{"id": "fbjue7", "title": "Are there any free online courses for people who already understand a bit about Python?", "url": "https://www.reddit.com/r/learnpython/comments/fbjue7/are_there_any_free_online_courses_for_people_who/", "subreddit": "learnpython", "author": "t2_3s8ndis4", "text": "It could be a website, series of tutorials, online books... anything really. \n\nI understand a big fist of things. I know about classes, objects, classmethods, properties, operator overloading, for loops, functions, file IO, pretty much all of the essentials. \n\nAre there any resources, courses, or sites, that cover python? As in good conventions (Already read up on PEP8), styles, antipatterns, alternatives, and things in that alley.", "comments": [{"id": "fj4x033", "author": "Unable_Request", "body": "Commenting because interested. I have completed a college course on Python, completed ATBS on Udemy, taken MITx 6.00.1x, and done a variety of self-interest projects, and occasionally read threads like these... but I always feel like its a case of 'draw the rest of the fucking owl'. Always on the hunt for a good transition course between where I am and where I need to be."}, {"id": "fj4y8p4", "author": "knighterrman", "body": "https://realpython.com/ is definitely a place to check out"}, {"id": "fj4yq5z", "author": "bgymn2", "body": "I would suggest micro master courses on edx. Georgia Tech has a course titled \"Computing for Data Analysis\". It says it is an introduction but I think it is a bit more than that. They also have a course that is really fun that you can learn R from."}, {"id": "fj5ht4m", "author": "ExpensivePickle", "body": "Probably not the preferred option for everyone, but your local library may actually have something. I'm having fun working through Impractical Python Projects by Lee Vaughan, and I picked up Serious Python by Julien Danjou before realizing it's a bit too advanced for where I'm at right now."}, {"id": "fj4pjhj", "author": "reddit007user", "body": "Please check this reddit post by u/alsweigart on [Python Course](https://www.reddit.com/r/learnprogramming/comments/fbjt3g/the_udemy_automate_the_boring_stuff_with_python/?utm_medium=android_app&utm_source=share) on Udemy.\n\nEdit: \n\n1. The udemy course is free till March 9th. \n\"Automate the Boring Stuff with Python\" online course is free for the next 9 days. \n\n2. The course is based on similar named book \"Automate the Boring Stuff with Python\".\n\nMore edit: 3. u/alsweigart is author for course and book both.\n\n\"Al Sweigart is a software developer in San Francisco. He has written four Python programming books, spoken at Python conferences, and has taught both kids and adults how to program. Python is his favorite programming language, and he is the developer of several open source modules for it. He is driven to make programming knowledge available to all, and his books freely available under a Creative Commons license.\"\n\nHTH"}, {"id": "fj54iez", "author": "Rplast", "body": "https://www.reddit.com/r/learnprogramming/comments/fbjt3g/the_udemy_automate_the_boring_stuff_with_python/?utm_medium=android_app&utm_source=share"}, {"id": "fj5u3za", "author": "PurelyApplied", "body": "I'm surprised no one has mentioned [the standard library docs](https://docs.python.org/3/library/).\n\nThey're much better references than educational material, but they're a good touch stone for what tools exist that you could learn.  And a lot of the standard lib will make your life easier, regardless of what you're writing.  Learn `itertools` and `functools` if you haven't already."}, {"id": "fj5vew1", "author": "FoxClass", "body": "Codewars. I finished a few of these Udemy and EDx courses and the problems on Codewars still challenge me.\n\nOtherwise, you need a project. What do you want to do? Set a goal and figure out how to make that work using Python. Robotics? Music? Security? Just pick a hobby project and you'll learn tonnes."}, {"id": "fj5wax1", "author": "semiokme", "body": "Project Euler https://projecteuler.net/ has exercises that scale in difficulty and are not python specific.  \n\nAlso the python institute has online self study courses for the first level of pcap certification https://pythoninstitute.org/certification/pcap-certification-associate/"}, {"id": "fj63ft2", "author": "mentorii", "body": "Check out Fluent Python book, it takes you to the next step after learning the basics, also i suggest you start learning algorithms"}, {"id": "fj4x5q3", "author": "SprJoe", "body": "Python For Everyone. https://www.py4e.com"}, {"id": "fj581ua", "author": "Lexam", "body": "https://github.com/P1xt/p1xt-guides/blob/master/README.md"}, {"id": "fj5ukd2", "author": "CrazyAnchovy", "body": "I'm really enjoying this course on Udemy and think you might like it too.\nhttps://www.udemy.com/share/101WjaBUUZclhQQHw=/\n\nEdit: I used the share function on the udemy app and it generated everything prior to this edit\n\nEdit 2: is Django, more python to learn.\n\nEdit 2a: try Flask too I guess"}, {"id": "fj69754", "author": "Nisse14", "body": "[edabit.com](https://edabit.com) \n\nA website with many challenges where you choose the difficulty yourself."}, {"id": "fj69ewh", "author": "MrShiftyJack", "body": "I recently started the edX course in Python for Machine Learning. I haven't been able to keep up with it because of other matters I've had to attend to but I was really impressed with the video lessons, quizzes and Jupiter notebook 'labs' in the course."}, {"id": "fj6a24a", "author": "Shmifful", "body": "Im jus saying, i could teach you"}, {"id": "fj93eer", "author": "smurpau", "body": "I'm a fan of [The Little Book of Python Anti-Patterns](https://docs.quantifiedcode.com/python-anti-patterns/index.html)."}, {"id": "fj51oqm", "author": "wsppan", "body": "Study data structures and algorithms to gain the vocabulary to work with all those concepts to describe the problem space and derive and create the solution space."}, {"id": "fj54d1w", "author": "forevalearning", "body": "Can you post some resources on patterns,"}, {"id": "fj5x2pt", "author": "SignalCash", "body": "Why not take a real project on github and google what you don't understand"}, {"id": "fj64vxi", "author": "gangculture", "body": "have you even bothered to read any of the other posts in this sub? it’s getting pretty boring handling this question at least once a day. if you can’t research for yourself you probably don’t have what it takes to pursue this to a professional level."}]}