{"id": "fbsise", "title": "any learning material suggestions for people who already know how to program ?", "url": "https://www.reddit.com/r/learnpython/comments/fbsise/any_learning_material_suggestions_for_people_who/", "subreddit": "learnpython", "author": "t2_32nbs9b1", "text": "well the title sum it up, i am a computer science student, i know java and c++ and i wanted to learn python,\n\nhowever, courses that i found are really oriented towards beginners who are just starting their path into programming .\n\nany suggestions are welcomed", "comments": [{"id": "fj67g94", "author": "ninety_hex", "body": "The wiki has a section for those [new to python but not programming](https://www.reddit.com/r/learnpython/wiki/index#wiki_new_to_python.3F)."}, {"id": "fj6eeux", "author": "vectorpropio", "body": "The python oficial docs. The pep's  (documentation with the proposals for python improvement, especially the accepted ones). Fluent python."}, {"id": "fj6tb9s", "author": "thegrassisstillgreen", "body": "Don't have any material to suggest but maybe just a suggestion on how you can git gud with python.\nThink of a project you might want to use python for and learn while you go based on what you need using the internet. With the essential cs concepts under your belt and experience in other languages, it's just a matter of learning the syntax. Maybe you'd know how to go about solving a problem with c++, you just need to step through that logic in your mind and translate it to python bit by bit. Need a for loop but don't know how? Search \"how to python for loop\" on the internet. Once you know that, then you can go in and learn the language-specific/pythonic ways of doing things like f-strings and list comprehension.\nThat's how I did it, anyway."}, {"id": "fj6rlob", "author": "nosmokingbandit", "body": "https://lobster1234.github.io/2017/05/25/python-java-primer/"}, {"id": "fj6seas", "author": "nanodano", "body": "I have written a post called \"I know how to program, but I don't know what to program\" that aims to help give you some ideas when you are at that soft spot between beginning and intermediate.\n\nhttps://www.devdungeon.com/content/i-know-how-program-i-dont-know-what-program"}, {"id": "fj7t8gb", "author": "ThePhoenixRisesAgain", "body": "Realpython.com"}, {"id": "fj7v4z4", "author": "rommon010110", "body": "Google Kirk Byers free Python course, it goes from beginner to advanced, and starts Mar 3rd so there is like 24 hours left to sign up."}, {"id": "fj8aewo", "author": "the-stanely", "body": "u/kberson mentioned [udemy.com](https://udemy.com).   That's where I took a Python course, and I'm a believer.  I strongly recommend Jose Portilla's Python Bootcamp from Zero to Hero.  It starts out simple and accelerates quickly.  Goes over all the basics fast and jumps into some pretty challenging assignments right away.  Some students complain that the programming assignments are too difficult.  I too was fluent in several other languages, but not Python.  The course and assignments were perfect for me.\n\nThe other thing I liked about this course it that Jose is a very conventional teacher who goes over the concepts first and then expects you to apply them.  I think that's a good approach for college students.  Other courses I've taken teach by doing.  I'm better at remembering concepts than memorizing steps, so I didn't get as much out of those courses."}, {"id": "fj688z1", "author": "kberson", "body": "I buzzed through w3school to pick up the basics.  Then went to udemy.com and audited a python course. Knowing how to program let me quickly master the video."}]}