{"id": "fc3c6p", "title": "Ask Anything Monday - Weekly Thread", "url": "https://www.reddit.com/r/learnpython/comments/fc3c6p/ask_anything_monday_weekly_thread/", "subreddit": "learnpython", "author": "t2_6l4z3", "text": "Welcome to another /r/learnPython weekly \"Ask Anything* Monday\" thread\n\nHere you can ask all the questions that you wanted to ask but didn't feel like making a new thread.\n\n\\* It's primarily intended for simple questions but as long as it's about python it's allowed.\n\nIf you have any suggestions or questions about this thread use the message the moderators button in the sidebar.\n\n**Rules:**\n\n* Don't downvote stuff - instead explain what's wrong with the comment, if it's against the rules \"report\" it and it will be dealt with.\n\n* Don't post stuff that doesn't have absolutely anything to do with python. \n\n* Don't make fun of someone for not knowing something, insult anyone etc - this will result in an immediate ban.\n\nThat's it.", "comments": [{"id": "fj89gyy", "author": "throwaway27272k", "body": "I have an assignment that requires some python\n\nI think I grasp what to do but the syntax of it confuses me. I’ll post the problem below \n\n\n\r\nPlease write a python code that performs following tasks, all parts are from a single code:\r\n\r\nPart 1:\r\n\r\n1)\tCreate a 2d array (dimension n*n, where n is a user input) of random float numbers, ranging from 10 to 300,\r\n2)\tPrint the size of the array,\r\n3)\tWhat is the mean and variance of the whole array,\r\n4)\tFor each column of the array what is the mean and variance,\r\n\r\nPart 2:\r\n\r\n5)\tCreate a second matrix of integer numbers ranging from 10 to 300.\r\n6)\tWrite a loop, that for each and every column, goes through all members of that column and \r\nIf that member is a factor of the member in the first row, print it, and say “it is a factor of first member”\r\nIf it is not, and if it is less that the member in the first row (of same column) replace that member with the member in the first row, but if it is greater than the member in the first row replace it with the member in the second row.\n____________________________________________________\n\nSo far I’ve imported the numpy lib and created a 2D array. Any help would be appreciated."}, {"id": "fj8vmpe", "author": "AviatingFotographer", "body": "When do I activate/deactivate an virtual env? When I finish a session? Or when I finish my project?"}, {"id": "fj8zrcc", "author": "Albatatis", "body": "2 questions. \n1.I am learning python and someone who owns a web designing company told me to make a program that automatically takes screenshot of screen every 10 secs and sends it to the cloud server.\nIf I do that he'll help me to get a job or offer me job in his company.\n2.I can't focus on learning from home so thought about taking classes, but many told me better not to take course and learn it on my own. I have two options--either I take the course which is costly or buy a new laptop and learn somewhere outside so I can focus. Need your suggestions. Thank you"}, {"id": "fj93jyx", "author": "wingedbuttcrack", "body": "I have 2 questions\n\n1. Is python a good starting place to learn programming (for business related analytics)?\n2. Do you have any recommendations on where to start? (tutorials, online courses, books etc)"}, {"id": "fj9b1gt", "author": "richasalannister", "body": "I’m a retail manager and I’m trying to write a script to make my schedule for me (I don’t think I’ll use it but I want to see if I can). I picked this project because I’ve done a couple of courses and have been stuck since without really anything to do. \n\nSo I eventually want to use excel to write my schedule for me\n\nMy question is this: can one variable be in multiple classes? \n\nBasically if I have “John” who can work in electronics and as a cashier how would I put him in both classes so that if I need a cashier he can be schedule (same for electronics)\n\nI hope this makes sense"}]}