{"id": "fc3pz6", "title": "Need help with hosting a text file", "url": "https://www.reddit.com/r/learnpython/comments/fc3pz6/need_help_with_hosting_a_text_file/", "subreddit": "learnpython", "author": "t2_14qpu2", "text": "I'm currently making a game for a school project and it's all complete however there is one last thing i need to add.\n\nI want to make my leaderboard system global, to do this all I need to do is host the leaderboards text file online and have any computer playing be able to access this.\n\nBut after spending quite a while looking online I just can't understand how you would host this file.\n\nCould anyone here explain? Thanks in advance", "comments": [{"id": "fj8ev4l", "author": "AsleepThought", "body": "I would just stick it in GitHub, not sure how often your planning to have this updated though\nOtherwise yeah you will want to have a simple web server that holds the data and gives it out on request"}, {"id": "fj8d12w", "author": "jfdahl", "body": "The challenge with this is that you will need to have all users running code that can update the leaderboard. The best \"real\" solution is a web service that stores the updates.\n\n**** DO NOT DO THIS IN PRODUCTION OR WITH YOUR REAL ACCOUNT ****\nIf you cannot create the web service, you can try hosting a file in a github repo, then include code in your game that will, upon completion:\n1. Fetch the \"current\" version of the file.\n2. Write the updates to your local file if the current game deserves it.\n3. Commit the changes to the local repo.\n4. Push the local update to the remote repo.\n\nYou may have collisions if multiple people are playing at the same time so try to keep the steps above as quick as possible. Also, create a separate identity and application ID since your game code will need the credentials to push updates to the master branch."}, {"id": "fj8ici4", "author": "efmccurdy", "body": "[https://www.hostingadvice.com/how-to/best-static-web-hosting/](https://www.hostingadvice.com/how-to/best-static-web-hosting/)"}]}