{"id": "fc5vlj", "title": "Issues creating virtualenvs", "url": "https://www.reddit.com/r/learnpython/comments/fc5vlj/issues_creating_virtualenvs/", "subreddit": "learnpython", "author": "t2_g04v2", "text": "First off please refer me to the proper board before Reddit deletes me. 99 percent of my posts get deleted and honestly, it makes me afraid to use Reddit. After a year of not using it, I'm back again to see if Reddit can do some good. With that out of the way let me explain.\n\nI got an old raspberry pi from a friend. I got everything working and am trying to install OpenCV. I've installed everything but when trying to create any virtualenvs I get the error\n\n\"ERROR: Environment '/home/pi/.virtualenvs/cv' does not contain an activate script.\"\n\nAnd before anyone asks yes I have updated bash and reloaded. Searched google and no luck either. can't find anyone with this same error. Searched Reddit but no one here either. Can anyone help me understand this? Thank you.", "comments": [{"id": "fj8vbt8", "author": "Tibernut", "body": "I can try to answer this as a general virtualenv question.  I am not familiar with OpenCV.\n\nVirtual environments are just directories with python and related binaries that are separate from your operating system's binaries.  The activate script the error is referring to is simply a script that will put those binaries in your path so that they are used instead of the operating system's binaries.\n\nMaybe a quick example will help things be more clear.\n\nFirst install virtualenv on your pi with\n`sudo apt install virtualenv`\n\nNow navigate to the directory where you want to store your virtual environments.  It looks like the application you want to use expects them to be in /home/pi/.virtualenvs/\n\nSo type `cd /home/pi/.virtualenvs/`\n\nIf this folder does not exist, create it with \n`mkdir -p /home/pi/.virtualenvs`\n\nNow navigate to it.\n\nNow make either a python2 or python3 virtualenv named cv (depending on what your application wants)\n`virtualenv -p python2 cv`\nor\n`virtualenv -p python3 cv`\n\nNow you can activate the environment by typing\n`source /home/pi/.virtualenvs/cv/bin/activate`\nYou should now see something like `(cv) pi@raspberry:~/.virtualenvs$ ` indicating your are inside the virtual environment.  You can install any needed libraries with pip.\n\nWhen you are ready to leave the virtual environment simply type `deactivate`.  You should see something like `pi@raspberry:~/.virtualenvs$ ` indicating your are no longer in a virtual environment.\n\nAs to what exactly OpenCV is supposed to do I am not sure, is it supposed to create the virtual environment by itself when you install it?\n\nWill it install the libraries it needs if you provide the virtual environment?\n\nIf you need to install a library for it (looks like at the very least it needs numpy from a quick glance at their website) you can do so with pip.  \n\nWhile inside of the virtualenv type `pip install numpy`.\n\nIf you think you screwed up and want to start over simply delete the virtual environment folder.  IE `rm -rf /home/pi/.virtualenvs/cv`.  Be careful with this command and make sure you type the correct path though =)\n\nWrote this up in a hurry but I hope it gives you enough to go on!  Virtual environments are incredibly useful and it is not a bad idea to get comfortable with using them."}, {"id": "fj8svhr", "author": "blix_12", "body": "Try r/raspberry_pi"}, {"id": "fj8xnbm", "author": "flyingwizard1", "body": "I was doing this flask tutorial \nhttps://youtu.be/Z1RJmh_OqeA?t=1360\nand it explained really well how to create virtual environments. Just watch the beginning of the video, it is the first thing they explain."}, {"id": "fj9aik5", "author": "rcktshps", "body": "Have you actually checked in your environments' 'Scripts'-folder if there is an activate or activate.bat file in there? If there isn't, something might have gone wrong while you were creating the virtualenv."}]}