{"id": "fc5wv2", "title": "Just finished Python for Everybody from Coursera - what next?", "url": "https://www.reddit.com/r/learnpython/comments/fc5wv2/just_finished_python_for_everybody_from_coursera/", "subreddit": "learnpython", "author": "t2_3petxxxs", "text": "What should I go to next? not looking for another training. Looking for practice problems that would match this skill level.", "comments": [{"id": "fj8rbwv", "author": "Flowerchild_1963", "body": "How did you like the course?"}, {"id": "fj8sibp", "author": "Bookmore", "body": "Same advice I would give anybody: look at the things you do everyday, and see how you could make then easier using Python. \n\nWrite a lot of emails and need to generate some automatically instead of typing them by hand? Python. \n\nUnits converter? Python. \n\nYou get the idea. Good luck!"}, {"id": "fj9896z", "author": "Qa372nite", "body": "Here is a little exercise for you I just finished solving:\n\nWrite a script that takes text file and a regex pattern as an input.\n\nThe user should pass the file name and the pattern via command like this:\n\n\\-f data.txt -r REGEX\\_PATTERN\n\nHint: use argparse for this part.\n\nThe output should be printed to the terminal in 3 different modes:\n\nIf the user passes -u argument in the command line,  print the name of the file, the entire line\n\nand the matched pattern should be underscored with the caret symbol.\n\nIf the user passes the -c argument in the command line, print the name of the file, the entire line and the matched pattern should be highlighted with any color you choose.\n\nIf the user passes the -m argument in the command line, the output should be in a machine readable format: name\\_of\\_file:num\\_of\\_line:starting\\_index\\_of\\_matched\\_pattern:string\\_of\\_matching\\_pattern\n\n Don't forget to add error handling\n\nTry to write a class to gain more understanding of OOP\n\nGood luck!"}, {"id": "fj9b163", "author": "Ithake", "body": "I competed the same course three months ago, as a next step I would recommend you to take the same course Dr. Chuck recommends too. It's from University of Michigan as well: Python 3 Programming Specialization.\nThat course will give you a more in depth knowledge of Python fundamentals and more practice. You'll learn the basics of OOP, too, which is barely mentioned in Python for Everybody (an excellent course to start with python and programming in general, by the way).\nI'd recommend you Automate the Boring Stuff with Python, too. Happy learning!"}]}