{"id": "fc8b91", "title": "I'm starting to bang my head against the wall getting started on python and I can't figure out how to get started or if I even can.", "url": "https://www.reddit.com/r/learnpython/comments/fc8b91/im_starting_to_bang_my_head_against_the_wall/", "subreddit": "learnpython", "author": "t2_5t1ossgw", "text": "I wanted to integrate an AI into my computer, but I didnt want to rely on other people's contraptions like Alexa and Siri. Ideally I wanted it to surpass them, I don't find either of them particularly interesting but I basically gave up on that idea but it's what guided me to python originally.\n\nThen I thought I'd make an audio visualizer because the ones I have on vlc suck ass but \"tutorials\" and examples are just people spouting out nonsensical lines of code I can't begin to even comprehend. \n\nI'm trying to get through \"how to automate the boring stuff with python\" but none of it \"sticks\", I can follow along but on my own I'm totally hopeless. I can basically print strings and that's it. Tutorial after tutorial I feel like people are spitting out jargon for a language when I can't even find the alphabet. Is there any point in even bothering? I feel like my aspirations are wholly out of step with what's feasibly possible.", "comments": [{"id": "fj962g0", "author": "galmeno", "body": "Everyone started not knowing. The field of AI has just got accessable, it doesn't mean it's effortless. Can a single non-programmer surpass a multibillion hightech research company? Likely not. Setting a goal and finding flaws in others says nothing about the work needed to get there. However, if you take it step by step and continue from code people already published you might reach your goal some day. Coding is a profession that takes time to master but the tools and knowledge are avalivable to everyone to try."}, {"id": "fj96xk3", "author": "kyber", "body": "You need to be patient and focus on build the basic skills very well. Do small projects that are meaningful to you, relating to your hobbies and interests. Focusing on problems you can relate to and solving them will help you learn faster than just doing abstract learning.\n\nJust like a practical skill such as woodworking, you need to start and get good at the basics before you make something more ambitious. Making unique functional and attractive cabinets is not easy."}, {"id": "fj95m6o", "author": "impshum", "body": "Sounds like you've had a nice idea then realised how little you knew about programming.\n\nBe realistic and demand the impossible."}, {"id": "fj97c53", "author": "smokingPimphat", "body": "You are thinking that NLP is a problem that is already solved. \n\nIt is not. \n\nGoogle ( a multi billion dollar company ) has just figured out how to get AI to make a hair appointment or a restaurant reservation. and you think you will build an alexa in your house. \n\ngood luck ( really,  I hope you can solve it ) \n\nNLP is THE problem for all these companies. if they can solve it they will rule the world. if you think you can help them build some cool stuff and get yourself a 6 figure salary."}, {"id": "fj97xu0", "author": "jimmythenewsmith", "body": "What you want to do is a pretty advanced topic, and it's not even really a \"python\" topic. You are combining Computer Science, Machine Learning, Artificial Intelligence, Audio and Voice recognition, maths / statistics / calculus and many other types of analysis. For one person to achieve this they need to study all these topics at Masters or probably PhD level. Even if you were the best python programmer in the world, but didn't have knowledge of these topics, you'd have no chance. If you find automate the boring stuff too difficult, well I think you get my point.\n\nIn short - you are being pretty unrealistic about what you can achieve. Start with something much more modest.\n\nI started with this course and it is one of the most popular python comp/sci mooc courses there is. Try that and see how you go. Either start the current season now (it's free) or if you want to take exams wait until the next one, but that could be a while.\n\n[https://www.edx.org/course/introduction-to-computer-science-and-programming-7](https://www.edx.org/course/introduction-to-computer-science-and-programming-7)"}, {"id": "fj981pw", "author": "NiccoloGranieri", "body": "I think you've jumped the gun by wanting to do a project that is too advanced or starting from a book filled with projects rather than basic elements of programming.\n\nFrom what you're describing I think you'd be better off solidifying your programming basics by reading a Python book first (I love [Think Python 2e](https://greenteapress.com/wp/think-python-2e/)) and then going back to \"Automate the Boring Stuff\". This will make you understand better the concepts used in the book and will help you expand on the ideas proposed."}, {"id": "fj98bjy", "author": "guttyn15", "body": "maybe the comment in this sub made by a certain 'galmeno' said it right.\n\nI can feel you man. it seems like you feel like you have so many ideas that you want do with python but cant get started with right approach.\n\ntry reading testimonials. many can be found in this subreddit.\n\ntry and focus on doing on small projects. try to automate small things that are related to you.\n\na word from a newb but fueled with passion."}, {"id": "fj99cgl", "author": "iplaymage", "body": "a CS education at a reputable institution will help you do what you want to do\n\ntutorials, free courses only get you so far"}]}