{"id": "5bx4bx", "title": "Thanks, Obama.", "url": "https://i.reddituploads.com/58986555f545487c9d449bd5d9326528?fit=max&h=1536&w=1536&s=c15543d234ef9bbb27cb168b01afb87d", "subreddit": "pics", "author": "Itsjorgehernandez", "text": "", "comments": [{"id": "d9s3q17", "author": "adeadhead", "body": "^^psst, ^^hey ^^kid, ^^want ^^some ^^[livethread](https://www.reddit.com/live/xw7ya3zdewzc)?"}, {"id": "d9s0sva", "author": "Badwolf2013", "body": "The president we needed. Now time for the one we deserve."}, {"id": "d9s30q4", "author": "Neighbor2972", "body": "DONT FUCKING LEAVE US"}, {"id": "d9s7flf", "author": "kvs17", "body": "Canadian here, \n\nI'm not even a US citizen nor do i live in the States but, even I feel like I'm losing a great president after tonight. \n\nThanks, Obama.\n\nGood luck to everyone after tonight."}, {"id": "d9s22ba", "author": "itsrawbb", "body": "This man right here, agree or disagree, knew how to speak to the American people. He could talk about a carton of milk and it would be the most interesting speech about a carton of milk thats ever been said."}, {"id": "d9s2uji", "author": "Freiheit7", "body": "I actually am gonna miss Obama regardless of what he may have done right or wrong. He was one of the most fun presidents I can think of. Maybe being an internet era president helped."}, {"id": "d9rzl3d", "author": "makeMSUgreatagain", "body": "They both gave us the [best memes.](http://imgur.com/gallery/pDFAE)\n"}, {"id": "d9s0cky", "author": "_GameSHARK", "body": "I never really had much of a horse in either race, though I didn't like Romney at all and any chance McCain had of getting my vote evaporated when they put a lunatic like Palin on his ticket.\n\nI like Obama as a person, though.  I've really enjoyed having a President that genuinely seems to enjoy science and technology and nerdy pursuits, and we've had some really amazing photographs come out of the White House when he's around kids.\n\nHas he said anything about what he plans on doing after he leaves office?"}, {"id": "d9s1as5", "author": "slickt0mmy", "body": "As someone who didn't vote for Obama, and never thought I'd be saying this, I'd totally re-elect him right now if I could. I don't agree with a lot of his politics but there's no denying that he's been an incredibly \"presidential\" president. He's on his game every time he comes into the public eye. The past 8 years we've seen him angry, we've seen him sad, and we've seen him goofing off with kids, but no matter what he always looks like a president. That's far more than I can say for the two morons we're being stuck with now."}, {"id": "d9s0lxy", "author": "nickdaisy", "body": "Republican here.  I never voted for Obama but applaud him for two things: sensible foreign policy and (as politicians go) being honest.  Thank God he kept us out of Syria and other unnecessary wars.  I disagree with virtually all of his domestic policies but he promoted them in good faith and what he thought was in the country's best interests.  He spent eight years in the White House and despite the best effort of his political enemies, he was never impugned with any serious political controversy.  The most significant taint of dishonesty during his administration was from Hillary Clinton-- which shows you how terrible a candidate she is and how much of a decent man he was.  I didn't agree with him, but respect him."}, {"id": "d9s1vsj", "author": "JaxynElvin", "body": "In under two hours, this has been one of the most upvoted posts I have seen in my few years on Reddit. \"Hindsight is 20/20\" as they say."}, {"id": "dh9c8o3", "author": "Primary-Bottom-Frag", "body": "Thank Mr Obama\n\nI also want to be the last person to post a comment before this is archived "}, {"id": "d9s32xd", "author": "dangshnizzle", "body": "16 months from now, Obama's gonna get pulled over in his newish Mercedes Benz beneath the B-line on Lake Street. As the cop get's closer to the driver side he realizes the car's pretty hazy and as Obama rolls down the window, the smell of marijuana billows out. Officer shines his light through the car at the passengers and it's [Jon Stewart making this sort of face](http://a10.akadl.mtvnservices.com/9950/mtvnorigin/gsp.entertainment-assets/cc/press_images/night-of-too-many-stars/notms2010-jon-stewart-2.jpg) from the passenger side while [Biden](http://cdn2-www.craveonline.com/assets/uploads/2014/03/man_file_1050360_Joe-Biden-4.jpg) and [Boehner](http://www.powerlineblog.com/ed-assets/2014/02/Boehner1.jpg) are passing tha L back and forth in the back seat.    \nI called it first. Tag me and set those reminder bots for 16 months."}, {"id": "d9s0f1w", "author": "reubensauce", "body": "No worries, he'll be back in the White House in 12 years.  \n\nMICHELLE 2028!!!"}, {"id": "d9s1xad", "author": "TrueTimmy", "body": "I'm going to miss this man so much when he's gone. He is the coolest president we have ever had, and he did a lot of good for this country. More than can be expected from the situation he was given. Let's hope the next candidate doesn't fuck up EVERYTHING. "}, {"id": "d9rz8dt", "author": "realister", "body": "If you remember in 2008 republicans said Obama will institute Sharia Law in the US and take away all the guns from people. Still waiting. "}, {"id": "d9rytzh", "author": "BirtSampson", "body": "If you look for yourself (and stop listening to politicians and the media), this country is a better place to live than it was 8 years ago. \n\nVirtually every standard of living that assesses a first world country is higher in the US now than it was at the end of Bush's second term. \n\nHe wasn't perfect but God knows he's better than these two twats. "}, {"id": "d9rxh5x", "author": "fixthecopier", "body": "My very sick wife can see doctors. Thank you Mr. President."}, {"id": "d9s0sk1", "author": "VitaleTegn", "body": "Imagine if history remembers him as the last sane president."}, {"id": "d9s2sf5", "author": "Itsmeasme", "body": "I'm going to to miss you and MIchelle. Respect and love 🙏"}, {"id": "d9s25g8", "author": "barakicohen", "body": "Ugh can he just be the president for another term so we have time to get our shit together "}, {"id": "d9ryycm", "author": "ZeroThePerson", "body": "\"Obama, come back!\nYou can blame it all. on. me!\nI was wrong!\nAnd we really don't want these two!\"\n\nEdit: My highest upvoted comment was about a cool black guy and a really good love song. Thanks reddit!"}, {"id": "d9s0szd", "author": "Kasper1000", "body": "Genuinely, truly, for the last 8 years of economic growth and stability, thanks Obama. Thank you so much. Now go enjoy every single day of your retirement, you earned it. "}, {"id": "d9s09br", "author": "DownvoteDaemon", "body": "http://i.imgur.com/uGckaNI.jpg"}, {"id": "d9rxfi3", "author": "username_404_", "body": "Everyone who completely shitted on Obama these last 8 years is gonna talk about him with such nostalgia in a decade I guarantee you"}, {"id": "d9rxkz8", "author": "Agastopia", "body": "Honestly, he'll be looked back very fondly. "}, {"id": "d9s0cyv", "author": "daneelthesane", "body": "My brother's cancer didn't kill him, thanks to Obamacare and the clause that prevents insurance companies from giving him insurance. He is alive thanks to Obamacare, and every time I hear a Republican say he wants to overturn Obamacare, I hear \"I want to kill your brother.\""}, {"id": "d9rxquo", "author": "Brownemaster", "body": "What did he do now? "}, {"id": "d9rxdbu", "author": "daynedakota", "body": "Yea thanks Obama."}, {"id": "d9s6238", "author": "PM_ME_PANTY_IN_MOUTH", "body": "u/PresidentObama if everyone in here could vote for you again, they would. Hope you're leaving the country in good hands, boss."}, {"id": "d9rzpqj", "author": "AlexGianakakis", "body": "For the amount of unwarranted shit this guy has put up with over the last 8 years, he did a fucking awesome job. Thank you President Obama, you were an an amazing leader."}, {"id": "d9s11qb", "author": "iTheOwl", "body": "You know, as a conservative libertarian I swore I'd hate Obama. (No guys I'm not a racist so chill out) 8 years later that's changed a ton. I don't love him, I disagree with some of his choices, but I would call his election a win. I would in a heartbeat take 1 more year of him while we figure out some new election choices. But unfortunately that's a no go. I will however hate Hillary until my dying breath ;) \nAlso trump is still a POS"}, {"id": "d9s4jgi", "author": "greenparksandscrubs", "body": "He's a genuinely good guy and a great leader of the country. Thanks Mr President."}, {"id": "d9s5vdh", "author": "Plethorius", "body": "I never thought I'd say this but I'm going to miss Obama.  I haven't always agreed with what he's done, but he stands up for what he believes is right.  He seems like a genuinely cool guy and I think he has handled himself well in office and in the public eye.  Being President ain't easy.\n\nNo matter who wins this election, I'm deeply worried for our country.  "}, {"id": "d9sttsl", "author": "Fat_lab", "body": "Thanks Obama, I had dollars in my pocket. Now I have change."}, {"id": "dd768ct", "author": "JohnnyKay9", "body": "This kinda doesn't make sense to me as a Canadian...for 8 years all it seemed like the Americans did was say \"thanks Obama\" and blame everything on him. New president comes in and like a bunch of little children it's \"please Obama don't go! We will miss you!!\" It's so weak. "}, {"id": "dfsx65v", "author": "sickdonalds", "body": " I miss him so much"}, {"id": "dgnjs4b", "author": "Cd206", "body": "OBAMA I love you"}, {"id": "dgyvvue", "author": "TheGreatGreenDragon", "body": "Yep, we miss you."}, {"id": "d9suz8i", "author": "Dontblaymme74", "body": "GFY Obama! Good riddance! "}, {"id": "deeq0tu", "author": "tyranosaurouswil", "body": "Last night I discovered r/the_donald, a subreddit about Donald Trump that has been banned from ever reaching r/all. Meanwhile this post is a top post. Reddit calls itself the front page of the Internet, and the Internet is a place where people can freely express themselves. People either like your stuff and tune in or ignore you, but the important thing to note is that the people decide. Go back to your original intention, reddit. Be the front page of the Internet again. \n\nEdited: spelled the Donald subreddit wrong. "}, {"id": "d9s1xaw", "author": "snowdog_93", "body": "Absolute living legend, it sucks that he has to go :("}, {"id": "d9s5uiq", "author": "AlexOverby", "body": "I am 14 years old. Obama is the only President that I have ever really known, being only 6 when was elected in 2008. \n\nI'm going to miss him."}, {"id": "d9sftuq", "author": "Dafunnyscene", "body": "He doesn’t get enough credit for all the credit he gave us\n"}, {"id": "d9si6er", "author": "rayarnold", "body": "Now pardon Snowden on your way out, please..."}, {"id": "d9st6lx", "author": "frankank", "body": "I tought this post had like 25000+ upvotes yesterday, what happened?"}, {"id": "dcax6j8", "author": "DangerousSnapDragons", "body": "He was an amazing president. "}, {"id": "de377tb", "author": "CuntHair_McDaddy", "body": "Glad he's gone. Never did a damn thing in office, but steal money from the people. What a damn joke."}, {"id": "dfnoptr", "author": "Kallifrax", "body": "Did you ever hear the tragedy of Darth Plagueis the Wise? I thought not. It’s not a story the Jedi would tell you. It’s a Sith legend. Darth Plagueis was a Dark Lord of the Sith, so powerful and so wise he could use the Force to influence the midichlorians to create life… He had such a knowledge of the dark side, he could even keep the ones he cared about from dying. "}, {"id": "dg3b8p0", "author": "andrewism", "body": "Thanks, Obama"}, {"id": "dgy8i6m", "author": "Lirvag_The_Nisio", "body": "That was probably the first time we all said \"Thanks Obama\"unironically"}, {"id": "d9s1y5w", "author": "PabstyLoudmouth", "body": "I admit he did not do much for me. My life did not change at all. But the one thing that will change, is that on Dec 1st, my company has to start paying me overtime. I have to work overtime, it is part of the job and a lot of it. I am going to go from 37K to 45K and I should be getting a good raise this year. It was not horrible under Obama. "}, {"id": "dg4dc5n", "author": "SiggiZeBear", "body": "Fuck you Obama you warcriminal, racebating, thief. Not one thing have come out of you begin president. You are one of the worst president we have ever had. Disgusting that the first black president was you."}, {"id": "d9s212x", "author": "k2_finite", "body": "RIP your mailbox OP. Holy fuck "}, {"id": "d9s0den", "author": "fuzzlez12", "body": "He still has 2 months."}, {"id": "d9s247k", "author": "since-92", "body": "Our great-grandchildren will know about this man. Amazing legacy left behind sir. "}, {"id": "d9s2uon", "author": "EdShnee", "body": "From an outsider's perspective, Obama to me was the best thing that could have happened to America, and possibly the world. Thank you sir.\nEDIT: a letter"}, {"id": "d9s1445", "author": "Eonexas", "body": "Thanks Obama. God bless us all."}, {"id": "d9s1dws", "author": "Dakunaa", "body": "Thanks, Obama."}, {"id": "d9s2b5l", "author": "LineDetail", "body": "You'll be greatly missed as president. :( Obama for life."}, {"id": "d9s2thk", "author": "copkillah23", "body": "No matter what he did or what he said, he stood for the right thing."}, {"id": "d9s2y7f", "author": "RewenX", "body": "He's still our president until January 1st 2017. :)"}, {"id": "d9s2yca", "author": "Enjoyitbeforeitsover", "body": "Thanks Obama... I'm glad you were my president..."}, {"id": "d9s8lco", "author": "iwasdoingthattoomuch", "body": "He wasn't Great. He wasn't the worst. He was ok. He did damage. He did good. He was a president."}, {"id": "d9s8nfu", "author": "An_Lochlannach", "body": "With what's about to come, people are really going to appreciate what Obama did for America."}, {"id": "d9s8wdx", "author": "wildcarde815", "body": "This election has demonstrated we didnt deserve him, and we will likely not get anybody close to him in the near future."}, {"id": "d9s94e9", "author": "im_the_idiot", "body": "Probably the coolest Presidents ever. I'll miss him"}, {"id": "d9sbh1c", "author": "Venrexx", "body": "I find it interesting how that whole \"thanks Obama\" thing started as blame, and how it turned from blame to sincerity. It's amazing the change in view someone can have on a population with enough given time.\n\nTrump being so close to becoming president is probably helping some as well."}, {"id": "d9scs4d", "author": "Spazzer", "body": "Thanks Obama, love Canada. "}, {"id": "d9sjc7e", "author": "mrmarkme", "body": "This had like 25k upvotes what happened"}, {"id": "d9svgqu", "author": "arcsine", "body": "How did this go from 20K+ to 5K? Is that legit? "}, {"id": "db7jd8i", "author": "klsnj55", "body": "Thanks Obama ... for what exactly?"}, {"id": "dbbdgwa", "author": "69mcdamn95", "body": "Finally, his reign is over, thank god"}, {"id": "dbn6krb", "author": "DMMDestroyer", "body": "Mr. Drone Strikes on Brown Kids overseas. No thanks. "}, {"id": "dd2cqrx", "author": "picklebun", "body": "Yeah thanks for nothing."}, {"id": "dd99jzm", "author": "JiveTurkey1983", "body": "For nothing."}, {"id": "dfoi52j", "author": "n00nin", "body": "Good riddance. "}, {"id": "dgqxuie", "author": "Lewissunn", "body": "I can't really complement on him politically but I've got to say that Obama is easily the most loveable politician I know of."}, {"id": "d9s14ih", "author": "FiniteCreatures", "body": "I'm not American but I would've been proud to have a president like Obama."}, {"id": "d9s2m0s", "author": "poop_in_my_coffee", "body": "He did a great job after the catastrophic presidency of Bush. He was a chocolate chip in a sea of milk and gave America hope during a bad time."}]}