{"id": "61ns2w", "title": "Private Internet Access, a VPN provider, takes out a full page ad in The New York Time calling out 50 senators.", "url": "http://i.imgur.com/GJYYNle.jpg", "subreddit": "pics", "author": "pdmcmahon", "text": "", "comments": [{"id": "dfg4wc3", "author": "Amy_Ponder", "body": "Remember everyone, *this is not a law yet*. The bill still needs to be passed by the House of Representatives, too. Please, if you're in America [call /email / fax your representative](http://ziplook.house.gov/htbin/findrep?ZIP=11377&Submit=FIND+YOUR+REP+BY+ZIP) and tell him / her you oppose SJ Resolution 34. \n\nWe managed to stop SOPA and PIPA -- we can stop this monstrosity, too!"}, {"id": "dffysc4", "author": "irrri", "body": "Just to be clear: this bill is good business for them. That's how fucked this is."}, {"id": "dfg0e5s", "author": "Oznog99", "body": "GOOD NEWS!\n\nYou don't need to write your rep anymore to tell them how you feel.  They can just look up your opinions based on the info they bought from your ISP."}, {"id": "dfg07wu", "author": "Sneakerp1mp", "body": "The land of the free*\n\n*terms and conditions apply"}, {"id": "dffwvmj", "author": "evmw", "body": "TIL Idaho has a Senator Crapo"}, {"id": "dfg039c", "author": "pudgypoultry", "body": "Great, more reason to hate Inhofe in OK.\n\nThis is the same guy who got sick from swimming in the water he voted to pollute.  What a dumbass."}, {"id": "dffwoce", "author": "Sargon16", "body": "Sigh, I keep voting against Toomey (R-Pa) and he just doesn't go away :("}, {"id": "dfg0obc", "author": "Jambam12", "body": "Let's not forget Rand Paul who Co-sponsored the bill and was conveniently absent from the vote. \n\nCosponsors: https://www.congress.gov/bill/115th-congress/senate-joint-resolution/34/cosponsors\n\nRoll Call Vote: https://www.senate.gov/legislative/LIS/roll_call_lists/roll_call_vote_cfm.cfm?congress=115&session=1&vote=00094\n\nAs a now former supporter of his, it was tremendously depressing to  see this."}, {"id": "dffw9sn", "author": "AlwaysSunnynDEN", "body": "I've been subscribing to Private Internet Access for 3 years now. At $40/yr it's some of the best money I've ever spent.\nEdit: My first gold ever. Thank you kind Redditor. You've bought my guilding cherry.\n\nAlso: To everyone who asked a question but didn't get a response, sorry. There's just too many. If you PM me I'll get to your questions as soon as I can. Thanks."}, {"id": "dffwhg4", "author": "iBleeedorange", "body": "That's a lot of black ink."}, {"id": "dffwajv", "author": "Kregerm", "body": "Good for them. This is the VPN I use,,,and will continue to use."}, {"id": "dfg08p1", "author": "PixieFurious", "body": "Of COURSE McCain is on there, that spineless fucking poser.  "}, {"id": "dffwe6q", "author": "sans_ferdinand", "body": "Sure are a lot of (R)s on that list..."}, {"id": "dffwv66", "author": "Agastopia", "body": "That's so weird, why do they all have Rs next to their name? "}, {"id": "dfg640k", "author": "Tatersalad96", "body": "As a republican I support this ad. All government officials should be held publicly responsible for the decisions they make, especially ones like this that aren't so great for our freedoms as Americans."}, {"id": "dffzys5", "author": "Tedesche", "body": "Republicans have been fighting for corporate rights over citizens' rights for decades now. It's shameful. They claim to be for \"small government,\" but they let that imply that they're fighting for the States or individuals, when really they're just fighting for the ultra-rich. I have my problems with the Democrats too, but the GOP takes corporate shill-dom to a whole new level."}, {"id": "dfg048e", "author": "EthMoonKid", "body": "Hello Senators! \nI will make sure to vote for whomever is running against you!"}, {"id": "dffzsyf", "author": "SpaceGhost1992", "body": "I use this service and I'm fucking proud of them now. Thanks for calling out our senators."}, {"id": "dfg07hc", "author": "keptfloatin707", "body": "I scanned thru it twice it appears they are all Republicans... *Weird*"}, {"id": "dfg08r5", "author": "MAADcitykid", "body": "Lindsay graham is such a shit stain"}, {"id": "dfg0lvg", "author": "UpDown", "body": "R\n\nR\n\nR\n\nR\n\nR\n\nR\n\nR\n\nR\n\nR\n\nR\n\nR\n\nR\n"}, {"id": "dffxfm7", "author": "Mister-Dobalina", "body": "[Find Your Representative](http://ziplook.house.gov/htbin/findrep?ZIP=11377&Submit=FIND+YOUR+REP+BY+ZIP)\t\n\nFind Your Representative"}, {"id": "dfg09ly", "author": "DrunkonIce", "body": "Me and all my friends emailed our representatives. It literally took less than 5 minutes. The sad part is that 90% of my generation thinks that voting is useless and that it's all rigged so why bother which means that this shit will probably get passed through the house. \n\nIt takes 5 minutes to make a difference people go do your job as a citizen and fucking do it. "}, {"id": "dffxk8c", "author": "MarvinStolehouse", "body": "I really need to read the details on what they passed..."}, {"id": "dfg077e", "author": "3DXYZ", "body": "Lots of republicans there... that want to be removed from office. Lets help them lose their jobs asap. BTW I love and use PIA. They will come for VPNs next. "}, {"id": "dfg1vyu", "author": "PillarOfSanity", "body": "WE NEED TERM LIMITS"}, {"id": "dffzyng", "author": "mijitoburrito", "body": "Fuck those senators."}, {"id": "dfg0081", "author": "fuqdupd", "body": "Vote them out! Power to the people."}, {"id": "dfg01ft", "author": "kushari", "body": "Not a single democrat, speaks volumes."}, {"id": "dfg54jc", "author": "platinumgulls", "body": "FYI - The FCC chair said he proposed the bill because he felt that ISP's had to ask for your data, but not larger companies like Facebook or Google, which created an uneven playing field. Instead of making other companies comply with the existing ruling by including these edge cases and requiring *everybody* to ask for your data, he just decided to do the exact opposite and make it so *nobody* had to ask permission.\n\nFWIW, this is lobbying in action folks. He just made a whole lot of internet marketers very, very rich. \n\n"}, {"id": "dfg06hh", "author": "hold_my_drink", "body": "It's so ironic that republicans claim to be the party of small government and freedom. "}, {"id": "dfg1lag", "author": "admlshake", "body": "Good ol Todd Young.  The dude has been in the pocket of lobbyists for so long I wonder when the last time he saw sunlight.  Come election time he just puts up a few more \"I was in the Marines!\" ad's on TV people keep voting for him..."}, {"id": "dffzgq7", "author": "2PackJack", "body": "The shitty 50, better known as \"those motherfuckers.\""}, {"id": "dfg1yn2", "author": "dguy101", "body": "All Republicans...what a fucking surprise."}, {"id": "dfg1l1d", "author": "CherokeeHarmon", "body": "So pretty much all the Republicans?"}, {"id": "dffyxqt", "author": "not_your_google", "body": "Tillis and Burr, they are like eczema, just won't go away. "}, {"id": "dfgc87f", "author": "deanable", "body": "This more than any other bill that I've seen recently, captures the \"heart\" of what the republican party is all about."}]}