{"id": "63pnhz", "title": "This image is now illegal in Russia.", "url": "https://i.redd.it/jouzymhjwtpy.jpg", "subreddit": "pics", "author": "GorillaS0up", "text": "", "comments": [{"id": "dfw4tpe", "author": "SaltyMeth", "body": "I swear putin is doing this to karma whore his reddit accounts"}, {"id": "dfw2bb3", "author": "Kyle1337", "body": "Obviously because Putin would look much better than that in drag"}, {"id": "dfw4n80", "author": "AWildPackofLips", "body": "I mean, I actually.. kinda like it. Looks like an album cover, or something."}, {"id": "dfw2jed", "author": "TitoMPG", "body": "Reminds me of god save the queen from v for vendetta. "}, {"id": "dfw391b", "author": "Grassfedcake", "body": "That eye shadow with that lipstick is illegal everywhere honey."}, {"id": "dfw4zcr", "author": "Delilahhaze", "body": "Bianca Del Rio?"}, {"id": "dfw3j5y", "author": "RedditToComment", "body": "I think he looks pretty"}, {"id": "dfw51v2", "author": "cobody", "body": "Why so curious?"}, {"id": "dfw9akl", "author": "RandomePerson", "body": "There needs to be a campaign to mass mail postcards with this image to Putin."}, {"id": "dfwd2pt", "author": "sweetalkersweetalker", "body": "Nobody better make T-shirts of this.\n\nNOBODY."}, {"id": "dfw5rck", "author": "sygraff", "body": "Would you fuck me? I'd fuck me.... "}, {"id": "dfw51u4", "author": "ReginasBlondeWig", "body": "Why are pictures of Brian Eno illegal in Russia?"}, {"id": "dfw6lsj", "author": "trumpsucksputinsdick", "body": "[is this one ok?](http://imgur.com/Bxb4zdN)"}, {"id": "dfw4wbp", "author": "smpl-jax", "body": "With his frame that *haircut* should be illegal"}, {"id": "dfwhojx", "author": "SystemThreat", "body": "Weird how many people ITT think this has something to do with Trump. It's just a picture of a dictator who has his critics murdered and does dumb shit like trying to make pictures illegal... I wonder why it offends them so?"}, {"id": "dfw4r2f", "author": "Tristab_", "body": "I guess he is no longer Putin up with it. "}, {"id": "dfw5b3v", "author": "Fr4nksumatra", "body": "Why does this picture of him remind me of Bianca Del Rio? "}, {"id": "dfw5ca4", "author": "Rentington", "body": "Russia seems like a hopeless and oppressive place to live unless you are a gangster who murdered their way into owning large sections of former nationalized industries. In that case, Russia must be pretty fun. "}, {"id": "dfw0qhn", "author": "JitGoinHam", "body": "\\*sigh\\* we're going to get people circlejerking over these \"brave\" posts forever now."}, {"id": "dfw4ztb", "author": "arystark", "body": "Makes sense; it's a true travesty what they did to his eye shadow and contour"}, {"id": "dfw7rlu", "author": "Baeblayd", "body": "Why is sharing a picture of Marilyn Manson illegal?"}, {"id": "dfweq67", "author": "phpdevster", "body": "It would be fantastic if we bombed Moscow with hundreds of thousands of copies of this picture."}, {"id": "dfw5uqb", "author": "Very_Sharpe", "body": "Why? Rocky Horror is a fucking GREAT film?"}, {"id": "dfw5vjv", "author": "CY4N", "body": "Homophobic Russian snowflakes."}, {"id": "dfwcp1r", "author": "PedoConfessionBear", "body": "Are these actually banned our are we just putting gay stuff with Putin for internet points?"}, {"id": "dfw5ut8", "author": "reggiedp16", "body": "putin can pass as the joker in suicide squad"}, {"id": "dfw97tf", "author": "FunctionBuilt", "body": "What's actually pretty scary to me is even so much as commenting on someone's facebook post of this image then traveling to russia in the near future could get you arrested and maybe even killed."}, {"id": "dfwf6nm", "author": "prjindigo", "body": "Shit, I agree.    Fucking AWFUL eye shadow.  He's more of a Peach color."}, {"id": "dfw4v0y", "author": "trumpza", "body": "You down to clown? \n\nLong as you're Putin' down."}, {"id": "dfw9mnk", "author": "kapone3047", "body": "Tomorrow news: Huge numbers of Redditors suffer polonium poisoning"}, {"id": "dfw55m1", "author": "lennybird", "body": "[Here's a documentary from 2007 by Vanguard on Russian homophobia and the rise of neo-nazis.](https://youtu.be/hij91q0Y9FI)"}, {"id": "dfw7knq", "author": "unixman84", "body": "I'm Putin this one in my collection."}, {"id": "dfw54rc", "author": "Tromboner1993", "body": "That's how you get gay clowns"}, {"id": "dfw9g3w", "author": "thedirtbike", "body": "We should do this for Trump."}, {"id": "dfwek6h", "author": "Niolani", "body": "[Ready for Gay Marriage](http://i.imgur.com/LyOLHlc.jpg)"}, {"id": "dfwfrz0", "author": "PlayCent", "body": "http://imgur.com/a/bWGuP"}, {"id": "dfwivim", "author": "dshams", "body": "[God save the Queen! ](http://i.imgur.com/yxpWrjO.jpg)"}, {"id": "dfx0sow", "author": "dudedad31", "body": "someone please tell me how to make this into a t-shirt"}, {"id": "dfw4v7b", "author": "KronicDeath", "body": "Putin on the Ritz"}, {"id": "dfw7a2w", "author": "Hd1906", "body": "what a pussy, happy to cause death and poverty for millions, can't handle a picture"}, {"id": "dfw5pp9", "author": "number9muses", "body": "I'm not surprised. Those colors are not doing his figure any favors."}, {"id": "dfw8vui", "author": "dmitryo", "body": "In case it's TL;DR: the OP lies.\n\n> But the picture was described last week on the Russian government's list of things that constitute “extremism.”\n\nAnother quite interesting example of how anything can be manipulated just a little bit to look outrageous. THE picture, means THE picture on the poster, was definitely NOT on that list. Washington posts relies on the idea it's readers are dumb enough to not double check. They even have a link to the actual list and an item number i that anyone can follow, but they assume nobody will, coz they take their readers as a cattle. \n\nYou download the list, you search for the number, you read the exact description. Neither the OP's picture or the poster, shown in the WP article are not described there.\n\nA picture from [this](http://vk.com/id161877484) exact post with [this](http://img1.reactor.cc/pics/post/%D0%BF%D0%BE%D0%BB%D0%B8%D1%82%D0%BE%D1%82%D0%B0-%D0%BF%D0%B5%D1%81%D0%BE%D1%87%D0%BD%D0%B8%D1%86%D0%B0-115733.jpeg) exact text has been listed. Good luck finding the original picture. I couldn't. And the account has been either made private or simply unaccessible by me.\n\nThe reason for listing was a ruling of the Court of city of Tver in May 2016 to regard the above-mentioned picture with hate speech and many others, including those calling to attack on \"cops, churkas and jews\", portraying Putin as nazi and such as extremist. The person himself seems to me is a neo-nazi. Those items are numbered 4065 through 4074, but somehow only number 4071 has caught WP attention. I'm sure they have just forgot to mention others, but totally meant to. ;)\n\nDouble check your \"facts\". Double check your media. If you're having trouble double checking because of the language barrier - send me a message, I know 5 languages including Russian. But FFS don't just blindly believe everything."}, {"id": "dfwaeev", "author": "ScoochMagooch", "body": "Relevant... Putin addressing America about his feelings towards cocks. \n\nhttps://youtu.be/zvSVn6S6zYs"}, {"id": "dfwcwv7", "author": "MrZombikilla", "body": "Let's get it to the top image when you search Russia haha "}, {"id": "dfw5dye", "author": "socokid", "body": "Wow. The Russian bots are in full force tonight. \n\nThe very idea of [making an image like this illegal](https://www.washingtonpost.com/news/worldviews/wp/2017/04/05/its-now-illegal-in-russia-to-share-an-image-of-putin-as-a-gay-clown/?utm_term=.3af6dd34b2f1) is freedom hating bullshit, and I like that it is being pointed out. \n\nRussia/Putin can suck a bag of dicks... "}, {"id": "dfw7zjx", "author": "TimeMachineToaster", "body": "Didn't someone already get Reddit banned in Russia?\n\nEdit: Yep https://www.reddit.com/r/tifu/comments/3grpdf/tifu_by_getting_reddit_banned_in_russia/"}, {"id": "dfw5cvi", "author": "pukesickle", "body": "I feel like this is going to end up in a museum some day."}, {"id": "dfw5go9", "author": "Down4whiteTrash", "body": "/r/place was too late for this one. Anyway we can add this?"}, {"id": "dfw5pyc", "author": "AetherMcLoud", "body": "The Rocky Horror Putin Show"}, {"id": "dfw5rjl", "author": "TrumpPaysForSex42069", "body": "Does anyone have a 1920x1080?"}, {"id": "dfw60ut", "author": "johndrichardson", "body": "Wallpaper? ☑️"}, {"id": "dfw6evf", "author": "piponwa", "body": "Why would they ban images of the POTUS?"}, {"id": "dfw6jo3", "author": "hippymule", "body": "If dudes wanting to fuck other dudes is that much of an issue, maybe you want to fuck dudes. "}, {"id": "dfw75v4", "author": "starkmatic", "body": "Can we get a side by side w trump looking like this?"}, {"id": "dfw7y54", "author": "Gaffgarion52", "body": "I wonder how many Russians have gotten jailed because this is the top post on the front page...."}, {"id": "dfw94y5", "author": "jwarne5057", "body": "But he looks FABULOUS!"}, {"id": "dfw9uki", "author": "fernplant4", "body": "Can we put this on Times Square in New York?"}, {"id": "dfwa0hz", "author": "KiwiNade", "body": "Cyka!!!"}, {"id": "dfwcfb6", "author": "AJWinky", "body": "If we're in the era of information warfare, we need to form an information militia. What Russia can do with an army of bots, we can do with an army of actual users. Let's beat Putin at his own game and spread everything we can to humiliate him."}, {"id": "dfwcg4v", "author": "captain150", "body": "Time for some good old Streisand effect to get going. Let's go people."}, {"id": "dfwci5n", "author": "ExitRiver1x3", "body": "What a beautiful lady man"}, {"id": "dfwcox3", "author": "kakemot", "body": "Didn't know Putin was a weak ass pussy"}, {"id": "dfwdwo4", "author": "User1111117", "body": "You guys do know ISP's can now give your info to Russia right?"}, {"id": "dfwdzfd", "author": "MtStarjump", "body": "It doesn't take a lot for every redditor to pick 5 random Russian businesses and email them a copy of this picture."}, {"id": "dfwej10", "author": "foolshearme", "body": "can we make this image the top one list on google for him?\n"}, {"id": "dfwf76c", "author": "dumbgringo", "body": "Putin on the Ritz!"}, {"id": "dfwf7de", "author": "Cartina", "body": "The full law text from things that are considered \"extremist\" \n\n>Item 4071: a picture of a Putin-like person “with eyes and lips made up,” captioned with an implicit anti-gay slur, implying “the supposed nonstandard sexual orientation of the president of the Russian Federation.”\n\n"}, {"id": "dfwguc1", "author": "dispelthemyth", "body": "[Did Homer Simpson have his gun set to whore again?](https://m.youtube.com/watch?v=gId2HsHvSgs)"}, {"id": "dfwhp95", "author": "nebuchadrezzar", "body": "Goddammit.  I'm halfway to Russia and all I have packed is Putin in drag rainbow flag t-shirts.  "}, {"id": "dfwhs7d", "author": "karljt", "body": "Need to make this the number 1 google image search for Vladimir Putin, (Or kermit the frog - they both work)"}, {"id": "dfwjwvr", "author": "TheRealHade3", "body": "sigh\n\n*unzips "}, {"id": "dfwsq9k", "author": "bagpiperjohn", "body": "Now put Trumps' face on it and see what happens."}, {"id": "dfywl3x", "author": "Myvaginahasstrep", "body": "As a gay man, I love the irony that the left has become homophobic now. Why is calling putin gay supposed to be insulting? What's insulting about being gay? Fucking liberals..."}]}