{"id": "6e7luk", "title": "And here it is: Likely the last sketch I'll ever post on Reddit. It's been a wild ride, guys and girls. Thanks for everything.", "url": "http://imgur.com/LXnMhwi", "subreddit": "pics", "author": "AWildSketchAppeared", "text": "", "comments": [{"id": "di891d8", "author": "Spartan2470", "body": "Now /u/Shitty_Watercolour is definitely not allowed to leave!\n\nThey had some great battles.  \n\nBattle [one](https://www.reddit.com/r/gifs/comments/3knq46/kid_on_a_stuffed_toy/cuyy8mv/) \n\nBattle [two](https://www.reddit.com/r/videos/comments/1gzpx9/how_to_introduce_your_sister/capg4gg/)\n\nEdit:  I'm a fool\n\nEdit 2: To clarify, my comment originally had three links.  The second one (at the time called \"Battle two\" linked to [here](https://www.reddit.com/r/pics/comments/pvgoo/my_friends_dad_was_flying_out_of_rome_and_snapped/c3sl20q/).  As /u/Victor4X pointed out, that link doesn't have wildsketch appeared at all.  So yes, the statment in my first edit is accurate."}, {"id": "di864ur", "author": "scoffatyourstupid", "body": "That's really good. but why is it your last? "}, {"id": "di88p19", "author": "Bran04Elite", "body": "Would be awesome if u/Shitty_Watercolour came to pay tribute. \n"}, {"id": "di86k2h", "author": "naszoo", "body": "See ya Sketch Cowboy"}, {"id": "di88zit", "author": "linux1970", "body": "You made a sketch of my daughter 5-6 years ago. It's still on my fridge.\n\nThanks!\n\n-------------------------- edit -----------------------------\n\nA couple of years ago ( on an older reddit account ), I posted about my daughter not making any noise. After some investigation I found her drawing on herself in the kitchen.\n\n[/u/AWildSketchAppeared](http://imgur.com/a/SPp4x) and drew [this](https://i.imgur.com/p1Teurg.jpg) "}, {"id": "di8lf4r", "author": "kn0thing", "body": "[Thank you for all the wild sketches, u/awildsketchappeared!!](https://www.reddit.com/user/kn0thing/comments/6eayjg/thank_you_uawildsketchappeared_for_all_the_wild/)"}, {"id": "di87ysk", "author": "overbread", "body": "AWildTearAppeared"}, {"id": "di87jdp", "author": "CantGrammarGood", "body": "Aiight people, post your favorite.\n\nhttp://i.imgur.com/shwxK8E.gif"}, {"id": "di86zuu", "author": "pm_me_your_kindwords", "body": "AWildSketchDisappeared "}, {"id": "di87e8b", "author": "Mertag", "body": "AWildSketch ran out of PP.\n\nAWildSketch ran away!\n\nYou will go down in reddit history as part of what made this website great. Thank you for your service. And now his watch is ended."}, {"id": "di8aipr", "author": "matthewboy2000", "body": "[Don't worry guys, I can take over for them](https://i.imgur.com/a7qsYn9.png)"}, {"id": "di87tb5", "author": "tehmlem", "body": "See you space cowboy."}, {"id": "di8h7yj", "author": "bandalbumsong", "body": "Band: The Last Sketch\n\nAlbum: Wild Ride\n\nSong: Thanks for Everything"}, {"id": "di8jn37", "author": "ThePeoplesBard", "body": "Hey, I can't thank you musically because I'm on the road for work, but I just wanted to thank you for representing the model of how to engage with reddit with OC. I wanted to make music for redditors, but I didn't know how to do it until I saw your account. My first account was something like /u/a_wild_song_appeared\n\nInterestingly, I've been desiring change and haven't been around here much myself lately. So I feel you. And I wish you luck on your next endeavor."}, {"id": "di8ebyp", "author": "captain_blackfer", "body": "I know over 2000 comments in you're not likely to ever see this, but just in case you do: thanks for being a part of reddit history. So long."}, {"id": "di87x4e", "author": "mrowhiss", "body": "Thanks for everything!!  One of my favorite moments between you and /u/shittywatercolour: https://www.reddit.com/r/MuseumOfReddit/comments/1sdhp0/the_battle_between_uawildsketchappeared_and/"}, {"id": "di886l9", "author": "manualex16", "body": "*Boy you're going to carry that weight...*"}, {"id": "di88y17", "author": "gen_reynolds", "body": "The [duel](http://www.reddit.com/r/videos/comments/1gzpx9/how_to_introduce_your_sister/capg4gg) with u/Shitty_Watercolour is by far my favorite thing to have ever happen on reddit to this day.  "}, {"id": "di87qx2", "author": "Wandering_Observer", "body": "Adios, Cowboy"}, {"id": "di8ajmw", "author": "fuckballsandwich", "body": "Thank you for all you've given this community, and all the smiles you've given me. You are one of the iconic people on this site, and while you will be sorely missed, I'm proud of you for not letting this place consume most of your time. You're an amazing person so go out and enjoy life. Hopefully we'll see you around sometime. :)"}, {"id": "di8akbg", "author": "Sister_Treefro", "body": "You came on to Reddit about the same time I did.  It'll be weird not having you around.  Thank you for all the entertaining sketches.  Peace and good luck <3"}, {"id": "di8b3wz", "author": "allaboardthebandwago", "body": "BANG..."}, {"id": "di8dpnk", "author": "chewsonthemove", "body": "It certainly makes me sad to see you go. Ever since you started your novelty account it would bring a smile to my face to see your sketches, and I think it goes without saying that you have shaped reddit in your own way. I hope in the future if you ever reach a point where life is calm and slow you'll have time for a sketch or two, but more than that I hope you enjoy your time away from reddit. Life is a wonderful thing and I wish you the best of luck with yours.\n\nThank you for the sketches, and good luck!"}, {"id": "di8o53n", "author": "node0ne", "body": "Reddit will truly miss you! Thank you for all the sketches!"}, {"id": "di892wo", "author": "Defarus", "body": "See you, space cowboy[.](https://puu.sh/w5ByJ/d1d330b72e.gif)"}, {"id": "di8741d", "author": "cj_would_lovethis", "body": "For those wondering why, check his [comment from here](http://imgur.com/a/2CJAy)\n\n> my account, /u/AWildSketchAppeared, will no longer be active. In the very likelihood of it being indefinite. It's been a real great 5 years entertaining you all.  It really was life-changing. But unfortunately it can't always go on. Soon enough I won't have the time to keep doing this anymore.\n\n> I have my job.  I have dates.  I have vacations planned.  I want to see more of my friends and family. I need to get back to my exercise routine. And we aren't even talking about going back to school yet. Most of all, I have other long-term artistic projects in the works that's going to take up a large chunk of my free time. Time I can't really spend on drawing random things on Reddit. I much rather detach myself from AWildSketchAppeared and try something new. Since this is in retrospect  just a simple novelty account.\n\n> This doesn't mean I'm abandoning Reddit altogether.  I do make use of my non-novelty account and will keep posting through there. I'm not going to delete /u/AWildSketchAppeared as it really is a piece of internet history and the only real way to see all the work I've done in these 5 years. It will stay there as long as Reddit is still a thing.\n\n> I figure this might be the best way to get this message across to the community. Love you all, most of you anyway. \n\n\nTL;DR: /u/AWildSketchAppeared has a job, dates, vacations planned, friends, family, exercise routine and school to keep him busy.\n\n\n\nEDIT: Wish him good life and stability though.\n\nEDIT2: Removed link from edit 1, don't want to be that guy who spoils someone's special day.\n\nEDIT3: For those wondering, link in the original edit was a controversial thing he had posted on FB or something 7 months ago.\n\nEDIT4: My highest rated comment is now about wild sketch, never change le reddit! \n\nEDIT5: I'm a grill btw ;)\n\nEDIT6: DAE hate le Trump doh?\n\nEDIT7: WildSketch-ShittyWatercolor 2020. /u/Shitty_Watercolour  /u/AWildSketchAppeared\n\nEDIT8: Frontpage... Hi Grandma!\n\nEDIT9: DAE got cancer from these edits?\n\nEDIT10: Ican't spel!!!\n\nEDIT11: RIP inbox\n\nEDIT12: Going to bathroom so won't be able to reply to your messages for 2 mins... will read them when I get back.\n\nEDIT13: Back from bathroom, surprisingly high amount of pee.\n\nEDIT14: Downvotes, reallly?\n\nEDIT15: omg, gf hacked my fone, sorry for all the edits, reddit!\n\nEDIT16: omg, i just realized reddit rhymes with edit! wat a time to be alive!!!!\n\nEDIT17: 420!!!\n\nEDIT18: 6969 upvotes? u guys are amazing!\n\nEDIT19: Holy shit... this blew up!! \n\nEDIT20: Thanks for the stranger, kind silver!\n\nEDIT21: OMG GOLD.... stranger thanks kind gold le!!\n\nEDIT22: Obligatory gold edit.... I would like to take this moment to thank my grandfather (who btw loved sex), my doggo and all my sex partners for making this happen! xDD\n\nEDIT23: Obligatory 'edit' edit, EDIT!\n\n\nEDIT24: Non-obligatory gold edit... I have gold now.\n\n\nEDIT25: [Giraffes](http://imgur.com/a/pYbJw)\n\nEDIT26: Popcorn tastes good.\n\nEDIT27:  <edited by spez>\n\nEDIT28: RIP again inbox.\n\nEDIT29: Hit Facebook, Join Lawyer, Delete Gym.\n\nEDIT30: LifeProTip: Don't die.\n\nEDIT31: ayy lmao \n\nEDIT32: EDIT25 should read geraffes... thanks bae  /u/DaHalfAsian \n\nEDIT33: Mandatory [award speeched](https://np.reddit.com/r/AwardSpeechEdits/comments/6e9h8v/theyll_never_stop/) edit, thanks you magnificent bastard.\n\nEDIT34: Weaponized Autism is a serious threat to society.  \n\nEDIT35: Don't let these edits distract you from the fact that in 1998, The Undertaker threw Mankind off Hell In A Cell, and plummeted 16 ft through an announcer's table. \n\nEDIT36: This is one way to get '**Inciteful Comment'**. See you all until next time!"}, {"id": "di89udw", "author": "yellow_yellow", "body": "F"}, {"id": "di8aipt", "author": "kswiszy", "body": "Just like that a wave of nostalgia appeared."}, {"id": "di88zoe", "author": "thoawaydatrash", "body": "u/Poem_for_your_sprog, we need you now more than ever in this time of darkness."}, {"id": "di8alnt", "author": "SilentAversion", "body": "See ya Space Cowboy"}, {"id": "di872me", "author": "shittysportsscience", "body": "As a longtime lurker, your account has been my favorite.  Much success."}, {"id": "di8aj2u", "author": "Dave_I", "body": "Nice send off, and great subject matter to boot. Sorry to see you go, you really classed up the place."}, {"id": "di8js1x", "author": "monkey_dg1", "body": "A certain realization dawned on him.\n\n\"Oh,\" he said.\n\nYES, said Death.\n\n\"Not even time to finish my cake?\"\n\nNO. THERE IS NO MORE TIME, EVEN FOR CAKE. FOR YOU, THE CAKE IS OVER. YOU HAVE REACHED THE END OF CAKE.”\n\n\n___\n\nSo long /u/AWildSketchAppeared, and thanks for all the fish."}, {"id": "di8alj2", "author": "Droppit", "body": "Oh, no, THANK YOU. If you accomplish nothing more, leave here assured that you have enriched the lives of a wide variety of people. Yet - my hope for you is that Reddit will be a minor footnote in the annals of your many successes!"}, {"id": "di8ds6z", "author": "kitttykatz", "body": "Dropped the mic. Perfect way to go out. See ya Space Cowboy."}, {"id": "di89u4v", "author": "mrjunx", "body": "Reddit will never be the same! Thanks for being amazing and brightening my day more times than you know!"}, {"id": "di8coit", "author": "TypographySnob", "body": "When are we getting a /u/AWildSketchAppeard book? Seriously though, I can imagine a hardcopy collection of your work showing your sketches with context. Get published, yo!"}, {"id": "di8e352", "author": "PM_TITS_PM_STEAM_KEY", "body": "colorizebot"}]}