{"id": "6zos6q", "title": "The UC Davis pepper spray incident that the university payed over $100,000 to \"erase from the internet\"", "url": "https://i.redd.it/ayj2cr2cuhlz.jpg", "subreddit": "pics", "author": "Bizarrmenian", "text": "", "comments": [{"id": "dmwykef", "author": "ewokskick", "body": "Chancellor Katehi who ordered the clearing of the quad and tried to bury the pepper spray incident went down in a flurry of controversies.  She was taking money from an academic publisher and a for profit college which were conflicts of interest.  As well there was some oddness with the hiring of family members.  Students occupied the admin buildings in protest and Fire Katehi was graffitied all over campus.\n\nUltimately, the president of the UCs intervened.  UC Davis hired a guy from Georgia Tech to replace her.  He seems to be an improvement."}, {"id": "dmx1xwh", "author": "bobikanucha", "body": "THE PERSON RESPONSIBLE FOR THIS IS RETURNING TO UC DAVIS. Chancellor Katehi the one who ordered the removal of the protesters was fired over her decision to do so. This year marks her return the school as a professor. Not only is she coming back but they are paying her THE SAME SALARY she had when she was chancellor(one of the highest paid people at the school). I really hope people see this as I'm surprised to see no mention of it in the comments. Ive seen comments asking why this is even relevant anymore and THIS is why. \n\nhttp://www.sacbee.com/news/local/education/article164312277.html"}, {"id": "dmwxfsh", "author": "TooShiftyForYou", "body": "*Police at first contended that the spray was the most appropriate tool on hand to deal with what they described as an unruly mob encircling the officers.*\n\n*However, a UC report in April 2012 declared that the pepper spraying violated policy and that school leaders badly bungled the handling of that campus protest. The investigating task force strongly rebutted campus police claims that the Occupy demonstrators who had pitched tents on a UC Davis quad posed a violent threat.*\n\n\n*In 2013, the former UC Davis police officer who pepper sprayed the campus protesters received $38,055 in workers' compensation after claiming he suffered depression and anxiety as result of the public outcry.*\n\n\n[Source](http://www.latimes.com/local/lanow/la-me-ln-uc-davis-pepper-spray-20160414-story.html)"}, {"id": "dmwx3xa", "author": "Academ1aNut", "body": "Guess it's not erased from the internet"}, {"id": "dmwx5id", "author": "allkill", "body": "Oi dickheads, pay me $50,000 and I'll make sure that I won't repost it back again. "}, {"id": "dmwzepr", "author": "halfassedanalysis", "body": "Payed means to seal a wooden boat to prevent leaks. The word you were looking for is paid."}, {"id": "dmwzb48", "author": "Theocletian", "body": "Wow, no wonder college tuition is so high these days.  If the administrators were willing to pay $100,000 to \"erase\" something off of the internet by paying to change around search results, imagine all the other things they are paying exorbitant fees for services.\n\nFor a measly $1,000 an hour I am willing to click on whatever link they want people to see instead of this pepper spray incident."}, {"id": "dmx2ht0", "author": "LouisBalfour82", "body": "[Video of the lead up to the incident](https://youtu.be/hhPdH3wE0_Y) "}, {"id": "dmx252t", "author": "oarabbus", "body": "My tuition money went towards that payment!"}, {"id": "dmwxbrh", "author": "Vanetia", "body": "Whatever happened to the cop doing the spraying in this picture? "}, {"id": "dmx0bfp", "author": "holename", "body": "\"paid\""}, {"id": "dmx1xfm", "author": "Mmaikkeli", "body": "Too few 6'4\" dudes who row, I guess."}, {"id": "dmx1cbi", "author": "ghostlimbwiener", "body": "A whole crowd of people behind them with phones and cameras and they think this picture is going somewhere? Psshhh "}, {"id": "dmx1j66", "author": "Spartan2470", "body": "[Here](http://i.imgur.com/m2OxI3H.jpg) is a much higher quality version of this image.  Credit to the photographer, Wayne Tilcock from the Associated Press, who took this on Nov. 18, 2011.  \n\n"}, {"id": "dmx2b5a", "author": "whodis77", "body": "Ha, and everytime I hear the words \"UC Davis\" I think of a place that tried to erase that incident.  So it had the opposite effect."}, {"id": "dmx1v7g", "author": "GreatMexicanTortilla", "body": "Damn, OP is smart. He posted this image so UC Davis will pay him 100,000 dollars \nEDIT: UC Davis not Berkeley "}, {"id": "dmx4jdq", "author": "Nurgle", "body": "[Aw some great memes came out of that](https://i.pinimg.com/736x/ae/e1/25/aee1254155c9efe90a353886856c3361--crispus-attucks-the-revolution.jpg)\n\n"}, {"id": "dmx0kqj", "author": "Its_NOT_Loose_dammit", "body": "> payed\n\nWhich university did *you* attend?"}, {"id": "dmx1jn4", "author": "trebuchetfunfacts", "body": "I wouldn't jump to conclusions here without seeing this whole video first\nhttps://youtu.be/hhPdH3wE0_Y"}, {"id": "dmx2xdz", "author": "kookoofunpants", "body": "Not to belittle the issue of police militarization, but pretty terrible that the biggest headline on Reddit can't spell \"paid\""}, {"id": "dmx2ryy", "author": "ed4ever", "body": "I was a sophomore at the time and watched this happen. It's ridiculous to me how the media villified this cop to excacerbate the police brutality agenda. Those kids were threatening the cops and were warned of the consequence. That cop walked around and warned every student, and they stubbornly rejected him. Their actions were embarrassing. \n\nThis video shows what really happened: https://youtu.be/hhPdH3wE0_Y\n\nAn excellent example of why people are fed up with the media."}, {"id": "dmx6squ", "author": "Steelwolf73", "body": "Ah, a gardener watering his hippies. It's life simple pleasures really"}, {"id": "dmx70b3", "author": "wally039", "body": "Don't they know that pepper spray, like all things ever, is known to the state of California to cause cancer?"}, {"id": "dmxa5w6", "author": "LilBoozy", "body": "That was the funniest shit ever. Zero fucks given"}, {"id": "dmx1wy5", "author": "us3rnam3tak3n2", "body": "The University paid*\n\n*California taxpayers paid. "}, {"id": "dmx6ib8", "author": "Fig_Newton_", "body": "Paid*"}, {"id": "dmx8p6f", "author": "JAproofrok", "body": "*****PAID***** for Christ's sake ...... really, the Jesus child hates missteps like this one. "}, {"id": "dmxgmft", "author": "SuperbCrawdad2", "body": "Lmao y'all think you're fightin' the power 😂"}, {"id": "dmxh7ij", "author": "jonnyclueless", "body": "And what you wont read on here is how students encircled and blocked police from leaving with people who were arrested. Nor will you hear about the people preventing the police from leaving being warned several dozen times of exactly what would happen if they did not let the police leave."}, {"id": "dmwxjbn", "author": "ymmajjet", "body": "Somebody post this to /r/AccidentalRenaissance with a quirky title "}, {"id": "dmx27lb", "author": "TheAC997", "body": "FWIW, the students walked up to the police and surrounded them, and chanted ~~\"you won't go.\"~~  \"If you let them go, we will let you leave.\"\n\nEDIT: fixed chant"}, {"id": "dmx3jvs", "author": "RxStfu", "body": "Not saying that I defend cops, but wasn't there an extended video showing these protestors circling the said group of cops and not allowing them to leave to their vehicles? I would say both sides have some shitty people in this instance. *Cue Trump jokes*"}, {"id": "dmx2bd9", "author": "ButterscotchYo", "body": "Ah yes, the old \"watering my hippies\" [image](http://imgur.com/RnVsi0u). "}, {"id": "dmx1su2", "author": "yourmajorprofessor", "body": "Feel the burn!"}, {"id": "dmx3x11", "author": "whinecube", "body": "PAID.  "}, {"id": "dmx41e0", "author": "Mowehner", "body": "I'll delete my pictures of it for 1000 USD"}, {"id": "dmx49it", "author": "srednuos", "body": "*paid"}]}