{"id": "73w8zb", "title": "This man took a bullet while protecting my sister from the gunfire in Vegas.", "url": "https://i.redd.it/gultof51thpz.jpg", "subreddit": "pics", "author": "tynation", "text": "", "comments": [{"id": "dntqp9s", "author": "adeadhead", "body": "Thanks for the reports friends! This post does not violate /r/pics title guidelines, and will be staying up. "}, {"id": "dnto3ld", "author": "ZeusHatesTrees", "body": "that's the smile of a man on hospital emergency morphine.\n\nGood on him, he deserves it."}, {"id": "dntnhgo", "author": "payfrit", "body": "this is the sort of story I want to read after an event like this.\n\nI couldn't care less about the assclown doing the shooting, someone interview this guy."}, {"id": "dntoh59", "author": "Nocoffeesnob", "body": "This photo brings home to me the huge scale of this horrific event.\n\nHere is a man who was shot just sitting there still bleeding, not even on a gurney.  Appears he went through triage and there are so many people far worse than him he’s stuck waiting.\n\nOn a normal day surely he would have been at or near the top of the list?"}, {"id": "dntoyc8", "author": "OC_maybe", "body": "Ya let's plaster this mans face everywhere not the killers. Lets glorify the heroes this time around!"}, {"id": "dntlckf", "author": "Smith5001x", "body": "Were the doctors able to get the bullet out?"}, {"id": "dntmhsz", "author": "potaytoposnato", "body": "That's awesome. So glad your sister is safe and this hero made it out (more or less) ok too. The only way to get through tragedies like this are to focus on the heroic efforts of those who help others during and after these events and always remember those who were lost. \n\nIt's good to see a photo like this after all I've read today 😞\n\nEdit: I didn't literally mean it's the ONLY way. I didn't think this comment would get so much attention 😳\n\nAll I meant was that it's important to notice stories like this to remember there is good in the world even during times like this. "}, {"id": "dntlxd4", "author": "dicky_cockpunch", "body": "A God damn hero, I hope that I can be that brave if called upon."}, {"id": "dntlltn", "author": "smellyPlastic", "body": "I’d buy that man a beer\n\nEdit: holy shit! I didn’t look at this since I posted. Thanks for the Gold!! \n\nIf anyone actually knows this dude let me know because I still want to buy that man a beer. "}, {"id": "dntnw9e", "author": "mikedeezy22", "body": "A real human being"}, {"id": "dntohfy", "author": "_thisisadream_", "body": "so how'd you two meet?\n\nhe took a bullet for me before he even knew my name. "}, {"id": "dntmoxs", "author": "IggyJR", "body": "He got himself a pair of awesome hospital socks.  They are the best."}, {"id": "dntomgq", "author": "narc0mancer", "body": "\"I used to be a casual concert goer like you but then i took a bullet in the knee..\" -This amazing guy"}, {"id": "dntqgnw", "author": "tynation", "body": "**To all media inquires:** I'm currently checking to see if the people involved here are willing to do a story with you. If they are interested I will forward your information to them.\n\n**Edit:** just spoke with my sister. She's just overwhelmed by everything and dealing with a lot of anxiety and not I interested in any interviews right now. Maybe in the near future when things settle down but not now. "}, {"id": "dnto432", "author": "krsdean", "body": "My husband worked with him a few years back... he's a good guy."}, {"id": "dntl1ze", "author": "iliketobefunny", "body": "Nice"}, {"id": "dnto91j", "author": "Billy_Hawkns", "body": "THERES A PROPER LAD"}, {"id": "dntlqbp", "author": "flappingpiegon", "body": "I was once a gambler like you. Then I took a bullet to the knee \n\nEdit: I count too much"}, {"id": "dntobsp", "author": "apple_hash", "body": "should be a good scar - make sure you do your physio dude.\n\nBullet 0 - Knee 1"}, {"id": "dnto3cs", "author": "Purplebuzz", "body": "I hope funds are raised to cover the medical expenses for all the victims. "}, {"id": "dntowk4", "author": "ayaymad", "body": "I wish these were the stories that got the most coverage. Screw the endless information about the shooter and his possible motives. To me, he'll just be a waste of oxygen who got out too easy. I want to know more about this guy and stories like these. Their stories of heroics and bravery in the face of absolute terror should be the focus of this tragedy. Not some coward up in a building.    "}, {"id": "dntmclg", "author": "KingOfBel-Air", "body": "What I've learned from these comments, save a girl and she's basically your property. Mario fucked you lot up."}, {"id": "dntn975", "author": "death_march", "body": "Buy this man many beers for being an amazing human."}, {"id": "dntmop5", "author": "Ennui92", "body": "I've never seen such a strong Skyrim guard!\n\nBtw: In Nordic/Scandinavian countries, \"taking an arrow to the knee\" meant that you are getting married/already got married. It refers to when we propose, we fall to one knee, comparing it to when a man gets shot in the leg, he, of course, falls to one knee so YES they should definitely merry as well. [Source](http://elderscrolls.wikia.com/wiki/Forum:What_%22Arrow_To_The_Knee%22_Really_Means.) Seems like Destiny..But its Skyrim^ok^wow^worse^joke^ever^time^to^sleep\n\n\nEdit: edits\n\nMore edit some time later: Found out my source was probably faulty from [this subreddit](https://www.reddit.com/r/gaming/comments/3015st/til_what_i_took_an_arrow_to_the_knee_means/) comments.   \n\nI choose to believe reddit even though it destroys my whole comment, calling it a night here."}, {"id": "dntljxm", "author": "daisypeace", "body": "TRUE HERO"}, {"id": "dntmicc", "author": "PhilthyMcNastay", "body": "They must have given him the good stuff or he's just happy to be alive or both. A hero.!"}, {"id": "dntlbsy", "author": "KCCOfitzy", "body": "Good man!"}, {"id": "dntnf0j", "author": "iPaintStripes14", "body": "Some people are so selfles and help people in these situations which amazes me "}, {"id": "dntngax", "author": "YuriTreychenko", "body": "MVP\n"}, {"id": "dntno00", "author": "AverageJoeWIS", "body": "He was there when she knee-ded him most\n\nJokes aside, It’s always nice to hear some good news in such bad news"}, {"id": "dntoetw", "author": "jonbuttcheeks", "body": "These are the faces we should be seeing and talking about on the news. Not the cowardly shooter. "}, {"id": "dntlsuc", "author": "Peterchamps", "body": "Nice human. Need more like him"}, {"id": "dntogth", "author": "Jhurpess", "body": "\nHuman beings are capable of some truly awful things, but some truly wonderful and selfless ones, too. \n\nThanks for reminding me of that. I needed the perspective."}, {"id": "dntq8dj", "author": "The_Bolenator", "body": "This shit. This shit right here. Everybody now a days during disasters like this seems to just wanna record the fucking thing happening instead of helping save others. For example I've seen videos of Dave Brizerian or however tf you spell his name running away from the Vegas scene talking about how he just saw this woman get her brains blown out. Fuck those type of people, this guy right here is a damn hero.\n\nHope him and your sister are both doing ok. "}, {"id": "dntljmj", "author": "rolltide1324", "body": "Good dude. "}, {"id": "dntm23n", "author": "Greganor", "body": "What a great guy!"}, {"id": "dntozzy", "author": "MrPennywhistle", "body": "He'd make a fine brother in law. "}, {"id": "dntpb21", "author": "ZDK242", "body": "Chivalry is not dead, just wounded 👍🏼"}, {"id": "dntutez", "author": "Viva_Las_Vegas", "body": "I worked with that guy. He's a Navy vet. Good guy. "}, {"id": "dntmk0s", "author": "toothravisher", "body": "The smile might be the meperadine"}, {"id": "dntmz2r", "author": "dontlikepills", "body": "I bet he's mostly upset that they had to cut his pants. \n\nYou can look at that man and tell he values a good pair of pants."}, {"id": "dntod60", "author": "Imafilthybastard", "body": "In the fucking knee too, what a champ. "}, {"id": "dntoum0", "author": "Extra21stChromosome", "body": "I hope the names from stories like this are what's remembered instead of the pos, deranged perpetrator.  I really want to believe the world  consists of 90% descent human beings, and the other 10% being wastes of humanity. "}, {"id": "dntuq8y", "author": "glennjamin85", "body": "Knew this guy on San Clemente Island, wouldn't doubt he'd do something like this. Genuinely proud to have met him, great story in a sad time like this."}, {"id": "dntodwr", "author": "Beorn_man", "body": "These comments are horse shit. Fucking A to that man and your sister for making it out of there alive. I raise a glass in your general direction. Sláinte!\n"}, {"id": "dntlp92", "author": "NapClub", "body": "i'd be smiling too if i saved someone!\n\ngood man!"}, {"id": "dntnujv", "author": "addisonshinedown", "body": "This man is a hero, no question,"}, {"id": "dntnyw4", "author": "AnotherDawkins", "body": "Did you know him before?  Or was he a total stranger?"}, {"id": "dntof2m", "author": "oh_no_aliens", "body": "he used to be an adventurer like you..."}, {"id": "dntojr7", "author": "IcarusBen", "body": "\"I used to be an adventurer like you, but then I took a 5.56mm caliber round to the knee.\""}, {"id": "dntox9q", "author": "mikeash", "body": "Tell him the internet says thanks."}, {"id": "dntoz6p", "author": "quincyguy1", "body": "I'm glad your sister is alive and well! "}, {"id": "dntoz8c", "author": "jewmuppet", "body": "may your gains be as abundant as your heroism. (at least now you have leg day off for a while)"}, {"id": "dntozzx", "author": "sysera", "body": "I'm glad your sister and this man are okay. So crazy, the whole thing."}, {"id": "dntp0lh", "author": "fenderscratch", "body": "You owe him a new pair of pants."}, {"id": "dntp0yi", "author": "IncrediblyDrunkUpvot", "body": "I feel safer just looking at this picture. truf"}, {"id": "dntp11s", "author": "cosby714", "body": "Buy him a drink, he literally took a bullet for somebody else. If that isn't respectable I don't know what is."}, {"id": "dntpquw", "author": "Selmanella", "body": "That looks like morphine face. "}]}