{"id": "76zwxx", "title": "ISIS lost its capital today", "url": "https://pbs.twimg.com/media/DMV41qCW0AAcIT7.jpg", "subreddit": "pics", "author": "sylezjusz", "text": "", "comments": [{"id": "doi5zxn", "author": "mai_mai_moi", "body": "Philippines' Marawi City (also controlled by terrorists) were also liberated just yesterday! 😃😃 "}, {"id": "doi3q16", "author": "nnn4", "body": "The BBC made a great article showing what this battle looked like from inside.\n\nhttp://www.bbc.co.uk/news/resources/idt-sh/the_city_fit_for_no_one_raqqa_syria_islamic_state_group"}, {"id": "doi189m", "author": "Llodsliat", "body": "Didn't ISIS lose its capital a few months ago?\n\nEdit: People are pointing out Mosul (which is the one I was thinking of, but didn't remember the name), a city in Iraq which is the largest city they had control over, but was not their capital. Today they lost Raqqa, in Syria, which was their capital."}, {"id": "dohy2al", "author": "sylezjusz", "body": "The woman in photo is [Rojda Felat](https://en.wikipedia.org/wiki/Rojda_Felat) who led the liberating force (SDF). She's standing at Raqqa's al-Naim roundabout, infamous for public crucifixions, beheadings and also [this scene](https://twitter.com/sommervilletv/status/920337136792014848) from when ISIS were at its peak. "}, {"id": "doi2cdu", "author": "moldedshoulders", "body": "If someone can confirm I believe the bottom text is Syriac/Middle Aramaic, if so, can anyone tell what it says?"}, {"id": "doi80xd", "author": "they_call_me_justin", "body": "Counterterrorists wins"}, {"id": "doi32gg", "author": "cfryant", "body": "Wherever they are is the capital of dickbags. "}, {"id": "dohzxzi", "author": "h0nest_Bender", "body": "Now they're just isis."}, {"id": "doi0p5o", "author": "felidhino", "body": "This fills me with so much joy!\n\nFuck ISIS! And their sympathizers."}, {"id": "doi308i", "author": "Butt_pass", "body": "The uniform amongst the rubble and that smile hits me on another level"}, {"id": "doi6e0z", "author": "WolfPerception", "body": "Fuck yes! Good job to ALL THE FIGHTERS FROM ALL COUNTRIES who whooped that ass.  May your rebuilding process be easy and painless.  God speed."}, {"id": "doi62ie", "author": "Dblcut3", "body": "In case anyone needs clarification on this: Their capital, Raqqa has been battled over for a few months now and finally liberated today. The group that liberated them are the Syrian Democratic Forces (SDF) - they are seperate from the Syrian Government, but not hostile towards them. Their main goal in the war is for autonomy in the northern, mostly Kurdish areas of Syria."}, {"id": "doi4ybz", "author": "Coffeypot0904", "body": "The way the shadow hits her makes the photo oddly look like a bad photoshop. "}, {"id": "dohwr8y", "author": "KommanderKitten", "body": "Here's your source: https://www.afp.com/en/news/205/islamic-state-group-loses-emblematic-syria-stronghold-raqa\n\nPhotog's Twitter: https://twitter.com/Kilicbil"}, {"id": "doi8ebo", "author": "x_cLOUDDEAD_x", "body": "And it's female fighters waving the flag. That must really burn ISIS up. They got stomped by the ladies."}, {"id": "doi7xt5", "author": "Chef_Chantier", "body": "Who wants to take a guess at answering the million dollar question: what will be the next terrorist group plaguing the middle east?"}, {"id": "doi5xdz", "author": "Enzo_kabenzo", "body": "Long live YPG/YPJ and the SDF!"}, {"id": "doi5hsc", "author": "Spaghetti_Rossetti", "body": "Hearing this made my day"}, {"id": "doifizw", "author": "Dark_Fury1000", "body": "Seeing the woman holding up the flag in this photo is powerful to me.  I know it'll really give hope to those affected by terrorism; especially to women that have been raped, beaten, mutilated, and basically stepped on by ISIS.  "}, {"id": "doi6fg2", "author": "hallese", "body": "Ok, time for the important question:  When can Mallory start using the name ISIS again for her company?"}, {"id": "doi6smo", "author": "BaconatorFry", "body": "lol get rekt isis "}, {"id": "doi4r3h", "author": "Monkeyfeng", "body": "Good. Fuck ISIS. "}, {"id": "doi5x3e", "author": "fulminedio", "body": "While I am excited for them and love the smile on her face, it absolutely saddens me seeing the destruction in the back ground knowing its going to be a long recovery."}, {"id": "doi3q2y", "author": "LJ_Carman", "body": "Soon to be waswas"}, {"id": "doi0kbr", "author": "JennyFranklin1", "body": "Alhamdu-lillah,\ngreat news. They've just ruined our religion."}, {"id": "doidhhn", "author": "Mega1X", "body": "As a Muslim, FUCK YOU ISIS\n\nSUCK IT!\n\nSeriously Happy, Heck all my family members who are Muslim are just ecstatic that these waste of lifes are gone. I hope more ISIS members die. \n\nThey fucked the religion up so much.\n\nBut the one thing that makes me proud is NO ONE, NOT ONE COUNTRY, fell into fear and despair. They fought hard, They made sure FEAR is not the winner. And they made sure that no matter what ISIS does, we are forever strong and powerful together.\n\nSo happy! Congratz all! We as a community from different cultures and countries are AWESOME!"}, {"id": "doi615w", "author": "hobbitlover", "body": "Relevant link showing how much territory ISIS has lost:\n\nhttp://www.bbc.com/news/world-middle-east-27838034\n\nIt won't be long until they're concentrated in a small enough area they can be wiped out with bombs. I'm surprised that there haven't been more desertions at this point - after being told God is with you for so long, it must be disappointing to realize that A) no he's not, B) he's actually with the other side, C) He's a She, or D) there is no God."}, {"id": "doieh4u", "author": "stellarborg", "body": "Gotta love it that it was a female commander who took is capital\n\nsuper badass"}, {"id": "doi63nm", "author": "subgamer90", "body": "So much for their garbage \"caliphate\". Lol"}, {"id": "doi9uzq", "author": "shek89", "body": "Down goes ISIS. Fuck ISIS."}, {"id": "doii48s", "author": "ManOfTheCommonwealth", "body": "The use of smartphones was incredibly striking - fighters ‘drop a pin’ to order up a little death from above. Amazing.  "}, {"id": "doilbl7", "author": "Nucks_Nation", "body": "He is acting like it, taking full credit for the victory.\n\nAs I recall, Trump was not even in favour of continuing the previous administration's strategy of working with the Kurds and SDF and other regional allies to weaken ISIS and chip away at their territory. Yet he seems pretty eager to take credit for their work when it suits him. "}, {"id": "doi6wey", "author": "ill_change_it_later", "body": "Man, the Kurds deserve their own country. It seems like they have been involved in any successful operation over there."}, {"id": "doi0yf8", "author": "soggybottomman", "body": "It kinda looks like they're celebrating....but against a backdrop that screams 'Doesn't matter at this point'...that's depressing.\n\nPlease stop jerking yourself off with replies like 'Duurrrr they're not fighting for rubble!'. If you don't understand how you can feel happy and sad at the same time, and you're about to hit that submit button, just hit cancel and shit up someone else's inbox. Thanks!"}, {"id": "doi6c30", "author": "JuanFran21", "body": "An unknown player lost their capital!  \nSDF now controls the most original capitals (2).  \n\nIn all serious though good for them :)"}, {"id": "doi85oo", "author": "xStickyBudz", "body": "Every time I see pictures of what Syria has become since all the wars is heartbreaking. Such a rich historical city turned to rubble. Break my heart "}, {"id": "doi8pns", "author": "willmaher1", "body": "Linda’s work is coming along nicely "}, {"id": "doi9ci3", "author": "BISON_FINGER_CHEESE", "body": "Buh bye goat fuckers. "}, {"id": "doia8z9", "author": "bobbyjoesanchez", "body": "I think this belongs in r/upliftingnews"}, {"id": "doigbyv", "author": "silvernug", "body": "Best Civilization 6 notification I've ever received."}, {"id": "doii132", "author": "ChemicalPictures", "body": "Suck that dick ISIS!"}, {"id": "doiabci", "author": "ultimatebesttroll", "body": "Thousands of goats breathed a sigh of relief. "}, {"id": "doi24v7", "author": "AbsolutelyTheNSA", "body": "Now they're ISIS: Vice"}, {"id": "doi6p0j", "author": "The_Gadway", "body": "And the people who defeated ISIS are being attacked by Iraq and Iran. The Kurds did nothing to deserve this hostility, as they want their independence from Iraq. Kurdistan needs our help, as they've always had our backs."}, {"id": "doi5sat", "author": "nexus6ca", "body": "From the looks of that picture, the people lost their city for a long time to come."}, {"id": "doid1ao", "author": "Troxio420", "body": "Sad day for the kurds tho they lost kirkuk to the Iraqis, so now they won't become independent"}, {"id": "doigecx", "author": "jellyroll_rob", "body": "free kurdistan!"}, {"id": "doik7qo", "author": "SexyStudlyManlyMan", "body": "The Kurds deserve their own country. No one would fuck with them."}, {"id": "doi9hvr", "author": "thoth1000", "body": "Hey, those people on the ground fighting ISIS, they're Muslims too. Let's hope that all the blood THEY spilled fighting against ISIS cements their belief in never letting extremists seize control again. I hope that since they fought for this victory, they will fight twice as hard to make it stick."}, {"id": "doimdy8", "author": "NebulaWalker", "body": "Cue Trump taking all the credit for it in 5...4..."}, {"id": "doi7ej4", "author": "cleofisrandolph1", "body": "This a great moment. \n\nHowever, ISIS's ideology will not simply disappear. You can't kill an ideology, look at Nazism as a perfect example of this. There is still work to be done. \n\nThis is also a drop in the bucket in bringing any form of peace to Syria. You still have Al-Nusra and HTS as the Islamic/Salafist-Jihadist elements in Syria. You have the SDF, you have Assad, and you have the Kurds who as ISIS is reduced will lose their common enemy and start fighting each other. \n\n I think it is starting to look like a failed state since there will be no way to reconcile all the parties and reform anything that looks stable. Especially given the actions of the US and Russia in this(to give some insight, Russia sees Iran as the regional power, Assad and the Ayatollah come from similar Shiite backgrounds of Twelver Shiism, so Russia sees these two states as their proxies. Iraq is currently in an odd situation since the leadership recently swapped from an Iranian backed Shiite regime in Al-Maliki to a Kurdish/Sunni regime. That shift probably brings Russia to see preserving Assad as a greater necessity.) \n\nAlthough people have said that Assad should remain it is pretty obvious that even if Syria is re-stabilized, how long can Assad last when the people to vehemently rejected him? the answer is not long, and because without a clear opposing voice to challenge him and an opposition filled with Salafist-Jihadists and loose rebel organizations in competition with one another, it is doubtful that Syria will be able to recover.  "}]}