{"id": "7pnxv2", "title": "Meeting Keanu Reeves at a traffic light", "url": "https://i.imgur.com/Fo7a18f.jpg", "subreddit": "pics", "author": "unknown_human", "text": "", "comments": [{"id": "dsinml1", "author": "Freefight", "body": "He really is Reddit's favourite, good guy."}, {"id": "dsimvui", "author": "elee0228", "body": "Seems like Neo is everywhere on Reddit these days."}, {"id": "dsinem2", "author": "mattreyu", "body": "And then just as suddenly, Keanu Leaves"}, {"id": "dsiohal", "author": "Sumit316", "body": "He acutally co-owns a bike company called Arch Motorcycle Company that makes badass custom motorcycles. \n    \nAbout biking he says - \n   \n\"“Riding your bike is one of the greatest things you can do to clear your head and just feel the speed and the motion,” said Reeves.\n\nUnlike the many other riders out there, Reeves didn’t get into motorcycles until he was a young adult. As a teenager growing up in Toronto, Ontario, he was more into playing ice hockey than anything (he is, after all, a Canadian—eh).\n\n“I started when I was 22,” said Reeves. “I was filming in Munich, Germany, at this film studio, and this young girl had a gorgeous (Kawasaki) Enduro motorcycle which she would drive around. One day I asked her to teach me how to ride it. So I started to ride that bike around the stage when she wasn’t using it, and when I got back to Los Angeles, I got the first bike I saw that was similar. .\"\n    \n“I don’t go as fast as I used to,” he said. “I don’t have a sense of fear, it’s just that I’ve had enough accidents, a ruptured spleen, a lot of scraped skin and road rash that I don’t really feel the need to test the limits as much. I also don’t use riding a motorcycle as a way of getting rid of anger or frustration the way I used to. When I was younger, I used to get out on the road with the bike and just go as fast as I could and basically let it all out on the road. But after enough wipeouts, you begin to think that that’s not a really good frame of mind to be in when you’re riding a motorcycle at high speed (laughs).”\""}, {"id": "dsin3s9", "author": "lornstar7", "body": "I don't care much about celebrities, but I'd definitely want to hang out with Keanu"}, {"id": "dsior4p", "author": "poopellar", "body": "Keanu Revs."}, {"id": "dsinovc", "author": "LizardBurger", "body": "I feel like most celebrities don't want to be noticed in public, but Keanu is like, \"Look at me. Look. Directly. At. Me. I am Keanu *Reeves*.\""}, {"id": "dsioixv", "author": "Marconius1617", "body": "Where does the Keanu roam?  Is he mainly seen in LA? Bill Murray seems to follow random migratory habits , but is Keanu more often seen in one area ?"}, {"id": "dsimpfq", "author": "YourMumsWoke", "body": "*A wild Keanu appears*"}, {"id": "dsimnbd", "author": "unknown_human", "body": "[Source](http://mr-reeves.com/keanu-reeves-norton-last-night/)\n\nMotorcycle is a 750 Norton Commando."}, {"id": "dsinit5", "author": "AndyMandalore", "body": "I feel like this is the other pov of that \"shia lebeuf at a stop light\" meme."}, {"id": "dsiqvqw", "author": "dumpsterdivingdonkey", "body": "Keanu Reeves is suddenly freaking everywhere. This year is blessed 🙏"}, {"id": "dsipp05", "author": "sir_stride20", "body": "I'm a simple man. I see Keanu, I upvote. "}, {"id": "dsipdhn", "author": "NatashaStyles", "body": "A guy in Hollywood who isn't a total fuckhead. Cheers to Keanu."}, {"id": "dsip624", "author": "masshamacide", "body": "I wish Reddit would have a notification that goes \"A Wild Keanu Has Appeared!\""}, {"id": "dsit1b5", "author": "mjoksana", "body": "He just got accused by multiple women of being a complete gentleman. "}, {"id": "dsip73q", "author": "Foo3112", "body": "Everyone's met this guy but me. Jk, I also met him when he toured with his Band DogStar back in 1997. He signed everything and took photos but he sure wasn't one for conversations. Kept to himself and would answer usually with just a simple yes or no when asked a question and that was that. Really quiet and reserved. Made me like him even more. "}, {"id": "dsipau3", "author": "GetsBetterAfterAFew", "body": "Dude is always chilling solo."}, {"id": "dsinqr2", "author": "FluffyAstronaut", "body": "He's everywhere on Reddit! Like the way cooler version of Where's Waldo."}, {"id": "dsiql39", "author": "serg_yeooo", "body": "Keanu Reeves is the most non-celebrity, celebrity. Seems so down to earth and humble. I'd love to meet him one day."}, {"id": "dsipa9c", "author": "Bangalore-Guy", "body": "Kenau is someone who brings grace & respect to celebrity fraternity. "}, {"id": "dsio9zr", "author": "NSRT4", "body": "He looks just as excited to have run into you as well "}, {"id": "dsip3v5", "author": "atlel", "body": "I made eye contact with Keanu in an airport a few years ago. He smiled and in that moment I was euphoric."}, {"id": "dsiqsbg", "author": "S4MH41N", "body": "As a biker, it's very interesting to me that Keanu Reeves, with all his money and resources, and his *own motorcycle company that makes high end $80K+ bikes*, still rides an old kickstart Norton from the 70s.  That's really cool.  The dude's a true biker."}, {"id": "dsiql9n", "author": "Capt_Schmidt", "body": "I think the Keanu is aware the internet has been stalking him for some time now"}, {"id": "dsiqte0", "author": "P2Pdancer", "body": "He’s like, “Hey there (smiles genuinely), do I know you?” \n\nWhat a great guy. I’m glad Reddit says nice things about him because from what I’ve read, he really is a kind man. "}, {"id": "dsip7q4", "author": "thelastactionhero", "body": "Not gonna lie, would have noticed that Norton before Keanu. "}, {"id": "dsip8tr", "author": "Cosmic_Fugue", "body": "He's come a long way from that lonely park bench."}, {"id": "dsiq9bf", "author": "itsnotthenetwork", "body": "I want this guy on Joe Rogan's podcast."}, {"id": "dsiqwgl", "author": "griff306", "body": "Am I the only one who hasn't met Keanu?? "}, {"id": "dsipt5l", "author": "ferociouspandas", "body": "Looks like Ventura  Blvd and Coldwater Canyon next to the Ralph’s market. "}, {"id": "dsip5ec", "author": "royboyblue", "body": "As a regular dude that rides, if I pulled up to scope out a fuckin Norton Commando and saw that it was K-Reeves. Thatd make my day!\n\n"}, {"id": "dsioj4g", "author": "HotPie007", "body": "This guy actually comes across as a genuine guy unlike many fake Hollywood celebs."}, {"id": "dsiqa22", "author": "mpk3", "body": "I hope he knows Reddit loves him...\n\nDear Keanu,\n\nIf you are reading this, we love you, even if you are an immortal/appear to dont age/ probably are a vampire...\n\nLove,\nReddit\n\nhttp://www.keanuisimmortal.com/ "}, {"id": "dsio5ny", "author": "ForNarnians", "body": "What an incredibly nice guy! To lean in and smile for some random persons camera like that, when you've been bombarded by them your whole career (more so in the last month) is just so awesome. "}, {"id": "dsis7gn", "author": "quotesforlosers", "body": "He’s the new mascot of Reddit. Reddit, lose the alien and just post new photos of Keanu Reeves everyday. "}, {"id": "dsio90j", "author": "TooShiftyForYou", "body": "Keanu is getting ready to embark on an excellent adventure."}, {"id": "dsiql1d", "author": "-MURS-", "body": "Does Keanu Reeves have friends? How come he's never with anybody in any of these pictures?\n\nDo you think all his friends are dead because the 1000 years old theory is true?"}, {"id": "dsipnh1", "author": "a_goonie", "body": "Did Keanu say fuck it. Matrix residuals are enough, im just gonma ride around on my bike and take pics all day. "}, {"id": "dsiqua4", "author": "405freeway", "body": "This intersection is Coldwater Canyon and Ventura Blvd. in the Studio City neighborhood of Los Angeles. They are driving westbound on Ventura Blvd."}, {"id": "dsioll2", "author": "SkyPork", "body": "Are there *any* bad photos of this dude? I'm as straight as they come, but he makes me question my heterosexuality like no other."}, {"id": "dsipp62", "author": "DontDoItMom", "body": "Keanu is like an easter egg reddit staff put randomly and the one who found him can get Karma as a prize"}, {"id": "dsintwt", "author": "jayvil", "body": "Can he be the next ghost rider?"}, {"id": "dsimlzk", "author": "Xujiahui", "body": "What did you say to him?"}, {"id": "dsipla1", "author": "gracklewolf", "body": "God damn, he is **the one**.  I'm an atheist, but this almost convinces me Jesus has returned to Earth and he is Keanu Reeves."}, {"id": "dsiozaj", "author": "dudeman9169", "body": "I obviously don't know for sure but he really seems like a genuinely cool dude. I'd definitely chill with Keanu given the opportunity."}, {"id": "dsipt5s", "author": "kaijuawho", "body": "God damn it why is he so cool?!"}, {"id": "dsipu31", "author": "alli_pal", "body": "Yep, he’s perfect. "}, {"id": "dsiqwkw", "author": "Atrampoline", "body": "Keanu Reeves for President 2020. He's got my vote."}, {"id": "dsir2x5", "author": "Spartan2470", "body": "Credit to the photographer, erinn_janee on Instagram.  \n\n[Here](http://mr-reeves.com/keanu-reeves-norton-last-night/) provides the following context:\n\n> May 17, 2014\n\n> Many thanks to erinn_janee who shared the photo that she snapped of Keanu Reeves last night while he was out on the Norton and to @jmilahkarla who tweeted the link.  According to her comment, she was next to him at a red light."}, {"id": "dsisctq", "author": "Pkock", "body": "This should be used to promote motorcycle awareness. \"Look twice for bikers, because you never know if they could be Keanu Reeves\""}, {"id": "dsj7q2c", "author": "RONINY0JIMBO", "body": "If Keanu isn't too good for a helmet neither are you.  Ride safe."}, {"id": "dsip01g", "author": "Pepsiman1031", "body": "Keanu Reeves all over Reddit "}, {"id": "dsit5x3", "author": "thekonzo", "body": "It feels like Keanu Reeves is reddits cool uncle and comes to visit every now, cooks a nice dinner for everyone, tells a good story that makes you think and is off to another adventure the next day. "}, {"id": "dsit9bu", "author": "HappyDazzle", "body": "God Bless this man."}, {"id": "dsixlst", "author": "cawpeeptweet", "body": "I met Keanu Reeves in a line at an airport one time. He knocked over somebody's luggage in the most clumsy Keanu way and was super apologetic. Always nice to see famous people in the wild acting like a normal human"}, {"id": "dsiz5up", "author": "self-guided", "body": "Keanu Reeves wears a helmet while riding a motorcycle. No one can ever say they are “too cool for a helmet” after this."}, {"id": "dsj1pl0", "author": "jukeboxinabox", "body": "Did Keanu reeves recently come out of hibernation? "}, {"id": "dsj7o6i", "author": "Go4Lo", "body": "Bill Murray: “No one will ever believe you.”\n\nKeanu Reeves: “Everyone will believe you.”"}, {"id": "dsiqojv", "author": "Ducman69", "body": "I like Keanu as much as the next guy, but why are we being flooded with Keanu stuff lately?\n\nIs some PR firm pumping up Keanu posts for an upcoming movie or something?  "}, {"id": "dsirmqy", "author": "Madtramp", "body": "He always looks like he could have you in a chokehold and still make it feel like a warm hug while you slip into the darkness."}, {"id": "dsis78k", "author": "pwrshft99", "body": "Keanu is going to become the Bill Murray of future generations"}, {"id": "dsishfh", "author": "DanHazard", "body": "What I want to know is how does everyone meet Keanu all the time."}, {"id": "dsiwplk", "author": "D_A_M_A_G_E", "body": "He got the John Wick beard"}, {"id": "dsixd3f", "author": "TheeVande", "body": "Keanu is a mythical creature that sometimes grants us mere mortals with his presence"}]}