{"id": "7qybyi", "title": "I beat colon cancer today. Happiest day of my life.", "url": "https://imgur.com/peI2aKV", "subreddit": "pics", "author": "the1godanswers2", "text": "", "comments": [{"id": "dssu9me", "author": "-SaC", "body": "I hope your future path is a long and happy one, and your colon remains a long and curly one."}, {"id": "dssverp", "author": "BeltfedOne", "body": "My Brother just started his brawl.  Congratulations! Stay strong!"}, {"id": "dssuklk", "author": "qeratsirbag", "body": "fuck yeah! wishing you a healthy life! fuck cancer!"}, {"id": "dsswszs", "author": "Not_Daniel_Dreiberg", "body": "I thing my biggest fear is living my life while having cancer without knowing and find only when it's too late."}, {"id": "dsstyvo", "author": "problynotkevinbacon", "body": "Nice. Fuck cancer. "}, {"id": "dssvjvg", "author": "zuggles", "body": "serious question: just tonight my girlfriend received a call from her mother-- her mother found out she has colon cancer.\n\nany advice? for me as to how to support my girlfriend? for my girlfriend in how to help her mom... or anything really?"}, {"id": "dssykan", "author": "LimpCoffee", "body": "Hope you do beat it, man. You probably won't see this. But my father had colon cancer when we first moved across country when I was 11. He found out because he needed to get his blood pressure, cholesterol, etc. medication refilled (he was about 52 at the time). He moved cross country for the job (from New York to Louisiana) and he went to the doctor and they did a full physical with blood tests. The doctor called a day later or so and said that he needed to come back in for more tests. Well after a colonoscopy and more blood tests... He had colon cancer. Just as I started school again (7th grader in a new state, living in a extended stay hotel). Couple weeks later he got the surgery and they took 18 inches out of his fucking colon. 18 inches. Couldn't believe it. But a few days after surgery when the doctors allowed him to walk again he walked as much as possible as often as possible and got back to health faster than the doctors thought. But he was motivated by his family and his new job to keep going keep working towards better health. He's been cancer free for about 10 years now.\n I just want you to know that it will get better and although cancer is hell and it takes a toll it will get better. There will be people in this world that love you and hope for the best of you even if they aren't your own family. I hope you get better man I really do. God speed and good luck my friend. "}, {"id": "dssw3n4", "author": "Nignug", "body": "I just had surgery for mine last Tuesday. Now comes chemo. Good luck dude. "}, {"id": "dsswbdi", "author": "wadeswhit", "body": "Fuck yea! You lifted so many spirits with this. I know Im not the only one. You kicked ass and chewed gum and you need to stop swallowing the gum. JK, awesome news."}, {"id": "dssyyoe", "author": "Gandalfthefabulous", "body": "Man in hospital"}, {"id": "dsszxdt", "author": "oopa_doopa", "body": "I'm 3 months post-op and also beat this fucker.  Fortunately didn't need chemo as it was caught early. You'll feel stronger every day. A couple things are important to know, and I wish I knew some of this stuff beforehand.\n\n It is not uncommon to have what is known as post-operative urinary retention. During any sort of pelvic surgery, the nerves Near the bladder can get beaten up a little bit. It took me nearly three months to get back to peeing again normally, but it did come back.\n\n Don't be surprised if it takes a little while to get a boner haha. For the same reasons above, Your sexual function may be off for a while. Although right now, the last thing you probably feel like doing is having sex haha.\n\n Get up and walk as soon as you can. The sooner, the better.\n\n Don't be afraid to ask for pain meds if you're in pain. It is important to stay ahead of the pain, because once you are in excruciating Agony, it is very difficult to get it back under control.\n\nWhen you're home, wound recovery will be vastly aided by ensuring that you are drinking at least two liters of water a day, that you take in a lot of vitamin C, ideally at least 1,000 MG, and that you are consuming additional protein.\n\nIf you have an ostomy is part of your surgery, it will take a little while to get used to it. I'm 3 months into my operation, and I'm still getting used to the fucker.\n\n You will get better. Keeping a positive attitude is critical. Your recovery may go extremely well, But you might have some complications along the way. Having a good support system and people to talk with and vent to is critical.\n\n There are lots of other things, please feel free to DM me if you want to talk. I've been down this path and would be more than happy to try to  Help you on this journey."}, {"id": "dssunwv", "author": "smokinokie", "body": "Rock on brother! "}, {"id": "dssxewg", "author": "drivvy", "body": "Not trying to be a downer. But make sure you get checked up if anything seems abnormal down the road. My mom had surgery for colon cancer 3 years ago and was declared cancer free at the time. She is currently doing chemo for lung cancer. If you have cancer be wary as it can come back.\n\nBut good on you best of luck!"}, {"id": "dsszfdn", "author": "the1godanswers2", "body": "I had pain in my lower left side. Felt like Mike Tyson taking rounds out of my abdomen. Usually you won't feel pain but mine was high up in the colon"}, {"id": "dst6ceu", "author": "TazMan65", "body": "I am a proud member of the semi-colon club. I had Stage 4 colon cancer they went in and removed 1/3 of my colon (the whole ascending side). Once I finished my chemo they found it had moved to my lungs so I went back and they were able to remove all the spots. \n\nIt has been over a year now and it hasn’t popped up anywhere so hopefully I have fucked cancer! So far so good at least. Stay positive and you can beat anything!"}, {"id": "dssx631", "author": "aj_ramone", "body": "The closest man I've ever had to a father is going through the same shit. Fuck yes dude. I am so happy for you. "}, {"id": "dssxmpp", "author": "Katahnz", "body": "Congratulations man. Colon cancer is a tender spot for me. I've lost two of the most influential men in my life to it. Keep wearing that blue ribbon man. "}, {"id": "dssupvh", "author": "JstnJ", "body": "https://media.giphy.com/media/PhKhSXofSAm3e/giphy.gif"}, {"id": "dssx9gc", "author": "fusepark", "body": "Friend of mine beat it fifteen years ago and is back to 100%. Beat it down, it'll cave."}, {"id": "dssycut", "author": "myfavoriteanimal", "body": "Fuck yeah!!!"}, {"id": "dssycwr", "author": "WheresTheButterAt", "body": "Fuck cancer! Good on ya man!"}, {"id": "dst672n", "author": "imsitco", "body": "I have no idea how this shit works, so please, educate me instead of hating.. Isnt it just the doctors doing the work? Does a \"positive mindset\" fix your body or something? Im so confused by all this"}, {"id": "dsswihm", "author": "sourseth", "body": "My dad has been fighting colon cancer since February of 2012 and I know how hard it is. Very happy for you!!!"}, {"id": "dssx8hs", "author": "DiamondPickle", "body": "Good for you! Hope you live a long happy life."}, {"id": "dssw68y", "author": "bestadamire", "body": "Good vibes your way! Ill drink one for you tonight bud."}, {"id": "dssxy01", "author": "LemonLimeAlltheTime", "body": "Someone should make a sub for all these posts, as well as all the \"After x years, I'm finally a US citizen!\"\n\nThey are nice and I am very happy for you, but none of these are good PICTURES.\n\nThis is the PICTURES subreddit, a place to share photographs and pictures.  Dont @me"}, {"id": "dssy6i7", "author": "TikeMyson31", "body": "I miss the old r/pics"}, {"id": "dst0jns", "author": "JordanTYH", "body": "My father has a friend that worked odd jobs, collecting and selling cardboard boxes for several years to provide for his family. He retired last year, and found out that he had stage 4 leukemia this year. He has 2 sons and he has trouble accepting that he only has about 2 years left. Fuck cancer man"}, {"id": "dst673f", "author": "weeecho", "body": "My mom just got diagnosed with it and I've honestly never been so scared. She's all I have... What tips do you have over this? Oh and thank you for the pic, it filled me with hope."}, {"id": "dst7pd7", "author": "Eaton_Beaver_in_FL", "body": "Congrats! I beat my meat today. Pretty average day of my life. "}, {"id": "dssxcd0", "author": "yellekwerdna", "body": "I DONT KNOW WHO YOU ARE BUT IM GLAD YOU BEAT CANCER HELL YEAH"}, {"id": "dssz3qm", "author": "dirtmerchant1980", "body": "Grats and all, but isn’t there a more appropriate place for these “picture of nothing/feelgood title” posts?  No matter the context, this is a picture of a dude laying in bed. Not front page material."}, {"id": "dsszkar", "author": "whatsupbroski", "body": "Hey man, not sure if you’ll go through reading every comment especially the buried ones, but if you do, just know this - you’re an inspiration. God bless you brotha, wishing you success as you get back on track!"}, {"id": "dssxqkm", "author": "Johneffer", "body": "That's great \nMy moms dying of cancer"}, {"id": "dssxjxo", "author": "cpo5d", "body": "Greetings fellow ass cancer survivor! You are an ass cancer ass kicker.  Welcome to the rest of your life."}, {"id": "dssycsh", "author": "iamjon4", "body": "Your post made my night. Just a random guy tired from work stumbling on this...wishing you a great healthy life man!"}, {"id": "dssz6m9", "author": "rebel_nature", "body": "Congratulations, OP!\n\nQuestion: What were the symptoms you had that made you think \"Something is definitely wrong and I need it checking out\"? I think there are a lot of people out there who don't go to the doctors when they have \"gross\" symptoms, especially in a very private part of the body, and either just shrug it off or hope that it'll go away. \n\nI'm currently going through my own issues with my digestive system and am just beginning testing for what could be wrong (my husband is now starting to suffer from symptoms too). Here's hoping I/we just have an infection that can be easily treated!"}, {"id": "dst7t0k", "author": "the1godanswers2", "body": "Wow. Waking up from a morphine induced sleep to so much support is amazing. Thanks for the gold! "}, {"id": "dsswbg3", "author": "k-west", "body": "hell yes!! congrats man!! my dad is celebrating 2 yrs colon cancer free this yr. wishing you many many cancer free years ahead! "}, {"id": "dsswjsg", "author": "ill-fed17", "body": "That’s the shit, man."}, {"id": "dssxjvr", "author": "Pukalo_Reincarnate", "body": "Damn that must've been a real pain in the ass."}, {"id": "dssxzo0", "author": "GregNak", "body": "Grats man!  I know the feeling.  My odds are shit but I’m currently disease free. "}, {"id": "dssy1zk", "author": "Twomblinator", "body": "This is a BAD. ASS. PHOTO.\n\nYou took the biggest enemy of humanity and made it your BITCH.\n\nKill it brother.\n\nReddit is a cesspool of hatred. Don't listen to them. "}, {"id": "dssyd0b", "author": "millamb4", "body": "Rock on brotha!! "}, {"id": "dst1ccb", "author": "vision-quest", "body": "Dude, that's fucking RAD! Keep fighting the good fight, you're going to crush life with the knowledge you have gained from this experience."}, {"id": "dst67wl", "author": "2l84aa", "body": "Greatest shit ever coming your way!"}, {"id": "dst6k3l", "author": "ucantafordit", "body": "Go to hell cancer"}, {"id": "dst6ka3", "author": "BeegIron", "body": "FUCK CANCER"}, {"id": "dst6mu5", "author": "tuanomsok", "body": "Yay for you! Fuck cancer."}, {"id": "dst7a7g", "author": "Z0MGbies", "body": "That must have been a real pain in the ass"}, {"id": "dst7jqw", "author": "derp_fedora11", "body": "FUCK CANCER BOIS"}, {"id": "dst8uyj", "author": "owerfemma", "body": "Fantastic! Long life and happiness t you, warrior!"}, {"id": "dstf4rr", "author": "General_Brainstorm", "body": "Congrats friend! Fuck cancer."}, {"id": "dstfqqm", "author": "TheSorussRex", "body": "My grandfather was diagnosed fairly early with colon cancer at the age of 90. We were all scared for him. But we began the treatments, and he was healed within a year and a half.\n\n Honestly, I was surprised. Now he is almost 100 and still doing well. He had always been very sharp and active and he's still the same guy he was before the cancer. In fact I think having a scare like that gave him a new lease on life :)\n\nI'm sharing this because I think it's unfortunate that cancer has this scary reputation. Of course it can be sad but these days the prognosis can be quite good. I'm wishing you the best of luck with the rest of your recovery. I know it's not easy."}, {"id": "dsu71ah", "author": "cirenj", "body": "I am currently going through chemo for Colon cancer now... Had surgery on September 5th to remove 2 feet of colon/intestines. Now on cycle 7 out of 13 for my chemo... Fight the good night sir..never give up... I say this after being 5 years clean from Sarcoma cancer as well... Head down and push push push! You have joined an exclusive club, a club that none of us really want to be apart of..."}, {"id": "dssz5lq", "author": "dietcokeandwater", "body": "Congratulations!! Keep reddit updated on your appointments in the months to come! "}, {"id": "dssww3u", "author": "hypnos_surf", "body": "It is great seeing someone give a big \"fuck you\" to a disease that took my grandfather. Your strength is amazing and happy for you!"}, {"id": "dssu84o", "author": "palegoldshadow", "body": "You made my day! :)"}, {"id": "dssvgrh", "author": "AframesStatuette", "body": "Fuck yeah. Way to fight the good fight!"}, {"id": "dssvlft", "author": "brotallyswagical_", "body": "Holy shit great job!!"}, {"id": "dssx7zz", "author": "ItsOfficiallyME", "body": "My man.\n"}, {"id": "dssvheh", "author": "Guardiancomplex", "body": "Wish I was sharing this joint with you dude. You're in my thoughts, congrats on your hard fought win! Hope you're on your feet soon!"}, {"id": "dssvyda", "author": "lizard-bacteria", "body": "Congrats!!!"}, {"id": "dssw2bt", "author": "jVestMan", "body": "Congrats!!"}, {"id": "dssw4ud", "author": "Suspiciously_Lumpy", "body": "Congrats man, looks like your finger is slowly turning into Superman as well. Keep it going!"}, {"id": "dsswa0v", "author": "joeypala", "body": "I’m so happy for you bro. In this day and age where cancer takes so many lives it’s nice to hear that someone finally has beat cancer. As the saying goes.. “ I can beat cancer” and you did!! "}, {"id": "dsswbxi", "author": "Pm__me__your_secrets", "body": "Nice job! No more red meat for you :)"}, {"id": "dssweja", "author": "oojahmeek", "body": "It’s a tough road but I’m glad you made it good luck friend"}, {"id": "dsswju1", "author": "Thedoctorjedi", "body": "As a fellow cancer survivor, rock on brother!"}, {"id": "dssx3sr", "author": "YourDailyDevil", "body": "Great job man! Must've been a hell of a fight. What're you gonna do now?"}, {"id": "dssx72l", "author": "gypsybacon", "body": "Way to go! Keep kicking ass. "}, {"id": "dssx9a0", "author": "TheNewMasterpiece", "body": "Be well my friend.  Fuck cancer. "}, {"id": "dssxipt", "author": "EepeesJ1", "body": "It’s a happy day for us too now! Way to go!"}, {"id": "dssxjpo", "author": "BamaFlava", "body": "happy for you man"}, {"id": "dssxl15", "author": "Fireblazz", "body": "Congratulations MAN! FUCK CANCER!!!! "}, {"id": "dssxl6u", "author": "blue_13", "body": "Congrats brother! That's so awesome! My mother in law is on hospice after being diagnosed with stage 4 colon cancer a year and a half ago. She doesn't have much longer now... but we've been trying to enjoy each day with her. But I'm glad to see someone beat it! "}, {"id": "dssxof7", "author": "deenali", "body": "Congratulations man! So happy for you - from a cancer survivor. "}, {"id": "dssxqqk", "author": "rdldr1", "body": "Take that, Roberto Colon! "}, {"id": "dssxt1e", "author": "Packiechu", "body": "Hell yeah!!!"}, {"id": "dssxyif", "author": "Undocumented_Sex", "body": "Anal sex and red meat are no joke, OP.  Slow the fuck down."}, {"id": "dssxypy", "author": "JennIsFit", "body": "That's so awesome. CANCER CAN GO FUCK OFF. "}, {"id": "dssxywb", "author": "rain-67", "body": ":) ... Happy day! You rock! Stay well. "}, {"id": "dssxz3o", "author": "Eobard_Wright", "body": "Congrats!"}, {"id": "dssxz6h", "author": "gypsydreams101", "body": "Mah man! Congrats dude, celebrate like a bitch in heat will ya? "}, {"id": "dssxzg0", "author": "FondsworthB", "body": "All the best mate. Love from Australia "}, {"id": "dssxzk5", "author": "yernamean", "body": "HELL YEA BUDDY"}, {"id": "dssxzkm", "author": "jugglingjellybeans", "body": "Fuck yeah! "}, {"id": "dssxzm6", "author": "mpypmyropys", "body": "Fuck yes, mate! Best wishes for the future!"}, {"id": "dssy5bq", "author": "bibblz", "body": "Are you ready for the rimjob of survival 🏆"}, {"id": "dssy6iy", "author": "daintycode", "body": "The first picture of how it really looks. No pretty-ass posed photo. I love it.🤘"}, {"id": "dssy7fm", "author": "HCagn", "body": "Top stuff! Congrats! How did u find out you had it in the first place? Also, how are u planning to celebrate?"}, {"id": "dssy8lh", "author": "lemon_jellos", "body": "Wow, dude. Rock on. Seriously. You’re a beast."}, {"id": "dssy996", "author": "MrMacAndCheese", "body": "Cancer can eat shit, Good Job"}, {"id": "dssycs3", "author": "KingKobra87", "body": "Good job man! Fuck cancer!"}, {"id": "dssyeh4", "author": "somenamestaken", "body": "Not a bad selfie."}, {"id": "dssyyoi", "author": "Mermaid_Mama323", "body": "I lost my best friend to colon cancer last year. She was only 34 and a mother of a six-year daughter. It is a very tough cancer to beat. I am so happy for you. You should join the Facebook group Colontown. It’s a fantastic support group with tons of great information. It is important to surround yourself with positive people who will support your new, healthy lifestyle. This post lifted my spirits. I wish you the very best of everything that life has in store for you. "}, {"id": "dssz13q", "author": "Sissylala", "body": "My mom is stage 4. I'm so happy to see that you've beat it. \n\nPlease go get a colonoscopy guys!!!"}, {"id": "dsszh3s", "author": "ithinkihax", "body": "Fuck yea dude!!"}, {"id": "dst06mz", "author": "Coolbeanz7", "body": "Also what helped you get through the worst days of this? Any advice for anyone who just learned they were diagnosed? "}, {"id": "dst0745", "author": "jousiemohn", "body": "Real glad to hear it! Love you buddy! "}, {"id": "dst09o6", "author": "Dkal_jadr11", "body": "FUCK CANCER! Congratulations, brother. \nStay healthy! "}, {"id": "dst0kay", "author": "sublmnalkrimnal", "body": "I feel ya mang, fellow cancer survivor and not a day goes by that I'm not thankful to see my son's face, I guess the wife too I like her a little haha, best of luck bother the fight continues so far after this, there will be somany people that you can help with just words of encouragement as someone who did it and they will ride your motivation into Thier own fight!\nhttps://imgur.com/a/kNE5J"}, {"id": "dst0n4c", "author": "LSDropper", "body": "I always read the first post on reddit before searching subreddits and this is the only outside the box picture ive commented on i just came to say congratulations man, fuck cancer. Live, for yourself, my papa and everyone else who lost their battle because you and I know damn well they fought hard and wish they could've been the champ you are congratulations man from the bottom of my heart "}, {"id": "dst11oz", "author": "mm2woodDOTmid", "body": "\"I lived bitch\""}, {"id": "dst13zy", "author": "shibby258", "body": "Fuck cancer hard! I hope it gets cancer!"}, {"id": "dst16e0", "author": "renaudyan", "body": "wish you the best. "}, {"id": "dst19vf", "author": "daewootech", "body": "My neighbor had that when I was just around graduating, he was a big strong muscle bound cool ass guy, all of a sudden he was this little twig out of nowhere and within a month or two he was gone, It was so crazy, so fast and unexpected, congrats on beating it, hopefully more will follow in your luck. "}, {"id": "dst1s5a", "author": "happuning", "body": "So happy for you! May you live long and cancer free. Breast cancer and I believe ovarian cancer run in my family. It ended up taking my great grandmother's life (she was too stubborn and hated doctors) after she survived it twice. My mom doesn't have the gene according to her tests, but there's always the chance it could happen. Your spirit made me smile and a little less afraid of either of those things happening. I'm also scared of catheters, lol. "}, {"id": "dst2uo0", "author": "RespectThyHood", "body": "Hell yeah, we're cancer warriors together (coming up on 2 years post chemo)! Congrats my dude, keep that shit up!"}, {"id": "dst35bd", "author": "megelysee", "body": "Congratulations to you! I know how it feels. I was diagnosed with stage 1 colon cancer late last year at 29 years old. It was such a big shock I didn't know how to process it at first. I'm extremely lucky we caught it early. It's been almost three months after the surgery and I am now back at work. God Bless!  "}, {"id": "dst59dc", "author": "LanceSmites", "body": "Suck it, Cancer!"}, {"id": "dst5tea", "author": "Teoretical", "body": "Do your body something good with a whole food plant based diet. Rich in antioxidants, vitamins, fibers and more. :)"}, {"id": "dst64xy", "author": "TurquoisePixel", "body": "Congrats!"}, {"id": "dst66df", "author": "tommytucho", "body": "Congratulations! FUCK CANCER & STAY STRONG"}, {"id": "dst67nf", "author": "demannu86", "body": "Congratulations !"}, {"id": "dst695s", "author": "63_Corvette", "body": "Good Job!\n\nI had and beat colon cancer in 2016.  Colostomy bag, chemo for 6 months and out of work for 6 weeks.  Colostomy was reversed and I'm totally cancer free now.  I feel great.\n\n**FUCK CANCER!**\n**GET A COLONOSCOPY if you are over 40!**"}, {"id": "dst69c9", "author": "WhereisNeilDiamond", "body": "I've never been so happy for a stranger in my life!! Go you!!! You did it! "}, {"id": "dst69j0", "author": "DarkValar28", "body": "I hope my godfather too.."}, {"id": "dst69lw", "author": "zzjjkk", "body": "I'm Happy for you. My mom of 46yo has stage 3 colon cancer. She had the surgery a month ago and is now ready for first round of chemo. I hope the surgery and chemo will fix this once and for all. "}, {"id": "dst69sx", "author": "Molassusboy", "body": "Hell yes man! Congratulations!!"}, {"id": "dst6aco", "author": "harleyfalcon", "body": "Hell yeah brother! God bless!  Encourage all to get their colonoscopies done every few years. I lost my maternal grandma to Colon Cancer, thus I’ve been getting myself checked since I was 26. Fuck the doctors telling me to wait until I’m 50 to get checked. I would have already died had I listened to them. "}, {"id": "dst6arh", "author": "_jhaysukun", "body": "fuck CANCER"}, {"id": "dst6auc", "author": "norman-cgn", "body": "Good news Bro. R E S P E C T !!!\n"}, {"id": "dst6bbk", "author": "wuddefuk", "body": "Oh man I’m happy for you! Fuck cancer! "}, {"id": "dst6bdw", "author": "yazid_ghanem", "body": "FUCK YEAH dude! Everyone's wishing you a healthy life, but I would like to wish you a healthy, *happy, and meaningful* life! Take care brother."}, {"id": "dst6bhx", "author": "Hiihtopipo", "body": "That bastard got my nana, you did us all a service"}, {"id": "dst6bpq", "author": "pariahdiocese", "body": "Congratulations man!! I lost my Ma to cancer and My friend just lost her brother in law to colon cancer. I hope you get well soon and live a long and happy life!  "}, {"id": "dst6bv4", "author": "colter108", "body": "Respect bro. Stay strong :) !!!"}, {"id": "dst6c6h", "author": "theluke112", "body": "Fuck yesss \\m/ "}, {"id": "dst6cu9", "author": "WilliamGerhartIII", "body": "Wow, unfortunate to hear you went through that. \n\nBut I'm glad you've persevered! I'm happy for you and wish you a healthy life.\n\nKeep on keepin' on brother (:"}, {"id": "dst6cwv", "author": "patrickhowland2", "body": "Congratulations! Also, does anyone think OP looks like Hugh Laurie?"}, {"id": "dst6dki", "author": "kylebutler775", "body": "You don't look that old, how did you know something was.wrong??"}, {"id": "dst6dls", "author": "iron233", "body": "Kick it’s arse!"}, {"id": "dst6ojc", "author": "braintumorwarrior", "body": "Grats due. Keep on trucking, and fuck cancer."}, {"id": "dst6pn9", "author": "GAZArts", "body": "Congratulations mans! outstanding. Here's to a full and happy life"}, {"id": "dst6pve", "author": "streaxy", "body": "yessss! this is great news "}, {"id": "dst6q40", "author": "ManicPudding", "body": "Congrats breh! "}, {"id": "dst6r3q", "author": "LifePotFarmer", "body": "All the best for your recovery! "}, {"id": "dst6rjv", "author": "okaris", "body": "I lost my grandpa, who was a father to me, to colon cancer. It gives me so much joy right now to see someone beat it. Hell yeah! \\m/"}, {"id": "dst6rl2", "author": "Elyrious", "body": "Congratulations man :) "}, {"id": "dst6rr3", "author": "enrikecido", "body": "congratulations!"}, {"id": "dst6sil", "author": "akahotpotato", "body": "FUCK YEAH, dude. Congrats!\n\nI lost a really awesome teacher from high school last year to colon cancer, so this stuff makes me smile. "}, {"id": "dst6snd", "author": "NebelTest", "body": "Legend!!"}, {"id": "dst6ss0", "author": "moneyp01", "body": "GOAT"}, {"id": "dst6svm", "author": "datsoar", "body": "Congrats dude. Fuck cancer. "}, {"id": "dst6w18", "author": "megabreakfast", "body": "I'm really happy for you! Same cancer took Joel just over 6 months ago - he was only in his early thirties. He was one of my best friends, my sister's partner and father of my nephew.\n\nI'm glad that while not everyone beats it, that some of you do! :)"}]}