{"id": "8f89zj", "title": "Damn. History was just made.", "url": "https://i.redd.it/syycygxj3du01.jpg", "subreddit": "pics", "author": "CrispCrisp", "text": "", "comments": [{"id": "dy1klcn", "author": "Bigballerbooks", "body": "Honestly my favorite Kpop duo. "}, {"id": "dy1jpi1", "author": "high_side", "body": "You have been granted a tourist visa to /r/pyongyang."}, {"id": "dy1ig3j", "author": "Pinkerdog", "body": "*\"Peace is a daily, a weekly, a monthly process, gradually changing opinions, slowly eroding old barriers, quietly building new structures.\"*\n\nSaid by JFK in September '63, but just as true today. It would really be something if this were the beginning of a lasting and spreading peace. To that end, I hope the best for the Koreas. And for everyone else. "}, {"id": "dy1lss4", "author": "FUCK_SNITCHES", "body": "Kim Jong Un's voice is super soft and pleasant, that surprised me for sure.\n\n[Meeting across the demarcation line](https://www.youtube.com/watch?v=fWs1MnegNDU)\n\n[Meeting with SK President Moon Jae-in in the morning](https://www.youtube.com/watch?v=HDVM5TnB7ag)\n\n[Taking a stroll after planting a tree together](https://www.youtube.com/watch?v=k7SqqBMCYL0)\n\n[Escorted by bodyguards jogging around his limo](https://www.youtube.com/watch?v=I33C9OnKZVc)\n\n[Speech outdoors](https://www.youtube.com/watch?v=rb2zmZyBVLk)\n\n[Meeting with spouses](https://www.youtube.com/watch?v=J_wDr8-cgxA)\n\n[Dinner and live performance](https://www.youtube.com/watch?v=tpsc3Bw57hU)\n\n[Speech indoors](https://www.youtube.com/watch?v=-822yVqymZM)\n\n[Watching a montage of the events](https://youtu.be/Gh12t1n6DZM?t=7m29s)\n\n\nIf anyone has English transcripts of these or videos with English subs please reply. I don't want the Arirang shit with the commentator and translator loudly talking over him.\n\nEdited for chronological order correct me if it's wrong\n"}, {"id": "dy1lyqk", "author": "Shift84", "body": "Golden state killer gets caught, Cosby gets found guilty, and North and South Korea are in peace talks.\n\nSome celestial being is tying up loose ends."}, {"id": "dy1g5cg", "author": "TooShiftyForYou", "body": "“Chairman Kim, for the first time in our history you crossed the military demarcation line,” Moon told told North Korean leader Kim Jong Un and North Korean delegation as they began talks. “The military demarcation line is no longer a symbol of division but a symbol of peace.”\n\n“I would like to pay tribute to the courageous and bold decision made by you chairman Kim to arrange our meeting,” he said.\n\n“Over the past seven decades we weren’t able to communicate, so I think we can talk the whole day today,\" Moon said, drawing laughs from Kim.\n\n[Source](https://www.cnn.com/asia/live-news/north-korea-south-korea-summit-intl/)"}, {"id": "dy1jika", "author": "dont_touch_my_food", "body": "Fuck this decade is weird "}, {"id": "dy1oexk", "author": "loveinjune", "body": "Korean here.  I actually teared up watching this live."}, {"id": "dy1luyl", "author": "OutoflurkintoLight", "body": "Whoa this timeline keeps going from stranger to weirder. I mean this is fantastic news but damn I never thought we’d ever see anything like this. "}, {"id": "dy1n6do", "author": "TheHubbleGuy", "body": "I’m sure the North Korean soldier who got shot 9 times escaping to South Korea is pissed he didn’t just wait a few more months. "}, {"id": "dy1reej", "author": "disisacrunksn", "body": "Kim Possible"}, {"id": "dy1gl9y", "author": "Sotsie", "body": "대박"}, {"id": "dy1irp0", "author": "chadwackerman", "body": "Now go watch some Shark Week together. "}, {"id": "dy1ich0", "author": "vinniefromschool", "body": "One of the examples we are closer to world peace than in the past few hundred years. Seriously, we are a long way from nuclear war. ^Knock ^^on ^^^wood."}, {"id": "dy1npqv", "author": "bak3rw00", "body": "His hair looks like a croissant."}, {"id": "dy1maj8", "author": "IzarkKiaTarj", "body": "On the one hand, I can't help thinking it's a trap.\n\nOn the other hand, the possibility that it might not be (even if only because of selfish reasons on Kim's part) makes this pretty damn cool."}, {"id": "dy1qijk", "author": "123hhh619", "body": "Kim is probably just doing what I do in civ 5 which is make peace so you can trade. Expect war again  in like 20 turns "}, {"id": "dy1nayv", "author": "futurologyisntscienc", "body": "In awe at the size of this lad. Absolute unit.\n\nEdit: Trump did nothing wrong MAGA."}, {"id": "dy1fozr", "author": "microtransgressor", "body": "He's a little heftier every time I see him"}, {"id": "dy1lnfn", "author": "antxmod", "body": "Someone save this pic before it gets deep fried and memed to oblivion"}, {"id": "dy1h0y2", "author": "Lethophobia", "body": "His people are starving...hence the meeting."}, {"id": "dy1kld6", "author": "Skooning", "body": "Isn’t that Dennis Rodman’s buddy? "}, {"id": "dy1na27", "author": "DVRK", "body": "Damn... Kim's smile looks more genuine than Mark Zuckerbergs...."}, {"id": "dy1j8in", "author": "Johnvonhein1", "body": "\nNot to be the skeptical asshole. But this is the same Kim who has concentration camps in his country, works people to death, tortured and killed tourists who tear down his posters, keeps internet access unavailable in his country, killed his Uncle, and probably his brother.\n\n\nYeah, it's a nice picture of two men shaking hands. But what really is going to change tomorrow?"}, {"id": "dy1mrtz", "author": "wtfever2k17", "body": "This had better not be the long con on the start of WWIII.  #fingerscrossed"}, {"id": "dy1q37l", "author": "the_deadcactus", "body": "All of Dennis Rodman's hard work has finally paid off."}, {"id": "dy1u4lx", "author": "coolsometimes", "body": "He's HONEYDICKING all of us just wait and see"}, {"id": "dy1mopo", "author": "slartibartjars", "body": "It was all highly koreagraphed."}, {"id": "dy1lrzu", "author": "HipHopGrandpa", "body": "Smiling is a sign of weakness in the animal kingdom.  -Dwight Shrute probably."}, {"id": "dy1m1na", "author": "Dizneymagic", "body": "I so want a picture of him visiting a mall or super market and being amazed like ~~Gorbachev~~ Yeltsin back in the day. But of course we have the internet and he knows full well how good the other side's got it."}, {"id": "dy1kvu3", "author": "SoyChemist", "body": "Perfect opportunity for a Seth Rogen photobomb\n"}]}