{"id": "8lfwjv", "title": "Found an old letter sent to my Mother who was struggling to make payments on my trumpet.", "url": "https://i.redd.it/pmmnq62lpiz01.jpg", "subreddit": "pics", "author": "jacques4801", "text": "", "comments": [{"id": "dzfh8tx", "author": "Boygirlwhatever", "body": "My dad died when I was eight and my mom couldn't afford my piano lessons anymore. My piano teacher then gave me free lessons all the way till I graduated from the Canadian Royal Conservatory of Music at 14. She was a renowned pianist and easily charged a lot for lessons but she kept helping us out. It was a huge contribution to my life and I never forgot it. "}, {"id": "dzfck36", "author": "Vhexer", "body": "*\"Tough times never last, tough people do.\"* - James W. Jones\n\nEdit: - Robert Schuller*"}, {"id": "dzfdjzk", "author": "vorpib", "body": "Wow, I live 5 minutes from this place, maybe I’ll drop off some donuts tomorrow \n\n\nUpdates \nOn my way https://imgur.com/j6b5njR\n\nDonut king\nhttp://imgur.com/hLQWEDZ\n\nDonuts\nhttp://imgur.com/8Pr1627\n\n Not open yet\nhttp://imgur.com/8h3AOra\n\nDelivery made\nhttp://imgur.com/xgQNeOM\n\nThe man himself\nhttp://imgur.com/6jIbnlA\n\nSo here we go, what an amazing guy, super humble and sweet, I don’t think hunk he likes all of the attention and he made the point that he didn’t do this for the publicity at all.\n\nTheir phone has not stopped ringing since I was in there, they are truly overwhelmed.\n\nI don’t think the business is doing that well, who’s interested in starting a fund for them? \n\n\nEdit:\nWe did it Reddit, we're famous!\n\nhttps://www.mnn.com/lifestyle/responsible-living/stories/music-store-owner-good-deed-internet-returns-favor\n\n\nLet's do some more good and buy some instruments and donate them to those in need\n\nGoFundMe link removed\n\n"}, {"id": "dzf9ctj", "author": "justshtmypnts", "body": "It’s the small things that make a world of difference. "}, {"id": "dzfqm4w", "author": "dashriprock777", "body": "This is my father-in-law, guys!  He is every bit as kind and selfless as this letter makes him out to be!  \n\nIf you all are serious about giving, I could set something up.  I’m not sure what would be most appropriate, so I would be open to suggestions.  (I also realize that I would have to prove that I am his son-in-law.)\n\nI can also confirm that the store is changing locations this summer (same plaza, different storefront).  So, the address will change slightly.  I look forward to hearing from you all!\n\n"}, {"id": "dzfb91e", "author": "urbanek2525", "body": "“You can easily judge the character of a man by how he treats those who can do nothing for him.”—Malcolm S. Forbes.\n\nDrink a toast to a man of fine character: James W. Jones of Casselberry, Florida."}, {"id": "dzfd1pi", "author": "ayriana", "body": "When I was in the eighth grade my band teacher called my mom and told her that I was talented, and that if I wanted to continue to play, my current instrument would hold me back. At the time, I played my dad's trumpet, and it was 30 years old. That Christmas/birthday/the next Christmas my gift was my trumpet. I had to agree to play all the way through high school, and it was difficult for my parents to afford it- I believe it cost about $700-800. It cost enough that we timed the purchase for the same time we were going to a neighboring state that had no sales tax just to save the hundred bucks. I still remember the rain in the parking lot as I walked to the car, clutching the blue case to my chest. It was the most expensive thing I owned, or would own for a long time.\n\nBand got me up in the morning, it made it so I went to school even when other kids sucked. It gave me something to work for, it gave me camaraderie and made me depend on others as others depended on me. It gave me pride, and showed me the correlation between hard work and reward. It kept me in college when I may have otherwise chickened out, given up and gone home. There is no rush like running onto a field with 30k people screaming in the stands, and music was the only thing that would ever give me that feeling.\n\nI'm 33 now, and I don't play that much anymore- but that trumpet, a music stand and a book of exercises still sits next to my desk. I hope to allow my son to play it someday. The trumpet, band, music in general changed my life, it made me a better person and it made me who I am today. I'm getting choked up writing this, so I'll just say, this gift is powerful for someone like me, and something small really can change lives."}, {"id": "dzfd9cn", "author": "audguy", "body": "Holy shit I got my trumpet from them too!  Hello fellow Casselberrian!"}, {"id": "dzf9ewo", "author": "cynikalAhole99", "body": "you still play it? professionally??"}, {"id": "dzfel7k", "author": "WiseMagpie", "body": "To the angry people on this thread - it went from \"what a kind act\" to \"OP should give the trumpet back because he's not a professional trumpet player\" really fast. \n\nI just checked out OP's profile and the guy is 21 years old. If trumpets are as expensive as y'all say - I sure as hell could NOT afford to \"pay it forward\" by buying a brand new one for anyone at age 21.\n\nIt took me literally 30 seconds to click on a post he wrote mentioning his age - giving me context I needed before I judged him. Maybe y'all need to take a second and step back from being keyboard warriors and look for a little information before deciding what kind of person someone is. \n\nFirst ever reddit gold- thank you kind stranger. :) I'm glad it was this comment that earned me a gold. "}, {"id": "dzflrlz", "author": "ArcadianDelSol", "body": "I have played and collected trumpets all my life. I currently have 9 of them that are in great working condition. Most of them I acquired at yard sales for less than $40 USD.\n\nSeeing that this company is still in business, I have contacted them and asked how I might donate all 9 of my horns for the specific purpose of having them placed into the hands of students who want to learn, but who cannot afford their own.\n\nWhile I do not know the status of James W. Jones, it is my hope that this spirit of paying forward remains a foundational core with Allegro Music Company.\n\nThank you OP for sharing, and for reminding me that a garage full of instruments that nobody plays is just a waste.\n\nAnd who knows - maybe we can get more redditors to do the same. Maybe we can so inundate this company with old horns long neglected, that we might start something really great."}, {"id": "dzfa514", "author": "OtterApocalypse", "body": "I'm kind of curious why this post has the **US Politcs** flair. I assume because it has the word trumpet in the title, but even that seems pretty damn ridiculous."}, {"id": "dzfd3ku", "author": "azikrogar", "body": "As a band director, if you have ANY instruments laying around not being used, please contact your local band and see if they'll accept your donation.  We often times have to turn away kids and it's heart breaking.  We are the one class that many of these kids ACTUALLY enjoy in school and many can't even take it due to the barrier of entry."}, {"id": "dzfcqui", "author": "RemedialChaosTheory", "body": "Very cool. I like to do something similar. I've been playing guitar for decades and have more instruments than I need. Whenever I hear a friend / coworker say \"I've always wanted to play guitar...\" I say \"here you go\" and let them have one. \"Give it back when you don't play it anymore and lessons are free\". \n\nI think at this point my conversion rate is 100% with most people buying their own instrument within a year!\n\nEdit: gold? Thank you internet stranger !"}, {"id": "dzfievw", "author": "Walkalope", "body": "This may get buried... but I was recently going through some old stuff from when I was a little kid. I found a homemade birthday card from my mom (single mom, only child). It was like old school early 90s clipart she made for me on the computer. On the inside it looked like a certificate. She colored the whole thing in with crayons. It probably took her a long time to make in those early days of computer art. The certificate said it was good for \"$20 at Toys R Us this Saturday.\"\n\nWhen I found this, my mom explained to me that my birthday fell just before that month's pay day that year and she did not have any money to buy me a present... so she made me the card and we went to Toys R Us after her pay day and I had no idea anything was amiss.\n\nThanks to all the Moms/parents/trumpet salesmen who kept a kid's childhood beautiful even when the world wasn't."}, {"id": "dzf9kmj", "author": "ZigNet", "body": "This why I practiced clarinet fir 6 to 8 hours a day every day while in school and wanted to go to college for music future (which never happened thanks to life sucking) never put down the instrument it's a good way for expressing feelings "}, {"id": "dzfduyf", "author": "ddrodriguez00", "body": "Applause to your mom because even though she was struggling, she still wanted to give you the gift of music and standing ovation to this generous man for not trying to repo a student trumpet."}, {"id": "dzfawkg", "author": "FriesWithThat", "body": "Looks like they're still around, and online:\n\n~~https://www.allegromusiccenter.com/~~\n\n\\* http://www.allegromusiccentre.com/new/ \n\n\\* Florida is full of Allegro's, apparently.\n\nSo at least OP hanging onto that charitable Trumpet all those years didn't sink them."}, {"id": "dzf9wni", "author": "Demderdemden", "body": "Jaques' Trumpet sounds like some indie band or a hipster \"gastropub\" "}, {"id": "dzfi9l4", "author": "morgueanna", "body": "I grew up in 'the ghetto.'  My elementary school looked more like a prison than a school. \n\nIn the 4th grade, the city gave the schools a pittance to start music programs to try and reinvigorate learning. Each student had to pick an instrument to play for a semester and I chose violin.\n\nI honestly don't know how much it was to rent the instrument- the first semester was free because it was part of the required curriculum, but after that if we wanted to continue we had to pay. But I found out after a few months through a slip made by my conductor that he was covering the rental for mine, as well as other students.\n\nI played for 3 years at that school, until I went to junior high. That school didn't have a music program and my mom definitely couldn't afford private lessons, so I fell out of playing. But I'll always remember the generosity of our conductor and how he inspired children to listen to, learn, and love classical music.\n"}, {"id": "dzff2yd", "author": "ThatGeek303", "body": "When I was in sixth grade I was in band and I had chosen to play the clarinet which just happened to be the instrument my teacher used as well. A few months into school my teacher set up an after school program for the band kids who wanted extra practice. It had to be paid for, though, but it wasn't much. It was, however, too much for my mother to afford at the time (times were tough back then and they still are on occasion). My teacher knew I enjoyed playing, though, so he offered to pay for me and I  got go to the program!\n\nI know he'll never see this, but Mr. Ross, you're awesome!"}, {"id": "dzf9u8x", "author": "Ol0O01100lO1O1O1", "body": "I hope if you have the ability OP you will pay it forward, and that you sharing this wonderful letter will encourage others to do the same. "}, {"id": "dzfdwi9", "author": "shadowshea", "body": "This made me cry. My mom was a single mother of two and struggled HARD. But my brother and I never truly knew how hard, she always made sure we had everything we needed and always put us first.\n\nShe took a part time job at a daycare that she would do in the mornings before going to her waitress job, so my brother could go there and she got a discount. Her car broke down once, and she was in no place to get it fixed, but was fucked without a car. My grandma lived in a different state at the time, we had no other family to help, and without a car, she couldn't get to work. The director of the daycare let her borrow the daycare van for a week while she saved up to fix her car. I remember her crying on the way home and thought what's she crying for? She can use the van!\n\nMs. Gail was a godsend. She was the director of the daycare and had been in an abusive marriage, and when it ended, she was left with almost nothing and two boys to raise. I found out many years later that she was the neighbor of my best friends parents, and my bffs dad helped her with yard work and such a lot. She was a super nice woman, and eventually met and married a wonderful man, who happened to be a very well off surgeon. She got to put her boys through college, retire early, and go on beach vacations with her husband all the time. If anyone deserved it, it was her. My best friend had to move back home with her folks after a bad marriage and was struggling hard to raise her son. She had a ton of student loan debt, but worked really hard and was making a dent in it. Ms. Gail found out about her situation, and sent her a check for $500 to put towards her loans, so she could afford to start saving up for her own place. That woman helped my mom out so many times. I'm so glad she got a happy ending."}, {"id": "dzfd7w3", "author": "Wallywutsizface", "body": "My fellow trumpet player in band who taught me to play killed himself this weekend.\nI know this is kind of irrelevant, but this reminded me of him.\nEdit: Thanks to everyone making me feel better. It makes more of a difference than you realize."}, {"id": "dzfan85", "author": "cocobandicoot", "body": "Maybe I'm just a baby, but damn this caused tears to well up."}, {"id": "dzfd7ze", "author": "FetusChrist", "body": "I have a feeling that this shop is about to come into some money. I can spare ten bucks but I'm kinda hoping it doesn't go to some big blowout xyz highschool band gets all their instruments paid for but instead goes to a fund that let's this Mr Jones donate instruments at his discretion."}, {"id": "dzfd9a3", "author": "BruteandTheBasilisk", "body": "I've worked in music retail for 7 years. It's one thing to repo a car but watching a child's heart break because their parents can't afford an instrument is one of the hardest things to see."}, {"id": "dzfdt6f", "author": "Totally_a_Banana", "body": "\"Tough times never last. But tough people do\"\n\n-James W. Jones\n\n... wow... I have shivers from reading that. It's exactly what I needed to hear right now."}, {"id": "dzfbo8r", "author": "iEbutters", "body": "James W. Jones the real MVP"}, {"id": "dzfdkjq", "author": "gettheplow", "body": "Place is still in business. But that shouldn't be surprising, as they clearly know how to be good people first.  \n\nhttp://www.allegromusiccentre.com/new/\n\n"}, {"id": "dzfd5xj", "author": "IrishRepoMan", "body": "Bunch of people claiming OP wasn't supposed to keep it. Even saw someone claim it was an ethical issue. Leave it to Reddit to try and shit all over a nice story."}, {"id": "dzfcozy", "author": "horror_unfolds", "body": "Man, some sad stuff comes up when you google mom’s name. Are you okay, OP?"}, {"id": "dzfb166", "author": "Ella_Lynn", "body": "This is exactly how when I was in School. I would pay rent to Use the instrument. If you kept paying until it was payed off, you could keep it. And, If you don't play it anymore, return it. So someone else can use it. The place where I would rent from cleaned up and disinfected the instrument for the next student to use."}, {"id": "dzfdunk", "author": "captainvaughn", "body": "Why am i crying in the Arby’s bathroom rn"}, {"id": "dzfbap4", "author": "AlbinoWino11", "body": "So much junk on the internet and so much disheartening crap on Reddit.  So, OP, thanks for sharing this uplifting story to balance it all out.  Did you thank that guy?"}, {"id": "dzfcx44", "author": "willingram123", "body": "My family has never really had a lot of\nMoney and I was in the band from 6th grade until I graduated high school in 2015. A few weeks ago I was cleaning out the garage with my grandpa and found my old snare drum that was still in great condition. Remembering how hard it was for us to pay for it, I gathered everything I could and drove down to the school and met with my old band director. I asked him if he could give it to a kid that otherwise wouldn’t be able to participate due to financial issues that were out of their control. I didn’t realize it at the time, but the amount of effort my single mother put in to make sure we could be included in what we wanted to do is truly amazing. I hope whichever kid receives that drum is able to follow his passion now and not worry about having to pay for an expensive instrument. "}, {"id": "dzfg5dv", "author": "Jonnasgirl", "body": "I just worked a shit-ton of overtime to send my kiddo to 'orchestra camp'. I know that she isn't some genius cello player... But every time I hear her torturing that poor cello like a pathetic cat, and she gets all excited to play her 'newest piece'... Well, it makes it all worth while, because she absolutely lights up, and I hope that she does better than me in life. That's all I want... Good for your momma and an understanding instrument rental guy..."}, {"id": "dzffzfa", "author": "ozman123", "body": "So it all ended on a good note?"}, {"id": "dzfcj6j", "author": "Joliet_Jake_Blues", "body": "Reddit spends money on a lot of stupid crap. We should do that with this shop.\n\nMake karma real. They did a good thing and sacrificed a couple hundred dollars, we can send back thousands. \n\nI'm good for $5 if someone finds this music shop and sets up a fund. "}, {"id": "dzfh6ob", "author": "asudan30", "body": "That's pretty cool. When I was young my parents rented a Trombone for me and an Alto Sax for my sister. They didn't realize that it was a \"rent to own\" situation but that they had to sign some paperwork after the payments were satisfied to own the instruments. Instead, they kept paying the monthly rent for almost a year longer than necessary. When my dad went to the store to ask how many more payments he owned they said: \"good news, you now own the instruments and here is a refund for your overpayment\". As a family with little money at the time, this was a huge windfall for my parents. (I estimate it was around $1000) and it was pretty cool of the instrument shop to do that. "}, {"id": "dzf9abp", "author": "QualityCucumber", "body": "Everything's political nowadays. Seriously though, that's wholesome AF"}, {"id": "dzfd7fi", "author": "squeejie09", "body": "r/humansbeingbros"}, {"id": "dzff0tj", "author": "alexa-488", "body": "My sister's music teacher gave me a flute that he had inherited from his uncle when I was in middle school. I played in band throughout high school and then too it to Germany when I went on a study abroad and played in two different bands/orchestras and used it to make a lot of friends. When I was a freshman in college the local music store in my hometown had a going out of business sale so I was able to buy my own, much better, flute at a real bargain price. When I returned the flute to it's original owner, he was momentarily upset and distraught because he thought I had given up playing. I explained that I'd gotten a new one, which brightened his day considerably. I think it was then donated to the school district when I was done with it. "}, {"id": "dzfleqt", "author": "TacoReyven", "body": "I remember vividly lieing to my mom about fairing my tryouts for band in middleschool because of the cost ... My director went behind my back and called my mom and told her how I was talented and how I wanted this . I cried for years after thinking about how much she spent on my sax and at the time how we 100% could not afford it . \n\nI threw myself into band and music I stayed extra after school when just to play and study took an extra class every summer just to play. In hs students in gifted could test out year 2 and start taking college courses and not come to school  just go to the college  campus .I did just that but scheduled every everything at night and took a whole 2 years of nothing but music classes in the morning at school for no extra credits . \nMusic saved my life and in the darkest times of my depression kept me grounded to each and away from the suicidal thoughts . I made all State jazz and Got a scholarship to college (partial) on this thing instument I never wanted to force my mom to pay . A few years ago I went through some bad times and to save my self I sold the sax . I lay awake at night sometimes and wonder if it was worth it .\n\nTLDR; this post hit me harder than I thought it would "}, {"id": "dzi8sly", "author": "phageinyoass", "body": "well now im crying a bit"}, {"id": "dzfc5u4", "author": "hashtag_lives_matter", "body": "2009 is considered \"old\" now?  Ugh."}, {"id": "dzfdoss", "author": "hugitoutguys", "body": "When I was in elementary I played the cello in orchestra. One day I leaned it against my moms car after school and forgot. She backed over it. It was super damaged. Needless to say she was furious and I was in deep shit. There were four of us kids and my mom and dad were super pissed they would have to pay for a cello (it was rented). The people at the cello place took me aside and said they would replace the cello and not charge us as long as I didn’t quit. It meant a lot to me because my mom took the heat off me and I’m sure it meant a lot to my mom, as she didn’t have to buy a new instrument. "}, {"id": "dzfj46g", "author": "pipedreamer79", "body": "Band director here, bassoonist since 1991. \n\nThis letter hits home harder than I realized.\n\nI had the great fortune of knowing an amazing teacher who gave me free lessons every week from 8th grade, all the way through my senior year of college. He opened so many doors for me. He sold me $100 reed knives for a penny. He made me a fucking $3000 reed making machine.  He’s the one that made me want to be a music teacher so I could try to help others have a life the way he did for me. \n\nMusicians are generally such kind, generous people. So glad to see something like this, with small town music stores helping the people that need it."}, {"id": "dzfdw7q", "author": "damprock", "body": "I’m a college trumpet player in music school. If it weren’t for people like this I wouldn’t be where I am today. Pay it forward, people. Even if someone doesn’t pursue music, a little bit of kindness in this dark world means so much at a time of weakness. "}, {"id": "dzfe8kj", "author": "hongkonghuey", "body": "If James W. Jones is still president and Founder of Allegro Music Center it might be a good idea to send some business his way. Seems like a great guy that deserves more business."}, {"id": "dzfjbo4", "author": "Escafablio", "body": "Whoa! It's a small world... I rented my first flute from Allegro when I was in 7th grade. My parents were also struggling to make the payments, and asked if they could slightly reduce the monthly payment. They did not hesitate, and I was able to keep the flute, and they only payed $15 or $19 a month or so. This was around 2007. Big, big hearts at this shop. Very cool."}, {"id": "dzfa86q", "author": "PythonKicksAss", "body": "Have you paid it forward?\n\n>OP's Trumpet Charity"}, {"id": "dzfdwgt", "author": "fuzzydimpelz", "body": "\"Tough times never last, \nTough people do.\"\n\nShook "}, {"id": "dzfioss", "author": "GlamourTits", "body": "That is so damn cool. Something similar to this recently happened to my sister. \n\nShe and her husband decided they wanted her to be home with their baby when she was born, so she quit her job half way into the pregnancy (due to daily migraines). \n\nWell, 3 months after their baby was born, he abandoned them overnight for his boss’s wife and left them with absolutely nothing and nowhere to go. He signed away his rights to their newborn so that he wouldn’t have to pay child support. She truly was left with nothing but hospital bills. He paid $2200 before he left, but she still owed about $6K. She contacted the hospital billing and let them know her situation hoping that they would work with her. Just a few weeks ago, she received a letter in the mail from them stating that her bill had been waived, and that her balance was zeroed out. \n\nTHEN, just last week she got another piece of mail from them. She opened it up, and it was, very unexpectedly, a $2200 reimbursement in her name. \n\nA true story of kindness and karma. I’ll never forget it. "}, {"id": "dzfde18", "author": "Trampmadic", "body": "Oh man, I used to live down Red Bug! The people there were always really nice! "}, {"id": "dzfdko6", "author": "cogitoesum2", "body": "At first glance, I hought the author of the letter was affectionately referring to the trumpet as Jacques. As in, \"it's okay ma'am, you can keep Jacques \nTrumpet\"."}, {"id": "dzffhkg", "author": "inohsinhsin", "body": "Wow. When I first to came to the States I saw a piano performance for the first time and I cried at how beautiful the sound it produced. Hearing this, my mom suggested that I take lessons, but we barely had money for rent let alone lessons, so I said no I didn't care for the piano knowing she'd have to work more than the 80 hours or so she already did.\n\nFuck, I need to go call my mom."}, {"id": "dzfgvx1", "author": "Invince23", "body": "I used to receive private violin lessons back in high school. I was good enough to be in our school's top orchestra which was one of the best in the nation for public school, but I couldn't afford to pay the lessons. I was prepared to let Mr. David Dye know that I would have to drop out because of it. \nFrom that day on I started to believe in miracles because he decided to pay the rest of my private lesson tuition until I was able to get a job during the summer to pay it off! \n\nIt's the small things that really make a difference in a 14 year old boy"}, {"id": "dzfh8by", "author": "Kyleclaarrk20", "body": "I’m drunk and never do this but I’m straight handing out upvotes for days "}, {"id": "dzfiv6k", "author": "freddybear72", "body": "I love it. Unfortunately when I was 12 and learning to play piano they came an repossessed the ours. Turns out my divorcing parents weren't so good at payments. That seriously sucked. I'm 45 now and still hate how that felt. Glad that didn't happen to you. Think I might buy a keyboard and take some lessons. Take that stupid Schmidt music!"}, {"id": "dzfj4az", "author": "lilcapt", "body": "20 points to hufflepuff"}, {"id": "dzfo322", "author": "gambitx007", "body": "I remember in like 2001 around 9/11ish I was in high school looking online for a better mouthpiece for my saxophone. This was because the saxophone message boards all said that it would improve my tone. Some dude asked me what my address was and that he had a selmer c star mouthpiece for an alto sax. I was very skeptical and asked my parents if it was ok to give our home address for a mouth piece from a stranger for free. \n\nReceived it a week later and made it into the jazz band that Same year. \n\nMusicians look out for each other. \nSadly I don’t play anymore but if I ever see a kid in my neighborhood that needs something like that I’ll do what I can to help them. "}, {"id": "dzfdh6j", "author": "BeelzeBuff", "body": "Everyone says \"Pick up the instrument you stopped playing, it's always worth it to go back!\"\n\nI played bassoon.... A decent bassoon would cost 1/2 as much as my car. "}, {"id": "dzfdnja", "author": "xiguy1", "body": "This was a real kindness. No matter what brand it is, a trumpet isn’t cheap. But there are 2 heroes in this story; the person who gave you the trumpet and your mom for doing her best to get you one. I think that she wanted you to have that opportunity even if it was hard for her. \n\nI write this as I remember struggling to pay for my kids musical instruments (and most everything else) and the rental folks weren’t nearly as forgiving or understanding when I couldn’t come up with the money. Somehow things worked out. A parents love is a huge force for good :-)"}, {"id": "dzfdvn9", "author": "Nuclearman83", "body": "Owner is still around and still a great guy.\n\nhttp://www.allegromusiccentre.com/new/index.php/about-allegro\n"}, {"id": "dzfgi5s", "author": "jwhites", "body": "lets give Allegro Music Center a good review on google. they deserve it :\\)"}, {"id": "dzfncxj", "author": "talliepie", "body": "To think, nearly a decade later, this letter was seen by over 100,000 people, and I can't speak for the rest of you, but at least one of us was moved to tears by such a simple act of generosity."}, {"id": "dzgj2ia", "author": "EverydayGravitas", "body": "The website site [replied](http://www.allegromusiccentre.com/new/) to the Reddit hug they've been receiving :)\n\n> Thank you!\n\n>Hello Everyone! I just wanted to take a quick moment to say thanks for the heart warming outpouring response to a letter written in 2009 that find its way to Reddit recently. We have been overwhelmed with the positive response, it has been so encouraging and uplifting. You may have noticed our site went down early this morning from the mass response, but we have fixed that and will continue to try and keep up with that. We love hearing from you and your own stories that this letter has reminded you of. One thing that we have always wanted to do is have a rental scholarship fund, where we could help more students access music education by either providing a free months rent or a full school year rental based on need. This is something we will be setting up in the coming days' so stay tuned! In the meantime, one of the most impactful things you can do is to visit your local music store, purchase an instrument and donate it to your local youth orochestra or a local band program. Again, we thank you for your awesome response and we look forward to serving our local communities with music education for years to come."}, {"id": "dzgrcli", "author": "reachouttouchFate", "body": "repost, as I was asked to put this as a direct reply to OP. This was from a call I placed shortly after the store opened this morning:\n\n> **update!**\n\n> I just got off the phone with their office. I didn't get to speak to Jim but another person there because she said he's been tied up on the phones since opening.\n\n> She confirmed the Miami store is a different store.\n\n> She also said they saw the OP and would prefer in lieu of monetary donations that people please consider turning their efforts to assisting their local high school band departments so that other kids who are less disadvantaged could be able to play instruments, as well.\n\n> I also apologized for overloading their bandwidth but noted we tend to be a good bunch and didn't intentionally mean to do that.\n\n> We ended with her saying the store appreciates us for trying to be of help.\n"}, {"id": "dzfcebg", "author": "glimmeringsea", "body": "Was your \"mom\" [an accessory to murder?](http://westorlandonews.com/woman-arrested-in-connection-with-ocoee-teen-murder/)"}]}