{"id": "8xqg68", "title": "The four Thai Navy Seals (one medic) that stayed IN the cave with the boys since they were discovered. They monitored their health and prepped them for their dangerous escape were the last to emerge after the 13 originals.", "url": "https://imgur.com/lLXBd8m", "subreddit": "pics", "author": "iDontLikeYouAnyway", "text": "", "comments": [{"id": "e24up2n", "author": "StepYaGameUp", "body": "Appropriate picture.  Sunglasses and masks.\n\nGood work, boys."}, {"id": "e24v7ry", "author": "TooShiftyForYou", "body": "*“We are not sure if this is a miracle, a science or what”, the Seals said on their Facebook page.*\n\nGreat ending to an incredible rescue mission."}, {"id": "e24uuzm", "author": "hiero_", "body": "Hope none of these dudes, including the kids, get cave disease or long term eye damage.\n\nGlad everyone came out alive though. These dudes are actual heroes."}, {"id": "e256j9i", "author": "322Uchiha", "body": "Let's not forget the SEAL volunteer who died during the rescue mission. All of them are heroes. "}, {"id": "e24yblr", "author": "OrmDraebogPlundra", "body": "These guys are the stuff they make movies of"}, {"id": "e24tjah", "author": "teeohdeedee123", "body": "In awe at the heroism of these lads"}, {"id": "e254l3o", "author": "dunnowins", "body": "This kind of heroism is really hard to comprehend. My life is so cushy and comfortable I cant even begin to imagine making the *choice* to stay in a cave like that to help others. Any amount of praise for the whole rescue team wont be enough."}, {"id": "e25004k", "author": "iDontLikeYouAnyway", "body": "A part of me feels like this will inspire many youths to wanna join the Navy Seal."}, {"id": "e24wx5p", "author": "gjbbb", "body": "Looks like Leonardo da Vinci, and Michelangelo standing with Raphael and Donatello."}, {"id": "e255rrl", "author": "I-LOVE-LIMES", "body": "This whole story has been making me think about my life choices.. it is inspiring me to start doing something meaningful rather than sitting on my rear making tons of money for thankless people that already have tons of money who only worry about how much money they have.  And after which I go home and rinse and repeat this process for 5 days 10-12 hrs a day. And at what cost? I'm depressed as fuck and my life is devoid of any meaning. Might as well try to be of help to others that truly need it.\n\nEdit: Just to clarify - I am not the one making the big money. It's the company and the clients.  "}, {"id": "e24zv8p", "author": "brojangles", "body": "Four guys that will never have to pay for their own drinks ever again."}, {"id": "e25700x", "author": "miraculum_one", "body": "Let us not forget the diver who died during the mission."}, {"id": "e2516uo", "author": "rafaelesco", "body": "when is the album coming out? "}, {"id": "e25a849", "author": "iDontLikeYouAnyway", "body": "For clarification, these are the four that stayed with the boys in the cave... there are another 18, Thai and International divers that assisted with bringing out the boys one at a time...two divers per boy. They estimate that round trip is roughly 11 hours.... imagine that. "}, {"id": "e24uzv5", "author": "Lextios", "body": "Sunglasses in a cave\n +60% cooler\n -30% vision\n "}, {"id": "e250hnr", "author": "LynxJesus", "body": "And these 4 now have a permanent profile picture; it's so badass, and I love the symmetry between them (hand placement)"}, {"id": "e259bvr", "author": "Mattyweaves19", "body": "\"After you risked your life to save the team, spent hours with them in the cave, and then emerged after everyone was safe, did you say or do anything cool?\"\n\n\"I gave a thumbs up and didn't show my face, then peaced out because I had other shit to do.\"\n\n\"That's so badass.\" "}, {"id": "e24xme3", "author": "ihateslowdrivers", "body": "Those 4 will forever be a band of brothers"}, {"id": "e24z0q1", "author": "flampadoodle", "body": "What are the medical masks for?\n"}, {"id": "e24xusn", "author": "AntiDbag", "body": "Fake news. How did they get into the cave in the first place with ball sacks that large?"}, {"id": "e24wtu0", "author": "sglville", "body": "True badasses"}, {"id": "e24wz6x", "author": "kushnsammy", "body": "Was that one dude actually cave diving in a horse collar? The other 3 look like they are wearing mexican-style sidemount rigs."}, {"id": "e24x1v3", "author": "beendoingit7", "body": "Fucking LEGENDS! Navy seals really are superhumans. If you don’t know about the brutal training/testing they go through you should check it out. These guys don’t fuck around. "}, {"id": "e253013", "author": "GeekofFury", "body": "Wait wait wait. They got all the kids out?"}, {"id": "e256jc5", "author": "arcticrobin", "body": "My thoughts are with the family of one Navy lost in action. May his soul Rest in Peace knowing he gave up his life so that others may live. I will remember you...🌹🇹🇭💝"}, {"id": "e25akb5", "author": "I_love_albert_ellis", "body": "Why can’t the world work together like this all the time?"}, {"id": "e2518yd", "author": "KateKathrine", "body": "Thank you, and our condolences for the loss of your friend."}, {"id": "e251e25", "author": "Nate224", "body": "Infinite up votes for these guys! 👏🏻"}, {"id": "e254328", "author": "SongsNotSung", "body": "These four are real-life guardian angels."}, {"id": "e25mjle", "author": "ElGrandeQues0", "body": "I've never been more proud of Thailand and the humanity. The response to this tragedy is nothing short of amazing.\n\nRest in peace Saman Gunan, your sacrifice gave these boys a second chance at life."}, {"id": "e252l6k", "author": "myslead", "body": "which one will The Rock play in the movie?"}, {"id": "e256j6j", "author": "EpikSwag", "body": "Are they literally called \"Thai Navy Seals\"? Or are they just Thailand's equivalent?"}, {"id": "e2544xd", "author": "treble-n-bass", "body": "True heroes. These guys need more recognition."}, {"id": "e257nns", "author": "ElectricalShoe", "body": "All kids and the coach are saved! A great news!"}, {"id": "e25qmbf", "author": "WheresMySpycamera", "body": "These motherfuckers right here. I am soo fucking PROUD that there are these kinds of heros and this kind of humanity left in the fucking world. "}, {"id": "e28mzf4", "author": "99999polertpo", "body": "If any of them EVER pays for a drink again I'm gonna slap somebody. Goldarmmed heroes right there, the lot."}, {"id": "e25326j", "author": "JDub8", "body": "I'm pretty sure the 3rd from the left is Obama"}, {"id": "e259nzc", "author": "JackBurtonPorkChop", "body": "Good news. Mark Whalberg has already written the screenplay starring himself as all four SEALs in one composite character named Tommy Sullivan. "}, {"id": "e25be2y", "author": "frostygraybob", "body": "That third one looks like obama"}, {"id": "e2f78lm", "author": "wellthatwasuglee", "body": "Not to be rude, but instead of giving someone on Reddit gold why not donate it to the victims families?"}, {"id": "e24zj1s", "author": "I_am_Noobish", "body": "Obama, is that you?"}]}