{"id": "979ywc", "title": "A bird flew in my window, sh*t on my laptop, and decided to die right in front of me. How's your day going?", "url": "https://i.imgur.com/tKRvqaf.jpg", "subreddit": "pics", "author": "JaMollyAdams", "text": "", "comments": [{"id": "e46s2tc", "author": "DooDooBrownz", "body": "they say it's good luck when a bird shits on you, but bad luck when it dies in your house. pretty sure you're even stevens in this case."}, {"id": "e46jyve", "author": "HypoAllergenicJin", "body": "Does this make you an official Disney Villian?"}, {"id": "e46l1qk", "author": "SlothOfDoom", "body": "I see you got my message."}, {"id": "e46m0vj", "author": "Tacothechihuahua", "body": "Sounds like you’re having a better day than the bird. "}, {"id": "e46l1qf", "author": "ralechner", "body": "Beautiful plumage, the Norwegian Blue..."}, {"id": "e46l6zc", "author": "geoking99", "body": "hide, dont leave your house, dont answer the door or phone, be like a person shaped hole in the universe"}, {"id": "e46k3z7", "author": "Mdk1191", "body": "Ah the new twitter notifications. "}, {"id": "e46k66h", "author": "dontkwit", "body": "I mean there’s days I wanna shit on my keyboard and die. This bird had the balls to do it. "}, {"id": "e46r3bx", "author": "PhilipLiptonSchrute", "body": "[Serious] Call animal control. Usually if a bird just up and dies like that, it's carrying some form of disease. Let them test it. "}, {"id": "e46k20n", "author": "Beckels84", "body": "That's a bad omen."}, {"id": "e46o7v1", "author": "ImALittleCrackpot", "body": "Call your county health department. They may ~~wavy~~ want to collect the bird and see if it was carrying West Nile."}, {"id": "e46laba", "author": "HydeWilde", "body": "Nah he's just stunned. Beautiful plumage"}, {"id": "e46k0l5", "author": "JTa235", "body": "That's an omen if I've ever seen one "}, {"id": "e46m08u", "author": "powerscunner", "body": "\"Hey, how are you doing?\"\n\n\"I'm having a real bird crashing into my window shitting on my laptop and dying in front of me kind of day.\"\n\n\"Been there.\""}, {"id": "e46tln0", "author": "slimslickersly", "body": "Flew through a window just to hit windows"}, {"id": "e46lxng", "author": "HookDragger", "body": "You should call animal control to have it inspected. "}, {"id": "e46k03g", "author": "exactly_average", "body": "I would check your house for carbon monoxide levels. "}, {"id": "e46mga1", "author": "TooShiftyForYou", "body": "Hopefully your anti-virus protects from bird flu."}, {"id": "e46sbom", "author": "MyNameIsKodos", "body": "Be sure to call your local health department, and don't handle the bird! Might be west nile"}, {"id": "e46mwvo", "author": "Athletekitty", "body": "Poor lil bird. "}, {"id": "e46thbs", "author": "DarthPreytor", "body": "Your the opposite of a Disney princess. "}, {"id": "e46ll61", "author": "TheDarkLordObama", "body": "dead for sure? hitting something can be shock. throw it in a shoebox for a while it might wake up.\n\nEdit - speak of the devil. A crow flew into my window. Well c if he make it.\n\nhttps://imgur.com/a/H6Cmw5p"}, {"id": "e46k0n8", "author": "thekaz1969", "body": "My day is shitty. It is dead around here. But at least it is flying by. "}, {"id": "e46mbj0", "author": "MyWifeDontKnowItsMe", "body": "I flew through a window, shit on some poor sap's laptop, then died while he just stared at me. "}, {"id": "e47chiu", "author": "robiwill", "body": "Wen nite is near\n\nand day is done\n\nAm flying round\n\nan having fun\n\nbut when I tri\n\nto fly thru glass\n\nI hit my hed\n\nand fall on ass\n\nI look to hide\n\nand see a shelf\n\nI tri to fly\n\nbut shit myself\n\nI tri to leave\n\nfore human came\n\nbut he see all\n\nI die of shame.\n\n\n\n"}, {"id": "e46tihj", "author": "Teach-", "body": "Dude, you got a Dell."}, {"id": "e46soll", "author": "hyteck9", "body": "I suspect fowl play."}, {"id": "e46s6ks", "author": "ThinSpiritual", "body": "So really, the bird decided to shit on someone before dying, that's understandable.  \n\n"}, {"id": "e46jxhn", "author": "atulanchal", "body": "Good comparing to you"}, {"id": "e46ldbf", "author": "TooMuchOzone", "body": "Not good. I just found out what happened to my sick pet bird that flew away last night!"}, {"id": "e46qydd", "author": "TARDIS", "body": "You and the girl whose boyfriend took her toilet should get together for a drink. Her ex stole her toilet...\n\nYou're both having shitty days."}, {"id": "e46v4a2", "author": "lobsterGun", "body": "Yup. Yup. Yup\n\nWhatcha got here is the start of the zombie apocalypse.\n\nI'm gonna need you to _not_ eat that bird and go ahead and burn that laptop just to be safe.  Keep the fire burning though, you may need it later. If'n you start to show symptoms (groaning,  shambling, hunger for branez)   you're gonna want to throw yourself into it.  Its the neighborly thing to do.\n\n"}, {"id": "e46ok7e", "author": "manukoleth", "body": "I see bird poop on the table side also. I think this one was either sick or poisoned. Normally such a scenerio is coupled with diarrhea and I think it was searching for a warm surface. I assume your laptop was warm."}, {"id": "e46suax", "author": "diogenes_amore", "body": "Ah, the Northeastern Foo. Known throughout the world for it's tendency to defecate and die. In some cultures, people fashion the excrement into ornate jewelry as a symbol of status within their community. This is the basis for the common saying, \"If the Foo shits, wear it.\""}, {"id": "e46s71h", "author": "Yerwun", "body": "This is like something that would happen at the beginning of a horror movie. OP, let us know how your week goes...\n\nAlso, RIP poor birdie."}, {"id": "e46t2d7", "author": "mrkennethmasters", "body": "Dude your caption is like the greatest stand-up comic intro ever. You made me go “hahahahahahahaahahahah”\n\nThank you."}, {"id": "e46uc8q", "author": "poopdrops", "body": "How likely are you to recommend windows 10 to a friend?"}, {"id": "e46te62", "author": "Seannj222", "body": "Just came from traffic court where I had to pay $200 and got home to learn that the power was shut off because my roommate didn't pay the one house bill he was responsible for. I pay water internet and cable. \n\nBut when I read this I started laughing out loud. "}, {"id": "e46jwpa", "author": "slapplebags", "body": "F"}, {"id": "e46t5l0", "author": "piscimancy", "body": "Bluebird of Crappyness"}, {"id": "e46wdnk", "author": "cassandra392", "body": "When the bluebird of happiness keels right in front of you, it’s maybe time to re-evaluate your life choices. "}, {"id": "e46jxcj", "author": "Kangaroosters", "body": "This made me laugh a disproportionate amount"}, {"id": "e46srkf", "author": "KeMushi", "body": "Did you try turning it off and on again?"}, {"id": "e46nxfg", "author": "Rebatoman", "body": "Press F to pay respects"}, {"id": "e46svvp", "author": "CaptFluffyBunny", "body": "I'm pretty sure you can legally go home with pay after that happens. "}, {"id": "e46v9da", "author": "jrwreno", "body": "That bird may have died from something like the Nile Virus. You need to dress with appropriate PPE, disinfect the literal shit out of everything, and bring the bird to the Dept of Agri for testing."}, {"id": "e473vbm", "author": "Oldkingcole225", "body": "Well, this is gonna be a longer story than it needs to be, but that's just cause I want to get the details down:\n\nI just went to get on the C train and two E trains came by (don't go to Brooklyn.) The second E train didn't open its doors or leave the station. Everyone started getting pissed. This guy next to me was just repeating over and over \"I'm from Marcy son. What up?\" and then wondering aloud why the train wasn't opening the doors or talking about how shit the MTA is (it's pretty bad right now.) I saw an MTA employee walking from car to car with a flashlight looking confused. Finally they opened the doors and started talking to people. I asked another man what happened; he said someone pulled the brake (emergency.) So we're all confused and looking around but the two MTA guys say we're gonna be pulling out shortly: \"We're just gonna have a look around and see if there's anything going on on the platform.\" \n\nThe doors half open and a couple with a baby is having trouble getting their carriage out of a half open door. The wife is fine but the guy is pissed. A bystander gets the MTA workers attention right as soon this guy gets the carriage through and then grabs his own water bottle and angrily throws it on the ground. The wife goes, \"what's your problem?\" It's a couples fight. He says something unintelligible like \"I just ugh fuckin!ugh\" and she looks at him half-embarrassed and half-pissed saying, \"that's _our_ water bottle.\" He doesn't even respond: just gives that 1000 yard stare. \n\nAt this point the MTA guys are looking at the connection between the two cars and there's a crowd behind them a few feet. One of the metal coils that connects the two cars is partly broken and they're lifting it up and down to see what happened. They start pointing their flashlights and looking into the tracks below. One of them in the orange jacket points down to what was probably right in front of the left car's first wheel and says, \"look there's a guy!\" kind of like it's so unbelievable that he can't even muster up the dramatic delivery necessary to make sure people believe him. It doesn't matter, though, cause he isn't lying. Im still not sure he said it (thought I misheard?) but everyone's crowding around so I take a peek myself and see a silver of what looks like white cargo shorts. The MTA guys are already rushing to call it in and maybe 10 people are looking with no supervision. I get my phone out to turn on the flashlight but I'm not close enough to get any light. Some other people have flashlights out and I see the whole cargo shorts, but you can't get a look at anything else. I just kind of assumed that I was looking at only half a body, and if I were to get down and really point my flashlight I'd see the other half cut clean, or maybe the head smashed under the wheels. I kind of wanted to check, but I figured people might think I look weird. At this point pretty much everyone around has realized what happened and backed away besides one dude who got a good look with his flashpoint. He gets up and I ask him, \"is he dead?\" The guy doesn't respond. I ask him again. The guy sort of gives me a vague response that I interpret as a yes, but I don't know if he spoke English. I start walking away with him and he meets a woman I assume was his wife, who rapidly interrogates him in Spanish. It's been a long time since my Spanish classes but she asked him something about a photograph. Fotografia was the only word I distinctly heard (and if there's one lesson here it's that my ears aren't as good as they used to be.) I think she either asked him why he took a photo or if he took a photo, but regardless the guy didn't want to talk about it and he immediately responded with a blunt, mumbled, negative sentence. His wife didn't like that and kept interrogating. \n\nWe were walking by others further down the track who were still waiting and I just motioned to a guy to start walking with a look on my face that he probably thought meant \"the annoying MTA fucked up again.\" I did it again to a second guy waiting and he asked me what happened. I just said, \"there was a jumper.\"\nEDIT: I forgot that at this time a child ran right by me (on the yellow line) straight towards the incident, his mother running behind him and brother behind her. I tried to tell her to stop him but they were far away before I processed exactly what they were about to see, how old they were, and the traumatizing effect this could have on them.\nThe guy kept walking with me for a bit and then asked, \"was it a suicide?\" I nod and say, \"I think so.\" I wish I had waited to see it out but I just left cause I didn't think there was gonna be much to see. I moved past the turnstiles and a guy asked this woman that was looking into the station why she was waiting. \"They're gonna pull out of the station soon,\" she says. I just shake my head and tell her the same thing I told the other guy, \"there was a jumper.\" It takes her a second. \n\nWe all walk out and I get about half a block away before I see/hear a fire truck. Impressive response time honestly. I talked to an NYC firefighter about this a few years ago. For those who don't know, the fire department deals with subway jumpers because of the electrical element. He told me that subway jumpers were the most fucked up of all things he'd ever seen. The wheels get so hot that they cut clean through and cauterize the wound immediately, meaning that some jumpers stay alive for long periods of time afterwards.\n\nNow that I think about it, though, I doubt the guy was actually dead. The brake was pulled and he must have pulled it. That means he stopped the train and then got down into the tracks. I bet it was some kind of suicidal cry for help, and I kind of hope I had stayed to see it through to the end. It was a pretty wild situation though."}]}