{"id": "99hl0j", "title": "Teachers homework policy", "url": "https://i.redd.it/qihcgc9pvph11.jpg", "subreddit": "pics", "author": "El_Torito23", "text": "", "comments": [{"id": "e4nuc25", "author": "HiJac13", "body": "My sixth grade teacher had this same policy.  Plus no homework on the weekends. The last hour every day would be what he call homeroom to finish as much work as possible so you have less homework. And he would help everyone. That was my best year of schooling! I hated homework. Still to this day, when I get home from work I am home and home means it's time to relax. Not think about work. "}, {"id": "e4nprym", "author": "Dollarbill1979", "body": "All of the elementary schools in my county have gone to this. Best part is, they implemented it the year my son went into middle school. "}, {"id": "e4nvgsx", "author": "toreachtheapex", "body": "Expectation: Eating dinner at the table  \nReality: Fortnite marathons till 1 am"}, {"id": "e4nq9a2", "author": "rarely_behaved_SB", "body": "My kids' school is homework-free from Pre-K through high school. The students work hard during the school day and are expected to experience life and be with their family outside of school, much like adults view the work/life balance.\n\n**Holy homework, batman! This blew up! Here's some information on [the Montessori method](https://en.m.wikipedia.org/wiki/Montessori_education) and [how it's used in modern classrooms](https://amshq.org/Montessori-Education/Introduction-to-Montessori)."}, {"id": "e4ns9sw", "author": "WheresTheButterAt", "body": "Its almost like kids would be motivated to finish their work this way..."}, {"id": "e4nr9df", "author": "pacollegENT", "body": "I went to a pretty strict private school that from about 6th grade on expected you to do a couple hours of homework a night.\n\nI pretty much did the minimum amount of work possible (thank God) but some kids did above and beyond what was needed.\n\nIt's just crazy to think back now and imagine doing a full school day, sports and then two hours of homework.\n\nThat's literally like a 12/13 hour day for a CHILD.\n\nMadness"}, {"id": "e4ntejr", "author": "Lobsterbib", "body": "Can you imagine a school year without busy work?\n\nDear Lord. Kids, I hope you appreciate this."}, {"id": "e4nr5k6", "author": "jonnysh", "body": "research shows that ain't nobody got time to be marking homework."}, {"id": "e4nu6vh", "author": "Bigbadmomma", "body": "My kids elementary school started this years ago. There was no difference in the students academic performance whatsoever and there was a positive attitude change in the student body which made for a more pleasant and productive classroom. \n\nBest thing ever. \n"}, {"id": "e4nrzbo", "author": "TooShiftyForYou", "body": "Studies have shown that cutting back on the amount of homework sent home and encouraging students to enjoy more free time directly correlates with teachers being able to enjoy more free time not grading homework."}, {"id": "e4nrv7x", "author": "roguekiller23231", "body": "My daughters 6, she was sent home with 3 books to read, a Math book to complete and 160 A4 pages of 'homework' for her holidays.\n\nEdit_\n\nShould add, the A4's are double sided!! \n\nThe books are easy, but long and boring, my daughter reads much harder books, but there is nothing worse then reading a long boring book. I sit and watch her go through 4-5 pretty hard books for her age but can't get through 2 or 3 pages of those school books. Boring books don't encourage reading!!\n"}, {"id": "e4nruc2", "author": "ec20", "body": "I knew a big family of homeschooled kids that eventually would go on to attend a regular high school/college and were often ahead of the other kids their age once they started the regular school. \n\nI remember I asked one of the kids how much homeschooling instruction he had throughout elementary school. He was taught for one hour with his mom and then he had one hour of homework time a day. That was enough to keep him well ahead of his similar aged peers. That really gave me an idea of how efficient our current school system is."}, {"id": "e4nvwfr", "author": "bigorangedolphin", "body": "My teacher from a couple years back.\n\n\"you wont have any homework other than what you dont finish in class\"\n\n\\*gives over an hours work and 5 minutes class to do it\\*\n\n\"it was set as classwork, and you chose not to do it in the set time\"\n\nsome teachers.......\n\nedit: rule 7"}, {"id": "e4nusw5", "author": "ticonderoga-", "body": "Is there really no correlation to homework and student success? Honest question, because I have found often times doing homework does in fact help me learn the material better."}, {"id": "e4nurll", "author": "MisterPhamtastic", "body": "Yeah this won't work in Asian households"}, {"id": "e4nv1mh", "author": "STOaway4DayZ", "body": "Kids everywhere have been saying this since FOREVER."}, {"id": "e4nykrh", "author": "jojoblogs", "body": "My primary school had no homework. I'm in university now and I feel like I still haven't got the hang of it.\n\nDoing homework may not improve academic performance, but I'm sure it makes students better at doing homework, right?\n\nEdit: a letter"}, {"id": "e4nw42x", "author": "sycamotree", "body": "WHERE WAS THIS WHEN I WAS IN SCHOOL!?\n\nI was so bored of homework by age 12 that I just didn't do anymore. I didn't need it. Results weren't pretty."}, {"id": "e4nuia3", "author": "thevoiceofterror", "body": "I work 8 hours. I don’t come home and have 3 hours of homework to do, I check my job at the door, and I’m still mentally exhausted. I can’t imagine putting a child through that. "}, {"id": "e4nvkwx", "author": "viktor72", "body": "I'm a teacher, a high school teacher. I have a love hate relationship with homework. First it's actually a lot of prep work for us. Second it's just one more thing the students have to do and our students are very busy because we are a full IB school. \n\nI would get rid of homework entirely but I feel our parents would react negatively to it so I've moved to weekly homework to give the students time to do it. I also only give complete/incomplete markings to homework, no grade. The idea is that the students need to do the homework to prepare themselves for success on assessments and to avoid giving too many \"buffer grades.\" This is a principle of IB as well. \n\nI'm also trying to move most writing to in class instead of at home. It's going to eat into my time for lessons but it's important students learn to write on the spot by hand because they will be expected to do that during IB exams. "}, {"id": "e4o25nr", "author": "bugninja", "body": "For elementary school, this makes sense for good kids with great parents.\n\nBut 90% of parents will probably just stick an iPad in front of their kids and let them eat garbage."}, {"id": "e4nw8ex", "author": "theofiel", "body": "Okay guys, teacher here. Wanna know a secret? We only give homework for the parents. "}, {"id": "e4nvitk", "author": "TinyPotatoAttack", "body": "Just wait for the administration to step in and force the teacher to give homework. That's what mine did."}, {"id": "e4nvu5t", "author": "Alltook", "body": "Going to go up against popular opinion here, but I'm not so sure that I agree with this. Homework, for me, effectively helped to discipline me in my studies. I may not have wanted to do it, but once I got started it helped reinforce what I learned and helped make material 'stick'. Without some of the \"outline this chapter\" homework I had in high school (that I was miserable while doing), I would have never been able to learn how to quickly skim an article for important information. Not until well into college at least. Homework was an effective means to train and learn good study habits that I still use today."}, {"id": "e4nsmk5", "author": "HaveThingsToSay", "body": "As someone with math/stat/science background, the claim that research shows homework has no influence is a bit strange.\n\nAll of the people I know with high academic performance have one thing in common, they practice. As in do all the homeworks and then more. Math, as an example, is a skill just like any other. It takes practice and repetition to be good at it. This is why Asian students coming to US doing their bachelors are generally very adapt at math problems - they were forced to do hours upon hours of practice a day during their schooling in China.\n\nHow old are the students? \n"}, {"id": "e4nw51a", "author": "sadwer", "body": "This has been what I've been doing for my 8th graders for the past few years. Homework is just a way for a school to start an argument between a child and a parent. "}, {"id": "e4nytre", "author": "blackmist", "body": "Well, those kids are going to be playing a lot more Fortnite..."}, {"id": "e4o2iir", "author": "curiouslexx", "body": "I wish I had this. I have flashbacks to elementary school, sitting at the dinner table at 8pm, getting scolded by my parents and being told I couldn't get up from the table to go to bed/sleep/play outside until I finished my homework; specifically math. I used to cry because I didn't understand what I was doing, and neither did my parents, they didn't understand the common-core way of solving equations. I can just imagine all the hours of my childhood I could have had if I wasn't stuck inside doing homework. I was on the Honor Roll list all the way until my first year of high school, after that I was completely burned out. I would take my current work/home life over my past school/home life 110%"}, {"id": "e4oa8vz", "author": "NC_PR0DIGY", "body": "I can tell you right now homework had a negative effect on me in school. I would never pay attention in class because I knew I was gonna have to go home and do it all over again. The homework would be graded but generally classwork wouldn't. Kinda like why work 40hrs a week if you're only gonna get paid for 20hrs, essentially."}, {"id": "e4nv1vh", "author": "SLURM187", "body": "My exact same homework policy. I teach middle school history. I don’t need my students doing homework for my class. I would rather have them in the classroom so I can work with them through complex ideas and challenge them in the classroom. I tell them that I expect them to work while I have them each day, but homework will not happen. They have been extremely responsive, and worked hard through the first two weeks. Fingers crossed"}, {"id": "e4nx1o0", "author": "Fosferus", "body": "My  father got a Doctorate in Education and then taught 5th grade after he retired from the tech sector.  He never gave homework.  When the other teachers complained he told them \"If you can't teach them what they need to know after having them all day - you can't teach.\""}, {"id": "e4o1b02", "author": "justinroberts99", "body": "11th year teaching. Made this my policy very early on and NEVER regretted it.  99% of the time homework sours parents and kids on school, drags down grades, and does nothing to improve learning.  (note to math teachers who all seem to disagree with me: practice does help a lot in math, but practice doesn't have to be homework, and most math home I see isn't practice)"}, {"id": "e4o75sp", "author": "Pluckt007", "body": "Been doing this for years.\n\nMy reasearch shows that i dont want to assign and grade homework and thats why it doesnt get assigned. "}, {"id": "e4nuqje", "author": "ortho_engineer", "body": "Homework is 100%, without a doubt, absolutely the key to success at engineering schools at least.\n\nAt my school homework was only worth like 5% of your grade - so you could just not do it if you wanted.  However, time and time again the people that didn't do their homework failed out of the classes (barring the rare savant).\n\nApproach homework as practice, not just busy work - and without practice how can you expect to pass your tests?"}, {"id": "e4o46gk", "author": "JRago", "body": "I had a geometry class in high school where I correctly answered every single test question on every single test and every extra credit question all semester long.  \n\nI ended with a 106% average.  \n\nThe teacher gave me a D because I never completed any homework assignments.  \n\nWhen I challenged her on this and asked if any other student an any of her sections had even a 100% average she said no but that I had to learn that following the rules was more important than learning.  \n\nThat's when I gave up on the American education system.  \n\n"}, {"id": "e4ntei1", "author": "Im_int", "body": "That font! My eyes! They are burning!"}, {"id": "e4nw3q4", "author": "extraordinarylove", "body": "I love this! The episode of modern family where Claire was adding up the hours and hours of homework that Alex was having to do as an AP student was appallingly accurate."}, {"id": "e4o0f9x", "author": "Rhawk187", "body": "I don't support giving busywork.  If there is a certain amount of content you need to cover in a year and you don't have enough time for students to do it all in class, then I understand the necessity to get it done outside of school hours.  But expecting them to do something at home \"just because\" is silly."}, {"id": "e4o22pt", "author": "Guitar46", "body": "I am a 4th grade math and science teacher. I do agree that homework doesn't drastically increase test scores or student learning. I do think that at an early age, students should be practicing math fluency such as addition, subtraction, multiplication, and division facts. They need to have these facts memorized and have the ability to recall the answers. If they do not have that then they will struggle.  I am positive that some students can be successful without the ability to recall these answers but it does in crease the chances that the student will be more successful in the upper grades."}, {"id": "e4o5uub", "author": "ActuallyAquaman", "body": "High school student, myself. My classes (primarily advanced, too) have been doing this for years now. Pretty standard, from what I know. As someone who’s usually a pretty fast worker, it’s been a straight-up gift from god for my free time."}, {"id": "e4o7bnp", "author": "lauderdalian", "body": "THIS IS SOMETHING ALL PARENTS IN THE UNIVERSE CAN AGREE ON.\n"}, {"id": "e4o7v9j", "author": "Iteachkidsallday", "body": "I fought for this policy at my last school as a fourth grade teacher. Homework has to be individualized review that students can accomplish independently with teacher feedback and even then, the research still doesn’t point to huge gains for elementary students. [Homework Research ](http://www.ascd.org/publications/educational-leadership/mar07/vol64/num06/The-Case-For-and-Against-Homework.aspx) \n\nHomework is also a deep divider between kids who have support (parental or otherwise) at home and those who don’t.  Think on this: most kids in poverty have to help their families after school. Sometimes it’s watching their siblings or cooking dinner or even helping bring in money with work. These kids are loaded down with responsibilities. The last thing they need is homework, especially busywork. These are the kids who feel different the second they walk into the middle class norms of American schools and homework only reinforces a sense of failure when they cannot complete it. They may not even have a pencil at home. Very different from the kids who have supportive families who yell at them to come in and do their homework from playing outside and then help complete it with them. See Donna Beegle’s work on poverty for more insight into the culture of poverty. I found it essential reading to myself as an educator and human.\n\nNow reading at home. That will help all kids be successful in school. [NEA Literacy Research](http://www.nea.org/grants/facts-about-childrens-literacy.html) \n"}, {"id": "e4o9n88", "author": "Incur", "body": "Honestly, it just comes down to giving a reasonable amount of homework. I had teachers in high school that would give you time in class to finish the assignment, but if you weren't super quick, you would have to finish it at home. I also had teachers that would give a work that had to be at done at home. Both were reasonable. No homework would not be a good thing if they aren't doing much in class. "}, {"id": "e4pk6gs", "author": "savagecanadaiass", "body": "I mean that’s pretty much what I did. I would get the homework assignment in school and start and finish it during class. Boom no homework!"}, {"id": "e4uutni", "author": "rayshieldsfalcon", "body": "Homework serves no purpose. If you're supposed to be preparing children for adulthood, homework is useless. Most adults leave work and don't have to do anything work related at home at all, and that's considered a good thing for peace of mind and mental health. Who should children have to mentally stay at school 24/??"}, {"id": "e4xi085", "author": "notothisguythumb", "body": "The proof is out there.\nCheck where the US ranks in education vs other developed nation's.\nAs those high ranking Countries prepare their youth for life and success, America prepares their youth for recess and fast food jobs.\nIt's competition, and the field is the youth of the world.\nWant fries with that burger!\n"}, {"id": "e4yesje", "author": "herewesillion", "body": "\"Proven to correlate\" is a phrase that pains me, but goodwill to your teacher for changing that policy. Many classes don't benefit from homework."}, {"id": "e4nu80r", "author": "modestlunatic", "body": "I have seen this idea first hand with my nephew and nieces. One is in a district that doesn't do homework and the others get homework sheets. Same grade, my brothers raised their kids similarly, the difference in their ability is huge. Especially in math and spelling (basically all they're doing at that age). Poor guy has a really hard time with multiplication tables, while the others blow through them. I really believe that practice with homework sheets is needed. "}]}