{"id": "9cmazx", "title": "They noticed there was a blank wall at mcdonald’s so they decided to make this fake poster of themselves. It’s now been 51 days since they hung it up.", "url": "https://i.redd.it/pavm6jjnj1k11.jpg", "subreddit": "pics", "author": "Goal1", "text": "", "comments": [{"id": "e5bpvui", "author": "TAU_equals_2PI", "body": "Wanna impress me?  Sneak into a McDonald's and fix the ice cream machine."}, {"id": "e5bo75z", "author": "TooShiftyForYou", "body": "It does look like a professionally made McDonald's ad."}, {"id": "e5bo3st", "author": "CitizensOfArkham", "body": "r/ActLikeYouBelong "}, {"id": "e5bouef", "author": "Kicker774", "body": "Would had been better if they had posed with a Whopper and Burger King fries."}, {"id": "e5bovu2", "author": "Tamespotting", "body": "Or.... Is this just a sneaky ad for Mcdonalds masking as a cool reddit post! I'm going to think this over with a McDouble and McFlurry.  "}, {"id": "e5br04f", "author": "Drak_is_Right", "body": "My guess is this is typical \"I thought another manager did this\" type thing.  Promotions and advertisements get changed frequently enough ."}, {"id": "e5bz0bt", "author": "IJustThinkOutloud", "body": "One of the mcdonalds in my town stretched a jpeg image of a fruit shake into a 8'x12' poster and each pixel is bigger than a quarter. It's glorious.\n\nThe best part? Some old person with 0 multimedia experience is holding that position down while there are recent grads looking for work that *actually know not to stretch a fucking jpeg to use on a physical advert* but somehow remain \"unqualified\"."}, {"id": "e5bpwwd", "author": "JayTrim", "body": "I mean shit, McDonalds should be giving them a job. That's very well done."}, {"id": "e5bpfnl", "author": "elleyesee", "body": "Are the dotted circles re-spawning locations for fries?"}, {"id": "e5bznm8", "author": "Dam_Kids", "body": "If I was that store manager I'd leave it up too. Looks professional af."}, {"id": "e5bsbuw", "author": "Vigama", "body": "I bet that manager couldn’t give two shits."}, {"id": "e5bo569", "author": "Charlitos_Way", "body": "*Hey Steve those kids are hanging a poster of themselves eating our product on the wall over there. As the manager I think you should do something about this very important matter. Steve? Why aren’t you doing anything? Steve? Oh my god they’re getting away Steve! Why don’t you care about this more - it’ll be up there for months unless you do something about it Steve. It’s almost like you don’t even care about this incredible job we have. I’m calling the FBI if you don’t do something about this Steve.*\n\n\n"}, {"id": "e5bsfjl", "author": "fuern2", "body": "The manager probably knows it's not suppose to be there but it's so well done they probably said \"fuck it. It's nicely done and goes with the store so let's keep it.\""}, {"id": "e5by525", "author": "GladiatorJones", "body": "Definitely the circles that did it. Random enough to be design, but not too much. "}, {"id": "e5bolse", "author": "LavenderSnake", "body": "r/madlads"}, {"id": "e5bo4td", "author": "HeadsOfLeviathan", "body": "They carried a massive picture into McDonald’s and hung it by drilling holes in a wall without anyone noticing?"}, {"id": "e5bpodz", "author": "Exhumed", "body": "To be fair it looks like something that would be up "}, {"id": "e5bzpw8", "author": "BetterThanOP", "body": "It's actually always been on my bucket list to do this at a hard rock cafe. Take a fancy black and white picture of yourself wearing a fur jacket or something, your face can even be  half covered or out of focus. Sign it with a black sharpie, frame it, sneak it into the restaurant in a purse or whatever. Then slyly find a blank space to hang it up (maybe just with some 3M sticky strips?) and hope that no one notices for a while. Keep going back to that restaurant once or twice a year to check on your fame"}, {"id": "e5bqk4l", "author": "CacheMeOutside", "body": "may they end up in ellen"}, {"id": "e5brky8", "author": "danceswithwool", "body": "If I was the manager there and I saw that someone had done that and had done it that well I wouldn’t take it down either. "}, {"id": "e5bu0s1", "author": "phteven24", "body": "This is a wholesome prank. What pranks were meant to be."}, {"id": "e5bxwol", "author": "stealfire1", "body": "Looks professional. Fits the message. And fills the needs of a blank wall beautifully. Why would they take it down. "}, {"id": "e5bodaw", "author": "owlsareowls", "body": "We believe it "}, {"id": "e5bwj6t", "author": "Cocainepepperoni", "body": "My buddy Greg and I tried the same thing at Victoria's Secret. \n\nThey apparently noticed two 38-year-old men with \"dad bods\" in lingerie was not \"corporate approved\" marketing. We were also banned from the mall, but I still feel like an angel. "}, {"id": "e5c0s74", "author": "topasaurus", "body": "We did this in a GM office/factory in Ohio in the 80s.  At my residence we had this ugly velvet picture thing like they used to sell at roadside fleamarkets and the like.  We got this idea to post it on the wall for a lark.  We used simple masking tape on the back.  Me, being young and such just walked in the front door, down the wide hallway, and planted it on the wall so that it would be in plain view of all that entered.  It stayed up for 2-3 weeks, then must've fallen from weight.  One time we arrived at work to see two executives leaning on the wall, one on each side of the picture, discussing something.  Good times."}, {"id": "e5c0vlp", "author": "GapDragon", "body": "That poster is dead on point!!!  Not too surprising nobody's noticed..."}, {"id": "e5lcgpw", "author": "createanotherjohn", "body": "Now this is humor"}, {"id": "e5ndmx9", "author": "howyoudoincow", "body": "Watch them get sued for using the logo 🤣"}, {"id": "e5buspu", "author": "moriarty70", "body": "I know some people will be critical of this. But me? I'm lovin' it."}, {"id": "e5c67a5", "author": "bobmarls", "body": "The food and offers that are displayed on this post definitely makes this look like an ad."}, {"id": "e5cbjzi", "author": "siouxftw", "body": "Fuck off\n\nMcDonald's is so heavily advertising on reddit "}, {"id": "e5cc0o9", "author": "hypernova2121", "body": "\"Here's a McDonald's ad, but McDonald's *totally* doesn't want you to see it\"\n\nLol"}, {"id": "e5cel9u", "author": "JohnnyLakefront", "body": "Hey look, a McDonald's commercial on Reddit. Shocking"}, {"id": "e5cgv75", "author": "dominant_driver", "body": "Too bad McDonald's food sucks, and is overpriced."}, {"id": "e5fc09t", "author": "funoversizedmugduh", "body": "The fact that they must’ve had a photo shoot, edited, printed and snuck this into McDonald’s is really cute. "}, {"id": "e9j5qui", "author": "beautiful_lilfool", "body": "I hope this is still up"}, {"id": "e5bom8n", "author": "mrsuns10", "body": "They should get paid for that "}, {"id": "e5bn358", "author": "famschopman", "body": "I'm lovin it"}, {"id": "e5bqgsh", "author": "vanbikejerk", "body": "Fuck you, viral marketing."}, {"id": "e5bq1j5", "author": "Bl36", "body": "I would totally believe that"}, {"id": "e5bz2ox", "author": "jvin248", "body": "Great job on the marketing program to get a job in McDonald's marketing department. Send that resume in."}, {"id": "e5cb128", "author": "spastic_whorse", "body": "This is literally an ad for McDonalds"}, {"id": "e5ces52", "author": "zomahd", "body": "Smells like a shill "}, {"id": "e5co8fw", "author": "tdavis20050", "body": "51 days, that means no one is working that ever saw the wall without the poster"}]}