{"id": "a89m64", "title": "Water ice on Mars, just shot by the ESA!", "url": "https://i.redd.it/06ozylnfmm521.jpg", "subreddit": "pics", "author": "loulan", "text": "", "comments": [{"id": "ec91wqf", "author": "Digital-Nomad", "body": "What is the scale of this image? How big is that crater?"}, {"id": "ec93ifi", "author": "Spartan2470", "body": "[Here](https://www.esa.int/spaceinimages/Images/2018/12/Perspective_view_of_Korolev_crater) is the source of this image.  Per there:\n\n> **Title** Perspective view of Korolev crater\n\n> **Released** 20/12/2018 11:00 am\n\n> **Copyright** ESA/DLR/FU Berlin,\tCC BY-SA 3.0 IGO\n\n> **Description**\n\n> This image from ESA’s Mars Express shows Korolev crater, an 82-kilometre-across feature found in the northern lowlands of Mars.\n\n> This oblique perspective view was generated using a digital terrain model and Mars Express data gathered over orbits 18042 (captured on 4 April 2018), 5726, 5692, 5654, and 1412. The crater itself is centred at 165° E, 73° N on the martian surface. The image has aresolution of roughly 21 metres per pixel.  \n\n> This image was created using data from the nadir and colour channels of the High Resolution Stereo Camera (HRSC). The nadir channel is aligned perpendicular to the surface of Mars, as if looking straight down at the surface.\n\n[Here](https://www.google.com/mars/#lat=72.662262&lon=165.407016&zoom=6&q=Korolev%20crater) this is on Google Mars.\n\n[Here](https://trek.nasa.gov/mars/#v=0.1&x=165.79120226781475&y=72.96546543256117&z=6&p=urn%3Aogc%3Adef%3Acrs%3AEPSG%3A%3A104905&d=) it is on NASA's Mars Trek.\n\nEdit: Thank you for the correction /u/PageFault. Fixed.\n\n**Edit 2:**  Over [here](https://www.reddit.com/r/pics/comments/a89m64/water_ice_on_mars_just_shot_by_the_esa/ec9tgft/) /u/NinjutsuStyle noticed [these yellow dots](https://i.imgur.com/JFB3OvJ.jpg) that show up at about 5 o'clock near where the water ice has an edge.  Any idea what they could be?"}, {"id": "ec8wpm9", "author": "MarkHughes4096", "body": "So would this be the first place humans might want to be near on arriving ? or is water so common there under the surface that it doesn't matter ?"}, {"id": "ec8xdj5", "author": "Kanuck88", "body": "Grab your sticks and pucks ! "}, {"id": "ec8x6do", "author": "Terran5618", "body": "That's great! I wouldn't drink water out of the pond in my neighborhood park, but this would be a great place to search for signs of life, right?"}, {"id": "ec8zric", "author": "wrproductions", "body": "Let’s hope they don’t wake up the Hive."}, {"id": "ec8wkt0", "author": "loulan", "body": "Official tweet by the ESA: https://twitter.com/esa/status/1076032022798192640\n\nEDIT: The comment below makes it sound like they used some CGI to make up some artist's rendition of what it would look like, that's not what this is at all. It's a real photograph, this one: http://www.esa.int/var/esa/storage/images/esa_multimedia/images/2018/12/plan_view_of_korolev_crater/18937953-1-eng-GB/Plan_view_of_Korolev_crater_node_full_image_2.jpg\n\nThen, since the picture is taken from above and they have a precise 3D map of the ground they just projected the picture on the 3D map so that we can see it from another angle, that's all. Which means, it's the same thing as when you look at google maps in 3D: it's real photos, and nobody claims, when they look at Google Maps in Satellite mode that it's \"a computer-generated image of the Earth\". When /u/pm_me_ur_big_balls claims it's \"a computer-generated image based on topographic data gathered\", it seems that he read somewhere how the 3D model of the ground was produced, not understanding the most important part: a real, high-res photograph of the ground was shot by ESA and projected on it. And no, they didn't \"just add the color\", the photograph was taken in color, as he quoted himself just above: the \"High Resolution Stereo Camera (HRSC)\" has color channels, it is a color camera.\n\nI would also like to reject the claim that I am a collection of sticks, as my title didn't imply anything else."}, {"id": "ec91flz", "author": "SubZeroEffort", "body": "There is water right nextdoor, we didn't have to look far.  Amongst the other billion planets out there, you just know there is life somewhere else."}, {"id": "ec8ydvj", "author": "Davecasa", "body": "That looks like a *lot* of ice, in a really obvious place. What's different about this mission that allowed them to find it?"}, {"id": "ec8xvw3", "author": "July_Sandwich", "body": "Nestle already purchased it and is charging royalties to post the photo."}, {"id": "ec93wus", "author": "newmdog", "body": "How is this not bigger news? Like....why isnt it on r/science or r/news or something?"}, {"id": "ec915y3", "author": "perrilloux", "body": "\"Thank you Mars, Very Cool!\"\n\nbut no seriously call the Doctor there are Ice Warriors up in that bitch."}, {"id": "ec96kra", "author": "robotic_dreams", "body": "This is why I love and hate Reddit .  I'm literally in an airport about to freak out thinking we found this amount of ice on Mars and I have no idea because the comments are just hundreds and hundreds of bad jokes I don't get with zero actual information"}, {"id": "ec94ijb", "author": "Calmeister", "body": "Mars always scared me back as a kid because of total recall and Arnold’s bloated eyes when he was dropped out in the open."}, {"id": "ec8wza7", "author": "martinkarolev", "body": "This is freakin amazing."}, {"id": "ec9077q", "author": "Wassa76", "body": "It looks like a close up of a chocolate Creme Egg"}, {"id": "ec8wnx4", "author": "Jayveesac", "body": "What does Steph Curry think of this? 🤔"}, {"id": "ec9c0rm", "author": "Vepr157", "body": "OP, your title is a bit misleading:\n\n* **The image is effectively a rending.**  ESA took a digital terrain model and photographs/images from Mars Express to make this computer-generated rendering.  It is an accurate view of what Korolev crater looks like, but it's not an actual ~~image~~ photograph.\n\n* **The most recent imaging data was taken in April.**  This image was just *released*, but the data that was used to make it isn't so new.\n\nAnd some facts that people seem to be confused about:\n\n* **We've known about water ice on Mars for quite a while.**  Even before spacecraft we have been able to observe Mars' polar ice caps, which are made of both water and CO2 ices.  [Here's a movie from Mariner 7](http://planetary.s3.amazonaws.com/assets/images/4-mars/2015/20150424_mariner7.gif) showing the northern ice cap in 1969.  For anyone interested in the history of the discovery of water on mars, see [this excellent wikipedia article](https://en.wikipedia.org/wiki/Chronology_of_discoveries_of_water_on_Mars).\n\n* **We've known there is ice in Korolev crater for a while too.**  [Here's an mosaic of Viking images](https://upload.wikimedia.org/wikipedia/commons/2/2c/Mars_NPArea-PIA00161.jpg) from the 1970s and 1980s showing Mars' north pole (Korolev is white circle at the 1-o'clock position, halfway from the center).\n\nI don't want to seem like I'm coming down hard on OP, but I think it's important to share images of the planets with more context, as posts with almost no context can be misleading or a bit confusing.\n\nEdit: For clarity, photograph is probably the least ambiguous word to use when referring to an image taken by a spacecraft camera.  Image can potentially refer to both photographs and renders, at least in non-scientific publications."}, {"id": "ec91gp8", "author": "billwashere", "body": "This is huge right? Especially for a Mars colony?"}, {"id": "ec97c01", "author": "TeaBottom", "body": "ITT: People didn't know we've observed water ice on Mars for over a decade. "}, {"id": "ec97yuv", "author": "FnkyTown", "body": "And so begins the Nestlé Spacé Racé."}, {"id": "ec9604x", "author": "lycan2005", "body": "Hope they don't harvest argent energy here."}, {"id": "ec9b97b", "author": "KerbalEssences", "body": "The title is a little misleading as this was not shot but generated using Mars data. What the artist does is generate a 3D model of the region, put the image of the ground as a texture ontop and set up a camera for a nice view. It's still real, it's just that this partcular angle would not be possible shooting images directly from the satellite. \n\n> This oblique perspective view was generated using a digital terrain model and Mars Express data gathered over orbits 18042 (captured on 4 April 2018), 5726, 5692, 5654, and 1412. The crater itself is centred at 165° E, 73° N on the martian surface. The image has aresolution of roughly 21 metres per pixel.  \n\nhttps://www.esa.int/spaceinimages/Images/2018/12/Perspective_view_of_Korolev_crater"}, {"id": "ec93let", "author": "Motherofdin", "body": "To think, years ago we were speculating about water on Mars and now we're looking at it. What a time to be alive."}, {"id": "ec9eyw2", "author": "Actually_a_Patrick", "body": "ITT: people who think we haven't practically always known of ice on Mars"}, {"id": "ec929t6", "author": "Bjfaber", "body": "Is this what they meant in Philly when they said the water ice was out of this world?"}, {"id": "ec957u1", "author": "DerDoenerbudenmann", "body": "Dont drink the water!\nDont even touch it!\nOnly one drop..."}, {"id": "ec91llf", "author": "watch_over_me", "body": "If you could melt and drink some of that, would you die?"}, {"id": "ec96gjv", "author": "Aturom", "body": "Get your ass to Mars!"}]}