{"id": "a9fi2j", "title": "An elementary school bus driver asked every kid on his bus what they wanted for Christmas. He bought every child a gift.", "url": "https://i.redd.it/c7w68wfbwf621.jpg", "subreddit": "pics", "author": "gangbangkang", "text": "", "comments": [{"id": "eciznfd", "author": "highassnegro", "body": "One of those kids got a bike..."}, {"id": "eciwl0n", "author": "TooShiftyForYou", "body": "*“When I opened that door, one of the kids asked me, ‘Are you Santa?’” school bus driver Curtis Jenkins told KXAS. “Seeing those faces on the kids was more than anything I could ever do with the money.”*\n\nThis good man bought presents for 70 kids that ride his bus.\n\n[Story](https://www.yahoo.com/news/bus-driver-put-aside-money-paychecks-get-christmas-presents-70-students-230457178.html)"}, {"id": "eciwjrz", "author": "gangbangkang", "body": "His name is Curtis Jenkins! \n\n>\"We talked about the things that they would want and I made a mental note of it and wrote it down.\" Curtis originally planned to host a gift exchange. When his wife pointed out some kids may not be able to bring a gift, the Jenkins decided to buy presents with their own money. Curtis set aside a little money from each paycheck to buy puzzles, games and small electronics. \"Seeing the faces of those kids was more than anything that I could ever do with the money.\" Jenkins said his work is his calling and he hoped to show each child they have value and are loved. \"I'm not at a job, I'm on a mission from God. I don't say anything about religion to the kids. I just let them know whatever they love is fine with me, just love somebody on the way.\""}, {"id": "ecixbbk", "author": "Complete_Loss", "body": "The kids who get the bikes are gonna get the stink eye."}, {"id": "ecix10j", "author": "magtataho123", "body": "This man is awesome. He'll be remembered by the kids for sure. "}, {"id": "eciw6ep", "author": "Northernrebel56", "body": "How did he afford that? Nice of him tho."}, {"id": "ecixzfu", "author": "Tendedtadpole2", "body": "This is why we thank the bus driver!"}, {"id": "ecj2s3o", "author": "ShineBloo", "body": "My school bus driver made all of us little ornaments of the first letters of our names. We've also had drivers give us candy and fruit for gifts as well. Bus drivers are just the sweetest people and seeing this makes me think of all them out there keeping us kids safe to and from school. To any bus drivers here on Reddit: Thanks for all you do and Merry Christmas :)"}, {"id": "ecivzgo", "author": "fizzled112", "body": "My bus driver once gave me a peppermint that had a hair on it. "}, {"id": "ecj4xwl", "author": "AshleyBradson", "body": "Let's get him on Ellen."}, {"id": "ecj1d91", "author": "zorath678", "body": "How many nintendo switches was he asked for."}, {"id": "ecj3bpx", "author": "RapSkallon", "body": "My father is a school bus driver. These men and women don’t get the credit they deserve for doing this job. Outstanding man this guy is."}, {"id": "ecj43qe", "author": "emw98", "body": "This is beautiful, I hope a gofundme appears for this guy, I really think he deserves it :)"}, {"id": "ecj1lsv", "author": "kitjen", "body": "How? I've only got one kid and I struggled to buy him what he wanted."}, {"id": "ecj21bm", "author": "mildimpregnator", "body": "I love this man."}, {"id": "eciw90i", "author": "CalRipkenForCommish", "body": "That’s amazing!  Well done by that guy!!  Imagine the excitement of the kids getting on the bus that day and seeing all those wrapped gifts, best ride to (or from?) school EVER!!"}, {"id": "ecj21bs", "author": "bikesboozeandbacon", "body": "Damn that kid with the bike request got lucky lol"}, {"id": "ecj3ofy", "author": "Rogpog777", "body": "What a good freaking person. I hope the internet gets together and buys him a pony or a stapler or something like that."}, {"id": "ecj4u5o", "author": "p1ll0wp4nts", "body": "Ha! Santa IS Black!"}, {"id": "ecj6tug", "author": "hairyass2", "body": "my bus driver once drove right by me at my bus stop "}, {"id": "ecj25iv", "author": "landlockedblu3s", "body": "My moms been a bus driver for various schools for over 20 years. She’s always given and received every year and takes a lot of pride in her job. Nice to see others do as well. "}, {"id": "ecj3scs", "author": "laidback26", "body": "This guy is a true hero. Some of these kids might not have even gotten a Christmas. People like this should be on the top of the news stories. Just maybe it will inspire some others!"}, {"id": "ecj0gqd", "author": "TexasMaddog", "body": "What fucking route does he have?!!?  I barely make enough on my route to get my own *two kids* a few presents!  O.O"}, {"id": "ecj27ng", "author": "jay22098", "body": "what if they all asked for iphone xs?"}, {"id": "ecj4sy8", "author": "RMJ1984", "body": "And they say real life heroes do not exist. Respect. Dude has a heart of gold."}, {"id": "ecjdca7", "author": "vienathedruid", "body": "r/humansbeingbros"}, {"id": "ecj4r5c", "author": "HillBillyBobBill", "body": "Knowing how little this man makes working as a bus driver he deserves mad respect for this. "}, {"id": "ecj06hw", "author": "Bluey014", "body": "Give that man a raise."}, {"id": "ecj1ksm", "author": "maybesaydie", "body": "Posted to r/HumansBeingBros three days ago."}, {"id": "ecj3rkh", "author": "malry", "body": "My dad just had his first Christmas as a bus driver to special needs kids. Many of them gave him presents on the last day of school before break! "}, {"id": "ecj0trb", "author": "thegeebeebee", "body": "In America, it seems that those who can least afford it do the nicest things.\n\nMeanwhile, there is a rich tyrant plotting how he can give this guy less pay and fewer benefits so he can make just a few more dollars.\n\nOur system sucks.  Sorry for the shitty holiday thoughts, but that's how it is.  This guy is a flower blooming out of an asphalt parking lot."}, {"id": "ecj2rsr", "author": "starktony_1", "body": "I really hope this guy also gets what he really wants for Christmas.. "}, {"id": "ecj3242", "author": "show_more_work", "body": "Imagine the salt after respectfully asking for a small $5 action figure and then watching Johnny get the Mighty Beans Rumble-Tumble Race Set and Billy get a freaking bike"}, {"id": "ecjd4sg", "author": "christorino", "body": "My Granda is a bus driver and has been for 30 years.  He is now taking the kids of some of the first kids he brought.\n\nEVERY Friday he gives out sweets.  However he knows all the kids by names (over 4 or 5 schools) and where they live and will bring them to their door if their folks cant lift them or forget to (we live rural so some stops are at cross roads etc).\n\nEvery Christmas he gets a present of every kids folks, we always loved going to his house when younger to open all his gifts!\n\nThis guy is making a difference"}, {"id": "ecjd7rb", "author": "refthemc4", "body": "As school bus driver myself I can honestly say this guy is a good dude. We get paid pretty terrible and don't work all year"}, {"id": "ecjec2h", "author": "banana430", "body": "I use to think the bus driver hated me because I would fall asleep waiting to get to school ( i was the first kid he picked up). The older kids would see me crying after i woke up and noticed my school had already been passed. This happened more than a few times. I thought i was really getting on his nerves plus he was so grumpy and always yelling. When my dad got another job he wasnt able to pick me up from school anymore so i had to take the bus home as well. I was always the last kid left on the bus and one day he gave me some chocolate.  Then he started to give me candy everytime he took me home until I no longer took the bus. Turns out all the other kids got on his nerves because they were disrespectful and I was one of the few who stayed put in their seat. I hope that bus driver is doing well I think about him sometimes. "}, {"id": "ecj101f", "author": "PM_ME_HERM_YIFF", "body": "One time my bus driver skipped my stop and took me back to school when I was asleep"}, {"id": "ecj2to3", "author": "poremetej", "body": "TIL bus drivers are loaded"}, {"id": "ecj20mh", "author": "Grande_24", "body": "Who got the iPhone?"}, {"id": "ecj3afc", "author": "twoquarters", "body": "My bus driver used to swear at me in greek and banish me to the front seat for god knows what"}, {"id": "ecj4jah", "author": "arthurpartygod", "body": "My kinda guy! Life is what you give, so give often!"}, {"id": "ecj5p8f", "author": "maseinface16", "body": "When I was a kid, our bus driver always drove straight from his house to the bus stop (a block away). In the winter, the bus wasn't warmed up and we lived in Michigan. It would be 25F outside and 25F inside...it warmed up a smidge just as we got to school.\n\nNot saying this to be negative, just accentuating how this guy in this post is the best bus driver ever."}, {"id": "ecjcbhs", "author": "Lukeb822", "body": "There should be some kind of fund to give him a gift. I'd chip in."}, {"id": "ecjcli6", "author": "roccos_unmodern_lyfe", "body": "People are talking about making a go fund me page for him which is great but get involved with your local community and see if you can help in the same sense there!"}, {"id": "ecjcrca", "author": "Grunge_bob", "body": "Every kid riding the other buses going to be so mad lol"}, {"id": "ecjetk1", "author": "Gojunk", "body": "CURTIS JENKINS IS A MOTHERFUCKING CHRISTMAS CHAMPION!!!!!  What a guy!!!"}, {"id": "ecjexna", "author": "miss_uninteresting", "body": "1) This is adorable. \n2) my old bus driver from like 8th grade bought us  twizzlers. Not  as expensive as what this guy did but its the thought that counts."}, {"id": "ecjf673", "author": "Summy1XD", "body": "This made me happy cry."}, {"id": "ecjgvca", "author": "chief432", "body": "Honestly bus drivers deserve more recognition. We really wouldn't get far without them, they're the unsung heroes"}, {"id": "ecjh0g4", "author": "ItDwellsWithin0", "body": "r/humansbeingbros"}, {"id": "ecjh6jq", "author": "TonyTabasco", "body": "You see celebs doing this and your like, “good marketing or good optics.”  But this guy is proof that things like this or rather people like this really do exist. "}, {"id": "ecjoy1x", "author": "0dd0ne010", "body": "How was he able to afford this with his salary? Unless he has another job or two, or three!"}, {"id": "ecjqf70", "author": "A_Fellow_Cynic", "body": "_Everyone_ has thanked the bus driver."}, {"id": "ecksqhc", "author": "critical510", "body": "Yes I'd like a PS4 pro with the red dead redemption 2 bundle. "}, {"id": "ecj0zyz", "author": "drunz", "body": "Some kid is getting a bike from a bus driver. "}, {"id": "ecj7i6j", "author": "vmcnick", "body": "Hope they didn’t forget to thank the bus driver "}, {"id": "ecj2awr", "author": "bananas21", "body": "If I did that I'd get fired :("}, {"id": "ecj1x42", "author": "_Schwing", "body": "A great man."}, {"id": "ecj3lez", "author": "meanlimabeanmachine", "body": "My bus driver many years ago did something similar. He stopped at Dunkin donuts and let everyone on the bus get what they wanted"}, {"id": "ecj4sk2", "author": "CM_MPR", "body": "When I was in elementary I had a bus driver who bought gifts every Christmas and cupcakes for anyone's birthday. "}, {"id": "ecj4sn6", "author": "suffering_synt4x", "body": "What a good man"}, {"id": "ecj63jf", "author": "Chortles_", "body": "Thank you bus driver. Very cool. "}, {"id": "ecj7nsx", "author": "backwoodsanarchy", "body": "Is it just me or is it kind of fucked that a bus driver can afford to buy a bunch of kids gifts but teachers work way more hours, make a pittance-and-a-half, and practically live in poverty? I mean good on him for giving back but damn..."}, {"id": "ecj9u9x", "author": "Epps1502", "body": "My old bus driver, who i had all 12 years of mu schooling, used to give out those giant sticks of candy cane. He was the best driver i had ever seen. I miss seeing him every morning."}, {"id": "ecjb3zu", "author": "Dogemann1366", "body": "Damn these kids better have thanked the bus driver"}, {"id": "ecjb49q", "author": "mikeg2277", "body": "#rolemodel "}, {"id": "ecjb7pz", "author": "Silber4", "body": "Wow. That's dedication, maaan..\n\nMerriest Christmas! 🎄🍾👍"}, {"id": "ecjbbiy", "author": "theshadystriker", "body": "This man is who we should all be calling Santa Claus."}, {"id": "ecjbcwh", "author": "Feralmedic", "body": "I’m just here for the gangbang "}, {"id": "ecjbeue", "author": "Memories_Faded", "body": "Good school bus drivers are seriously under-appreciated in this country. "}, {"id": "ecjbexf", "author": "ThatOtherMonster", "body": "I sent my mom this link as a nice heartwarming holiday thing. She writes nack, \"what does 'gang bang kang' mean?\" So thanks for that. Merry christmas."}, {"id": "ecjclw5", "author": "DeemSleep", "body": "Are all those Vbucks cards?"}, {"id": "ecjcq23", "author": "athenagodessofwar", "body": "❤️❤️😭❤️❤️❤️😭😭"}, {"id": "ecjcr9z", "author": "db4d1988", "body": "This is awesome. Good job!"}, {"id": "ecjd08o", "author": "zackadiax24", "body": "/r/humansbeingbros"}, {"id": "ecjd5j8", "author": "dokdorosman", "body": "Heaven guaranteed."}, {"id": "ecjd7cg", "author": "stillquenchless", "body": "Those are great people!"}, {"id": "ecje6v6", "author": "Lavishgoblin2", "body": "When the repost gets almost a 100k upvotes... feel bad for the original original poster a couple days ago."}, {"id": "ecje775", "author": "plumprumps", "body": "Bought all of mine a king size of their favorite candy bar... Kids don't expect much from bus drivers so I like seeing other ones who set the bar high! "}, {"id": "ecjegdw", "author": "FightTheFallen", "body": "O'doyle Rules!"}, {"id": "ecjeiup", "author": "MattyH51", "body": "This guy gives hope for humanity"}, {"id": "ecjejoo", "author": "TheOriginalMarra", "body": "Until every kid asks for a nintendo switch"}, {"id": "ecjem4r", "author": "Bcsaldi18", "body": "Mr. bus driver i would like to get a Nintendo switch. Thanks :) "}, {"id": "ecjevng", "author": "bush-did_9II", "body": "Wow my bus driver would forget to drop or pick me up sometimes"}, {"id": "ecjewr0", "author": "Fox_brother075", "body": "This dude is a fucking legend!!!!"}, {"id": "ecjf2yh", "author": "newbies13", "body": "I love how this has turned into a discussion about how much or little the guy makes. He bought random children presents to make them happy, that made him happy. What kind of horrible culture have we fostered were something that simple brings up cost to so many people? Maybe he went to the $1 store, maybe he went to Nordstrom, why does that matter?"}, {"id": "ecjg9ib", "author": "Tradidiot", "body": "Wow! Top tier human right there!"}, {"id": "ecjgec8", "author": "Yo_el_rey", "body": "Lets get this guys somthing dope! I got $5 on it whos in?"}, {"id": "ecjh41w", "author": "Daftkeeper", "body": "What a lad) hope people get to care more and stop being assholes that only care about their Christmas present "}, {"id": "ecjhde9", "author": "questionablemention", "body": "Probably the strangest and most off putting post & username combo that I’ve ever seen "}, {"id": "ecjhkta", "author": "BipolarMillennial", "body": "What. A. Guy. "}, {"id": "ecjkvew", "author": "lisabutz", "body": "THIS is what will make America great again."}, {"id": "ecjlzba", "author": "Riptide1737", "body": "I don’t know this guys economic status, but a lot of bus drivers work another, better paying job. For example, my bus driver through middle and high school was a realtor who made some pretty good money and only showed homes while we were in school. He originally started because he wanted to make sure his daughter got to school safely but just loved the kids so he kept doing it. \n\nHe would do similar stuff for kids on our bus whenever they graduated. Pretty cool guy"}, {"id": "ecjm2yw", "author": "Beer-_-Belly", "body": "Good on him.   If you want to donate $ to a charity, find someone doing something like this and hand them cash.  100% will go to the cause, not 40% like most charities. "}, {"id": "ecjm30l", "author": "REDDIT-UR-DRUNK", "body": "Christmas/Holiday spirit and humanity restored."}]}