{"id": "a9jiea", "title": "My dad got me right in the feels today with a wallet", "url": "https://i.redd.it/bjsw1ttxgi621.jpg", "subreddit": "pics", "author": "Mal_Reynolds84", "text": "", "comments": [{"id": "eck1gcj", "author": "ech-o", "body": "This is my first Christmas without my dad. Would literally give anything for 5 more minutes with him. \n\nEnjoy your time with the old man OP. "}, {"id": "ecjytjk", "author": "UnPhayzable", "body": "This is perfect for broke college students. Every time you realize you got an empty wallet, you can always read this message and smile "}, {"id": "ecjxx7w", "author": "Maluberries", "body": "This is something that you should hand down to your own son; the start of a beautiful tradition."}, {"id": "ecjyfy6", "author": "MattyFatDabs", "body": "I lost my Dad yesterday, please make sure he knows how special he is to you as well.\n\n\nEdit: would also like to add that he’s an organ donor who will be saving at least two, possibly three other lives. Pops gets to go out like he lived, as a hero."}, {"id": "eck1zqm", "author": "Clowens", "body": "Oof, suddenly my mom’s personalized wallet feels a little less special.\n\n[Oops](http://imgur.com/05q3YwR) "}, {"id": "eck5p1y", "author": "Mal_Reynolds84", "body": "Thanks for all the love on this guys. I didn't think so many people would like it. \n\nYes the message is a generic one, but I know that he means those words. He's had a lot of health issue the past several years and I'm not sure how much time he has left, so that just makes it mean even more I think."}, {"id": "eck1tl4", "author": "NotSoGreatCourier", "body": "I’m just going to say this, cherish every moment you have with him, cherish every moment you have with all your friends and family, because if you don’t, you’ll realize you should’ve when their gone, and you never know when they’ll go, be it tomorrow, or next week, or in 20 years, cherish every moment.  I lost my dad to cancer 8 years ago, and I lost my friend to a car crash 3 years ago, and I’m still kicking myself for not cherishing those moments, cherish everything"}, {"id": "eck8qvg", "author": "lovelyleslee", "body": "Lobster 2.0 Font. "}, {"id": "eck6dcz", "author": "chocolate_sprinkles_", "body": "Ha, everyone getting the same wallet. *I* got the same message - [but on a watch](https://imgur.com/gallery/Mcr8ixb)"}, {"id": "eck54bn", "author": "analterrror69", "body": "I got a wallet with the same inscription today as well! "}, {"id": "eck4zn0", "author": "Deckard_Pain", "body": "Instagram hits me with ads for these, constantly."}, {"id": "eck1a2l", "author": "MolokoMixer", "body": "Hey my dad loves me too! My dad gave me a watch for Christmas with the exact same message engraved. Lol. Such a dad thing. I figured the message was recommended from the engraving company. It still means a lot to me. "}, {"id": "eck9cyu", "author": "rawzon", "body": "Wonder how many other dad's got their sons that same generic wallet."}, {"id": "eckd3o3", "author": "whoolzyourdaddy", "body": "This made me tear up. We are taking my dad off life support essentially tomorrow. He put up a month long fight against viruses and rejection from his double lung transplant. He had the transplant 2+ years ago, but his body just gave out the past few weeks.\n\nTreasure your time with your dad, he truly cares for you."}, {"id": "eck5z3y", "author": "Junior_tosh", "body": "Make sure to thank him for the karma, you dad-love-milking SOB."}, {"id": "eck7azv", "author": "Haakkon", "body": "What’s having a dad that’s not a piece of shit like?"}, {"id": "eck5ymj", "author": "imfromda806", "body": "As a dude with no dad, don’t ever take him for granted and tell him you love him too. Stuff like this makes me happy for people who are for blessed enough to have a dad that cares and loves them. <3 "}, {"id": "eck81xq", "author": "Dawkinsisgod", "body": "Does it say \"Bad Motherfucker\" on the front?"}, {"id": "eck3xfg", "author": "APhoneBooth", "body": "That's awesome my mom gave my brother and I the same wallet today! Merry Christmas dude!"}, {"id": "eck6320", "author": "tctown", "body": "The most Facebook post I’ve ever seen on Reddit. "}, {"id": "eck5y5b", "author": "usehernamelike", "body": "My dad gave me a bracelet with the exact same inscription. Who cares that they weren’t his words, they are still the words he picked to give to me."}, {"id": "eck6f81", "author": "InvertedLook", "body": "Man who ever finds your wallet at the bar is going to cry"}, {"id": "eckdzoj", "author": "Azioth", "body": "FU man, Last week I lost my 61 yo father due to a sudden cardit arrest. Do me a favor, give ur dad a big hug and tell him how much you love him, will ya?"}, {"id": "eck13mw", "author": "hawaiifive0h", "body": "Facebook "}, {"id": "eck8r5n", "author": "danhastheplan93", "body": "Makes you think twice when putting a drug baggie in your wallet"}, {"id": "eck1sg0", "author": "seshelton", "body": "I hope you find your dad, buddy. "}, {"id": "eck9ghc", "author": "TurdManMcDooDoo", "body": "My dad died 3 years ago, then I soon became a dad myself. After a long, emotional day this has made my eyes all watery. "}, {"id": "ecjxvx3", "author": "DunkelDunkel", "body": "They sell these at the corner gas station.  I think he just got you a last minute gift."}, {"id": "eckg0uc", "author": "Criticalmak", "body": "What a load of drivel."}, {"id": "ecjwe1r", "author": "capt9859", "body": "Dang bro, you won"}, {"id": "eck8mju", "author": "thinline788", "body": "Congrats on having a great Dad!\n\nRemember to spend time with him while you can. \n\nTake care and have a Merry Christmas."}, {"id": "eck8tua", "author": "YarsJaggerin", "body": "I'm only 21 right now but my goal since as long as I can remember has been to be a good dad. I want to start a family very soon. I'm gonna be the best fucking dad out there. The world isn't ready for my dadness. "}, {"id": "eckaad9", "author": "iamianyouarenot", "body": "[Me too, buddy](https://imgur.com/gallery/JOUW4nv)"}, {"id": "eckdsmj", "author": "Fartikus", "body": "[Reminds me so much of this. Man I love Dads.](https://www.homestuck.com/story/3395)"}, {"id": "eckfphl", "author": "Robaschi", "body": "I have flashbacks to Homestuck... still, I consider this a great gift to receive from a parent."}, {"id": "eckr7bn", "author": "RedHelvetica", "body": "Lobster though? 🤔😣"}, {"id": "eckul0t", "author": "heart3ele", "body": "I feel like this same thing was in act 1 of Homestuck...\n\nNice, though."}, {"id": "eclotrx", "author": "AeriaGlorisHimself", "body": "I always wondered what it would be like to have an actual family and people that care for you"}, {"id": "ecndigv", "author": "Xenofontee", "body": "ok i’m crying. "}, {"id": "ecndxtb", "author": "inacomicbook", "body": "Oh dear, for a second day running tears are flowing 😢"}, {"id": "ect4alb", "author": "rsn1990", "body": "I’m not crying. You’re crying. "}, {"id": "ecxqnc5", "author": "JHarrison1980", "body": "Lost my Dad in July 2017. I would give anything to call the house and hear his voice one more time. Enjoy your time with your Dad OP."}, {"id": "eck71d2", "author": "Semanticss", "body": "Corny as shit. Reads like a stupid fb text image. I would roll my eyes out of my skull if my dad tried giving me something like this. But he knows better."}, {"id": "eck99zr", "author": "Overlandtraveler", "body": "#boughtatagasstation"}, {"id": "eck6ani", "author": "DomesticApe23", "body": "If you have deep emotional reactions to Hallmark card greetings you may wish to see your doctor about a mood stabiliser."}, {"id": "ecjyanh", "author": "kotkaiser", "body": "Yeah? Well, my psychiatrist patted me on the back the other day, so...."}, {"id": "eckdnaj", "author": "loves2spooge2018", "body": "Gaaaayyy"}, {"id": "ecka6l1", "author": "xwingx", "body": "My dad hung himself and didnt leave any note for me, my stepmother took all the thing. I just dont care, i want him back."}, {"id": "eckamvt", "author": "TigerSharkFist", "body": "Don't lose your wallet, OP"}, {"id": "eckb3dl", "author": "mrnalisa", "body": "If anyone ever swipes this wallet their gonna feel like such an asshole "}, {"id": "eckb7t6", "author": "HawaiianPunchRobot", "body": "Wow that’s pretty powerful stuff. This Christmas was the first without my dad. He passed in November. Treasure that relationship. "}, {"id": "eckcewh", "author": "bellevueunderground", "body": "Meh, a little too lovey dovey for me."}, {"id": "eckd7nq", "author": "OutlawGunslinger", "body": "Great line from Phenomenon."}, {"id": "eckdszg", "author": "Julia526", "body": "Judging by the font, my dad legit got me the same exact thing, just a different style wallet "}, {"id": "eckeg3t", "author": "iusedtobeanoctopus", "body": "What a coincidence. My mom gave me the same wallet, just the mom's version. Hit me pretty hard too. "}, {"id": "eckeg6y", "author": "mrkrimbo", "body": "Show us how this looks in like 20 years when it’s all worn in"}, {"id": "eckh2mz", "author": "WurdSmyth", "body": "Today I will become a plagiarist "}, {"id": "eckh4eb", "author": "zhohaq", "body": "On a dad wallet no less.Designed to carry wads of cash and a condom, we no longer need."}, {"id": "eckivm4", "author": "my_research_account", "body": "As a son whose dad passed away relatively recently, I suggest taking a bit better care of that wallet than usual. I would trade just about anything  for something like that."}, {"id": "eckko4o", "author": "Woodcutter69", "body": "I wish I had family that I felt this way about"}, {"id": "ecknxcc", "author": "IR0NxLEGEND", "body": "I got this same wallet for Christmas , thought it was custom .. ouch"}, {"id": "eckos3f", "author": "faustkenny", "body": "Daddy’s boy"}, {"id": "eckqy4n", "author": "wakka420", "body": "I wish I had a relationship like this with my dad."}, {"id": "eckrn7y", "author": "KweenOfKawaii", "body": "IM Not CRYINg bro ARE yoU??! "}, {"id": "eckual2", "author": "woody29", "body": "Wow, your Dad really knocked it out of the park. "}, {"id": "eckuq54", "author": "myoujou0", "body": "Why lobster tho."}, {"id": "eckusrs", "author": "pigonedragone", "body": "This makes me crying. I've been away from home for almost one year, missing my dad and mom."}, {"id": "eckuuti", "author": "dkfromthebk", "body": "“Enjoy the ride and never forget your way back home.”  Beautiful - I’m borrowing that."}, {"id": "eckux9e", "author": "Robhig007", "body": "Where you get this?? That’s awesome!! I want to buy one for my son??!! Thanks\n"}, {"id": "eckvd7f", "author": "abhijith332", "body": "Wow man you are lucky to have an awesome dad. Good for you"}, {"id": "eckvg33", "author": "Saber7777", "body": "Shit! this is deep"}, {"id": "eckvqi3", "author": "steven239", "body": "I cried...how? "}, {"id": "eckw6n6", "author": "admuh", "body": "Eew, Lobster "}, {"id": "eckxq4v", "author": "HetfieldJ", "body": "A perfect example of \"how to gain sympathy by advertising your emotions over social media\". \nIsn't that the same wallet we all saw in the FB ad? "}, {"id": "ecky2o8", "author": "Wiechu", "body": "My dad, after month of silence (we live in different cities)\n- hi. I can't log into facebooo.... how are you?\n- fine,dad. Fine."}, {"id": "eckyxon", "author": "MeMeSRLivfe", "body": "I am not crying ur crying "}, {"id": "eckz645", "author": "grimmtalker", "body": "Well now I miss my dad."}]}