{"id": "abixpi", "title": "After the beautiful NYE photos; workers who clean up all the mess after the party in Times Square deserve some respect too", "url": "https://i.redd.it/jm46azu9xt721.jpg", "subreddit": "pics", "author": "Lord-AG", "text": "", "comments": [{"id": "ed0l6xx", "author": "ogo_pogo", "body": "Imagine all the disgusting things left behind too, not just confetti..."}, {"id": "ed0m4rk", "author": "TooShiftyForYou", "body": "*New York City sanitation workers cleared out more than 57 tons of debris from Times Square after the New Year’s Eve festivities ended left by 1 million revelers from the crossroads of the world.*\n\nThat's a pretty huge overnight job. Good on these guys."}, {"id": "ed0lnha", "author": "foreverisclever", "body": "The already defeated look on the guy on the left. "}, {"id": "ed0m87y", "author": "KingNopeRope", "body": "Ya. After learning about the mass crush of people pissing and shitting on eachother. This is officially on my anti bucket list."}, {"id": "ed0jyji", "author": "ProblematicFeet", "body": "The real MVPs spending their New Year cleaning up other people’s trash and... who knows what else. Thanks, my dudes. \n\nEdit: This means they probs didn’t go out last night. Extra sacrifice :’-) "}, {"id": "ed0s8d6", "author": "bakedphilosopher", "body": "I'm DSNY, and I was out there cleaning 8th ave. We do make holiday time for working NYE. this is the greatest job in nyc and I'm proud to be a part of it. It's also really nice to see some love towards us. \n\nEdit: I will add. Its actually really amazing to be part of the nye clean up, I don't spend nye drunk. But in a way I get to enjoy the festivities."}, {"id": "ed0lb6o", "author": "0p3nyourm1nd", "body": "Thank you for recognizing all the hard work people like this do. We never seem to notice all the effort that goes into making things run smoothly in the background. "}, {"id": "ed0mmua", "author": "TailwindsFoxy", "body": "I’ve heard that there’s very few bathrooms open to the public too. You know there’s gotta be piss and vomit everywhere too"}, {"id": "ed0lxqd", "author": "TooShiftyForYou", "body": "These are the workers that should be appreciated more on a daily basis."}, {"id": "ed0n62x", "author": "El_Eleventh", "body": "Those are some serious brooms. Nice. "}, {"id": "ed0tmch", "author": "brickplate", "body": "DSNY is no joke. That’s why they’re called “New York’s Strongest.”  If they were in charge of cleaning up subway stations too those stations would be spit-polish clean. "}, {"id": "ed0n8eo", "author": "LeBastardHead", "body": "Those are sanitation workers; they are making bank with OT pay here. It’s awesome to respect them and all, but I’d be willing to bet that they are happier about the 2.5x or more pay increase."}, {"id": "ed0xx4x", "author": "Enemy_Zero", "body": "I used to do overnight cleanup from NYE in Las Vegas for a big hotel/casino there. I actually loved doing it and looked forward to it as it was just funny most of the time. I would show up at 2am to start cleanup and mostly involved throwing any large trash into the street for the large sweepers to pick up and taking down fence and throwing it onto a truck. It was a big night for people watching.  Biggest observations from the nights:\n\n- You constantly get hit on by drunk people even though they see you in uniform. Men and women alike.\n\n- the amount of naked people is impressive every year. You think you've seen it all and then some naked woman dances in a fountain. \n\n- Yes, there are large amounts of pee, poop and vomit on the streets and sidewalks and it's always staggering the amount of women that are carrying their uncomfortable club shoes and walking barefoot through it down the strip. \n\n- Fights are constantly happening. Between everyone and the police are quick to step in and come from out of nowhere. It's pretty amazing to see. They have a handle on it almost immediately and are quick to pull a shirt up over your head from the front almost like a hockey fight. It's super quick to diffuse the situation. \n\n- I still don't know the reason why but the thing that always got me was the unbelievable amount of baby strollers you'd find discarded. We're not just talking about the cheap, fold up type but the 100+ dollar Graco type ones. They're always mangled and you just look in horror at it wondering where the baby is, whether it's safe and what kind of terrible parent brings a baby to New year's Eve on the Las Vegas Strip? I've personally thrown a LOT of them into the street for the sweepers to collect. \n\nAll in all, I have to hand it to the police and city cleanup crews, they move through quick and clean up fast. I worked out there for almost 10 years and only saw 1 death on a night I was there as a civilian for 99/00 (man climbed a pole in front of Bellagio and grabbed power lines. Since then, most strip properties actually have poles removed from the front of their properties weeks before NYE) and haven't seen any real injuries. Hats off to the people that are part of the cleanup every year. It's hard work and you're exhausted afterward but it's unlike any other night of work you'll ever be a part of. "}, {"id": "ed0td3x", "author": "thebombasticdotcom", "body": "Shout to the hard workers who keep the world turning while others are burning it down! "}, {"id": "ed0mz81", "author": "Covenantkiller342", "body": "And here I thought that the janitors in the roller coaster tycoon games had unrealistically large brooms... I was wrong"}, {"id": "ed0qnjp", "author": "Ry-Bread01256", "body": "The real MVPs take pictures of other people working and talk about what they are doing all for the karma."}, {"id": "ed0t2rv", "author": "strangenessandcharm7", "body": "Am I the only one who thought this looked like the part of a musical where people bust out into song and choreographed dance during a random task?"}, {"id": "ed0rqmo", "author": "effennekappa", "body": "/r/ZeroWaste is having a seizure"}, {"id": "ed0l1c6", "author": "silverbullet52", "body": "I'm sure they're crying all the way to the bank.  C'mon, city workers, night shift on a holiday?"}, {"id": "ed0npfx", "author": "idgafpb", "body": "Sure they do, just like ever other human being, but this my friend is called a job.  You get paid to do it.  "}, {"id": "ed0onue", "author": "Homebruise", "body": "Basically, respect people who have jobs."}, {"id": "ed16qnp", "author": "REEEEEEEsist1776", "body": "[Kinda reminds me of the trash left over after the woman's march and the climate march. ](https://imgur.com/gallery/7vhSFfK)"}, {"id": "ed0of9o", "author": "23x3", "body": "Those sweeper brooms are straight for the 40s"}, {"id": "ed0rqnk", "author": "Ssme812", "body": "I wonder how many people lost/dropped there phones that morning"}, {"id": "ed0s6jw", "author": "Donamole", "body": "I hate those brooms "}, {"id": "ed0s7z9", "author": "GatorRich", "body": "I saw these guys in the musical STOMP, they were mesmerizing. Hold up, I’m being told these are just sanitation engineers. "}, {"id": "ed0t8cn", "author": "Astyanax1", "body": "Based on the article about people wearing diapers there, those guys are the biggest heroes that city has.  Sorry NYFD"}, {"id": "ed0t8i9", "author": "Lorinar", "body": "I used to work as a grounds cleaner at a major theme park. It had a concert venue for special events, and whenever there was a concert held there we had to stay late to clean up after (usually there till after midnight after an already long day cleaning the park). In some rare cases, a concert ended with shooting a confetti cannon. When that happened, it guaranteed at least an extra 1-2 hours or work cleaning up.\n\nMy experience there taught me this: screw anybody who shoots/throws confetti or glitter and doesn't clean up after themselves.  No quarter shall be given."}, {"id": "ed0tpxr", "author": "cgntvdissonance", "body": "The ones who clean up definitely deserve more respect than the ones who mess up. Goes for life too. "}, {"id": "ed1b2du", "author": "walshk8", "body": "I've watched these guys in action after some of the parades and stuff. They're the seal team six of sanitation workers. Mad props"}, {"id": "ed0pakj", "author": "ndc233", "body": "They’re probably getting $80+ an hour to clean all that up. I’d do it. "}, {"id": "ed0p05x", "author": "Johnny3_sb", "body": "Uhh... and bars all over the damn country. They’re probably getting paid a lot less, too."}, {"id": "ed0tpg9", "author": "Braavosassasin", "body": "People in this thread *really* make me appreciate my job"}, {"id": "ed0ouew", "author": "PTKFVK", "body": "is all that litter worth having people spend the entire night cleaning up after everyone else celebrates a holiday?"}, {"id": "ed0tk79", "author": "plantyourself", "body": "Millions of pieces of plastic confetti free falling through the air in New York City? Shout out to these guys for doing their part and cleaning this waste up. Much of this plastic will end up in the ocean off the coast, and polluted around the planet for centuries to come. The planet deserves some respect too for constantly putting up with poor human designs. \n\nIn 2019 we use compostable confetti! "}, {"id": "ed0qams", "author": "jrells", "body": "We all appreciate their hard work. But let’s remember that they get paid and WANT to do it. Nobody is forcing them, that is their job."}, {"id": "ed0rvs9", "author": "jakenjoi", "body": "I want to see pictures of all the adult diapers.\n\nThat's all I could think about last night anytime anyone had to use the restroom. Thanks Reddit!\n\n*If this was New York, they would all have dirty diapers*"}, {"id": "ed0s1ez", "author": "SubieDom", "body": "Those brooms are ridiculously massive. "}, {"id": "ed0s1py", "author": "DwightsPerfectCrime", "body": "I’d wait til the confetti was done falling personally "}, {"id": "ed0s5ak", "author": "TheRarestSeal", "body": "I'd like to see a time-lapse of times square from the start of December 30th to the end of Jan 1st"}, {"id": "ed0tim6", "author": "youngfootsteps", "body": "People clean up garbage in NYC?"}, {"id": "ed0tnf1", "author": "Rocko210", "body": "Surprisingly, pretty much every major city has this. People get wasted, drunk, party, etc. every weekend and workers are hired to clean up the streets the next day "}, {"id": "ed0vawp", "author": "dinklberg1990", "body": "Standing in place for 12 hours pissing and shitting on myself just doesn't sound appealing to me. I'd rather get drunk at home lol"}, {"id": "ed0vk0t", "author": "nacho78", "body": "These people have a good salary, pension and healthcare.  They're better off than most in this country.  Everyone deserves respect not just these People that have a damn good paying job. "}, {"id": "ed0z7uy", "author": "wonderboi_777", "body": "plus $50/Hours bonus on top of check."}, {"id": "ed11plu", "author": "HypergaMouse", "body": "Having worked on NYE as a bartender last night after having celebrated every previous one, I can really appreciate those who work to make it happen. It's a two way street. "}, {"id": "ed1brr5", "author": "Philac718", "body": "Just thought of Disney’s next sequel: Mary Poppins: Maid in Manhattan"}, {"id": "ed1cc6w", "author": "jammydodgehim", "body": "Amen! Thank you!\n\nI was in Primrose Hill to celebrate NYE and it's disgusting how people can feel so entitled that they would just leave their rubbish everywhere. \n\nCleaners, you da real MVP"}, {"id": "ed27dhh", "author": "mrjimi16", "body": "These posts, and the general sentiment, are kind of weird to me. It's their job. They get paid to do this. When they are done, people give them money. They aren't there because they are a bunch of cool dudes on a mission to keep the city clean, they are a bunch of probably cool dudes on a mission to support their families, or at least themselves. There was a guy at my work going around thanking all of us for working on the 26th. Obviously I said thanks, but I'm not there so he can come get a pint while he grabs some chips or whatever, I'm there because I work 5 days a week to feed my family. Just my two cents."}, {"id": "ed0p09x", "author": "marthirial2", "body": "What do you mean \"deserve some respect too\" ?  As far as I know nobody is disrespecting them, specially while doing their job.  Maybe  you think appreciation means the same as respect, which means you are not providing either."}, {"id": "ed0rfs8", "author": "OlStickInTheMud", "body": "So much grabage for such a fleeting moment."}, {"id": "ed0qqut", "author": "DunamisBlack", "body": "I mean they signed up for this right? They shouldn't be disrespected but I am not going to go out of my way to respect a janitor for signing up to be a janitor ffs"}, {"id": "ed0qv71", "author": "Hirronimus", "body": "Respect? For doing their jobs?  Good wages and pension.  Sure, I'll \"respect\" the shit out of them with my tax dollars.\n\nBring on the downvotes."}, {"id": "ed0ukqz", "author": "OurBrainOnDrugs", "body": "Oh my sweet baby fuck I cant believe all the boring ass, discourteous people on this thread trying to apply logic to what is literally a post appreciating someone.  Yes it is their job, yes they are paid, yes they probably asked for it, but oh my god they do it so thousands can get merrily fucked up and forget about it. SHOW SOME DAMN LOVE. "}, {"id": "ed0me13", "author": "Rekdon", "body": "Man this some bullshit"}, {"id": "ed0xspq", "author": "SlickL7690", "body": "I don't think anyone is disrespecting them? Do you mean recognition? Lol I guess upvotes means respect"}, {"id": "ed0og41", "author": "marthmagic", "body": "I am all for appreciation and respect for all the jobs that cobtribute to society. \n\nEspecially tough and underpaid ones. \n\nBut on the other hand, the trash creates jobs. It creates work they can be payed to do.\n\nThis picture that is painted here in the comment section of the uncivilised horrible people that party all night. Is a bit one sided imo. \n\nYes our economy is absurd. But that makes it so people profit from having stuff to clean. "}, {"id": "ed0nxtm", "author": "donkeyDPpuncher", "body": "Do they get paid?"}, {"id": "ed0qlm8", "author": "zoidbender", "body": "Respect? What?\n\nWhy? They're paid to do that. "}, {"id": "ed0k4e6", "author": "memeasaurus", "body": "They make New Year's day rockin! Thanks you unsung heroes of the night!"}, {"id": "ed0mepa", "author": "bumjiggy", "body": "NYE MVP TTFN"}, {"id": "ed0sv7g", "author": "MyCommentIs27", "body": "I read on Reddit that people are locked in place for 12 hours and children go in the streets, where is the picture of them cleaning poop and pee of the streets?"}, {"id": "ed0s9xw", "author": "leonardugo", "body": "Dude they get paid to do that. It's not a favor "}, {"id": "ed0tdzw", "author": "Sanderanders", "body": "No disrespect meant, because these are hardworking citizens. But: Why do they deserve extra respect. I mean, this is just regalur and paid work, isn’t it?\n\n"}, {"id": "ed0qa8f", "author": "sanford8645", "body": "And for that brief second, the streets of New York were clean. "}, {"id": "ed0qjrq", "author": "dispelthemyth", "body": "\"Cant someone else do it?\""}, {"id": "ed0qyqm", "author": "slimy_lime", "body": "Wet confetti has got to be the worst. Other then used adult diapers "}, {"id": "ed0qzsa", "author": "geek_blast", "body": "How many upvotes can our boys in Neon get "}, {"id": "ed0r0z7", "author": "RealWakandaDPRK", "body": "Workers of the world unite"}, {"id": "ed0reiv", "author": "thedzer", "body": "I was in NYC for New Years Eve in 2008. Not for the ball drop, but to visit some college friends for a party at their apartment. We walked through the area to check it out a few hours before. It was only around 8pm, and I had no idea how people got out of that nonsense to use the bathroom. \n\n\n\nAnd then I saw it. People were just pissing on the ground. I always thought it would be kind of cool to say I’ve watched the ball drop once.. until that moment."}, {"id": "ed0rro4", "author": "Cakelord", "body": "They do. We treat ourselves on NYE but they make it happen. Except they see a spec of the rewards."}, {"id": "ed0ru0a", "author": "sryidc", "body": "All that wet confetti was grossing me out, also the thought of all those people pooping themselves."}, {"id": "ed0srev", "author": "chickeeper", "body": "As a fellow cleaner upper after events I hope they paid them well.  I know we get paid after 4th of July"}, {"id": "ed0stjw", "author": "ahhter", "body": "Any broom experts know why the bristles are so much longer than a standard push broom? "}, {"id": "ed0sy32", "author": "PoopInTheOcean", "body": "i wonder how many of those confetti get stuck somewhere and never gets found again. "}, {"id": "ed0t023", "author": "dontwastebacon", "body": "On one hand humanity fights against unecessary trash and on the other hand humaity celebrates by throwing around trash. Awesome."}, {"id": "ed0t1o3", "author": "BryantCabrera", "body": "Props to them!"}, {"id": "ed0t2h8", "author": "faceoftheancients", "body": "I wonder how long until all the confetti is banned because it's so wasteful."}, {"id": "ed0t60z", "author": "Jaexyn", "body": "Urine/feces/alcohol-soaked confetti...fun."}, {"id": "ed0te4t", "author": "CriticalEscapeBike", "body": "*(It's a shame someone hasn't invented some kind of industrial vacuum type device for this type of work.  I wonder if that's even technically feasible).*"}, {"id": "ed0tfph", "author": "eff50", "body": "I was watching the fireworks at Frankfurt yesterday. About 30 mins after 12, the entire mass of people started to move off the bridges and head towards the subway/railways stations. The mess left behind was incredible. Eitherways, Germany goes a bit crazy with New year fireworks, entire sections of the city look like a warzone, lol. Its tons of fun though.  \n\n\nBut as I was walking back to the station I noticed an army of mechanised road sweeper/street sweepers ready and standing by, with their hazards on. At 12:30 on a New Year's night! Also the many police patrol vans, Ambulances etc who were wizzing around the city, dealing what I guess, a lot of crazy/stupid shit."}, {"id": "ed0tn8k", "author": "revolution1solution", "body": "Fuc, that's the day you dread."}, {"id": "ed0tr9a", "author": "sagginapples", "body": "Get that overtime, boys! "}, {"id": "ed0u029", "author": "Aqua7KH", "body": "As someone who used to work cleanup after concerts at a stadium, they don’t pay us shit lol"}, {"id": "ed0uu4t", "author": "Keggyswags", "body": "Working as a cop in Times Square I can say the worst thing is watching the people run into the street to grab the piled confetti that was just cleaned up and throw it in the air for a photo op. The sanitation workers have been working for hours and aren't going home until everything is re-cleaned now"}, {"id": "ed0uz16", "author": "Pedro_North", "body": "Trash men in NYC make over 100k per year. Good for them. "}, {"id": "ed0vikg", "author": "Srock9", "body": "r/trashy to see how bad the mess actually is."}, {"id": "ed0vjk5", "author": "i_am_jordan_b", "body": "Just left there this morning. The amount of trash is staggering. "}, {"id": "ed0vkwa", "author": "BoringPersonAMA", "body": "Glitter and confetti should be fucking banned. "}, {"id": "ed0vsmj", "author": "notcooldeathpacito", "body": "Press F to pay respects"}]}