{"id": "abx582", "title": "My parents denied me vaccinations as a child. Today, I was finally able to take my health into my own hands!", "url": "https://i.redd.it/moxiw9och2821.jpg", "subreddit": "pics", "author": "ToddmanHorseboy", "text": "", "comments": [{"id": "ed42svu", "author": "adeadhead", "body": "Wow, the reports on this post have some [wild accusations](https://i.imgur.com/H7ZL596.jpg). We get it, big pharma is stealth advertising on Reddit. \n\n-----\n\nThis post does not break any rules, and vaccinations are not bad. \n\nYou may now return to your regularly scheduled shitposting. \n\n\n\nEdit: OP is doing an [AMA](https://www.reddit.com/r/IAmA/comments/ac06c3/my_parents_denied_me_vaccinations_as_a_child/). Check it out. Or don't, I'm not your mom. "}, {"id": "ed3qdab", "author": "strangedigital", "body": "My parents was the opposite. They never kept health records, and every time a school wants vaccination records, I get a new series of shots. We moved often.\n\nLast time it was for college, after that I took over my own health records. Then the army also gave me additional shots.\n\nSo I am probably the most vaccinated man ever."}, {"id": "ed3p7mn", "author": "mashedp55", "body": "The struggle is real with writing 2018 in 2019. "}, {"id": "ed3rm6u", "author": "spilk", "body": "That's awesome that there's a chickenpox vaccine now. When I was young, if one kid caught it in the neighborhood everyone else would try to get their kids to catch it so they could \"get it over with\""}, {"id": "ed3nx0u", "author": "mpjx", "body": "Saw your post on r/nostupidquestions yesterday, glad you were able to get them done! Hope they weren’t too bad "}, {"id": "ed3md6m", "author": "streamstroller", "body": "How were you able to type this with all of your new autism? ^I ^^am ^^^obviously ^^^^kidding."}, {"id": "ed3krvs", "author": "SausageMcWonderpants", "body": "Congratulations for living long enough to get vaccinated. "}, {"id": "ed3qu5j", "author": "okiedokieKay", "body": "Sooo, how’d you start the process? I want to get vaccinated but been a bit nervous.... did you just call up your regular doctor and say you’re not vaccinated and want to be? How many appointments would it take to be completely caught up? Do they need a 2nd round or are you good to go after 1 dose?"}, {"id": "ed3mgqj", "author": "Natethegreat9999", "body": "Vaccines cause adults"}, {"id": "ed3m3h9", "author": "ZZZ_123", "body": "Irreconcilable Differences 2: Vaccination Boogaloo"}, {"id": "ed3s6qd", "author": "TriniAsh", "body": "Today I took my 2 month old for his first round of vaccines. He's having a tough time with the side effects right now but I know it's worth it.\n\nI'm from a developing country in the Caribbean. We have a lot of societal issues but I'm thankful that we prioritize vaccinating our children.\n\n Medicine has progressed to the point where infant mortality rates are fractions of what they were even 30 years ago. \n\nI refuse to risk the resurgence of diseases like mumps and measles. Parents, for the good of the individual and the collective vaccinate your children."}, {"id": "ed3nmft", "author": "phooka", "body": "Hmm. I haven't had any vaccines since I was maybe 12 years old.  I am now 52. I wonder if I should do something about that?  (seriously)"}, {"id": "ed3ts8c", "author": "drob2094", "body": "This is a friendly reminder to set your pens forward to 2019. "}, {"id": "ed3rq4l", "author": "FireandBloodandStuff", "body": "My brother and I went to live with our grandma when we were 13 and 10 respectively. We were taken out of catholic school, put in public school where vaccines were mandatory, and now we aren’t dead. It’s lovely. "}, {"id": "ed3tpn7", "author": "HumunculiTzu", "body": "As someone who has had 2 heart transplants and cancer, and thus have a suppressed immune system and can't get all my vaccines, thank you for helping prevent people like me from dieing from preventable diseases.\n\nEdit: forgot to add prevent from \"help people like me\""}, {"id": "ed3ptou", "author": "d_rickards", "body": "Congratulations.  \n\n\nIt drives me absolutely insane that in Ontario (Canada) we still use this stupid paper form to track immunizations."}, {"id": "ed3rmq5", "author": "Skippylu", "body": "Wait you can get vaccinated for chickenpox? I was made to go to 'chickenpox parties' when I was a kid!!! "}, {"id": "ed3qi6d", "author": "wraith_havoc", "body": "I love how the person who filled the form made the 2018/9 boo-boo. "}, {"id": "ed3x17p", "author": "its-ya-boi-uhhh", "body": "In Canada, you’re allowed to go see a doctor without your parents at age 14"}, {"id": "ed3on2e", "author": "barcaloco", "body": "Thank you for caring about the rest of humanity and congratulations on getting vaccinated. I hope the shots didn't hurt too much and that you don't have any crummy side effects."}, {"id": "ed3py5c", "author": "baddoggg", "body": "Are you feeling more or less autistic?"}, {"id": "ed3tii2", "author": "tethercat", "body": "I am a grown adult man who is immunocompromised.\n\nI personally thank you with all sincerity for doing this.\n\nThank you."}, {"id": "ed45rv2", "author": "joeyo1423", "body": "So did you become autistic immediately after or is it slowly creeping on? Did the doctors tell you how long you have before you melt into an amorphous blob due to all the chemicals?"}, {"id": "ed3vohh", "author": "Elyam", "body": "Also, it is worth knowing that dinosaurs were not around 5,000 years ago. Just in case they were trying to \"teach\" you that too.\n\n"}, {"id": "ed3spfu", "author": "JunkofGunk", "body": "Love it! I am a single father who is taking his sons health into his hands very soon by scheduling his vaccines because his mom is an idiot and didn’t want him vaccinated. He’s ALWAYS sick and has no immune system. Let me tell you right now people...ESSENTIAL OILS ARE NOT A REPLACEMENT FOR VACCINES!!! My son is living proof!! Also children can have allergies to some oils and they can really mess them up. This is all information I have gathered by watching my son live it, not information gathered from social media posts. "}, {"id": "ed3p360", "author": "ilovetotour", "body": "I’m so glad you got the HPV vaccine! SO many people are unaware of it or simply don’t bother with it. "}, {"id": "ed43cl6", "author": "partypooperpuppy", "body": "Wow, kids who were born in the antivaxxing movement are now old enough to get vaccinated."}, {"id": "ed3tmco", "author": "kantical", "body": "Not only are you taking your health into your own hands, but you are also helping protect others (infants and the elderly) at the same time.  Good for you!"}, {"id": "ed3q5qr", "author": "XCypher73", "body": "I misread the title as \"vacations\" and was very confused. "}, {"id": "ed3m67m", "author": "BOBfrkinSAGET", "body": "Good for you! Have you told your parents and if so, how do they feel about it?"}, {"id": "ed44atj", "author": "Bosticles", "body": "ITT: people who actually believe that the products that *literally every doctor on Earth* already recommends be used on *literally every human being on Earth* somehow needs this weird round about stealth marketing to promote their products. It doesn't even fucking say a product name anywhere in the picture!\n\nCome the fuck on, people.\n\n"}, {"id": "ed40684", "author": "Noobkakka1234", "body": "when the anti vaxxer kid lives long enough to get vaccinations for himself  \n\n\n**That wasnt part of my plan**"}, {"id": "ed3yqhq", "author": "bubbletrollbutt", "body": "My sons have all the shots.  My oldest we know is on the spectrum but that’s not because of the shots. Plus I wouldn’t change him for the world. He is a hoot. Happy and healthy. I am glad you got your shots. "}, {"id": "ed46ob6", "author": "DadGoneGamer", "body": "\"Go ahead and get vaccinated, then. Don't come crying to us when you develop autism and the government controls your thoughts.\"\n\n-Mom and dad, probably"}, {"id": "ed43zwk", "author": "Madoff_Hitler420", "body": "Welcome to the club you now autistic son of a bitch"}, {"id": "ed4472q", "author": "MrCheapskate_toyou", "body": "My mother vaccinated me as a baby and child. Now I am obese and balding. I will now, (hopefully) die of old age instead of a vaccine preventable disease. Thanks, Omama. "}, {"id": "ed3t7i4", "author": "AlcroAsterion", "body": "My parents also denied me of free vaccination program as a kid.\n\nNo vaccinations against tetanus, Mpr measles etc :(\n\nI have to now collect money to take those shots as adult since it's not free anymore. But atleast I knew now this year that I have no vacations due to random check at the archieve of the town I grew up in. "}, {"id": "ed3rtxa", "author": "moe417", "body": "The most impressive thing about this is that the nurse/doctor only messed up the year once. "}, {"id": "ed3t2uu", "author": "_________FU_________", "body": "Nows your chance to mess with them. Slowly act more autistic around them to make them think they actually did make you autistic."}, {"id": "ed3uksi", "author": "alsoaprettybigdeal", "body": "I love seeing all of the posts of people getting vaccinated as a new adults in charge of their health. I’m also super excited to see the mental gymnastics anti-vaxxers do to explain why none of you will get ADHD/Autism/Vaccine Injured from them. Have you told your parents what you’re doing?? "}, {"id": "ed42qka", "author": "chris1096", "body": "[OP leaving the doctor](https://gfycat.com/diligentflawlessdorking)"}, {"id": "ed3rgq8", "author": "TwoHeadedCactus", "body": "I like how you can tell it was the Doctor's first time writing 1/1/19. They almost put 1/1/18!\n\nGets me every year, too :/"}, {"id": "ed3rm46", "author": "Pistachio269", "body": "I’m curious, what did your parents say when you told them you got vaccinated? Where they wholly against it and trying to stop you or were they supportive?"}, {"id": "ed40az0", "author": "animaguscat", "body": "My parents are anti-vax. Thankfully, me or my siblings have never been seriously sick but my parents did finally let me get a tetanus shot a few months ago."}, {"id": "ed3xthz", "author": "Username_Number_bot", "body": "This will probably get buried but way to go OP. My brother and I were both raised without vaccinations and while I made it well into adulthood just fine my brother almost died once around the age of 9 from pertussis. Unrelated but in the same vein about 4 yrs later he developed type 1 diabetes (which dad has). There's a [virus theory to the cause of IDDM (insulin dependent diabetes mellitus) that hypothesizes a childhood infection triggers the onset of IDDM.](https://invisiverse.wonderhowto.com/news/root-cause-type-1-diabetes-could-be-common-childhood-viral-infection-0175880/) \nTo this day my dad still makes a joke about how we survived, neither of us find that very funny. \n\nI just got vaccinated a year ago after realizing I had never received any of my vaccines. My parents used to use the religious exemption, despite our family being entirely and faithfully agnostic. "}, {"id": "ed3pbbl", "author": "The_SpellJammer", "body": "If your parents were correct, prepare to possibly be very good at math and really bad at body language! \n\nReally though, congrats man. "}, {"id": "ed3r6ql", "author": "shots4strangers", "body": "Two thumbs up for getting the HPV vaccine!"}, {"id": "ed3syle", "author": "wesarr", "body": "I’ll never forget when I went to college they asked to see my vaccination history. I had no idea what they were talking about. I asked my parents and they told me to find another school that had more progressive views. I found someone to act as my guardian. (Had to be 19 in my state at the time, I was 18) and I proceeded to take 8 shots. I then went to the same university. \n\nFeels good to know you’re protected!"}, {"id": "ed4fvuy", "author": "Super_SATA", "body": "This is the most shamelessly Reddit-esque circlejerk post I have ever seen on this subreddit ever, but I ain't even mad. The point needs to be drilled over and over:\n\nFuck anti-vaxxers."}, {"id": "ed3zaeg", "author": "kindamything", "body": "R. I. P. Your arm for about a week"}, {"id": "ed41iha", "author": "MightBeAProblem", "body": "Thank you for doing this! I have autoimmune disorders that make my vaccinations pretty much useless, and herd immunity allows me to survive without fearing these preventable diseases."}, {"id": "ed42nsa", "author": "chejrw", "body": "Oh man, that’s a lot all at once.  Your arms are going to feel like they are going to fall off tomorrow and don’t be surprised if you feel a bit generally shitty. TDaP in particular kicks my ass. \n\nGlad you are being a responsible adult though. By protecting yourself you’re protecting babies"}, {"id": "ed442ow", "author": "boringcarpets", "body": "Wait, what? Has anti vax really been a thing that long? enough for children to be adults now? Jesus"}, {"id": "ed4vzu6", "author": "why_not_both_bot", "body": "Annnnnnnnnnd... autism. \n\n/s"}, {"id": "ed3t1r2", "author": "FjohursLykkewe", "body": "Join the military, they give you a lifetimes worth of vaccines in like a month. "}, {"id": "ed4uplz", "author": "TechnoEquinox", "body": "OH BOY A VACCINE POST\n\n/./Sorts the posts by worst to best././\n\nLet's read the dumpster fire at the bottom!   ᕕ( ᐕ )ᕗ"}, {"id": "ed3uiou", "author": "MelPhil", "body": "As an RN, thank you! And congrats on your decision! "}, {"id": "ed3un3e", "author": "Halfobsidion", "body": "wish I could up-vote this twice"}, {"id": "ed3wzhe", "author": "Phlypp", "body": "When you get older (60+), consider a shingles vaccine also. Some people with shingles describe it as the worst pain they've ever had, including childbirth. "}, {"id": "ed3z8jm", "author": "IllstudyYOU", "body": "Proud of you. "}, {"id": "ed4041a", "author": "OracleOperator", "body": "I didnt receive alot of vaccinations according to the parent who raised me because at the time she wasn't my legal guardian. At 30 I wonder if i should still get them?"}, {"id": "ed43697", "author": "Blakey_2_go", "body": "I read Vacations and was trying to read all the places you plan to visit. Is Varicella in Italy?"}, {"id": "ed4x6s2", "author": "TinleyP", "body": "Their is a vaccination registry for those of you who can’t find your paper records, it might just eliminate having to start over."}, {"id": "eeh4c5j", "author": "IAmNotAReptile", "body": "congrats on helping eradicate diseases like measles! now all we need to do is to vaccinate 90% of Facebook"}, {"id": "ed3x476", "author": "pineapplepucker", "body": "Warms my heart to see that it is in fact possible to be raised by idiots and not turn out an idiot. "}]}