{"id": "aohpmo", "title": "Given that reddit just took a $150 million investment from a Chinese censorship powerhouse, I thought it would be nice to post this picture of \"Tank Man\" at Tienanmen Square before our new glorious overlords decide we cannot post it anymore.", "url": "https://i.redd.it/luk4bhymxbf21.jpg", "subreddit": "pics", "author": "FreeSpeechWarrior", "text": "", "comments": [{"id": "eg16n97", "author": "adeadhead", "body": "Hey friends, there are lots of discussions going on about free speech and all that. \n\nThis post is going to remain approved regardless, to avoid stifling that conversation. \n\nFor meta discussion, check out /r/outoftheloop and /r/undelete. "}, {"id": "eg0xyz2", "author": "SpunTheOne", "body": "Should post some tips and tricks to get around China's massive firewall as well."}, {"id": "eg12koe", "author": "Axelsouss", "body": "\nHere is a different angle of this iconic photo most people are familiar with.Tank man is in the top left.\n\n[https://i.imgur.com/j96yuT6.jpg](https://i.imgur.com/j96yuT6.jpg)\n\n&#x200B;"}, {"id": "eg0y66g", "author": "Animeniackinda", "body": "Can somebody post a pic of the real aftermath of the Tainanmen Square Massacre?"}, {"id": "eg11uuz", "author": "HeWhoMustNotBDpicted", "body": "People don't understand that ~~official~~ *credible* estimates are that 10,000+ civilians were killed.\n\n# 10,000.\n\nedit:\n\n[The death toll from the 1989 Tiananmen Square massacre was at least 10,000 people, killed by a Chinese army unit whose troops were likened to “primitives”, a secret British diplomatic cable alleged.  The newly declassified document, written little more than 24 hours after the massacre, gives a much higher death toll than the most commonly used estimates which only go up to about 3,000.](https://www.independent.co.uk/news/world/asia/tiananmen-square-massacre-death-toll-secret-cable-british-ambassador-1989-alan-donald-a8126461.html)\n\nedit2:\n\n[In 2014, however, it was reported that a confidential US government file quoted a Chinese military source as saying the Communist regime’s own internal assessment believed 10,454 people had been killed – a figure that would fit Sir Alan’s initial estimate.](https://www.independent.co.uk/news/world/asia/tiananmen-square-massacre-death-toll-secret-cable-british-ambassador-1989-alan-donald-a8126461.html)\n\nAlways upvote tank man.\n\nedit3:\n\nThank you for the silver and gold.\n\nControl of information is possibly the biggest overall threat to people from governments.  [**KNOW YOUR ENEMY**](https://www.youtube.com/watch?v=4smim2MNvF8)"}, {"id": "eg0ynnt", "author": "BigSchwartzzz", "body": "Perhaps we should start a sub now that tracks suspected Chinese censorship and influenced articles/posts? Call it /r/chinareddits? Tag it the same way people tag heilcorporate?"}, {"id": "eg0ykva", "author": "KevlarYarmulke", "body": "What Chinese censorship powerhouse has invested in reddit?"}, {"id": "eg11hz2", "author": "Dnlx5", "body": "!Remindme 1 year"}, {"id": "eg12czx", "author": "Elmauler", "body": "Imagine how the cold war would have ended if the soviet union had just been able to buy American companies."}, {"id": "eg11xy3", "author": "CubeCake", "body": "Better post any Winnie the Pooh related content now, before it's too late, as well."}, {"id": "eg10ugu", "author": "orange4boy", "body": "Your repost has resulted in a civil status demerit of 12 points. Your current civil status points are now below the threshold required for acceptable social status. Please report to the coordinator's office at Rehabilitation Center A-6288 for registration as soon as possible to avoid arrest and further demerit point allocations. Glory to our benevolent leader!"}, {"id": "eg0uzhr", "author": "FreeSpeechWarrior", "body": "Yes I blatantly copied the original post here:\n\nhttps://www.reddit.com/r/pics/comments/aofnuv/given_that_reddit_just_took_a_150_million/\n\nBy u/StopHavingAnOpinion\n\nThis one should follow all title guidelines as it accurately describes the picture."}, {"id": "eg11gt4", "author": "Miamifish", "body": "At the end Money Talks.  Aaron just turning in his grave "}, {"id": "eg13jjh", "author": "J_Charles_L", "body": "Aaron Swartz is rolling in his grave right now. Thanks for spitting on his grave by taking money from a major proponent of censorship."}, {"id": "eg11krm", "author": "irishfro", "body": "Sorry sir, that pic just cost you 12 citizen points."}, {"id": "eg12nlj", "author": "capoony147", "body": "Social media giants have become such shitty, evil entities. "}, {"id": "eg1ax4q", "author": "Gary-got-Aleppo", "body": "六四天安門事件 The Tiananmen Square protests of 1989 天安門大屠殺 The Tiananmen Square Massacre 反右派鬥爭 The Anti-Rightist Struggle 大躍進政策 The Great Leap Forward 文化大革命 The Great Proletarian Cultural Revolution 人權 Human Rights 民運 Democratization 自由 Freedom 獨立 Independence 多黨制 Multi-party system 民主 言論 思想 反共 反革命 抗議 運動 騷亂 暴亂 騷擾 擾亂 抗暴 平反 維權 示威游行 法輪功 Falun Dafa 李洪志 法輪大法 大法弟子 強制斷種 強制堕胎 民族淨化 人體實驗 胡耀邦 趙紫陽 魏京生 王丹 還政於民 和平演變 激流中國 北京之春 大紀元時報 九評論共産黨 獨裁 專制 壓制 統一 監視 鎮壓 迫害 侵略 掠奪 破壞 拷問 屠殺 肅清 活摘器官 黑社會 誘拐 買賣人口 遊進 走私 毒品 賣淫 春畫 賭博 六合彩 台灣 臺灣 Taiwan Formosa 中華民國 Republic of China 西藏 土伯特 唐古特 Tibet 達賴喇嘛 Dalai Lama 新疆維吾爾自治區 The Xinjiang Uyghur Autonomous Region 東突厥斯坦 反官倒 youxing 上街 动 宣言 运 绝食书 学潮 示威 罢课潮 暴动 民运 游行 26years 26周年 26年 二十六周年 二十六年 廿五周年 25years 25年 二十五年 25周年 25周年纪念 anniversary 24年 二十四 二十四周年 24周年 二十三 周年 廿三 22周年 十二个春秋 历史的伤口 天安门情人 缅怀 致敬 祭奠 晚会 勿忘 悼念 毋忘 祭 纪念 追思 默哀 平反 426＋四二六社论 四二六社论 June 4 屠杀＋四 535 6+si 631日 6four 8jiu liu4 six4 陆＋肆 6+4 8的平方 春夏之交 这一天 五月三十五 5月35日来 四＋开枪 64+屠杀 64+开枪 89 64+24 viiv 八的平方 己巳月+乙未日 hk64 特殊的日子 那天 35 63+1 65-1 6四 Jun+4th june six+four six四 八八 六+四 六4 陆四 明天 昨天 那年 今天 4 6 8 9 23 35 eight four nine six 三十五 九 八 六 四 捌 玖 肆 陆 五四+一个月 玖捌 bajiu liusi liu四 八玖 刘四 捌九 1989 8964 5月35日 8x8 八九 六四 六肆 陆肆 64事件 64学潮 64学运 64运动 六四事件 六四学潮 六四运动 六四学运 89+动乱 89事件 89学潮 89学运 89民运 89运动 八九学潮 八九学运 八九民运 八九运动 天下围城 碾 屠杀 镇压 戒严 学生＋1989 改革派 三角政治联盟 北高联 高自联 黄雀行动 学联 天安门母亲 学运 天安门母亲运动 Jonathan Mirsky＋网站 全民倒共 马云＋64 马云＋89 马云＋八九 马云＋六四 不适宜对外公开 敏感词 烛光 网络封锁 蜡烛 主义 小秘书 推特 政 民 火 烛 自治 血 黑衣 学生领袖 祖国母亲 广场上的热血 广场上的血 tank 坦 民主女神 坦克 坦克＋六月 tank man Wu er kai xi 习近平＋坦克 习近平＋言而无信 邓小平＋坦克 周锋锁 周封锁 邓屠夫 习+影帝 蟹农场 张先玲 艾晓明 司徒华 鲍朴 耀邦 胡总书记 胡赵 严家其 北岛 国家安全沙皇 翟伟民 袁木 邓力群 陈子明 韩东方 励之 方lizhi 方校长 li长春 封从德 月月鸟 lichangchun 乌尔 方励之 丁子霖 坦克人 江泽民 胡耀邦 吾尔开希 李鹏 柴玲 王丹 紫阳 赵总理 赵紫阳 ZZY 魏京生 占占点 占点占 占占人 北京＋暴力恐怖 天安门＋举牌 天an门 TAM tiananmen 广场 金水桥 长安街 维园+晚会 公主坟 公园 北京屠城 木樨地 维园 京城+戒严 北京+戒严 square 天安门 上证 下跌 指数 收盘 股市"}, {"id": "eg0w89p", "author": "xwing_n_it", "body": "So when do we start our own reddit with cocaine and Chiang Kai-shek? "}, {"id": "eg0zywc", "author": "Mega__Maniac", "body": "So I'm guessing we wont be able to talk about organ harvesting soon either.\n\n&#x200B;\n\nAhh well, It's been a nice run reddit. "}, {"id": "eg132j2", "author": "s33murd3r", "body": "Seriously, wtf Reddit!?"}, {"id": "eg15d0z", "author": "mistuhphipps", "body": "Great, the Russians own Facebook and China owns Reddit.  Any other world powers want to place an offer on Twitter?"}, {"id": "eg16d59", "author": "Conie2018", "body": "I’ve had several people post this and have their comment removed, wish me luck.\n动态网自由门天安门天安门法轮功李洪志Free Tibet 六四天安门事件The Tiananmen Square protests of 1989 天安门大屠杀The Tiananmen Square Massacre 反右派斗争The Anti-Rightist Struggle 大跃进政策The Great Leap Forward 文化大革命The Great Proletarian Cultural Revolution 人权Human Rights 民运Democratization 自由Freedom 独立Independence 多党制Multi-party system 台湾台湾Taiwan Formosa 中华民国Republic of China 西藏土伯特唐古特Tibet 达赖喇嘛Dalai Lama 法轮功Falun Dafa 新疆维吾尔自治区The Xinjiang Uyghur Autonomous Region 诺贝尔和平奖Nobel Peace Prize 刘暁波Liu Xiaobo 民主言论思想反共反革命抗议运动骚乱暴乱骚扰扰乱抗暴平反维权示威游行李洪志法轮大法大法弟子强制断种强制堕胎民族净化人体实验肃清胡耀邦赵紫阳魏京生王丹还政于民和平演变激流中国北京之春大纪元时报评论共产党 独裁 专制 压制 统一 监视 镇压 迫害 侵略 掠夺 破坏 拷问 屠杀 活摘器官 诱拐 买卖人口 游进 走私 毒品 卖淫 春画 赌博 六合彩 天安门 天安门 法轮功 李洪志 Winnie the Pooh 刘晓波动态网自由门"}, {"id": "eg12qb8", "author": "gregmcmuffin9", "body": "/u/gallowboob would like to know how to monetize this"}, {"id": "eg16r0y", "author": "Fredfredbug4", "body": "Nothing better than a post complaining about reddit getting a bunch of gold and platinum. \n\nYou guys are fucking idiots. I've honestly never seen a website with this many blithering morons. "}, {"id": "eg13i44", "author": "pieohmi", "body": "News articles for the lazy.  \n\nhttps://www.newsbusters.org/blogs/techwatch/corinne-weaver/2019/02/07/chinese-censorship-company-invests-millions-reddit\n\nhttps://gizmodo.com/reddit-banned-in-china-is-reportedly-set-to-land-150-1832375439\n\nhttps://www.google.com/amp/s/techcrunch.com/2019/02/05/raiseit/amp/\n\nMore on Tencent: \n\nAfter reading these, I would just like to say that I have no problem with Tencent because I, unlike op, don’t plan on committing suicide. The company already owns so much it’s astounding. My favorite is the Wikipedia page. Makes you wonder if they gave Wikipedia some money too. It’s strangely vague. https://en.m.wikipedia.org/wiki/Tencent\n\nhttps://www.bloomberg.com/news/features/2017-06-28/tencent-rules-china-the-problem-is-the-rest-of-the-world \n\nhttps://www.fastcompany.com/3029119/tencent-the-secretive-chinese-tech-giant-that-can-rival-facebook-a\n\nhttps://m.scmp.com/tech/apps-social/article/2185280/reddit-said-land-chinas-tencent-lead-investor-funding-round-may\n\nWhat else does Tencent own, you ask? Just a bit of everything. \n\nEpic Games? Fortnight? Yep. https://www.google.com/amp/s/dotesports.com/business/news/major-assets-tencent-owns-publish-24012/amp\n\nSnap and Tesla? Oh yes. https://www.fool.com/investing/2018/02/13/tencent-owns-stakes-in-these-4-us-companies.aspx\n\nDiscord? Yes that too. https://www.crunchbase.com/organization/tencent/investments/investments_list#section-investments\n\n2017 Annual Report for the analyst nerds like me. 2018’s annual report won’t be out until next month. https://www.tencent.com/en-us/articles/17000391523362601.pdf\n\n2018 interim. https://www.tencent.com/mobile/en-us/articles/17000421537440277.PDF\n\nList from their website. https://www.tencent.com/attachments/ProductlistofTencent3Q18.pdf\n\nThat’s one hell of a rabbit hole. \n\n"}, {"id": "eg102xi", "author": "skitsology", "body": "Tencent is trying to takeover the world bit by bit"}, {"id": "eg444nu", "author": "Macrocarpa82", "body": "China is a real threat domestically and internationally.  I was attending Free Tibet marches in the late 90’s and delivering reports on Chinas, very public, forced sterilization programs, in High School back in 2000.  Ive been following China and also Russia (since Putin “won” his second election) closely ever since.  Ive wanted people to understand them both as threats for a decade now.  I dont care that it took a creepy 12% purchase of Reddit to spark all this.\n\nIt actually brings me to tears to see the Tiananmen Square Man gaining so much attention with a new generation.  I hope it keeps up for another 2 months.  Social activist trigger happy millennials could use the reality update on history.\n\nMy 25 yr old friend was gushing about his iphoneX unlocking with his face, and I sent him an article on Chinas forced application of facial recognition for they’re social dystopia, and he was shocked.  He stopped using that feature.\n\nChina has tremendous social, economic, and policy influence over the world stage now, and their administrative and governmental culture is not aligned with democratic-society values.  We have to know what our values are and stand up for them where we can.  If it’s on Reddit, then I applaud it.  If its in the streets, Im even happier.  Complacency on their long term agenda is not ok."}, {"id": "eg12tv8", "author": "BelCantoTenor", "body": "Is Reddit selling their soul to the devil? Just like Tumblr? (Which is now awful!). When will American corporations start realizing that when they destroy and censor their products like this, they tie their own noose? Americans destroying other Americans for money. Dumb assholes. All the money in the world can’t BUY your freedom back. "}, {"id": "eg12jel", "author": "The_Real_OneHungLo", "body": "Does that mean China can censor American reddit? (Serious)"}, {"id": "eg15upb", "author": "NumberOneJetsFan", "body": "Speaking of overloards. You should see the Mods at r/Winnipeg"}, {"id": "eg156y0", "author": "PM_ME_UR__UPVOTE", "body": "So idiots here gilded the post and gave reddit more money. lol"}]}