{"id": "aoidr9", "title": "The real picture of Tienanmen Square people should be posting", "url": "https://i.redd.it/newflzdhh8211.jpg", "subreddit": "pics", "author": "hockeyjmac", "text": "", "comments": [{"id": "eg1c0md", "author": "permalias", "body": "or post the video of the ambulance driving into the square with the white flag waving, to help the wounded  ... only to get mowed down by gunfire.\n\nedit: I couldnt find a clip, but its found in a [great Frontline documentary \"Tank Man\"](https://www.pbs.org/wgbh/frontline/film/tankman/) - see 34:10 for the ambulance.  But do yourself a favor and watch the whole thing\n\n"}, {"id": "eg1380w", "author": "IrishmanErrant", "body": "Significantly more brutal than most people, and especially most Chinese people realize. \n\nThere are reports of bulldozers being used to move the bodies of the protestors. "}, {"id": "eg1dzhm", "author": "Inri137", "body": "Fun fact, when Taylor Swift toured China for her tour of the *1989* album, her merchandise, which had \"TS 1989\" written on it, was confiscated by Chinese officials. It was ultimately released because it put the Chinese government in the awkward position of not wanting to explain to the people what the significance of \"TS 1989\" could mean if not Taylor Swift 1989.\n\nedit: despite getting like 3k upvotes over the last five hours, this comment got like 700 downvotes in literally like the last ten minutes. Wtf. Hello Chinese botnet!"}, {"id": "eg14oos", "author": "MIRAGES_music", "body": "If someone were to say, post these to a Chinese site; how fast you reckon it would be taken down?   \n"}, {"id": "eg10qbf", "author": "morosct", "body": "The Chinese Government has worked very hard to ensure these photos aren’t shown, and that their people don’t know the effectiveness of the Tienanmen Square event. "}, {"id": "eg1bq9u", "author": "SilverPhoenix41", "body": " [Here's more](https://www.reddit.com/r/pics/comments/aohpmo/given_that_reddit_just_took_a_150_million/eg13byj?utm_source=reddit-android) NSFW and NSFL\n\nEdit: Wow. First Gold and Silver. Thank you, anonymous strangers. Lest we forget. \n\nEdit 2: Wow. Platinum too? Thank you, kind strangers. Also thank you to all who have kept the discussion civil on the comment thread. This comment is also getting a tonne of downvotes so please keep the updoots coming so the link doesn't get buried. Let's make sure what happened is never forgotten. "}, {"id": "eg181ll", "author": "Spartan2470", "body": "Per [here](https://www.independent.co.uk/news/world/asia/tiananmen-square-massacre-death-toll-secret-cable-british-ambassador-1989-alan-donald-a8126461.html):\n\n> The death toll from the 1989 Tiananmen Square massacre was at least 10,000 people, killed by a Chinese army unit whose troops were likened to “primitives”, a secret British diplomatic cable alleged.\n\n> The newly declassified document, written little more than 24 hours after the massacre, gives a much higher death toll than the most commonly used estimates which only go up to about 3,000.\n\n> It also provides horrific detail of the massacre, alleging that wounded female students were bayoneted as they begged for their lives, human remains were “hosed down the drains”, and a mother was shot as she tried to go to the aid of her injured three-year-old daughter.\n\nCredit to /u/Sumit316 for originally [finding this](https://www.reddit.com/r/pics/comments/8or4nt/rare_shocking_image_of_the_tiananmen_massacre/e05krai/)."}, {"id": "eg18ft9", "author": "Spartan2470", "body": "[Here](https://i.imgur.com/dCfe3Lj.jpg) is a higher quality version of this image  [Here](https://www.hk01.com/01%E5%BD%B1%E5%83%8F/23653/%E5%85%AD%E5%9B%9B%E5%BD%B1%E5%83%8F-%E5%85%AD%E5%9B%9B%E7%8F%BE%E5%A0%B4-1989%E5%BB%A3%E5%A0%B4%E7%9A%84%E6%97%A5%E5%AD%90-%E5%9C%96%E9%9B%86#media_id=112676) is the source.   Per there (and Google Translate):\n\n> [June 4th Image] The June 4th Scene of \"1989 Square\"\n\n> The multi-disciplinary documentary photographer Huang Qindai resolutely went to Beijing to shoot. The ideals and beliefs of the June 4th students who had nowhere to practice were able to leave the memories they deserved and remain in the images. \"The Days of 1989 Square\" shows a young face, carving out the history that the people will not forget.\n\n> I am grateful to Huang Qind for agreeing to the teacher publishing a number of photos of \"The Days at 1989 Plaza\"."}, {"id": "eg198b6", "author": "Porrick", "body": "I think the other photo is popular for the same reason Schindler's List is popular, or that Hotel Rwanda was more popular than Shooting Dogs. People like focusing on the flower growing on the battlefield, and prefer not to think too much about the rotting corpses next to it. "}, {"id": "eg1de5b", "author": "appropriateinside", "body": "Even more, and more horrific pictures:\n\nSome might say this is NSFL.\n\nhttps://imgur.com/a/q8ZIS"}, {"id": "eg15b2m", "author": "PM_ME_WEED_AND_PUSSY", "body": "Censorship is real. I am a decently educated 36 year old person and I've never seen this photo before. Shit, I don't even know how many people died here....😩 "}, {"id": "eg173ku", "author": "therapistofpenisland", "body": "This is so very true, and a lot of what really happened still isn't known by many there. I was just in Beijing a few months ago and had the opportunity to visit and talk with my guide and she was saying how she mostly knew nothing about it until very, very recently thanks to methods of bypassing the Great Firewall becoming more accessible. The majority of citizens there still don't know what really happened, and those who do know don't discuss much due to the shame."}, {"id": "eg1dxb7", "author": "im_thatoneguy", "body": "I was talking about this a few weeks ago. It's interesting that the iconic image of Tienanmen square is of a protester standing in front of a tank that is \\*STOPPED\\*.   The imagery we see gives the impression that the peaceful protesters were successful not that shortly thereafter the military violently put down the protest. "}, {"id": "eg145ec", "author": "Lysergicassini", "body": "10 thousand people."}, {"id": "eg17jeu", "author": "Hullandback", "body": "The iconic picture tells a far more optimistic story- that in spite of towering odds people will summon immense courage to stand up for their beliefs.\n\nThis image is the cold reality of the consequences of those actions. It’s no surprise one is more popular than the other."}, {"id": "eg147rh", "author": "WhatACunningHam", "body": "This is horrifying and should never be forgotten."}, {"id": "eg1ddbt", "author": "killfuck9000", "body": "Don’t worry guys! Reddit right now is going through some rounds of investment. Right now one of their larger investors is a company largely responsible for the internet censorship in China. In short time things like this will be removed for you before you have the misfortune to see them!"}, {"id": "eg1cxjr", "author": "howeyroll", "body": "Pretty crazy Reddit decided to take 150 million from a Chinese censorship giant.  "}, {"id": "eg116mo", "author": "ramdom-ink", "body": "Our tour guide in China said hundreds died that day but...it was silenced. Other thing? Yeah, not a Communist country anymore *but* it is Totalitarian state. People have money, displayed all the time and others do not, but the crackdown is real. The violations in Human Rights are legion. "}, {"id": "eg1e3w2", "author": "folsleet", "body": "It's weird why the other Tienanmen picture grabbed as much fame.  The people didn't win.  \n\nThe Chinese government completely flattened over their people.  "}, {"id": "eg1ip7a", "author": "wluo329", "body": "My mother was there during 1989.\n\nShe was a student, and was protesting with a incredibly large hoard of students.  The tanks suddenly came, and dismantled the rebellion. She was trying to run away, when suddenly she was pushed down onto the ground.  That almost meant inevitable death beyond the huge crowd of people by all means would be willing to trample over you to escape, and imminent tanks behind her. She told me how scared she was and how she thought it was the end of her life.  But suddenly, a nearby police officer pulled her hand up.  She was saved.  He told my mom to \"get the fuck out of here\" in Chinese.  She got out of Tiananmen square as fast as she could.  She managed to live and stay strong like she is today。"}, {"id": "eg143ed", "author": "beerneed", "body": "Why don't you ask the kids at Tienanmen Square?"}, {"id": "eg19f77", "author": "RasAlTimmeh", "body": "Protestors were given a time to clear out and they started to flatten people to make \"meat pie\" earlier than the time given. A lot of the people in power then are in power now in the Chinese government. Most people in China are not aware that this even happened. They knew there was some sort of protest but it got \"resolved\"."}, {"id": "eg18gch", "author": "Under_the_Gas_lights", "body": "For real. Fuck the Chinese government and their efforts to influence the West through reddit and popular culture. "}, {"id": "eg1aauv", "author": "Ghastly_Gibus", "body": "$150M Chinese investment? Let's see how long this post can go without being deleted"}, {"id": "eg1d22w", "author": "0100011001001011", "body": "The other post has been removed from the front page."}, {"id": "eg19mg3", "author": "IMakeMeLaugh", "body": "Fuck. Haven’t seen this one before. "}, {"id": "eg16rpm", "author": "TheFeshy", "body": ">“The Chinese government almost blew it. Then they were vicious, they  were horrible, but they put it down with strength. That shows you the  power of strength. Our country is right now perceived as weak.”\n\nDonald Trump on the Tienanmen Square \"riot\", as he referred to it when clarifying this statement.\n\n&#x200B;"}, {"id": "eg1cauv", "author": "IS_JOKE_COMRADE", "body": "this website is fucked once the Chinese start influencing mods "}, {"id": "eg15dtt", "author": "WesternCanadian", "body": "Wow, I ignorantly thought only the guy infront of the tank died until not long ago!"}, {"id": "eg14ie1", "author": "3rdbrother", "body": "So /u/spez is cozying up to the Chinese now, huh?"}, {"id": "eg151eb", "author": "TheMathelm", "body": "There's no war in Ba Sing Se. "}, {"id": "eg1l0fp", "author": "is_lamb", "body": "They are coming for the youth\n\nhttps://archive.is/wZP6O\n\nReddit is raising $150 million to $300 million to keep the front page of the internet running, multiple sources tell TechCrunch. The forthcoming Series D round is said to be led by Chinese tech giant **Tencent** at a $2.7 billion pre-money valuation. Depending on how much follow-on cash Reddit drums up from Silicon Valley investors and beyond, its post-money valuation could reach an epic $3 billion.\n\nhttps://en.wikipedia.org/wiki/Tencent\n\nRiot Games was majority-acquired by Tencent in February 2011, publisher of  **League of Legends**\n\nIn 2012 Tencent bought a 40 percent stake in Epic at a valuation of about $825 million back when “**Fortnite**” was still in the early stages of development. The Chinese investment holding conglomerate’s roughly $330 million outlay was used by Epic as a platform to bankroll some major changes.  Epic used Tencent’s cash injection to drop the monthly charge for its game engine and give it away to anyone who wanted to use it.\n\nIn May 2017, Tencent **surpassed Wells Fargo** to enter the world's top 10 most valuable companies.\n\nIn July 2017, Tencent bought a 9% share in Frontier Developments, the creator of the **Elite: Dangerous** and Planet Coaster franchises; as well as developer for **Rollercoaster Tycoon** 2 & 3\n\nOn 22 November 2017, Tencent formally entered into a strategic co-operation with **PUBG** corporation and obtain exclusive rights to operate ''Playerunknown's Battlegrounds'' in China.\n\n\nIn November 2017, Tencent revealed that it had purchased a 12% stake in Snap Inc in the open market, with plans to help establish **Snapchat** as a gaming platform.\n\nIn January 2018, Tencent and **The Lego Group**, the world's largest toy company, are teaming up to jointly develop online games and potentially **a social network aimed at children**.\n\nIn March 2018, Tencent acquired a 5% stake in **Ubisoft** from Vivendi,"}, {"id": "eg1bky8", "author": "imzadi481", "body": "I am 42 years old and I have never seen this picture. When they say a picture is worth a thousand words, it's true. I never knew the extent of this event."}, {"id": "eg13za1", "author": "ThucydidesOfAthens", "body": "The other picture is more iconic, but doesn't show the story that has to be told, the story that still *can't* be told in China. I agree this needs to be seen more so than the photo that probably everybody already has seen before. "}, {"id": "eg1crvo", "author": "CndConnection", "body": "I had a really interesting experience leaving mainland China in 2010 to go into Hong Kong (if you don't know, Hong Kong is now part of China but treated differently under a system commonly known as \"Two systems, one country\"). \n\nI took the train and got to walk out of the Hong Kong train station and when you step outside you are immediately greeted with a huge post sign detailing the Tienanmen Massacre with extremely graphic pictures and text. \n\nThe stories of people crushed into a pulp and hosed away? I believe it, I've seen the piles of gore in those photographs.\n\nBefore that I had actually visited Tiananmen square. It was truly weird and definitely a place that you could feel some sort of aura. "}, {"id": "eg1d0hx", "author": "-Xandiel-", "body": "I've been to China, to Tienanmen Square. I knew nothing other than famous \"tank man\" photo, and that people died. The exact extent of the brutality of it... I imagine I would have felt very differently about seeing the place in person if I'd known then."}, {"id": "eg1dhh2", "author": "intihuda_123", "body": "What is the Tienanman Square Event?"}, {"id": "eg1ljot", "author": "ilovetopoopie", "body": "I went to school for photography, and even with an entire college of professionals, I'd never seen this image before. Rare history right here. So important it was almost destroyed. "}, {"id": "eg1dpw8", "author": "bluejay_burgers", "body": "Fuck the Chinese government "}, {"id": "eg1id6t", "author": "stoner-kitty007", "body": "I visited Tienanmen Square in 2011 just out of high school. My grandparents asked our guide about the \"massacre.\" I will never forget the tour guide's reaction. She shut it down and said \"we don't use that word and I have no idea what you are talking about.\" "}, {"id": "eg1nzjo", "author": "toolymegapoopoo", "body": "What is really sad is the number of people on this thread who are shocked by what happened there. Most of them probably know nothing further than the \"tank man.\" I'm not blaming them. The Chinese, and let's be honest The Americans, did a very good job of completely whitewashing this. This was a massacre and it has been largely forgotten.  "}, {"id": "eg1avve", "author": "hiroue", "body": "China's Censor Crew joining in 3...2...1"}, {"id": "eg1g8qf", "author": "c0nsciousperspective", "body": "They did this to their OWN people. Fuck. "}, {"id": "eg1dghd", "author": "HydroponicGirrafe", "body": "I wonder if reddit will remove this picture since one of their biggest investors and advertisers is Tencent, a Chinese company. 🤔 "}, {"id": "eg1icbm", "author": "KoYsP3R", "body": "There’s your tyrannical government "}, {"id": "eg1j8hy", "author": "kombatunit", "body": "The Chinese Government ground up 10k of their people in to the \"pie.\"  Think about that next time you are buying cheap shit in walmart.   "}, {"id": "eg1iwsm", "author": "BenXylona", "body": "I am Chinese, a china-borned Chinese. I want to remind you all a cold truth about this inccident: nobody fucking cares. About half of my friends know about this very well, but they just simply don't care. The scareness towards CCP is so deep that everyone knows what he/she should do when encountering topics like this: slicence. It's fking black mirror in real life in China. \nAnd what even worse is, more and more young people, mostly teens broned after 2000, they are being successfully brainwashed. They think this inccident is totally bad but CCP should do that. And they do believe those commmunism crap while they are in fact living in a fking capitalism societ."}, {"id": "eg1czkt", "author": "walmartpaulwalker", "body": "Tenecent can suck one"}, {"id": "eg1gjfy", "author": "coldfusion718", "body": "Reddit getting investment of $150m with Chinese censorship company. "}, {"id": "eg1goxk", "author": "boarpie", "body": "Now they want reddit?? Fuck their 150 mil "}, {"id": "eg1aat3", "author": "therottingbard", "body": "Fuck. I had never seen this. "}, {"id": "eg1dt2g", "author": "davinitupoverhere", "body": "10,000 civilians dead. Absolutely shameful."}, {"id": "eg1e4fa", "author": "RedPillDessert", "body": "Given that the related post to this has suddenly mysteriously sunk down to position 34 on the front page (despite only being 3 hours old, and scoring 120k upvotes), I'll post it here for prosperity: https://www.reddit.com/r/pics/comments/aohpmo/given_that_reddit_just_took_a_150_million/"}, {"id": "eg1ebzx", "author": "Guerrillablackdog", "body": "I've seen the famous video of the guy standing in front of the tank, but I've never seen this image before and I'm 28. I'm not even entirely sure what happened in that event. :/"}, {"id": "eg1g0ri", "author": "ImmobilizedbyCheese", "body": "The impact of people in uniform blindly following orders. "}, {"id": "eg1kltn", "author": "paulerxx", "body": "Are there more of these photos?\nThis is when the Chinese government slaughtered their own people due to protests?"}, {"id": "eg1ol1y", "author": "clawhatesyou", "body": "Chinese-American here. I lived on that street when this happened. I was 8yo. The sad thing is, even if people in China saw this photo without context, the vast majority of them would have no idea what they were looking at. "}, {"id": "eg1csfx", "author": "JimBob-Joe", "body": "HEY CHINESE GOVERNMENT \n\nFUCK YOU! \n\nFUCK YOUR WHINNIE THE POOH LOOKING FAT FUCK DICTATOR! \n\nAND FUCK YOUR CENSORSHIP! \n\nbut lots of love sent to the Chinese people - your government has fucked you enough. "}, {"id": "eg17rv9", "author": "evenios", "body": "on this site in 1989 nothing happened.\n\n&#x200B;"}, {"id": "eg13tmp", "author": "Roc_City", "body": "Bikes! "}, {"id": "eg19thw", "author": "liquidmetaljesus", "body": "What about the pics of the people run over by tanks? Those are the ones that should be seen"}, {"id": "eg14m8l", "author": "Omiie91", "body": "Sometimes I think about how fortune I am to have been born in a time & country where there isn’t on-going wars or brutal killings"}, {"id": "eg1ctcy", "author": "revbfc", "body": "Not turning our back on China after this was as big a mistake as the 2003 Iraq invasion."}, {"id": "eg1cz8h", "author": "LeGrandeMoose", "body": "Can we get a sticky on this?"}, {"id": "eg1dv7w", "author": "pynewbie", "body": "This is what actual oppression looks like. Rip."}, {"id": "eg1gnrz", "author": "Yooklid", "body": "I’ve never seen this before. Thank you."}, {"id": "eg1jm4f", "author": "Gtarmanperson", "body": "FUCK CENSORSHIP"}, {"id": "eg149eb", "author": "TooShiftyForYou", "body": "More than 1,000 people were killed and even still The Communist Party of China forbids discussion of the Tiananmen Square protests."}]}