{"id": "aq8355", "title": "Today, NASA will officially have to say goodbye to the little rover that could. The Mars Opportunity Rover was meant to last just 90 days and instead marched on for 14 years. It finally lost contact with earth after it was hit by a fierce dust storm.", "url": "https://i.redd.it/vc9qhyfgzcg21.jpg", "subreddit": "pics", "author": "iBlueSweatshirt", "text": "", "comments": [{"id": "ege97ng", "author": "mechapoitier", "body": "Fingers crossed Opportunity comes back to life one day like the [Oscar 7 satellite](https://en.wikipedia.org/wiki/AMSAT-OSCAR_7), which died in 1981 and was nearly forgotten about when it suddenly came back to life and started transmitting again *21 years* after it was seemingly dead forever. It was launched in 1974 and is still working to this day."}, {"id": "ege3hce", "author": "Trimestrial", "body": "I hope nasa tries to ping opportunity, at least once a year, for the next ten years."}, {"id": "ege19rq", "author": "RamsesThePigeon", "body": ">After 15 years on Mars, the mission of NASA’s Mars rover Opportunity appears to have come to an end. The wheeled explorer was only supposed to function for 90 days, but it went on to assist in many discoveries about ancient conditions on Mars, becoming the longest-lasting robotic explorer sent to another planet.\n\n>The rover has been silent since June when a planet-wide dust storm prevented sunlight from reaching its solar panels; lacking energy, Opportunity could not stay awake. The hope was that the rover would revive when the skies cleared, but it has not responded after months of efforts to contact it.\n\n>On Tuesday night, NASA made one last call to Opportunity. On Wednesday, the space agency is expected to announce that it is wrapping up the mission.\n\n[Source](https://www.nytimes.com/2019/02/13/science/mars-opportunity-rover-dead.html)"}, {"id": "ege4ua6", "author": "Xe1ex", "body": "This just seems like the perfect setup for a horror movie.  Eventually we land on Mars, and we find the rover.  Everyone is thrilled, until they recover pictures taken but not sent back to Earth.  The scientists are trying to determine the shapes in the dark images, just as the mechanics find what look like claw marks on the rover.  That's when the Martians finally reveal themselves..."}, {"id": "ege9tv4", "author": "IllusiveBro", "body": "Do not go gentle into that good night. "}, {"id": "egec0ji", "author": "MangoCandy", "body": "Good bot "}, {"id": "ege1rxh", "author": "Danieljoe1", "body": "14 years instead of 90 days....... good return on investment. Rebuild that bitch and have another go"}, {"id": "ege5chm", "author": "seshelton", "body": "The ultimate example of “undersell and over-deliver”"}, {"id": "egeh9ko", "author": "fullforce098", "body": "**The year is 2134**\n\nThe first Martian colony is surrounded by the Martian creatures. They close in on the unarmed astronauts, they've never tasted human blood, their mandibles are erect in anticipation. The astronauts hug one another, knowing this is the end. They look to the sky, hoping in vain to see a glimpse of the pale blue dot, the home they'll never see again. It's no use, the dust is too thick. Like many pioneers to this hellish world before them, they will perish under a red storm. They close their eyes and wait for death.\n\nWhen suddenly a blast is heard, a scream, and then another and another. They open their eyes. A cloaked figure has appeared out of nowhere, and is raining fire down on the creatures from above. They flee, back to the cracks in the Martian soil they crawled from, mandibles tucked between their six legs.\n\n\"But...who?\" The commander asks\n\nThe cloaked figure turns slowly with an odd whirring sound and lowers its hood.\n\n\"Impossible!\" The wide-eyed commander declares, \"You were lost over a hundred years ago! They said you were dead!\"\n\n\n\"Not quite, commander. Opportunity always knocks when you least expect it.\"\n"}, {"id": "egehg0x", "author": "DWEGOON", "body": "\"My battery is low and it's getting dark.\" How can a quote from a robot make me sad?"}, {"id": "ege2b4d", "author": "jece2379", "body": "I can't link to XKCD because of my workplace firewall, but: \n\n[https://www.sunnyskyz.com/uploads/2015/05/bdhku-mars-rover.jpg](https://www.sunnyskyz.com/uploads/2015/05/bdhku-mars-rover.jpg)"}, {"id": "ege5r16", "author": "dirtyrango", "body": " So we have to launch a mission to save the rover, right? #nobroleftbehind!!!"}, {"id": "ege9kco", "author": "Ffeorg", "body": "Will I dream Dr. Chandra?"}, {"id": "egebkh4", "author": "Thekijael", "body": "Opportunity Rover: “NASA, I don’t feel so good”\n\nNASA: *sheds tear \n\nEdit: thanks so much for the gold reddit friend :) "}, {"id": "ege11ox", "author": "afortiorii", "body": "\nThat’ll do pig, that’ll do"}, {"id": "ege6102", "author": "gene100001", "body": "That landed 14 years ago? What the fuck, i feel like it landed only a couple of years ago, maybe 3 years tops. Time is just passing me by faster and faster these days. I need to figure out what I'm doing with my life"}, {"id": "ege9xa1", "author": "weekend-guitarist", "body": "F"}, {"id": "ege9tw2", "author": "EarthsFinePrint", "body": "I would put $10 down that it will come back online at some point, even if it doesn't have full functionality.\n\nHats off to the engineering and control team."}, {"id": "ege8i49", "author": "Ruadhan2300", "body": "Gonna launch a rover in Kerbal Space Program in Opportunity's Honour"}, {"id": "egee754", "author": "lissimcsaurus", "body": "This makes me so sad. It was the goodest robot. 10/10"}, {"id": "egeirok", "author": "Insectshelf3", "body": "We were controlling a robot operating on another planet for 14. Freaking. Years. \n\nThat’s incredible. "}, {"id": "egei3df", "author": "bishopsanspants", "body": "**Ode to Opportunity**\n\nSoujourner and Spirit\n\nmade way for Opportunity\n\nand with gusto it took it\n\nand held on with Curiosity.\n\nNinety days to fourteen years\n\nin the search for each new wonder,\n\na rover with tenacity\n\nrode and faced many fears.\n\nEvery expectation did it sunder\n\nwith a true explorer's tenacity."}, {"id": "egec870", "author": "thetransportedman", "body": "Listening to NPR about this was so sad haha. They talked about how he has dust on his solar panels and high wind periods don't seem to be freeing them up. And that if he even did get them cleared up that he's entering a super cold winter where he'd divert all of his solar power to keeping his \"heart\" warm so that his electronics don't shrink and break from the temperatures, thus not having enough power to move around which helps keep his whole body warm and have enough surplus energy to talk to us"}, {"id": "ege7c6b", "author": "TooShiftyForYou", "body": "We imagine these rovers as being tiny but, Curiosity for example, [is about the size of an automobile.](https://i.imgur.com/voCn0Yp.png)"}, {"id": "ege83xe", "author": "Smoglessmike13", "body": "Good bye brave warrior, may we see you again one day. Till then earn you well deserved slumber.\n\nI'm not crying.... you are.... "}, {"id": "egea7ru", "author": "nowyourmad", "body": "hopefully we can put it in a museum one day"}, {"id": "ege5yiu", "author": "oooriole09", "body": "After watching WALL-E, I’m hoping that rover finds it’s EVE. "}, {"id": "ege6og2", "author": "kids-these-days", "body": "...or its gone sentient and is roving on its own now"}, {"id": "ege5dei", "author": "SchrodingersNutsack", "body": "I hope the next one we send is programed to give Oppy a proper burial. "}, {"id": "ege59i9", "author": "Zander10101", "body": "I am thoroughly convinced that it should be treated as a national hero, receive some kind of military award for outstanding service, and get a statue or memorial of some kind in DC."}, {"id": "egebju1", "author": "CharlesChaplined", "body": "She traveled 28 miles in her 15-year journey that was only expected to last 90 days. She helped prove that water once flowed on the surface of Mars and that life may have thrived there at one time. In her time on the planet's surface, she sent us over 217,000 images. Her last known [photo](https://twitter.com/JacobMargolis/status/1095436913819889664?s=20) was a wide-sweeping shot of the sky above, showing that even from Mars, the sky is not the limit. "}, {"id": "egecdhb", "author": "KilroyBrown", "body": "\"Keep Talking\" by Pink Floyd comes to mind.\n\nJust because it doesnt respond, it doesn't mean it's not aware. \n\nMaybe its choosing to stay silent for it's own reasons.\n\nMaybe the dust storm made that function only, inoperable.\n\nThe writer in me is opting for the first scenario. \n\n"}, {"id": "egef5l8", "author": "ctflora", "body": "\"...fierce dust storm\"?  \n\\*FIERCE DUST STORM\\*?!?!\n\nHow about \"...catastrophic dust storm that plunged the entire planet into darkness for over a month\"?  \n"}, {"id": "ege5xwc", "author": "Gnarledhalo", "body": "Time to go back and get him. I think Matt Damon would agree."}, {"id": "egefifz", "author": "whims-and-worries", "body": "A 10/10 GOOD BOY"}, {"id": "egefhou", "author": "kutschi201", "body": "Does this unit have a soul? "}, {"id": "egegd9x", "author": "Dadfite", "body": "I like to think that for the last 14 years. A Maintenance Martian stumbled across our little Rover at the end of it's time, and has just been doing routine maintenance on it. Obviously from behind. That's why we haven't seen him in any shots."}, {"id": "egeii1z", "author": "kylebutler775", "body": "In 10 years, there's going to be a movie called Rover that takes place in the future in which people start colonizing Mars and they start disappearing mysteriously only to find out centuries later Rover was still there and functioning. Rover was never meant to be a research instrument, it was an instrument of war\n\n"}, {"id": "egemk20", "author": "bronney", "body": "The reason we find the stuff in this thread sappy AF and tears up is because we're all explorers at the very core. Yet due to the modern lifestyle, we chose to imprison ourselves in our fake lives from 9 to 5.  Then we fake explore by walking our thumbs on our phones.\n\nAnd when we see true explorers we couldn't help but yearn to be that knowing we can't be that. It's sad AF. \n\n"}, {"id": "ege9azi", "author": "Generic_Template", "body": "ELON DO SOMETHING!!!! WE NEED GET TO MARS AND SAVE HIM"}, {"id": "ege19c2", "author": "Beneto3k", "body": "F"}, {"id": "egebvyx", "author": "Thekijael", "body": "Journey’s Faithfully started playing right as I read this. I’m crying, this is fine, emotions are fine. Rest In Peace little Rover, you have captivated the hearts and minds of us for 14 wonderful years. "}, {"id": "egec703", "author": "WiggleFriend", "body": "I hope they make a video of Opportunity rovers best moments. 🤞"}, {"id": "egedpld", "author": "l_one", "body": "That was some fucking excellent engineering.  Bravo."}, {"id": "egegkhm", "author": "Zero300x", "body": "We will meet or find you again little guy, stay strong and wait for the sun to come up, even though the ones who built you won't be alive when we reach you, their descendants will, stay strong and keep roving on."}, {"id": "egefbwq", "author": "vampyire", "body": ".. .and now its watch is over.."}, {"id": "egecs34", "author": "Sin_the_Insane", "body": "Thank you Opportunity to show us a whole new world. You did good."}, {"id": "eged64e", "author": "patrickfrmnj", "body": "I fully support Elon Musk's plan to go to Mars with a dust rag to wipe off Opportunity's solar panels."}, {"id": "egep65b", "author": "MildlyAgreeable", "body": "Rest easy little one.\n\nThis isn’t goodbye - just ‘see you later’."}, {"id": "egeces0", "author": "RUFiO006", "body": "Talk about a lost Opportunity. "}]}