{"id": "arfjs5", "title": "This person sold their VHS player on eBay and got a surprise letter in the mailbox.", "url": "https://i.imgur.com/73ZJIme.jpg", "subreddit": "pics", "author": "effectivepep", "text": "", "comments": [{"id": "egmxwwt", "author": "JakeMeOff11", "body": "There’s something heartwarming about an ~~89~~ 86 year old man remarking on how young he and his acquaintances looked 25 years ago. "}, {"id": "egmxjyv", "author": "new_old_mike", "body": "Man...I really miss my grandpa.\n\nEDIT: All of your grandparents seem like very nice people. Thanks to everyone for sharing your stories. And if your grandparents are still here, **call them today and say you love them!**"}, {"id": "egmya5b", "author": "onetimeonreddit", "body": "I've sold hundreds of items on Ebay and only a portion of those buyers will leave a feedback rating on the site itself which is nice and all but one day I received a thank you card in the mail from a sweet elderly woman who bought a designer wallet from me and loved it so much she had to hand write it on a card for me. It was over a year ago and it's by far my favorite memory from years of selling. "}, {"id": "egmw886", "author": "justlovehumans", "body": "This is great but someone find this person and tell them to take their VHS tapes to somewhere to get them put on DVD and harddrive. VHS is pretty close to the end of their life. The first time you watch an old tape from the 90s might be the last.\n\n\nEDIT: A lot of people are asking where to go but the best places are going to differ on location so best bet would be to check online for local places that do it. If you're having difficulty some people told me Costco does it also. \nThere is also converters you can buy at best buy or other electronics stores to do it at home yourself. \nYou can buy as well a DVD/VCR recorder combo which plays both and can record non protected tapes that way.\nSome local libraries may do it for cheap or free also!\nThanks for the comments humans ♡\n"}, {"id": "egmufn1", "author": "realmwalker", "body": "A letter with an ink signature too. Not an email, not a rating on eBay. An honest to goodness letter. Old school appreciation letter from someone who learned the art before we had instant gratification."}, {"id": "egmw1ue", "author": "Floyd314", "body": "I bet the clock is blinking 12:00"}, {"id": "egmywpb", "author": "psychodahick", "body": "VCR"}, {"id": "egmzyek", "author": "TremblinBlender", "body": ">The gentle maturing of my family. \n\nI love this phrase so much, I don't know why. "}, {"id": "egmu0ux", "author": "badd_bianca", "body": "Tugs at the heart some"}, {"id": "egmuvc5", "author": "Kivanctatlitug", "body": "When someone takes the time and effort to write you a letter for something so small, I remember how kind we as a people can be. "}, {"id": "egmydza", "author": "Davel23", "body": "But did he get to watch his Night Court tapes?"}, {"id": "egn46xl", "author": "ILaughAtFunnyShit", "body": "This reminds me of [my favorite post from TalesFromTechSupport.](https://old.reddit.com/r/talesfromtechsupport/comments/28qemm/dont_bother_sending_a_tech_ill_be_dead_by_then/) \n\nTL;DR: Elderly (94 y/o) man calls cable company because his TV isn't working. Tech cant fix it over the phone. Offers to send someone out. Elderly man says \"Don't bother sending a tech. I'll be dead by then.\" Tech decides to personally visit the man to find out what's wrong and fixes a simple issue getting his cable working again. Elderly man is in tears he's so thankful and old school mails a letter to the company just like this outlining how thankful he was for the tech who took it upon themselves to show up and help him with his issue."}, {"id": "egmym3u", "author": "emkul", "body": "This guy got to retire at 61. That must’ve been nice... sigh "}, {"id": "egmus6j", "author": "boombadajam88", "body": "If someone were able to digitise them for him to pass onto his family, man that would be awesome. "}, {"id": "egn1hhb", "author": "grtwatkins", "body": "Expected reply from eBay seller: \n\n\"请留下五星评价并花更多钱\""}, {"id": "egmucka", "author": "effectivepep", "body": "Credit to the original poster /u/MarshmallowMatt"}, {"id": "egn5a6g", "author": "KinMotto", "body": "They dont make them like they used to anymore. Im talking bout the 86yo."}, {"id": "egmutlc", "author": "HumaneAnalogs", "body": "r/humansbeingbros maybe, although I was expecting sextape."}, {"id": "egmvks3", "author": "TannedCroissant", "body": "Looks so weird seeing EBay with a capital E, but this is such a sweet letter"}, {"id": "egn9hcx", "author": "productiveslacker73", "body": "My insignificant karma vote will only go to https://www.reddit.com/r/MadeMeSmile/comments/arcmve/i_sell_on_ebay_and_got_this_in_the_mailbox_today/?utm_source=reddit-android"}, {"id": "egn6igm", "author": "sabby55", "body": "Why is everyone calling these VHS players and not VCR’s? Am I the only one who called them that?"}, {"id": "egp2p2w", "author": "T_Weezy", "body": "This post actually belongs, as far as I can tell, to u/MarshmallowMatt since he actually posted this 5 hours before OP. Karma thievery is a real thing, people."}, {"id": "egn2e7h", "author": "tyman1876", "body": "I mother purchased a new car recently and traded her old one into the dealership. About a month later she received a letter in the mail from the other end of the state. It was the guy who purchased her trade in. It said that while going through the car he found a single earring stuck in the edge of the carpet which he included with the letter. He said he wanted to make sure she got it back in case it was important to her. It was her grandmother earring that she lost almost 2 years before. She kept the other one in case she was ever able to find it. \n\nLittle acts of kindness like that are awesome. "}, {"id": "egngpe1", "author": "tinnguyen123", "body": "I'm quite amazed he is able to do all of this as a 86 year old..\n\nFirst time Ebaying, typing, mailing, proper formatting, and PayPal..\n\n\nI have a hard time getting my mom to jump on autopay for her credit card, let alone signing up for PayPal. "}, {"id": "egmzjd8", "author": "rawbamatic", "body": "This is the most face fucking wholesome thing I've seen all year. "}, {"id": "egn1nqi", "author": "MrWoodlawn", "body": "OP wrote a letter back asking if he could give him a positive review on ebay.\n\n&#x200B;\n\nand also, if he's 86 then you figure the tapes of his kids growing up would be 40 to 60 years ago. I didn't think they had VHS back then. "}, {"id": "egn7eku", "author": "poopy878", "body": "86 year old’s wedding on VHS? Did she get married in her 50’s?? "}, {"id": "egnathp", "author": "vladdante", "body": "\"Jeez, were we young\" - got me right in the guts"}, {"id": "egn0nmj", "author": "schwulest", "body": "V C R"}, {"id": "egn2ei0", "author": "lceCubeDude", "body": "Why the fuck does OP get gold. They did nothing but repost. This site is going downhill so fast"}, {"id": "egn1xll", "author": "Elevened", "body": "Quit stealing other peoples posts. You’re not going to get your 121k likes. Asshat. "}, {"id": "egn7jce", "author": "somenamestaken", "body": "I saw this on other subs and I thought it was awesome. It warms my heart.\n\nIt DOES NOT belong on this sub.\n\nIt is not a \"pic\" -- It's a photo of a letter. \n\nIt is not a piece of photography\n\nIt is not piece of art\n\nThe only thing that this post has associated with this sub is that, in order to be posted on Reddit, you have to take a pic of the letter. That's a little pathetic. It actually devalues the quality of the Original Post.\n\nHave some standards, please\n\n"}, {"id": "egn2ure", "author": "HxCurt", "body": "lol people fake this stuff for internet points, how sad"}, {"id": "eh43ze9", "author": "whatarewetalkingto", "body": "25 years of retirement!!! wow!!!! I wonder what he has been working since then....My mom in her 60's retired, and couple of years later went back to work part time as she said she hated waking up and not \"having a purpose.\" Then had a neighbor in his 80's and he was a greeter at Walmart; he used to be an airline pilot, had a huge house and he told me, i couldn't stand staying home watching tv and wanted to get a job....if I ever make it that far, I think i'll be happy at home not doing much."}, {"id": "egmz0tn", "author": "runandkickgirl", "body": "*REPOST OF A REPOST.*"}, {"id": "egn0slp", "author": "Wert357", "body": "looks fake"}, {"id": "egn0dz9", "author": "SoMesGuy", "body": "Repost?!"}, {"id": "egmzyfo", "author": "WorshipNickOfferman", "body": "I kept waiting for the snark/sarcasm, and I was shocked when it was an honest, heartfelt letter. I don’t feel as jaded as I did 10 minutes ago. "}, {"id": "egn0jg5", "author": "shunestar", "body": "We need more of this. \n\nHopefully it’s not fake."}, {"id": "egn0p3k", "author": "boilingwater16", "body": "r/wholesomeness"}, {"id": "egn5yhe", "author": "dezelita", "body": "Reminds me of when I wrote my boyfriend a letter from the heart for  Valentine's day.\n\nI'm still waiting for a write-back, over a year later :'("}, {"id": "egn8zg8", "author": "Aegisuv", "body": "Reddit has ruined me, as I expected there to be a comment of some stripe referring to watching nostalgic porn tapes, either professional or homemade."}, {"id": "egng1cu", "author": "fayntgaming", "body": "\"with all my family and friends, many of which are no longer around\" \n\nThis part has suddenly made me feel both sad and appreciative... the thought of my younger siblings and friends being dead for years, and then watching old videos of our years together, makes me miss them dearly already. "}, {"id": "egnnjd3", "author": "rabbittheracer", "body": "Hi M. Shoukry,\n\nI don't have any idea what people on the internet are going to do if they found your name but don't worry, your name is not visible since I used my black highlighter.\n\nBest regards,\n\neffectivepep"}, {"id": "ego7gt4", "author": "T_Weezy", "body": "You karma stealing fucker, this isn't even OC."}, {"id": "egn2iw6", "author": "magneticphoton", "body": "\nFake and dumb."}, {"id": "egmxhjr", "author": "well_hung_stable_boy", "body": "Wow, an 86 year old ebayer"}, {"id": "egn0yxx", "author": "AvidasOfficial", "body": "Reeeeeeeeeeposttttt!"}, {"id": "egn66rx", "author": "Ziotron2", "body": "I’m over here waiting for the punchline “if you want the homemade porn video back that you left inside, let me know”"}, {"id": "egn1hzl", "author": "Fuhrer_Mel_Gibson", "body": "Lol I guess you retards will believe anything. "}, {"id": "egn3qpt", "author": "PukeBucket_616", "body": "VCR. \n\nIt's called a VCR. "}, {"id": "egnabn9", "author": "RUthrowaway111", "body": "This is the fakest thing I’ve ever seen. Don’t care if I get downvoted, fuck you op. Stop fucking lying."}, {"id": "egmug7x", "author": "PaulDiGiorgio", "body": "That earns him a great eBay buyer's review! "}, {"id": "egn0gws", "author": "B_easy85", "body": "Sends letter of appreciation.. plot twist forgets to leave feedback!?"}, {"id": "egn0i35", "author": "hcknbnz", "body": "Wholesome AF"}, {"id": "egn0kur", "author": "Tx3089", "body": "Well isn't that nice =) Warms my Heart"}, {"id": "egn0lcs", "author": "eclecticnomad", "body": "Wow this is beautiful "}, {"id": "egn0ove", "author": "advar100", "body": "how wonderful thoughtful and clearly the gentleman got such lovely enjoyment and reminiscences "}, {"id": "egn0oxq", "author": "losbullitt", "body": "Classy. "}, {"id": "egn0qy3", "author": "hotvision", "body": "Pure class. "}, {"id": "egn10zd", "author": "VictorVanguard", "body": "Someone should help him digitise his collection into DVD or other media file type/stream. Imagine his glee if he got to share his memories with others."}, {"id": "egn11l7", "author": "butterpopkorn", "body": "This is very heart warming "}, {"id": "egn121w", "author": "Zombiewax", "body": "Someone better back all his stuff onto some digital storage! Tapes can deteriorate pretty bad over the years. "}, {"id": "egn12k1", "author": "Cecdog30", "body": "WHOEVER YOU ARE, QUIT CUTTING THE FUCKING ONIONS"}, {"id": "egn14q2", "author": "Wheatizard", "body": "This is amazing."}, {"id": "egn14rb", "author": "inlinetriple17", "body": "Damm this hit me hard"}, {"id": "egn19xa", "author": "AMICUS1187", "body": "There's just something special about someone expressing their gratitude through a letter.  It always kind of takes you by surprise when someone takes the time to write you, and it really cements their expression of appreciation when you read what they took the time to write.\n\nEmails, texts, even a quick \"Thank you!\" is great; however, knowing someone took the time to sit down to write(or type) out a letter, address it, purchase postage, and sign it, just means a little more.\n\nEveryone should try to write at least one letter to someone who is not expecting it every year.  It just makes people feel good."}, {"id": "egn1ex7", "author": "arch_dog", "body": "Wholesome af"}, {"id": "egn1h0a", "author": "raftah99", "body": "This is ridiculous. People have VCRs everyone with a few inches of dust on them. Why on earth did he pay for one? Would have given him one my many old ones for free plus other vhs tapes for entertainment. "}, {"id": "egn1nvp", "author": "SirDinkleDink", "body": "I'm not crying, you're crying"}, {"id": "egn1ssg", "author": "Pkligerman7", "body": "All the feels. All the feels. We all\nCould learn to appreciate life a little more from this person"}, {"id": "egn27qj", "author": "kokothedon", "body": "Here. I give you my poor man's gold🏅"}, {"id": "egn2cni", "author": "just_say_n", "body": "Just, wonderful."}, {"id": "egn2gwj", "author": "MazMazda3", "body": "This made me happy sad. "}, {"id": "egn2krn", "author": "bishslap", "body": "You know someone is old when they watch their RETIREMENT video and say \"Jeez we were young\"!"}, {"id": "egn2mtj", "author": "meager", "body": "It's awesome that the VHS tapes actually still worked! Some of the home videos my mom has from my sisters and I growing up don't work well because of old age, and those are from 25-30 years ago. I can only imagine how old the wedding tape is if she retired 25 years ago."}, {"id": "egn2ovn", "author": "DrThunderous", "body": "who's cutting onions"}, {"id": "egn2ron", "author": "echoes_HD", "body": "Someone needs to digitize Grandpa's collection for him"}, {"id": "egn2wud", "author": "notdownwithsickness", "body": "Back in my day, we called em VCRs. "}, {"id": "egn40fz", "author": "Bdubz", "body": "And this is why my dad still goes and fixes VCRs for his old customers"}, {"id": "egn540z", "author": "retroEXX", "body": "When my dad passed a few years back, one of his old high school buddies sent me a hand-written letter through the mail. It broke me. This reminded me of that. Something about the personal feeling of it. It wasn't through facebook, or an email, it was handwritten, well done, and sent to me personally through the mail one day. It was beautiful."}]}