{"id": "bbql1i", "title": "This is Dr Katie Bouman the computer scientist behind the first ever image of a black-hole. She developed the algorithm that turned telescopic data into the historic photo we see today.", "url": "https://i.redd.it/shhy0jzoshr21.jpg", "subreddit": "pics", "author": "iKojan", "text": "", "comments": [{"id": "ekkt6hc", "author": "NanoDucks", "body": "The blackboard in the back looks exactly like you think it would. Covered in triangles and dotted lines and shit"}, {"id": "ekkpyd7", "author": "TooShiftyForYou", "body": "*Katie Bouman has worked on the imaging project for the Event Horizon Telescope for about 12 years. Katie first learned about the Event Horizon Telescope in 2007, back in high school in West Lafayette, Indiana, then pursued it as work in college at the University of Michigan. Now, Ms. Bouman is a post-doctoral fellow at MIT and Assistant Professor at CalTech, the California Institute Of Technology.*\n\nShe put a lot of effort into what finally happened today."}, {"id": "ekkqog2", "author": "Sumit316", "body": "She did a ted talk in 2017 \"How to take a picture of a black hole\" - https://youtu.be/BIvezCVcsYs\n     \nAnd today it happened. Huge Congratulations to her and her team. It is a wonderful achievement."}, {"id": "ekkpkoy", "author": "_Erin_", "body": "I remember watching her TED video on imaging black holes a couple of years ago. It's amazing to see the final image. Incredible work! Congrats to you and your team Katie!"}, {"id": "ekktpo7", "author": "Sweep_Single", "body": "The look on her face says it all"}, {"id": "ekpfu92", "author": "howdygents", "body": "https://twitter.com/thisgreyspirit/status/1116518544961830918\n>(1/7) So apparently some (I hope very few) people online are using the fact that I am the primary developer of the eht-imaging software library (https://t.co/n7djw1r9hY) to launch awful and sexist attacks on my colleague and friend Katie Bouman. Stop.\n\n>(2/7) Our papers used three independent imaging software libraries (including one developed by my friend @sparse_k).  While I wrote much of the code for one of these pipelines, Katie was a huge contributor to the software; it would have never worked without her contributions and\n\n>(3/7) the work of many  others who wrote code, debugged, and figured out how to use the code on challenging EHT data. With a few others, Katie also developed the imaging framework that rigorously tested all three codes and shaped the entire paper (https://iopscience.iop.org/article/10.3847/2041-8213/ab0e85 …);"}, {"id": "ekks6iq", "author": "bsass66", "body": "she looks like a kid on Christmas. very happy for her and the whole army of people it took to accomplish this."}, {"id": "ekkqx58", "author": "FuckHumans_WriteCode", "body": "Dude, she looks so stoked. I love this picture"}, {"id": "eklg54y", "author": "zombi-roboto", "body": "Misleading title.  \n\n\"This is Dr. Katie Bouman ***ONE OF THE MANY SCIENTISTS*** behind the first ever image....\"\n\nEven she's not trying to take full credit for this accomplishment. Quit your bullshit."}, {"id": "ekkwuwh", "author": "Teddy_canuck", "body": "Yeah well today at work I found the screw my boss dropped under the transformer so it's a big day for both of us."}, {"id": "ekkqmgu", "author": "Dakujem", "body": "Good on her. It's taken years of combined efforts, but we're witnessing a milestone in scientific history.\n\nWhen you start to think about it, the black hole is just mind-boggling in its enormity and beautiful destructiveness. It's twenty five *billion* miles wide and has an incredible gravitational field so strong, that as we speak, it's busy pulling absolutely everything in its surroundings into itself, from man to machine. Not unlike my ex wife."}, {"id": "eks4uh7", "author": "cornholio-", "body": "\"the spotlight should be on the team and no individual person. Focusing on one person like this helps no one, including me.”- Katie Bouman.\n\nBasically the photo of her smiling went so fucking viral that nonscientists across the world dubbed her this lone wolf female hero figure. In reality it was a diverse group effort but don't point that out or you hate women."}, {"id": "ekl0gbo", "author": "mynameischristian", "body": "Develops algorithm to convert data into historic photo. Friend still takes pictures that are somehow blurry as fuck."}, {"id": "ekl00ni", "author": "C0uvi", "body": "That blackboard looks like something straight out of a movie needing the audience to know this is a smart person's  office."}, {"id": "ekkpib1", "author": "goatcoat", "body": "Is that python on the right side of her screen?"}, {"id": "ekkuli6", "author": "NerdWithWit", "body": "That is pure, unadulterated, nerd glee captured in that photo."}, {"id": "ekkzybm", "author": "novaraz", "body": "Zoom in to see matplotlib! The tools of champions!"}, {"id": "emyd8f4", "author": "RustyGamer", "body": "Andrew Chael wrote 850k out of the 900k lines of code. He was also the co-leader of the project along with Kazunori Akiyama.\nMichael D. Johnson wrote 12k lines of code\nChanchikwan wrote 5k lines of code\n\nKatie Bouman? Only wrote 2.4k lines of code\n\nInterestingly enough, the code she wrote was importing something called HOPStools\n\nInterestingly enough if we go look at HOPStools and all its contributors we get:\n>weilgusm wrote 2.9k lines of code\n>chanchikwan wrote 676 lines of code\n>Andrew Chael wrote 1.2k lines of code\n>jpbarrett wrote 71 lines of code\n>Katie Bouman wrote 2 lines of code\n\nhttps://bhi.fas.harvard.edu/people/kazunori-akiyama\n\nhttp://news.mit.edu/2019/mit-haystack-first-image-black-hole-0410\n\nLooks like MIT's social media twitter account didn't collaborate with MIT's own news office since in reality, Katie Bouman did not lead any team at all or was a leader at all.\n\nThe actual leaders were Kazunori Akiyama and Andrew Chael.\n\nNotice how before this social media shilling on twitter, the MIT article only mentioned Katie Bouman once at the very end of the article.\n\nhttp://news.mit.edu/2019/mit-haystack-first-image-black-hole-0410\n\n>The Haystack EHT team includes John Barrett, Roger Cappallo, Joseph Crowley, Mark Derome, Kevin Dudevoir, Michael Hecht, Lynn Matthews, Kotaro Moriyama, Michael Poirier, Alan Rogers, Chester Ruszczyk, Jason SooHoo, Don Sousa, Michael Titus, and Alan Whitney. Additional contributors were MIT alumni Daniel Palumbo, Katie Bouman, Lindy Blackburn, Sera Markoff, and Bill Freeman, a professor in MIT’s Department of Electrical Engineering and Computer Science.\n\nHow long before this MIT article written by MIT themselves gets taken down and rewritten to give Katie Bouman a whole paragraph to herself?\n\nWhen will the mainstream media take responsibility for inaccurate reporting? Why is there such a glaring difference between one of MIT's twitter accounts versus their own press release?\n\nWhy were the 2 leaders: Kazunori Akiyama and Andrew Chael completely ignored by everybody else?\n\n4 teams around the world.\n\nAmerican team was ked by Kazunori Akiyama and Andrew Chael.\n\nNowhere it is mentioned that Katie Bouman led the American team, just only these 2 males who were co leaders.\n\nWhere did this Katie Bouman was leader originate from? Even MIT's own news article doesn't mention this.\n\nhttp://news.mit.edu/2019/mit-haystack-first-image-black-hole-0410"}, {"id": "ekmy2su", "author": "dragonballcell", "body": "Tuns out she did a sub, sub, sub part of a program. A sort of 'adaptor' that just reformats certain data into another format, and then feeds it into the ACTUAL program.\n\nThat misrepresentation of what she actually contributed and what she actually did is nauseating. Either nepotism on the part of the institution or the media.\n\nSources:\n\nHere is what she wrote (hopstools): https://github.com/klbouman/hopstools\n\nHere the mother program where that optional part of her is added, where it acts as a sort of interface to import one more datatype by reformatting it.\n\nSource: https://github.com/sao-eht/eat/graphs/contributors\n\nIt's kinda ridiculous how the media morphs this into something COMPLETELY different.\n\nBtw, that's also NOT an algorithm, but just reformatting data.\n\n---\n\nYou don't understand, she did NOT write and algorithm at all. She did NOT write an image tool at all.\n\nWhat she did code is at max about 4 pages of code, but more importantly, that's neither an algorithm nor a imaging program, but an ADAPTOR for a source of data which reformats the data to feed it into the mother program of which she contributed that adaptor, which makes up 0.01% of said mother program at max AND is marked as \"optional\" part of the program.\n\nSource: https://github.com/sao-eht/eat/graphs/contributors\n\n---\n\nHer whole bundle (hopstools) here was merged into the mother program and counted as one commit of 'mother' program. hopstools, of which she did at max 25%, so her share on contribution on this actual imaging program is about 0.3% max, but OK, lets say 1%, so she did less than 1/4 of 1% of the work. Max. If we're very generous.\n\nThis little part is the share that her contribution does. And again, hopstools is just an adaptor for another data \nformat that can be read into the 'mother' program. That's it.\n\nAndrew Chael wrote 850k out of the 900k lines of code (a lot of it is auto generated lines, but he contributed a large chunk of it). He was also the leader of the project. Michael D. Johnson wrote 12k lines of code. Chanchikwan wrote 5k lines of code.\n\nThe woman? Only wrote 2.4k lines of code.\n\nInterestingly enough, the code she wrote was importing something called HOPStools.\n\nInterestingly enough, if we go look at HOPStools and all its contributors, we get:\n\nWeilgusm wrote 2.9k lines of code.\n\nChanchikwan wrote 676 lines of code.\n\nAndrew Chael wrote 1.2k lines of code.\n\nJpbarrett wrote 71 lines of code.\n\nKatie Bouman wrote 2 lines of code.\n\nHell, even on the hopstools thing, there is this in the summary:\n\nFor Katie:\n\ncd /Users/klbouman/Research/vlbi_imaging/software/hops/build source hops.bash\n\nrun this file from: /Users/klbouman/Research/vlbi_imaging/software/hops/eat\"\n\nShe also fixed absolutely none of the bugs on the EHT.\n\nAnd the algorithm they talk about? It was plagiarized off of a Japanese guy named Mareki Honma who made the thing back in 2012, and uploaded/updated it to GitHub in 2016.\n\nAndrew Chael asked to use it, Honma helped him adapt it, and was part of 60 Japanese people working on the project.\n\nKatie Bouman also isn't following anyone at all on GitHub, and has basically only utilized it for these two projects: hopstools and EHT.\n\n---\n\nThe second co-leader of the EHT imaging group is Kazunori Akiyama, with the first being Andrew Chael.\n\nhttps://bhi.fas.harvard.edu/people/kazunori-akiyama\n\nhttp://news.mit.edu/2019/mit-haystack-first-image-black-hole-0410\n\nLooks like MIT's social media Twitter account didn't collaborate with MIT's own news office since in reality, Katie Bouman did not lead any team at all or was a leader at all.\n\nThe actual leaders were Kazunori Akiyama and Andrew Chael.\n\nNotice how before this social media shilling on twitter, the MIT article only mentioned Katie Bouman once at the very end of the article.\n\nhttp://news.mit.edu/2019/mit-haystack-first-image-black-hole-0410\n\n>The Haystack EHT team includes John Barrett, Roger Cappallo, Joseph Crowley, Mark Derome, Kevin Dudevoir, Michael Hecht, Lynn Matthews, Kotaro Moriyama, Michael Poirier, Alan Rogers, Chester Ruszczyk, Jason SooHoo, Don Sousa, Michael Titus, and Alan Whitney. Additional contributors were MIT alumni Daniel Palumbo, Katie Bouman, Lindy Blackburn, Sera Markoff, and Bill Freeman, a professor in MIT’s Department of Electrical Engineering and Computer Science.\n\nHow long before this MIT article written by MIT themselves gets taken down and rewritten to give Katie Bouman a whole paragraph to herself?\n\nWhen will the mainstream media take responsibility for inaccurate reporting? Why is there such a glaring difference between one of MIT's Twitter accounts versus their own press release?\n\nWhy were the 2 leaders, Kazunori Akiyama and Andrew Chael, completely ignored by everybody else?\n\n4 teams around the world.\n\nAmerican team was led by Kazunori Akiyama and Andrew Chael.\n\nNowhere it is mentioned that Katie Bouman led the American team, just only these 2 males who were co-leaders.\n\nWhere did this \"Katie Bouman was a leader\" originate from? Even MIT's own news article doesn't mention this.\n\nhttp://news.mit.edu/2019/mit-haystack-first-image-black-hole-0410\n\n---\n\nKatie Bouman did not invent the algorithm.\n\nMultiple people are cited on the limited proof of concept thesis.\n\nThe actual research and development of practical application of this technology, as well as development of the algorithm itself, was done by a huge team of researchers, not Katie Bouman:\n\nhttps://arxiv.org/abs/1901.06226\n\nhttps://arxiv.org/pdf/1901.06226.pdf\n\nhttps://iopscience.iop.org/journal/2041-8205\n\nThis is the primary research that led to the possibility of imaging the black hole. Notice how the research cites Andrew Chael’s EHT imaging library (the guy who wrote 850,000 lines of code). Chael wrote the entire library. To not give him the same or preferably more credit than Bouman is pretty messed up.\n\nhttps://bhi.fas.harvard.edu/people/andrew-chael\n\nAlso, Katie Bouman did not lead or manage anything. These are the directors, managers, and affiliates:\n\nhttps://bhi.fas.harvard.edu/our-people\n\nKatie Bouman does not deserve 100%, 50%, 25%, 10%, 5%, or even 1% of the credit. There are so many people involved that made far more significant contributions (like Andrew Chael developing the EHT imaging library).\n\nWhat has science come to when such incredible falsehoods about who contributed to research are perpetuated by the scientific community and mainstream media? It’s wrong.\n\nCredit for this sleuthing goes to u/Dorkydor. I just fixed grammar.\n\n---\n\nEdit: Here's a Tweet that says they did not even use Katie's algorithm to produce the image https://twitter.com/SaraIssaoun/status/1116304522660519936\n\nMirror: https://i.imgur.com/534WdKg.png\n\nShe continues:\n>This is not Katie's fault but due to extremely misleading PR she had no involvement in that was blown out of proportion and harming all involved. Katie is a wonderful, smart and passionate scientist and I love working with her.\n\n>But it's important to set the facts straight and let the collaboration and its people be heard and celebrated for their true accomplishments as part of the many challenging aspects of this project."}, {"id": "ekmb00x", "author": "glitchingamer", "body": "So who was that guy? [https://www.reddit.com/r/pics/comments/bbuvff/this\\_is\\_andrew\\_chael\\_he\\_wrote\\_850000\\_of\\_the/](https://www.reddit.com/r/pics/comments/bbuvff/this_is_andrew_chael_he_wrote_850000_of_the/)"}, {"id": "ekmkebc", "author": "Sandzaun", "body": "She is one of the contributors, but not the main one. Okay, I get it, she is a woman and we want to celebrate it, but please stick with the reality. Here are the real contributors:\n\nhttps://github.com/achael/eht-imaging/graphs/contributors\n\nAs you can see, Andrew Chael is the main contributor and author of the software.\n\nEdit: typo"}, {"id": "ekku23b", "author": "fennesz", "body": "“Fuck yes”\n\n-Apple"}, {"id": "ekln5l3", "author": "GrandBreaker", "body": "I mean, that's cool and all, but it's also blatantly taking credit away from the rather significantly large team, and the coordinated efforts of about 40 years of work, that went into the algorithm and the HE telescope itself. She didn't \"invent the algorithm\" she even said in a ted talk that the algorithm is the result of over a decade of work by her team, a team which was working on it for years before she was ever a part of it.\n\nI'm not saying that her work isn't amazing, I'm saying **don't take credit away from all the people who put decades and generations of their blood, sweat and tears into this project**. Fucking shit."}, {"id": "ekkuebu", "author": "fullforce098", "body": "Translated that chalkboard from Science to English:\n\n\"Math. Math. Magic. Magic. Magic. Math. Magic.\""}, {"id": "ekl9lgq", "author": "link_3007", "body": "Fun Fact: The software she wrote was written in Python, is open-source and can be found in Github\n\n&#x200B;\n\nIf anyone is interested:  [https://github.com/achael/eht-imaging](https://github.com/achael/eht-imaging)"}, {"id": "ekm6gyo", "author": "the-real-putin", "body": "So was this the only person working on the project, the only female maybe and that’s why the reddit front page is awash with stories about her?"}, {"id": "ekmvnhb", "author": "ImNotTemper", "body": "Okay, one of the people who helped develop it. The post makes it sound like she was the sole creator of the entire algorithm that hundreds of people all over the world had put blood sweat and tears into for years."}, {"id": "ekkst13", "author": "derpderpdonkeypunch", "body": "13/10 Would be intellectually inferior to her."}, {"id": "ekna60s", "author": "hyderabadipotta432", "body": "Also lmao at the victims complex : \"no one is sharing stuff about Katie bouman\" while she's the only one credited and being praised in a project made possible by hundreds of people in which she only contributed a minuscule part\n\nTuns out, she did a sub sub sub part of a programm. A sort of 'adaptor' that just reformats certain data into another format, and then feeds it into the ACTUAL programm.\n\nThat misrepresentation of what she actually contributed and what she actually did is nauseing. Either nepotism on the part of the institution OR the media.\n\nSources :\n\nhere, what SHE wrote ( HOPSTOOLS ) : https://github.com/klbouman/hopstools\n\nHere the mother program, where that optional part of her is added, where it acts as a sort of interface to import one more datatype by reformatting it.\n\nsource : https://github.com/sao-eht/eat/graphs/contributors\n\nIt's kinda ridiculous, how the media morphs this into something COMPLETEY different.\n\nbtw: that's also NOT an algo, but just reformatting data.\n\nYou dont understand - she did NOT write and algo at all. sche did NOT write an image tool at all.\n\nWhat she did code is at max about 4 pages of code - but more importantly - is neither an algo, nor a imaging program but is an ADAPTOR for a source of data, which reformats the data to feed it into the mother program - of which she contributed that adaptor, which makes up ca 0.01% of said mother program at max AND is marked as \"optional\" part of the program\n\nsources : https://github.com/sao-eht/eat/graphs/contributors\n\nHer whole bundle (\"hopstools\") here was merged into the mother programm and counted as one commit of 'mother' program. hopstools, of which she did at max 25% Her share on contribution on this actual imaging program is about 0.3% max, but OK lets say 1% - So she did less than 1/4 of 1% of the work. max. If we're very generous.\n\nthis little part is the share that her contribution does. And again : HOPSTOOLS is just an adaptor for another dataformat that can be read into the 'mother' programm. that's it.\n\nAndrew Chael wrote 850k out of the 900k lines of code He was also the leader of the project Michael D. Johnson wrote 12k lines of code Chanchikwan wrote 5k lines of code\n\nThe woman? Only wrote 2.4k lines of code\n\nInterestingly enough, the code she wrote was importing something called HOPStools\n\nInterestingly enough if we go look at HOPStools and all its contributors we get:\n\nweilgusm wrote 2.9k lines of code\n\nchanchikwan wrote 676 lines of code\n\nAndrew Chael wrote 1.2k lines of code\n\njpbarrett wrote 71 lines of code\n\nKatie Bouman wrote 2 lines of code\n\nHell, even on the hopstools thing there is this in the summary:\n\n\"=============================\n\nFor Katie:\n\ncd /Users/klbouman/Research/vlbi_imaging/software/hops/build source hops.bash\n\nrun this file from: /Users/klbouman/Research/vlbi_imaging/software/hops/eat\"\n\nShe also fixed absolutely none of the bugs on the EHT\n\nAnd the algorithm they talk about? It was plagiarized off of a japanese guy named Mareki Honma who made the thing back in 2012, and uploaded/updated it to github in 2016\n\nAndrew Chael asked to use it, Honma helped him adapt it, and was part of 60 japanese people working on the project\n\nKatie Bouman, also isn't following any one at all on Github and has basically only utilized it for these two projects (Hopstools and EHT)\n\nThe second co-leader of the EHT imaging group is Kazunori Akiyama with the first being, Andrew Chael.\n\nhttps://bhi.fas.harvard.edu/people/kazunori-akiyama\n\nhttp://news.mit.edu/2019/mit-haystack-first-image-black-hole-0410\n\nLooks like MIT's social media twitter account didn't collaborate with MIT's own news office since in reality, Katie Bouman did not lead any team at all or was a leader at all.\n\nThe actual leaders were Kazunori Akiyama and Andrew Chael.\n\nNotice how before this social media shilling on twitter, the MIT article only mentioned Katie Bouman once at the very end of the article.\n\nhttp://news.mit.edu/2019/mit-haystack-first-image-black-hole-0410\n\nThe Haystack EHT team includes John Barrett, Roger Cappallo, Joseph Crowley, Mark Derome, Kevin Dudevoir, Michael Hecht, Lynn Matthews, Kotaro Moriyama, Michael Poirier, Alan Rogers, Chester Ruszczyk, Jason SooHoo, Don Sousa, Michael Titus, and Alan Whitney. Additional contributors were MIT alumni Daniel Palumbo, Katie Bouman, Lindy Blackburn, Sera Markoff, and Bill Freeman, a professor in MIT’s Department of Electrical Engineering and Computer Science.\n\nHow long before this MIT article written by MIT themselves gets taken down and rewritten to give Katie Bouman a whole paragraph to herself?\n\nWhen will the mainstream media take responsibility for inaccurate reporting? Why is there such a glaring difference between one of MIT's twitter accounts versus their own press release?\n\nWhy were the 2 leaders: Kazunori Akiyama and Andrew Chael completely ignored by everybody else?\n\n4 teams around the world.\n\nAmerican team was ked by Kazunori Akiyama and Andrew Chael.\n\nNowhere it is mentioned that Katie Bouman led the American team, just only these 2 males who were co leaders.\n\nWhere did this Katie Bouman was leader originate from? Even MIT's own news article doesn't mention this.\n\nhttp://news.mit.edu/2019/mit-haystack-first-image-black-hole-0410"}, {"id": "el01key", "author": "-NavyBluePaint-", "body": "She herself didn't discover it, and it was only a small part in finding. The majority of people who found it were men."}, {"id": "ekkut57", "author": "ant1992", "body": "And she was the very first person to see it! Well done!!!!"}, {"id": "ekmof92", "author": "Dorkydor", "body": "Just post this proof:\n\nTuns out, she did a sub sub sub part of a programm. A sort of 'adaptor' that just reformats certain data into another format, and then feeds it into the ACTUAL programm.\n\nThat misrepresentation of what she actually contributed and what she actually did is nauseing. Either nepotism on the part of the institution OR the media.\n\nSources :\n\nhere, what SHE wrote ( HOPSTOOLS ) : https://github.com/klbouman/hopstools\n\nHere the mother program, where that optional part of her is added, where it acts as a sort of interface to import one more datatype by reformatting it.\n\nsource : https://github.com/sao-eht/eat/graphs/contributors\n\nIt's kinda ridiculous, how the media morphs this into something COMPLETEY different.\n\nbtw: that's also NOT an algo, but just reformatting data.\n\n────────\n\nYou dont understand - she did NOT write and algo at all. sche did NOT write an image tool at all.\n\nWhat she did code is at max about 4 pages of code - but more importantly - is neither an algo, nor a imaging program but is an ADAPTOR for a source of data, which reformats the data to feed it into the mother program - of which she contributed that adaptor, which makes up ca 0.01% of said mother program at max AND is marked as \"optional\" part of the program\n\nsources : https://github.com/sao-eht/eat/graphs/contributors\n\n────────\n\nHer whole bundle (\"hopstools\") here was merged into the mother programm and counted as one commit of 'mother' program. hopstools, of which she did at max 25% Her share on contribution on this actual imaging program is about 0.3% max, but OK lets say 1% - So she did less than 1/4 of 1% of the work. max. If we're very generous.\n\nthis little part is the share that her contribution does. And again : HOPSTOOLS is just an adaptor for another dataformat that can be read into the 'mother' programm. that's it.\n\nAndrew Chael wrote 850k out of the 900k lines of code He was also the leader of the project Michael D. Johnson wrote 12k lines of code Chanchikwan wrote 5k lines of code\n\nThe woman? Only wrote 2.4k lines of code\n\nInterestingly enough, the code she wrote was importing something called HOPStools\n\nInterestingly enough if we go look at HOPStools and all its contributors we get:\n\nweilgusm wrote 2.9k lines of code\n\nchanchikwan wrote 676 lines of code\n\nAndrew Chael wrote 1.2k lines of code\n\njpbarrett wrote 71 lines of code\n\nKatie Bouman wrote 2 lines of code\n\nHell, even on the hopstools thing there is this in the summary:\n\n\"=============================\n\nFor Katie:\n\ncd /Users/klbouman/Research/vlbi_imaging/software/hops/build source hops.bash\n\nrun this file from: /Users/klbouman/Research/vlbi_imaging/software/hops/eat\"\n\nShe also fixed absolutely none of the bugs on the EHT\n\nAnd the algorithm they talk about? It was plagiarized off of a japanese guy named Mareki Honma who made the thing back in 2012, and uploaded/updated it to github in 2016\n\nAndrew Chael asked to use it, Honma helped him adapt it, and was part of 60 japanese people working on the project\n\nKatie Bouman, also isn't following any one at all on Github and has basically only utilized it for these two projects (Hopstools and EHT)\n\n────────\n\nThe second co-leader of the EHT imaging group is Kazunori Akiyama with the first being, Andrew Chael.\n\nhttps://bhi.fas.harvard.edu/people/kazunori-akiyama\n\nhttp://news.mit.edu/2019/mit-haystack-first-image-black-hole-0410\n\nLooks like MIT's social media twitter account didn't collaborate with MIT's own news office since in reality, Katie Bouman did not lead any team at all or was a leader at all.\n\nThe actual leaders were Kazunori Akiyama and Andrew Chael.\n\nNotice how before this social media shilling on twitter, the MIT article only mentioned Katie Bouman once at the very end of the article.\n\nhttp://news.mit.edu/2019/mit-haystack-first-image-black-hole-0410\n\nThe Haystack EHT team includes John Barrett, Roger Cappallo, Joseph Crowley, Mark Derome, Kevin Dudevoir, Michael Hecht, Lynn Matthews, Kotaro Moriyama, Michael Poirier, Alan Rogers, Chester Ruszczyk, Jason SooHoo, Don Sousa, Michael Titus, and Alan Whitney. Additional contributors were MIT alumni Daniel Palumbo, Katie Bouman, Lindy Blackburn, Sera Markoff, and Bill Freeman, a professor in MIT’s Department of Electrical Engineering and Computer Science.\n\nHow long before this MIT article written by MIT themselves gets taken down and rewritten to give Katie Bouman a whole paragraph to herself?\n\nWhen will the mainstream media take responsibility for inaccurate reporting? Why is there such a glaring difference between one of MIT's twitter accounts versus their own press release?\n\nWhy were the 2 leaders: Kazunori Akiyama and Andrew Chael completely ignored by everybody else?\n\n4 teams around the world.\n\nAmerican team was ked by Kazunori Akiyama and Andrew Chael.\n\nNowhere it is mentioned that Katie Bouman led the American team, just only these 2 males who were co leaders.\n\nWhere did this Katie Bouman was leader originate from? Even MIT's own news article doesn't mention this.\n\nhttp://news.mit.edu/2019/mit-haystack-first-image-black-hole-0410"}, {"id": "ekkteeh", "author": "jlew24asu", "body": "why wasn't she on stage today?"}, {"id": "ekkz861", "author": "Devinology", "body": "Very cool.\n\nOn a completely unrelated side note, I'm always puzzled when I see professionals at university or government research facilities and tech companies in photos or videos working away on little laptops.  Is it just me, or is anyone else expecting them to be using powerful desktops hooked up to like five or six 32\" 4K monitors, with, you know, real keyboards and mice?  I can't believe our top scientists and computer people are sitting there using a laptop like an undergrad student.  I'm a therapist and still use three monitors with a proper keyboard and mouse to do my computer related work."}, {"id": "eknc00s", "author": "alexmotorin", "body": "She isnt behind it though, she only did a small part. I know reddit is obsessed with women but come on..."}, {"id": "ekl0bsc", "author": "Lunacti", "body": "She looks genuinely happy and proud. That pure joy is so contagious. Congrats to her and her team!"}, {"id": "ekn5bs9", "author": "sixseven89", "body": "[Except she didn't.](https://i.redd.it/o180y5xn6jr21.jpg)"}, {"id": "ekn6cys", "author": "BannedLife4", "body": "Media made this more about her than the black-hole."}, {"id": "ekn7us0", "author": "mandelsplitter", "body": "Actually Andrew Chael did 75% of the work and he got robbed."}, {"id": "ekna4ew", "author": "hyderabadipotta432", "body": "Also lmao at the victims complex : \"no one is sharing stuff about Katie bouman\" while she's the only one credited and being praised in a project made possible by hundreds of people in which she only contributed a minuscule part\n\nTuns out, she did a sub sub sub part of a programm. A sort of 'adaptor' that just reformats certain data into another format, and then feeds it into the ACTUAL programm.\n\nThat misrepresentation of what she actually contributed and what she actually did is nauseing. Either nepotism on the part of the institution OR the media.\n\nSources :\n\nhere, what SHE wrote ( HOPSTOOLS ) : https://github.com/klbouman/hopstools\n\nHere the mother program, where that optional part of her is added, where it acts as a sort of interface to import one more datatype by reformatting it.\n\nsource : https://github.com/sao-eht/eat/graphs/contributors\n\nIt's kinda ridiculous, how the media morphs this into something COMPLETEY different.\n\nbtw: that's also NOT an algo, but just reformatting data.\n\nYou dont understand - she did NOT write and algo at all. sche did NOT write an image tool at all.\n\nWhat she did code is at max about 4 pages of code - but more importantly - is neither an algo, nor a imaging program but is an ADAPTOR for a source of data, which reformats the data to feed it into the mother program - of which she contributed that adaptor, which makes up ca 0.01% of said mother program at max AND is marked as \"optional\" part of the program\n\nsources : https://github.com/sao-eht/eat/graphs/contributors\n\nHer whole bundle (\"hopstools\") here was merged into the mother programm and counted as one commit of 'mother' program. hopstools, of which she did at max 25% Her share on contribution on this actual imaging program is about 0.3% max, but OK lets say 1% - So she did less than 1/4 of 1% of the work. max. If we're very generous.\n\nthis little part is the share that her contribution does. And again : HOPSTOOLS is just an adaptor for another dataformat that can be read into the 'mother' programm. that's it.\n\nAndrew Chael wrote 850k out of the 900k lines of code He was also the leader of the project Michael D. Johnson wrote 12k lines of code Chanchikwan wrote 5k lines of code\n\nThe woman? Only wrote 2.4k lines of code\n\nInterestingly enough, the code she wrote was importing something called HOPStools\n\nInterestingly enough if we go look at HOPStools and all its contributors we get:\n\nweilgusm wrote 2.9k lines of code\n\nchanchikwan wrote 676 lines of code\n\nAndrew Chael wrote 1.2k lines of code\n\njpbarrett wrote 71 lines of code\n\nKatie Bouman wrote 2 lines of code\n\nHell, even on the hopstools thing there is this in the summary:\n\n\"=============================\n\nFor Katie:\n\ncd /Users/klbouman/Research/vlbi_imaging/software/hops/build source hops.bash\n\nrun this file from: /Users/klbouman/Research/vlbi_imaging/software/hops/eat\"\n\nShe also fixed absolutely none of the bugs on the EHT\n\nAnd the algorithm they talk about? It was plagiarized off of a japanese guy named Mareki Honma who made the thing back in 2012, and uploaded/updated it to github in 2016\n\nAndrew Chael asked to use it, Honma helped him adapt it, and was part of 60 japanese people working on the project\n\nKatie Bouman, also isn't following any one at all on Github and has basically only utilized it for these two projects (Hopstools and EHT)\n\nThe second co-leader of the EHT imaging group is Kazunori Akiyama with the first being, Andrew Chael.\n\nhttps://bhi.fas.harvard.edu/people/kazunori-akiyama\n\nhttp://news.mit.edu/2019/mit-haystack-first-image-black-hole-0410\n\nLooks like MIT's social media twitter account didn't collaborate with MIT's own news office since in reality, Katie Bouman did not lead any team at all or was a leader at all.\n\nThe actual leaders were Kazunori Akiyama and Andrew Chael.\n\nNotice how before this social media shilling on twitter, the MIT article only mentioned Katie Bouman once at the very end of the article.\n\nhttp://news.mit.edu/2019/mit-haystack-first-image-black-hole-0410\n\nThe Haystack EHT team includes John Barrett, Roger Cappallo, Joseph Crowley, Mark Derome, Kevin Dudevoir, Michael Hecht, Lynn Matthews, Kotaro Moriyama, Michael Poirier, Alan Rogers, Chester Ruszczyk, Jason SooHoo, Don Sousa, Michael Titus, and Alan Whitney. Additional contributors were MIT alumni Daniel Palumbo, Katie Bouman, Lindy Blackburn, Sera Markoff, and Bill Freeman, a professor in MIT’s Department of Electrical Engineering and Computer Science.\n\nHow long before this MIT article written by MIT themselves gets taken down and rewritten to give Katie Bouman a whole paragraph to herself?\n\nWhen will the mainstream media take responsibility for inaccurate reporting? Why is there such a glaring difference between one of MIT's twitter accounts versus their own press release?\n\nWhy were the 2 leaders: Kazunori Akiyama and Andrew Chael completely ignored by everybody else?\n\n4 teams around the world.\n\nAmerican team was ked by Kazunori Akiyama and Andrew Chael.\n\nNowhere it is mentioned that Katie Bouman led the American team, just only these 2 males who were co leaders.\n\nWhere did this Katie Bouman was leader originate from? Even MIT's own news article doesn't mention this.\n\nhttp://news.mit.edu/2019/mit-haystack-first-image-black-hole-0410"}, {"id": "elzo8le", "author": "will-smiths-leftsock", "body": "It’s really sad how one person on the team did 850,000 lines of 900,000 lines of the code yet no one knows him"}, {"id": "emq1huv", "author": "AlexisCoffee", "body": "I'm sad for people in this thread trying to discredit her just because she didn't do most work, like, so what? does it means She doesn't deserve any credit at all? if some people worked more on it credit them, don't discredit her"}, {"id": "eshaw0b", "author": "bloyy", "body": "She literally wrote 2000 of the 900,000 lines of code... another bloke wrote 850,000 of the lines, and gets absolutely ZERO recognition."}, {"id": "ekkr1rg", "author": "LegoMaster2149", "body": "I wish her my kind regards for her groundbreaking accomplishment. I am happy to have witnessed such a historic moment in my lifetime! :)"}, {"id": "ekne0g4", "author": "CattitudeLatitude", "body": " So, where did the post about Andrew Chael, the man who was actually behind the algorithm, having written 850k out of the 900k lines of code used in processing the picture, go? I could have sworn that it was a prominent post in this subreddit, yet it seems to have disappeared? Does anyone know what happened?"}, {"id": "ekl0131", "author": "shadowgnome396", "body": "She's certainly younger than I imagined someone with her accomplishments would be! That's amazing."}, {"id": "ekkv3k8", "author": "Wingo21", "body": "Being a computer science student, this is pretty inspiring"}, {"id": "ekkwd5q", "author": "Ur_Glog", "body": ">Historic picture of a super massive blackhole\n\n>Gets used as a meme\n\nWe live in a clown world 🤡🌍\n\nHONK HONK 🤡👌\n\nI H S"}, {"id": "ekkvnm0", "author": "iCowboy", "body": "This evening, BBC Horizon ran an episode on BBC Four in which Dr Bouman featured. An excellent programme following the Event Horizon Telescope team over the years and showing some of the issues they had - everything from cooling fans to wonky clocks, glacial flow to plate tectonics.\n\nShould be on iPlayer any minute now."}, {"id": "ekm3z1a", "author": "bedtimez", "body": "[Now I’m confused](https://i.imgur.com/JwN7ru6.jpg)"}, {"id": "ekmg61b", "author": "path_ologic", "body": " **Andrew Chael** wrote it, not her. How about you tell the truth instead of misleading people, and actually say what she did instead of making stuff up for reddit points?"}, {"id": "ekl5a5r", "author": "TruthBeforeAll", "body": "Take a look at the GitHub repository for the project. She contributed about 5% of the code for the algorithm whereas one guy did 80% of the work. I Googled his name and he's not mentioned in a single news source...\n\nEdit: he's also the founder of the project and he started the initiative. In what universe did she \"lead\" anything? This is why the media is considered dishonest and trying to push a political narrative.\n\nEdit 2: turns out they didn't even create a new algorithm. The algorithm was created by a Japanese team over 2 years ago, and they only made slight modifications to an already existing algorithm for interpreting radio interferometry signals that would fit their specific data set... -- to which she contributed about 5% of github commits of code."}, {"id": "eklbanb", "author": "schmistopher", "body": "Math at this level is just wizardry."}, {"id": "ekmdcvt", "author": "baseitr6", "body": "Except she was part of a team of 200. \n\nShe’s smart, thousand times smarter and more successful than me. But still part of a team. \n\nReality gonn reality"}, {"id": "ekl2wx4", "author": "COMSUBLANT", "body": "This is one of the worst cases of media manipulation I have seen. She was part of a large team who were responsible for figuring out a system of data processing and filtering, she had a [relatively minor contribution](https://imgur.com/a/8Qt1Ifh) to that team as anyone who cared to do a modicum of research would realise."}, {"id": "ekkvebn", "author": "Scottyjscizzle", "body": "I'm curious. Is she really the one \"behind it\" or is this like the picture of Margaret Heafield that Reddit loves to post with the credit of \"single handedly writing all of the code to land on the moon!!!\"."}, {"id": "eklgvsz", "author": "Scary_Bushmonster", "body": "Give all the credit to one person"}, {"id": "eklupa2", "author": "Snavster", "body": "The GitHub with contributors and the repo for the algorithm for those interested:  [https://github.com/achael/eht-imaging/graphs/contributors](https://github.com/achael/eht-imaging/graphs/contributors)\n\n&#x200B;\n\nCongrats to Dr Bouman and team for this amazing work!"}, {"id": "ekkuj1s", "author": "fullforce098", "body": "I love that this room has a chalkboard AND the a whiteboard, both filled with science."}, {"id": "ekkuue2", "author": "UdavidT", "body": "Why does it resemble the dark sign from dark souls?"}, {"id": "ekkvhmd", "author": "grickygrimez", "body": "Tarantino is a terrible filmmaker because he hires a cast and crew.\n\nFDR didn't really have a pivotal role in WW2 because he had soldiers.\n\nBill Gates doesn't actually MAKE the vaccines that all but wiped out malaria.\n\nYa'll might not see it but ya'll are some subconsciously sexist mo'fuckers. She's done more than anyone in these comments but ya'll trying to rip her down because you are jealous."}, {"id": "ekm473i", "author": "MNKPlayer", "body": "She put in 2,410 lines of code to the project. Andrew Chael put in 850,275 lines into the project. I'm not dismissing her work, maybe it was the code that was needed to complete it, but to claim she was the one that did all the work, which this post implies, is dishonest.\n\nhttps://github.com/achael/eht-imaging/graphs/contributors"}]}