{"id": "co6h3d", "title": "I got a cease and desist for making the Crocs Gloves", "url": "https://i.redd.it/9xijbv8pvgf31.jpg", "subreddit": "pics", "author": "rightcoastguy", "text": "", "comments": [{"id": "ewgjz4t", "author": "RamsesThePigeon", "body": "Do we seriously have to go through this again, people?\n\nOkay, fine... but I'm *very* disappointed in you.\n\n**This is not an advertisement. \"Crocs Gloves\" is not a real product. Ketchup is not a vegetable. A single hyphen is the difference between a \"man-eating chicken\" and a \"man eating chicken.\" A vocative comma is the difference between \"Come on, people!\" and \"Come on people!\"**\n\nIn short, stop reporting the post. Nobody is trying to sell you anything."}, {"id": "ewgb6si", "author": "Nothing_Nice_2_Say", "body": "From the fashion police?"}, {"id": "ewgeulo", "author": "DullSharp", "body": "Croc Blocked"}, {"id": "ewg9bar", "author": "dada6868dada", "body": "Damn, they blew a huge hiring oppurtunity. Them gloves will be huge when the apocalyptic Mad Max/mutant vehicle days fall upon us."}, {"id": "ewg7rzx", "author": "ManyVoices", "body": "\"Please stop. Please.\""}, {"id": "ewg8osf", "author": "etriz", "body": "I like how you look so happy to receive a letter from a legal department."}, {"id": "ewgd0sq", "author": "tallmiller", "body": "Time to rebrand as Gator Gloves"}, {"id": "ewgb77w", "author": "flunkyclaus", "body": "Now if you could make an almost exact replica of that letter and send it back asking them to stop making shoes...\n\nEdit: Oof! Just broke my Gold and Silver cherries in the same day! I'm not going to walk straight for a while. \n\nThank you loveable strangers! I promise I'll call..."}, {"id": "ewgf388", "author": "ZombieTrainee", "body": "\"*If you wear Crocs .... you're gonna need these*. **Gatorbators**. Pre-lotioned for immediate use.\""}, {"id": "ewg7we7", "author": "rightcoastguy", "body": "Can't say I'm surprised or really upset at all due to the fact of how much they blew up over the past two weeks, I figured they were going to get in touch one way or another.  I talked about it a bit more, Fair Use in parody, and being a content creator in general on [YouTube.](https://www.youtube.com/watch?v=YQQHHRwPF0I&t=2s) Now onto the next unnecessary invention!"}, {"id": "ewgb0w1", "author": "sh1nes", "body": "The is the Crocs legal department going through the motions of protecting the company's trademark. They basically have to send this guy a C&D."}, {"id": "ewgdkud", "author": "beansm8beans", "body": "I hope you got that letter framed and hung up on the wall. Very few receive the honour of getting a “stop your shit before we sue you” letter from crocs!"}, {"id": "ewgf8o4", "author": "TheKuchenBurglar", "body": "And it appears as though you have neither ceased, nor desisted. Carry on, prodigal son."}, {"id": "ewg9f0m", "author": "sixesand7s", "body": "You should make Crocs Condoms\n\n&#x200B;\n\nEDIT: Why do I get gold for my dumbest comments, I love you Reddit, never change."}, {"id": "ewgepta", "author": "Spartan2470", "body": "[Here](https://www.reddit.com/r/UnnecessaryInventions/comments/cjfq3g/crocs_gloves_i_made_a_pair_of_crocs_gloves/) is OP's original submission about these gloves.\n\n[Here](https://www.youtube.com/watch?v=6HeUYFUgDu0&feature=youtu.be) is the video of how OP made these."}, {"id": "ewgget6", "author": "DrakeAU", "body": "Make a Croc Chastity Belt to annoy them further. I mean normal Crocs are technically a Chastity Belt anyway as nobody is going to get laid wearing Crocs. However it would still be really funny to see a second cease and desist!"}, {"id": "ewgjyft", "author": "Truculent_Raisins", "body": "I got a letter one time asking me to please stop calling velcro “velcro.”  Sorry that your brand name has become a noun, but no way I’m calling it “interlocking fastening tape.”\n\nEdit: If you haven’t watched the video posted below by toolazytomake, do it. Not once, but over and over. It’s awesome and would have gotten me to change my mind back in the day. And if you upvoted me, upvote the video."}, {"id": "ewgc44y", "author": "sev45day", "body": "So we're all just going to ignore this guy's eyes? Really? I think I'm ovulating right now, and I'm a straight guy."}, {"id": "ewgfwcp", "author": "gbaroth", "body": "whenever you send someone a cease and desist, you should expect them to immediately post said cease and desist publicly"}, {"id": "ewghv7p", "author": "Noxious89123", "body": "Not many people know, but trademark holders are actually ***legally obligated*** to defend their trademarks, or else risk losing them."}, {"id": "ewgfrhs", "author": "zigaliciousone", "body": "Were you selling them though? If they were for personal use, send them a reply letter with a Crocs themed condom and tell them to fuck themselves."}, {"id": "ewgeivr", "author": "barktothefuture", "body": "As long as your not selling them I really don’t think they can do anything about it."}, {"id": "ewgcvak", "author": "mister_808", "body": "This crocs me up"}, {"id": "ewgcqm3", "author": "imzwho", "body": "That implies that they think croc gloves have a market. \n\n\nI really hope they do not start making these ......"}, {"id": "ewgjc13", "author": "hilib", "body": "Was the Cease and Desist from Crocs?  Or just the general public?"}, {"id": "ewgcars", "author": "thxxx1337", "body": "I want you to slap me in the face once while wearing those. You have my full permission."}, {"id": "ewge6zv", "author": "TheAtrocityArchive", "body": "The hero we never knew we needed."}, {"id": "ewgc85u", "author": "DownvoteDaemon", "body": "You Mickey blue eyes lookin mf..those are beyond awful. We have transcended fingerless gloves."}, {"id": "ewggc1b", "author": "TheMightyWoofer", "body": "Now make the boot form: Doc Crocs"}, {"id": "ewggy8w", "author": "DrizzlyEarth175", "body": "This is exactly what I would expect the \"Croc gloves\" guy to look like"}, {"id": "ewgi1a6", "author": "danmanx", "body": "\"He just gave our company free advertising!\"\n\n\"Hmmm, send him a cease and desist just in case he's onto something.\""}, {"id": "ewgi0f6", "author": "desexmachina", "body": "I don’t know how they can enforce that C&D.  You aren’t making volume, so there’s no patent to enforce.  They aren’t commercially available, so there’s no mechanism from the FTC or DOC that you’re violating.  You aren’t packaging them, so you aren’t infringing on trade dress.  Maybe you can’t call it Crocs publicly.  This is a typical strong arm lawyer tactic.  Get your attorney to tell them to pound sand.  I’ve lost respect for those A-holes.  Your effort was clearly aimed at humor and novelty, not libel/slander or defamation."}, {"id": "ewgg4qs", "author": "Sithjustgotreal22", "body": "You look exactly like someone who would be in this situation"}, {"id": "ewgkxzo", "author": "joy3r", "body": "God sent crocs a cease and desist but they ignored it"}, {"id": "ewgmh6k", "author": "PandaYoshi", "body": "Damn, and to think I could’ve worn those gloves with my jean shorts and jean jacket and not be judged at all."}, {"id": "ewg8s1b", "author": "ficomm", "body": "I'm excited to see what you do next!"}, {"id": "ewghu4m", "author": "DetectiveMotts", "body": "Yoooooo where my Ugg gloves at?"}, {"id": "ewgpupb", "author": "skyvin", "body": "So can I buy a pair or not?"}, {"id": "ewgq3q6", "author": "Z0idberg_MD", "body": "I’m not sure what this post is about. Im lost in that guy’s eyes. Stirring something in me."}]}