{"id": "cp4sce", "title": "DEMOCRACY NOW", "url": "https://i.redd.it/6tcarmtiwwf31.jpg", "subreddit": "pics", "author": "foxeydog", "text": "", "comments": [{"id": "ewn8mtn", "author": "Koffi5", "body": "I can do nothing except say Good luck to the brave people of HK\n\nEdit:\nYou can, support free press in HK here: https://www.hongkongfp.com/support-hkfp/\n\nEdit2: \n> CANADIANS  🇨🇦\n> there will be a meet up 8.17 this coming saturday in major cities.\n> please please please come out in support of Hong Kong.\n> please. PM me for details in the coming days. I don't know much more than that at this point. Please understand we're just regular dudes, not magic professional event planners.\n> But we need your help. Stand with us. Everything will be in English and Cantonese.\n(Previous ones have been in Markham and Toronto)\n\nEdit3: Thanks to u/Chocobean for the information about the protest. If there are none around your area it could change any second"}, {"id": "ewndvds", "author": "jakesteed33", "body": "Can someone explain this whole Hong Kong thing to me in simple terms?"}, {"id": "ewna6nh", "author": "alteredstatus", "body": "I’d love to see this story have a happy ending, but separatist movements (even the most limited in scope) don’t have a track record of happy endings in China."}, {"id": "ewo1mxq", "author": "wt4fox", "body": "Hello world, we Hongkongers are fighting.\nStand with us."}, {"id": "ewnma3i", "author": "sacherich", "body": "Hi Reddit, I sincerely request your support on our democracy movement.  We need more attention from the rest of the world to combat this battle.  We might not win, but we never give up. Please help upvote and share!\n\nA Hongkonger\n\n(Sorry, English is not my first language.)"}, {"id": "ewnairx", "author": "usernamemustbegood", "body": "*Democracy now dot org, the war and peace report, I'm Amy Goodman*"}, {"id": "ewnc0ty", "author": "arsjan", "body": "This is a very powerful image.\n\n\nEdit: thanks for my first silver, kind redditor friend. 👍"}, {"id": "ewnffpq", "author": "italianhandgun", "body": "> *Do you hear the people sing?*\n> *Singing a song of angry men?*\n> *It is the music of a people*\n> *Who will not be slaves again*"}, {"id": "ewnwdaf", "author": "GCNCorp", "body": "The thing most depressing is the protestors using lights and masks to stop facial recognition technology. That's such a fucked up dystopia."}, {"id": "ewng6g1", "author": "angry_badger32", "body": "Man, I hope the best for them but there is no way this is going to end well."}, {"id": "ewnvf90", "author": "Chocobean", "body": "# CANADIANS  🇨🇦\n\n## [🍁](https://emojipedia.org/maple-leaf/)\n\n## [🍁](https://emojipedia.org/maple-leaf/)\n\n## [🍁](https://emojipedia.org/maple-leaf/)\n\nthere will be a meet up 8.17 this coming saturday in major cities.\n\nplease please please come out in support of Hong Kong.\n\nplease. PM me for details in the coming days. I don't know much more than that at this point. Please understand we're just regular dudes, not magic professional event planners.\n\nBut we need your help. Stand with us. Everything will be in English and Cantonese.\n\nPosters should be out tonight will PM again! Should have dates and time soon\n\n:D city list is OUT!\n\n~~Vancouver 8/17 Calgary Winnipeg 8/17 Toronto/Markham 8/17 Montreal 8/18 Halifax 8/17~~\n\nTell your friends in other cities! Thanks for your care <3\n\n&#x200B;\n\n&#x200B;\n\nEDIT:\n\nVancouver confirmed\n\n&#x200B;\n\nCalgary confirmed\n\n&#x200B;\n\nWinnipeg 2pm - 5pm\n\n&#x200B;\n\nToronto 3:30pm - 5pm\n\n&#x200B;\n\nOttawa 2 - 4pm\n\n&#x200B;\n\nHalifax confirmed\n\n&#x200B;\n\nSt. John’s confirmed\n\n&#x200B;\n\nthe ottawa event, with permits and everything, is being organized by a seperate group from the other ones\n\nSaturday Aug 17 2-4pm at the hill - i can't post Facebook event links in this sub :) please PM if you want to keep up with them thanks!"}, {"id": "ewnfodf", "author": "just-casual", "body": "This is a fucking metal picture. Please be safe HK."}, {"id": "ewnhkpj", "author": "ApplaudableUser", "body": "I live on the other side of the world so I feel like I can’t do anything to help. Is there any things I can do to show support for Hong Kong?"}, {"id": "ewnu6eu", "author": "KING_OF_BICC", "body": "I am from China but I hate the Chinese Government"}, {"id": "ewnfho1", "author": "Driver2900", "body": "There is an abnormal amount of civil unrest in the world RN.\n\n^((note: by \"unrest\" I am not differentiation between good and bad.))"}, {"id": "ewnhjc3", "author": "ExpensiveLove", "body": "The spirit and strength they have to come out against corruption is something we can ALL learn from. \n\nRooting for you guys!"}, {"id": "ewnvjm0", "author": "SirBoberus", "body": "This will be in a textbook one day"}, {"id": "ewnhlzw", "author": "v1smund", "body": "Hey Xi Jingping...uh, I think they are trying to tell you something bro."}, {"id": "ewnv0ma", "author": "USBLight1", "body": "Fuck you, China.\n\nTo be fair, I'm on record telling my own government to fuck off."}, {"id": "ewnvdaz", "author": "RedhatBlackheart", "body": "Of course no coverage anywhere, same with Russian protests.. corporate news is a plague and needs to be banished."}, {"id": "ewnfzmn", "author": "Decoy77", "body": "I’m impressed with how massive this protest movement is, how well organized and persistent it is. How did they do it? We could never have this in US."}, {"id": "ewnpxc8", "author": "ArtOfDivine", "body": "Will this protest actually lead to anything? China seem to not give a fuck"}, {"id": "ewoefzm", "author": "mart1373", "body": "It’s gotta be an awkward day for China’s Tencent, which owns a portion of Reddit."}, {"id": "ewnfb5f", "author": "MILE013", "body": "What can I do as an American to help?"}, {"id": "ewnh8xb", "author": "dabakos", "body": "SERENITY NOW SERENITY NOW"}, {"id": "ewo0nsk", "author": "thehectorion", "body": "China got fucked by Britain and Britain got HK."}, {"id": "ewni49d", "author": "FightForDemocracyNow", "body": "My username is relevant but I'm not sure what to comment"}, {"id": "ewnf0zg", "author": "dedredcopper", "body": "Absolutely nobody I speak to in my family knows about this because they only watch local news in America and they act like I’m making it up when I try to explain the magnitude of this protest. They also don’t know about Kashmir or the Myanmar genocides or the Russian protests 🤦‍♀️"}, {"id": "ewnc2dy", "author": "ChristoWhat", "body": "\"Lol nope\"  -  China"}, {"id": "ewnhbnn", "author": "1thief", "body": "https://imgur.com/9N1D32D"}, {"id": "ewnh30h", "author": "Sbatio", "body": "I wish I lived in a city/state where the people cared this much about our futures."}, {"id": "ewnqfxe", "author": "crushgrapeberrysoda", "body": "Love you HK"}, {"id": "ewnv0x4", "author": "mzialendrea", "body": "Full support the protesters, but this unfortunately is a Tiananmen Square massacre in the making."}, {"id": "ewnaraq", "author": "killroy1971", "body": "Good luck with that.  I'm sure the Chinese Premier would love to have an island of democracy mucking up his communist perfection."}, {"id": "ewno0zg", "author": "Dell_Rider", "body": "And to r/teenagers"}, {"id": "ewnrer7", "author": "SerialDeveloper", "body": "They assured me I was guilty but I commited no crime  \nThey said confessions bring lenience so they put me on the line  \nSo I protest the massacres at the Tiananmen Square  \nMy friends said yo, stay away man, you better not go fucking back there  \n  \nThey wouldn't let me write about my opinions about the state  \nAnd freedom of expression they would never tolerate  \nAnd the military secrets that I never did steal  \nI didn't start no violence, and there was nobody that I killed  \n  \nSo I have a clear account of all the abuses of power  \nAnd the memories of my homeland have now gone sour  \nAnd I only got one weapon, its so plain for me to see  \nMy only weapon I call.. poetry  \n  \nAnd I don't even know why  \nThe truth seems like a lie  \nIn my cell there is no sky  \nWhen I was arrested in Shanghai  \n  \nInto wealth and priveledge, huh, I was not born  \nBut a devotion to freedom and liberty, I was sworn  \nSo every emotion is studdied, watched and controlled   \nWho gets paid, who gets disciplined, who gets rolled  \n  \nA transmitter beams my coordinates anywhere on earth  \nAnd radio waves, surveilance, satellite burst  \nOpen up your skull and let some knowledge come in  \nCrack open the cranium and let awareness begin......."}, {"id": "ewnup73", "author": "dulun18", "body": "once you get a taste at freedom...."}, {"id": "ewo89t2", "author": "TBsama", "body": "Brave people you have my full respect and I wish you the best of luck"}, {"id": "ewqm277", "author": "JacketJack", "body": " \n\nList of inhumane deeds by the Hong Kong Police Force:\n\n&#x200B;\n\n1. Dispersing protestors with tear gas (TG), but leading them into a building and trapping them.\n2. Firing TG canisters directly onto human bodies, causing burns.\n3. Firing TG canisters directly towards press.\n4. Firing EXPIRED TG.\n5. Claimed to have fired 1000 TG in the past 1.5 months, proceeds to fire 800 in a single day.\n6. Firing TG onto civilian areas (residences, elderly homes, etc.), hurting children as young as 2yo.\n7. Firing TG INSIDE subway stations.\n8. Firing rubber bullets and TG few seconds after the warning.\n9. Firing non-lethal bullets aiming at eye-level (they can only shoot below waist, stated by them in 2003), headshotting multiple and permanently blinding a first-aid.\n10. Shooting pepper balls (bullets) at an extreme close range (less than 1m), causing a chain to fall down an escalator.\n11. Arresting a reporter from a pro-China media, then apologizing like dogs.\n12. Arresting a student for buying astronomical laser pointers, accusing him for owning weapons.\n13. Yelling and pushing a reporter from a pro-government media, media now became anti-police.\n14. Using strong lights on reporters to prevent them from taking good footages.\n15. Backdooring patient information from hospital databases, arresting injured protestors.\n16. High-ranking gov official publicly apologized for worrying the public (fair apology imo). Policemen proceeds to question his authority. He took back the statement.\n17. One day, everyone heard rumours that triads are ambushing protestors returning home at night, which did happen (MANY WERE SEVERELY BEATEN UP). The police arrived 39 minutes after the massacre, none were arrested.\n18. Same day, police said they did not see these triads. Livestreams witnessed them chatting, arms over shoulders.\n19. Till now, 27 triad members were arrested but none charged.\n20. Another day another place, triad members are attacking protestors with knives. None arrested.\n21. Same day another place, triad members attacked protestors with sticks. None arrested.\n22. Another day another place, triad members attacked protestors. Police brought some of them away but none arrested.\n23. Beating up protestors even after they are arrested. Protestor yelled, \"I'm arrested alright! Stop beating me up!\n24. Dragging a female protestor, showing her bra.\n25. Dragging another female protestor, her whole skirt came off.\n26. Grabbing a male protestor by his penis.\n27. Dressed as protestors and arresting them, possibly pretending to incite violence before to frame protestors.\n28. Putting a stick into a protestors' bag, framing him of owning weapons.\n29. Claimed officer was second-degree burnt by molotov cocktails -- medical professionals said that it doesn't look like a molotov burn.\n\nThat's everything I can remember for now."}, {"id": "ewnv3cx", "author": "Raptor_360", "body": "Power of people > People with power"}, {"id": "ewnwooz", "author": "luka--bed", "body": "They didn't write this just for their government they wrote this because they need the wests support let's not forget only a handful of countries even recognize Taiwan as an independent country for Hong long to be free we must help they fight the oppressors"}, {"id": "ewo2jnd", "author": "p3rviepanda", "body": "As a HKer living in Canada, I am so touched by what's happening in HK being recognized and heard worldwide. I am also really sadden to see my home coming to this day."}, {"id": "ewo6o8f", "author": "jakeyjakjakshabadoo", "body": "I've been listening to some economic experts who have been saying that the only way China's socialist economy has been able to survive is due to Hong Kong and the other few capitalist areas it holds by force. They were saying that socialist economic planners can't determine product values in shifting circumstances so they copy others. Anyone else hear this or know more about it?\n\nIf that's true, Hong Kong can never be free as long as the PRC is in power."}, {"id": "ewo726d", "author": "vandalpwuff", "body": "As a Hong Konger thank you."}, {"id": "ewo7c6l", "author": "thexdroid", "body": "From the Reddit I can only support you HK brave people with up vote but from here I can help to spread the message of a people that wish freedom."}, {"id": "ewo7e7m", "author": "EastCoastBeardo", "body": "I’m stuck in the Hong Kong airport with a bunch of panicked people. I can wait a day here if it’ll help. Please, no need to thank my heroic actions! Zzz"}, {"id": "ewo7hdy", "author": "dallyopcs", "body": "Why are all their signs in English and not Cantonese/Mandarin?"}, {"id": "ewomyzi", "author": "Downtownloganbrown", "body": "The fuck are these awards?\n\nFUCK CHINA AND WINNIE THE XIN"}, {"id": "f9lb9hz", "author": "saoonv69", "body": "Holy shit those metals are more then 100k coins! Also free Hong Kong yeah"}, {"id": "ewnitmc", "author": "Animus0724", "body": "Are we talking Democracy democracy or American Democracy because there is a clear difference."}, {"id": "ewnej0q", "author": "EBear17", "body": "What are the red squares?  My knee jerk reaction says that is part of the facial recognition system they have but I have no basis beyond knowing it exists."}, {"id": "ewntw74", "author": "Pucyyyy", "body": "As a mainlander, I completely and sincerely support the people of HK. \n\nEat shit, Pooh."}, {"id": "ewnfeqb", "author": "woodzopwns", "body": "As a Brit I really wish our government would do more on this and offer help."}, {"id": "ewnehrb", "author": "getyourcheftogether", "body": "OMG how many thoughts and prayers will this take?"}, {"id": "ewnv5ef", "author": "ILayWood12", "body": "God speed HK. Fuck China, and Communism."}, {"id": "ewni7ic", "author": "portagedude", "body": "Hong Kong, I support you. Portage, MI, USA. Be safe...be strong"}, {"id": "ewnkcbl", "author": "vinecardslamp", "body": "I think if we care about Hong Kong we should put pressure on our elected officials to put pressure on China, right? But it would take a massive number and the West (US) barely cares about itself, let alone anyone else"}, {"id": "ewnuyx7", "author": "sadboysed", "body": "Hear the people"}, {"id": "ewnuyyd", "author": "Less_Transportation", "body": "Such a strong image! Keep on going people of HK"}, {"id": "ewnw7fz", "author": "Frankenstien456", "body": "Chinese Government: This never happened"}, {"id": "ewnx253", "author": "Max-the-God-v2", "body": "I am impressed by this courage. Especially with regards to daily suppression in mainland China. These protesters risk everything! I wish China could be more democratic!"}, {"id": "ewnxzbr", "author": "Kyrran", "body": "I know this is the wrong moment but why do the awards spell penis?"}, {"id": "ewo6sqw", "author": "Banshee-77", "body": "Bump support, keep this in the frontpage folks!"}, {"id": "ewo7nhq", "author": "watchyirc", "body": "China is gonna kill all these people. That’s what you get for living in a shitty country"}, {"id": "ewo90b3", "author": "id4220", "body": "Fucking chills man. Take the power back."}, {"id": "ewoker0", "author": "MoistMummys", "body": "After they get true democracy Antifa should move in and call all them racist Nazis and try to turn them all socialist."}, {"id": "ewol07a", "author": "angrybutt420", "body": "They fight for democracy while the American looney left fight for oppression. Backwards ass world we live in."}, {"id": "ewollcy", "author": "storieboy", "body": "Nobody wants China’s bullshit."}, {"id": "ewombhk", "author": "hedgeproject", "body": "I was in HK during the umbrella protests and was quite impressed. Now the current protest reconfirms that HK society will keep its freedom whatever it takes. Amazing"}, {"id": "ewon7di", "author": "CrispySkin_1", "body": "This is on the one hand very inspiring, on the other hand I know a lot of the people in photos like this are going to be dead once China starts cracking down for real and that makes me sad."}, {"id": "exl5xp0", "author": "typicallchad6", "body": "You all deleted the Chinese massacre pic. Pussies"}, {"id": "exlhvta", "author": "KinkiiTwinkii", "body": "I can hear tencent demanding mods to delete this post"}, {"id": "eyvdxy0", "author": "hkaddoil1256", "body": "HONGKONGERS UNITE, ADD OIL!"}, {"id": "ezguygt", "author": "Yamonomics", "body": "Get on over to /r/HongKong everyone"}, {"id": "fb3lo6j", "author": "whyismypeewhite", "body": "are we gonna ignore that the awards spell penis backwards"}, {"id": "ewnj3dy", "author": "crel42", "body": "From Venezuela we say to you: DONT GIVE UP. \nWe are in this fight against China as well."}, {"id": "ewned1z", "author": "furie1335", "body": "Hong Kong needs to form a provisional government and declare independence"}, {"id": "ewnhcww", "author": "hypanormalized4eva", "body": "Damn. God damn. More power to you hong kong!"}, {"id": "ewnhds7", "author": "Fidelis29", "body": "Best of luck to them. This situation seems like it's ready to boil over."}, {"id": "ewnhdxm", "author": "ChornWork2", "body": "democracy protests in hong kong, and in moscow.  signs of hope to weigh against the rise of nationalism in the west."}, {"id": "ewnlkgx", "author": "sunburn69", "body": "That looks bangin!"}, {"id": "ewns2wc", "author": "UKHirst", "body": "We the UK should have never given the territory back to China, if anything Hong Kong should of been made an independent country instead of having their rights and freedoms stripped away day by day."}, {"id": "ewnvafg", "author": "abhiklodh", "body": "It’s so sad to see that most of the news outlets and social media just seem to ignore this issue but only in Reddit, this fight for freedom gets recognised. Pathetic."}, {"id": "ewo7w5w", "author": "MutatedAlgorithm", "body": "Honestly, fuck PRC at this point."}]}