{"id": "cpsdwd", "title": "Protestor in Hong Kong today", "url": "https://i.imgur.com/zFDHmbn.jpg", "subreddit": "pics", "author": "UsernameUsernameson", "text": "", "comments": [{"id": "ewrci6n", "author": "Spartan2470", "body": "[Here](https://pbs.twimg.com/media/EB1Gq5JUIAEUtah.jpg:orig) is another picture of this sign.  [Here](https://twitter.com/alvinllum/status/1161161988547870720/photo/1) is the source.  Per there:\n\n@alvinllum\n\n> In Queen Mary Hospital, some medical staff showed support for one lady who is shot blind on Sun. “Police shot my eye, give me back my eye!”\n\n> 11:26 PM - 12 Aug 2019"}, {"id": "ewre853", "author": "PotatoClanMember", "body": "Hong Kong is a ticking time bomb right now. Either the protesters get what they want or China paints a very bad public image if they dont"}, {"id": "ewrc7hx", "author": "Consistent_Floor", "body": "PepeHands"}, {"id": "ewrcidc", "author": "Jindabyne1", "body": "That’s quite a nice mask"}, {"id": "ewrg8th", "author": "WrongPermit", "body": "Once again, I'd like to echo another thread's comments. Cynicism is an inevitable thing, but it might do more harm than good:\n\nThere are a disturbing number of posts here that are attempting to completely normalize the idea that 1) China taking HK early is inevitable, and 2) that there is nothing anyone can or will do about it.\n\nEither Reddit has become filled with sociopathic armchair assholes (racing to predict a horrible outcome), or some people really want to push a particular narrative and sow the seeds of defeatism for the benefit of a particular government.\n\nSeriously, what is the value in pushing that narrative? It's like going to a playground and yelling to children how their future is scorched Earth due to climate change because it is inevitable and no one cares. Are you right? Maybe. Should you share that position so brazenly and thoughtlessly? Fuck no.\n\nThe future of a few million people are potentially about to change drastically, for the worse, and here we have a room full of pricks jockeying for the rights to call themselves prognosticators. You erode people's sense of hope, will to fight oppression, and prime them to ignore the suffering of others, all so you can sit their smugly and say \"I told you so.\"\n\nMeanwhile, you are wrong. It may be very likely, but it is not inevitable. Speaking up against China will be costly, but not impossible or ineffective. The people of HK and China do care and notice who in the world has HKs back, and who in the world is readying to look the other way.\n\nThere is a sickening element here readying others to look the other way. Kinda reminiscent of bots from Russia, no? Certainly China wouldn't do anything like that."}, {"id": "ewrj8od", "author": "Usernamesareso90s", "body": "What can we do to help"}, {"id": "ewre7cf", "author": "BelleCurves76", "body": "Hong Kongers rise up."}, {"id": "ewrd3in", "author": "t-rex42", "body": "Considering the large mobilizations of the military into the area I would speculate that they will be shooting more than just an eye very soon. Sending the best wishes to these people but it doesn't look like it will end well for them."}, {"id": "ewrem5r", "author": "gobblegobbleimafrog", "body": "I support Hong Kong."}, {"id": "ewrbvob", "author": "devasohouse", "body": "Does pepe have a significance over in Hong Kong?  Just seems like an odd character to use\n\nEDIT: changed China to Hong Kong. Sorry for my ignorance, I'm not entirely sure what is going on over there"}, {"id": "ewrodt6", "author": "BebopDC", "body": "Pepe is international. Pepe is world wide"}, {"id": "ewrfbdg", "author": "Brewtown", "body": "Feelsbadman.jpg"}, {"id": "ewraxhx", "author": "gekogekogeko", "body": "It’s not the same woman"}, {"id": "ewrcfdm", "author": "vibrex", "body": "I speak Cantonese. It says Police shot my eye."}, {"id": "ewrdhgr", "author": "TheUpperHand", "body": "*feelsbadman*"}, {"id": "ewrheeg", "author": "Rada_Ion", "body": "Does this count as a rare Pepe?"}, {"id": "ewres6s", "author": "Q-ArtsMedia", "body": "Get AND wear your PPE (Personal Protective Equipment)    The police are not going to stop using bullets. Polycarbonate safety glasses would be a good place to start.  Followed by a helmet, and body armor.  It is going to get far, far worse over there, not better, not for a very long time.  China wants Hong Kong."}, {"id": "ewrhgxb", "author": "Liliumin", "body": "Ey guys, some of us don’t belong to USA and don’t give a shit about memes involving USA politics. Pepe frog is used as a normal meme in other places of the world. Please don’t assume that because a meme is political in your country, that then everybody should then use it the same way. USA is a big country, but not the only country in the world.\n\nHave a good day!"}, {"id": "ewrevx1", "author": "Nutaholic", "body": "The amount of people who seriously believe a fucking cartoon frog is somehow a symbol of white supremacy or fascism is mind blowing."}, {"id": "ewrl8l8", "author": "Sofius", "body": "Pepehands"}, {"id": "ewra1rg", "author": "Oh_god_not_you", "body": "Poor poor brave woman. I hope you’re successful in your fight for the freedoms we take for granted."}, {"id": "ewrciqg", "author": "BigGorillaBoss", "body": "Pepe can show such depth of emotion. Pepe, btw, wasn’t created to spread hate, only adopted by the hateful."}, {"id": "ewupp8a", "author": "Kurtisclk", "body": "Please stand with Hong Kong, fight for freedom with us.\n\nWe, the Hongkongers need your support.\n\nCCP and the people's republic of China are the cancer to civilization. It should be fixed for the world.\n\n# \n\n&#x200B;\n\n#"}, {"id": "ewrg3fn", "author": "wowsuchdoge_wow", "body": "That's probably the rarest pepe."}, {"id": "ewrsufv", "author": "RussianCyberBot", "body": "Hey reddit, remember when you screamed that everyone ever associated with pepe the frog was a racist white supremacist trump-supporter?\n\nPepperidge farm remembers."}, {"id": "ewrt9el", "author": "NotSLG", "body": "bUt pEpE iS a SYmBoL oF wHitE sUpReMaCy"}, {"id": "ewrnbm3", "author": "knothole", "body": "Rare Pepe"}, {"id": "ewrnffz", "author": "3thL0", "body": "PepeEyes"}, {"id": "ewrf0ql", "author": "newobrain", "body": "don't let these pictures die, keep it plastered all over social media. they have a better chance with the world rooting for them"}, {"id": "ewrelkl", "author": "sandyravage7", "body": "Man everyone there is a million times braver than I ever could be. Good luck, I wish you guys well."}, {"id": "ewrdv5z", "author": "Mega_Dunsparce", "body": "People crying about how Pepe is a HaTe SyMbOl are demonstrating that we're are already becoming desensitised to what's happening in Hong Kong. How about you focus on the young woman who's gotten shot by the establishment for fighting for her freedom?"}, {"id": "ewronnu", "author": "Abhishek_gg", "body": "PepeHands"}, {"id": "ewrik8b", "author": "Underage_Person", "body": "There are literally Instagram accounts that are trying to raise awareness about the situation in Hongkong and their posts are being deleted"}, {"id": "ewreo76", "author": "jeezyf", "body": "Lol people in the US think the frog symbolizes white supremacy"}, {"id": "ewrex9k", "author": "RedditAdminsRNazis", "body": "But Pepe is a white nationalist racism symbol!\n\n-CNN's Fredo"}, {"id": "ewretkk", "author": "Outspoken_Douche", "body": "Imagine having political beliefs so fragile that your world is shattered upon learning that a cartoon frog is actually not a universal symbol of hate and that context is actually important\n\nYou're imagining reddit"}, {"id": "ewreqpz", "author": "InfinityProtocol", "body": "Remember when Reddit and the media told us that Pepe was a white nationalist symbol. \n\nThose were the days"}, {"id": "ewrf7j8", "author": "Connectitall", "body": "According to the American propaganda media-  That’s Racist!"}, {"id": "ewrfxn7", "author": "Helmet_Here_Level_3", "body": "Reddit idiots are torn. Support HK or continue to claim that Pepe is a symbol of hate."}, {"id": "ewrqzar", "author": "fookmahlife", "body": "Just to clarify this isn't the lady who got beanbagged in the eye. She is a medical staff attending a rally in a hospital."}, {"id": "ewryxpb", "author": "nwordSpammer", "body": "Nigga you expect me to believe that's not kaneki ?"}, {"id": "ewrztd2", "author": "SonicCT", "body": "this is so sad..."}, {"id": "ews2d70", "author": "AgainstAHSCensorBot", "body": "I am a Bot. Please be aware AHS users have linked this post on the AHS Sub. This action was performed automatically to help you protect yourself from AHS censorship."}, {"id": "ewu2k4j", "author": "tsingtao12", "body": "FK CHINA."}, {"id": "ewu35iu", "author": "phylogenyhkg", "body": "Hong Kong is my home and I love Hong Kong."}, {"id": "ewu3mly", "author": "lolocat3321", "body": "The police obviously abuse their power! Poor lady!"}, {"id": "ewucx0n", "author": "crycry627", "body": "StandWithHK!"}, {"id": "ewurrkf", "author": "tsingtao12", "body": "FK CHINA Regime."}, {"id": "ewrelu6", "author": "roccnet", "body": "Inb4 discussions about a hand drawn cartoon frog being the same as a swastika or a burning cross"}, {"id": "ewrdu6v", "author": "Johnnadawearsglasses", "body": "Pepe attacked!\n\nJoin the resistance now"}]}