{"id": "dcabzh", "title": "This image of Xi Jiping as Winnie the Pooh is illegal in mainland China", "url": "https://i.imgur.com/v60fY9U.png", "subreddit": "pics", "author": "whatis_bombs", "text": "", "comments": [{"id": "f27dbu1", "author": "relaxlu", "body": "Locked because some people are trying to organize brigades here."}, {"id": "f26ypx8", "author": "ilivedownyourroad", "body": "But I'm confused.\n\nThis is winnie the pooh.\n\nWhy is it banned ? Winnie has looked like this for decades..."}, {"id": "f271riw", "author": "Hieremias", "body": "I'll admit I don't see the resemblance between them but the unbelievable insecurity of the Chinese to this is way funnier than the actual comparison."}, {"id": "f26wokf", "author": "Silent_Palpatine", "body": "Oh bother."}, {"id": "f26yod1", "author": "KinnieBee", "body": "Out of the loop, why Winnie the Pooh?"}, {"id": "f27d58t", "author": "laxt", "body": "Gotta love that this taunting comes with [a theme song](https://youtu.be/V4IOrH_FMIs).\n\nXi Jiping's taunting comes with musical accompaniment.  I wonder if it's illegal to whistle this melody."}, {"id": "f274v30", "author": "Legobrick100", "body": "**EDIT: Hold your upvotes, everyone. It appears I've made a mistake and relayed false information from the video (Namely, the fact that a VPN is not required for Steam in China). I am sorry, I trusted it before I did any research to verify it and for that I apologize. Here is the video if you're curious, the part I'm referring to starts around 9:07.**\n\n[**5 Removed Easter Eggs Never Meant To Be Found**](https://youtu.be/pXHhfweFnF4)\n\n~~I JUST watched a video about a video-game that had an easter-egg calling him Winnie The Pooh, and the game had to be taken down because a bunch of Chinese gamers flooded the game with negative reviews on Steam in defense of him.~~\n\n~~Ironically, since Steam was never officially allowed in China, they had to use a VPN to access Steam to post the reviews, thus bypassing their dear leader's regulations.~~"}, {"id": "f26yv8w", "author": "Birdamus", "body": "But did he harvest bear organs for this look?"}, {"id": "f2770f6", "author": "xnickg77", "body": "The good old “ this picture is illegal” karma farm"}, {"id": "f274cbi", "author": "Sm4cy", "body": "So....another spineless dictator? Why is it that authoritarians are such whiny bitches?"}, {"id": "f274048", "author": "nebuNSFW", "body": "Disrespectful to Winnie the Pooh."}, {"id": "f27d6p1", "author": "I_Frunksteen-Blucher", "body": "I don't get it.  If Xi Jinping doesn't want to be compared to Winnie the Pooh, why did he have the surgery to look like him?"}, {"id": "f2763kr", "author": "wesdankerson", "body": "Wow man you did it, you totally owned china"}, {"id": "f27d6vp", "author": "ialwaysbeatmymeat", "body": "Will you get banned or blocked if you share this on WeChat?"}, {"id": "f2791g3", "author": "Konananafa", "body": "Just another reminder that Winnie the Pooh IS NOT banned in China, a quick Baidu search reveals this. Just try typing in “Winnie the Pooh” into Baidu’s search bar."}, {"id": "f27db5k", "author": "Dieselx22", "body": "Disney's trademark is strong in china."}, {"id": "f27dbrb", "author": "jerkwad_152", "body": "...which means it's probably illegal on Reddit, too.\n\nEDIT: Oh, the irony.  My comment is the last one before the post was locked.  Thanks for the silver, haha!"}, {"id": "f279873", "author": "strato1981", "body": "Welp we’ve done it guys, China is no more"}, {"id": "f277leb", "author": "OhGoodGrief", "body": "Hello kids, it's me, Captian Reddit! I'm here to save the day with the power of Slacktivism! Woo! 🙄"}, {"id": "f26yfqy", "author": "Malhallah", "body": "https://i.imgur.com/spbyDqQ.gif"}, {"id": "f276w6b", "author": "GatorGuard", "body": "Really smashing the state there kids."}, {"id": "f276hz2", "author": "FetishizedStupidity", "body": "\\*butterfly meme\\*\n\niS tHiS eFfEcTiVe ReSisTaNcE?"}, {"id": "f272yci", "author": "Friendly-Criticism", "body": "why? it makes him look cuddly and nice instead of a murderous communist dictator."}, {"id": "f277qul", "author": "trig9118", "body": "The fact that people believe this is true, and that it somehow \"gets to\" the CCP, is laughable and frankly betrays the maturity of most people on Reddit. You want to fight the good fight go become a political activist instead of memeing bullshit on r/pics."}, {"id": "f278ebw", "author": "murphysclaw1", "body": "is it illegal? these posts are just like the \"Beyonce's manager is trying to remove these photos from the internet!\"\n\nThey're offensive, but I'm not sure they are actually illegal. If you want to make a difference, why not use a post like this to spell out the human rights abuses in China?"}, {"id": "f26yr9o", "author": "SuperDuperDylan", "body": "In before the Chinese investors call head office to get this taken down."}, {"id": "f27d6r3", "author": "AyULz", "body": "We did it Reddit! Authoritarianism is no more!"}, {"id": "f27d8m8", "author": "GTX_Incendium", "body": "China has no sense of humor"}, {"id": "f277m1x", "author": "Needgirlthrowaway", "body": "Fuck winnie the pooh fuck the han Chinese cunts that support this cum sucking cock sucker. \n\n动态网自由门 天安門 天安门 法輪功 李洪志 Free Tibet 六四天安門事件 The Tiananmen Square protests of 1989 天安門大屠殺 The Tiananmen Square Massacre 反右派鬥爭 The Anti-Rightist Struggle 大躍進政策 The Great Leap Forward 文化大革命 The Great Proletarian Cultural Revolution 人權 Human Rights 民運 Democratization 自由 Freedom 獨立 Independence 多黨制 Multi-party system 台灣 臺灣 Taiwan Formosa 中華民國 Republic of China 西藏 土伯特 唐古特 Tibet 達賴喇嘛 Dalai Lama 法輪功 Falun Dafa 新疆維吾爾自治區 The Xinjiang Uyghur Autonomous Region 諾貝爾和平獎 Nobel Peace Prize 劉暁波 Liu Xiaobo 民主 言論 思想 反共 反革命 抗議 運動 騷亂 暴亂 騷擾 擾亂 抗暴 平反 維權 示威游行 李洪志 法輪大法 大法弟子 強制斷種 強制堕胎 民族淨化 人體實驗 肅清 胡耀邦 趙紫陽 魏京生 王丹 還政於民 和平演變 激流中國 北京之春 大紀元時報 九評論共産黨 獨裁 專制 壓制 統一 監視 鎮壓 迫害 侵略 掠奪 破壞 拷問 屠殺 活摘器官 誘拐 買賣人口 遊進 走私 毒品 賣淫 春畫 賭博 六合彩 天安門 天安门 法輪功 李洪志 Winnie the Pooh 劉曉波动态网自由门"}, {"id": "f27afva", "author": "hashtagpow", "body": "Reddit users regularly tell me that this site is controlled and censored by china. That means this picture isn't allowed to be posted here either!"}, {"id": "f27aklc", "author": "KitteNlx", "body": "Should ban this specific image here, it's poorly done. At the very least someone make a better version."}, {"id": "f27crua", "author": "Jaircito13", "body": "They do not let you be creative. Slavery."}, {"id": "f27d7fd", "author": "sevee77", "body": "With so many upvotes it will probably a top Google search result lol"}, {"id": "f26wrje", "author": "Darth_Blizzard", "body": "Images of Whinny the Poo are ban in China"}, {"id": "f2796qn", "author": "kitjen", "body": "I'm not saying it is incorrect, but is it really illegal? There just seems to be a lot of things like this for upvotes or Facebook Likes. On Facebook they will typically say \"Share this before it gets taken down again\" but bullshit was it ever taken down; it's just a ploy to get you to fight the system and share it.\n\nMeanwhile some 14yr old is telling his mates how his post has gone viral."}, {"id": "f27cf2w", "author": "AimMoreBetter", "body": "We did it Reddit! This will surely destroy him as a man and as president!"}, {"id": "f275s2s", "author": "mkalaf", "body": "PRINTED 100 OF THESE AND MAKING PAPER AIRPLANES OUT OF THEM AND THROWING THEM INTO CHINA. THEY CANT STOP ALL OF THEM"}, {"id": "f2754ge", "author": "TheWeaponShop", "body": "People in mainland China on reddit scrolling through just had a panic attack someone else might see."}, {"id": "f275i3q", "author": "PMmeYourNoodz", "body": "No it isn't"}, {"id": "f271tmj", "author": "arizonatasteslike", "body": "Streisand effect is a bit sweeter when the target is a chubby dictator"}, {"id": "f271biw", "author": "Game_of_Jobrones", "body": "Winnie the Pooh, Winnie the Pooh\n\nNothing happened in Tienanmen Square in 1989 so don't ask\n\n*whistles tunelessly*"}, {"id": "f27d8dv", "author": "Dont-be-a-smurf", "body": "God if there was any example of the Streisand Effect, this is it.\n\nFor those who don’t know, the SE is that by being defensive about something you actually call a ton of attention to it and you end up making the problem way worse."}, {"id": "f272yt3", "author": "losthours", "body": "What a fucking loser"}, {"id": "f276ebi", "author": "Magnolia_Wellness", "body": "Fuck Xitler"}, {"id": "f27d7y1", "author": "weddle_seal", "body": "Why did you guys post a blank image"}, {"id": "f27acg4", "author": "poppinchips", "body": "Pro China comments on here are hilarious. There's so many of them, you'd think there wasn't a dictator running China, imprisoning a million Uighurs, and trying to subjugate HK or something."}, {"id": "f275np9", "author": "Nightmare_Pasta", "body": "OP is a Chinese karma farm bot, you've all been bamboozled"}, {"id": "f27d6lu", "author": "StMuel", "body": "Please don’t disrespect Winnie the Pooh he is a huge part of my childhood"}, {"id": "f2745ku", "author": "ratmon", "body": "🙄🙄🙄🙄"}, {"id": "f2793h0", "author": "PM_ME_YOUR_BEST_GIF", "body": "The honey pot lapel pin is a nice touch."}, {"id": "f279798", "author": "zaraishu", "body": "Actually, there are regions in China where bees went completely extinct due to to excessive use of insecticides...\n\nThe one who controls the hunny controls the world."}, {"id": "f27a2c0", "author": "lrtDam", "body": "To be honest, this is not OPENLY illegal. Just that you couldn't post this on the major social media and if you did, your post will most likely disappeared."}, {"id": "f27bwbh", "author": "yusenye", "body": "It’s not illegal"}, {"id": "f27c4fu", "author": "AbdullahFaheem2666", "body": "r/confusedboners"}, {"id": "f27d3sa", "author": "oldmanposter", "body": "I'm curious what disney did with the winnie the pooh rides now."}, {"id": "f2733kq", "author": "beachbbqlover", "body": "See, normally I could give a shit about pictures like this.  They're base, and frankly kind of silly.  But the fact it's illegal is also fucking goofy.\n\nMeanwhile in the rest of the world, we fly balloons with Trump in a diaper."}, {"id": "f276ewc", "author": "arrrggghhhhhhhhh", "body": "I wannapost this in r/China"}, {"id": "f278pvr", "author": "optimister", "body": "Oh you guys are really slaying China here. I'd be surprised if they ever recover from having their leader compared to an adorable lovable figure. Have you ever wondered why Reddit's new owner does not deleted these memes? \n\nhttps://www.reddit.com/r/imsorryjon/comments/c1e8q2/poohs_daily_ritual_extended_edition/"}, {"id": "f27a564", "author": "onizuka11", "body": "Waiting for TenCent to take this down."}, {"id": "f2758oc", "author": "Asmor", "body": "Why would an unaltered picture of Glorious President for Life be illegal?"}, {"id": "f277z0z", "author": "thekingofsting1833", "body": "Haha what a madlad! We stand with you Hong Kong we will repost this image everyday until you guys stop getting shot in the chest and tear gassed and other human rights violations, \n\nBut we will support you by making funny images that get a lot of gold"}, {"id": "f27czqu", "author": "jclcwca0987", "body": "This image is an insult to Winnie the Pooh. That scum is not worthy of the Pooh Bear."}, {"id": "f27d3zr", "author": "StornZ", "body": "Can we post it to r/China"}, {"id": "f2775h1", "author": "ytdocchoc", "body": "Thanks op, i needed a laugh and i ended up giggling like a moron because of this. \nTake your upvote."}, {"id": "f272mlz", "author": "jpfeifer22", "body": "Oh *bother*...."}, {"id": "f275zvv", "author": "AGooDone", "body": "They \"elected\" him leader for life... What kind of fucked up Frankenstein's monster is China?"}, {"id": "f2767rc", "author": "Elmer-Eugene", "body": "I like this more and more every time I see it."}, {"id": "f278ndk", "author": "Pinkman505", "body": "Was this even altered?"}, {"id": "f2793w6", "author": "Plummles", "body": "Say what you will about America, but at least we can have photoshopped pictures of Trump with Shrek ears and green skin."}, {"id": "f279aay", "author": "K1ngPCH", "body": "And to think, there are people out there who genuinely believe that the United States right now is worse than China right now"}, {"id": "f27531x", "author": "omiaguirre", "body": "Someone should make a deepfake video"}, {"id": "f275saz", "author": "EatingAnItalianSando", "body": "Fuck China!"}, {"id": "f278wdy", "author": "BRLGGS", "body": "fuck xi jiping"}, {"id": "f276g6x", "author": "MilkyBugle", "body": "Let's see how long this post lasts"}, {"id": "f2775i4", "author": "Gurneysingstheblues", "body": "Now which brave soul is gonna post pics of tiananman square with the same title for that sweet karma"}, {"id": "f278tv8", "author": "360walkaway", "body": "Yup, it's totally the **People's Republic of China**... not some fascist state that's been in the making for decades."}, {"id": "f278xjz", "author": "ASAP_Stu", "body": "Beyoncé wants this removed from the Internet!!"}, {"id": "f2795fp", "author": "vandriff", "body": "But why? He just looks so cute as Winnie the Pooh, and everyone actually loves that silly ol' bear. \n\nIt would probably do wonders for his image if he just accepted it."}, {"id": "f279y6r", "author": "jacquesmalchance", "body": "I teach at an international business school. We have lots of Chinese students. I have spoken to them about this and they swear they have never heard of this. One of them even told me that Winnie is popular in China...so I guess they are censoring the censorship or the students are specifically instructed to say the opposite."}, {"id": "f27auyb", "author": "Blaustein23", "body": "How long before big daddy tencent ~~forces~~ strongly suggests that the mods remove this post for violating some arbitrary rule that's never usually enforced?"}, {"id": "f27c8nd", "author": "LaststandHw", "body": "That very dangerous in a totalitarian regime like the Chinese"}, {"id": "f27czb2", "author": "Dilbertreloaded", "body": "This is offensive to Pooh. Even 💩 is offended by comparing pooh to Xi."}, {"id": "f27d4vy", "author": "RedSunBlaze82", "body": "This is the exact same fucking thing as the gay Putin post being constantly reposted. This image will probably follow the same path"}, {"id": "f272hdr", "author": "Imjustafoxxx", "body": "Are those nilla wafer ears?"}, {"id": "f278d6m", "author": "LurkmasterP", "body": "\"What day is it today, Piglet?\"\n\n\"It's the day we punish the disloyal, and reiterate that western democracy is a decadent and flawed sociopolitical concept.\"\n\n\"My favorite day.\""}, {"id": "f278em8", "author": "thefriendlypuffin", "body": "Hong Kong protestors should start putting up this picture all over the city"}, {"id": "f278frl", "author": "Sir_Watto", "body": "Also, posting this picture gets you on the organ donor list!"}, {"id": "f279if9", "author": "CBNT_Tony", "body": "Please stop disrespecting [my president](https://imgur.com/WVatYhT) like this"}, {"id": "f27bova", "author": "Nyckname", "body": "Well, it _is_ insulting to Winnie the Pooh."}, {"id": "f27c0fm", "author": "Blendahead", "body": "Why do people keep insulting Winnie the Pooh like this"}, {"id": "f27amw7", "author": "Hypoed", "body": "Can you imagine being this insecure lmfao"}, {"id": "f278db1", "author": "PirateCodingMonkey", "body": "i thought it was illegal to compare Jiping to Poo. i remember John Oliver doing a segment about it and it's now a regular feature of his opening credits."}, {"id": "f278lj4", "author": "throwawayabananapple", "body": "Those pancake ears...."}, {"id": "f278mv3", "author": "theflyingsquirl", "body": "This guy makes Trump look like Gandhi"}, {"id": "f278q4l", "author": "Milfsaremagic", "body": "Nice pin lol"}, {"id": "f278rh5", "author": "Lateralus11235", "body": "I’m sure Trump would like to take a page out of that playbook."}, {"id": "f278sd5", "author": "JulienMaxport", "body": "Xi Jipooh"}, {"id": "f278znv", "author": "daneelr_olivaw", "body": "Xi Jiping the poo."}, {"id": "f2792ke", "author": "z0nk_", "body": "I think you mean Xi Jinpooh"}, {"id": "f27939h", "author": "doclsd", "body": "I'll seriously never understand why he gets to upset about this. Like it's Winnie the Pooh, I look like Brad Pitt and you don't see me complaining, Xi should be proud to look like a loveable cartoon bear whose face gets stuck in a honey jar."}, {"id": "f2793cw", "author": "Star_Theif", "body": "His ears look like vanilla wafers lol"}, {"id": "f279595", "author": "Erj2969", "body": "China owned epic style 😎"}, {"id": "f279bdw", "author": "si8472", "body": "Oh now I see the resemblance yeah that guy looks like Pooh Bear"}]}