{"id": "dgib1y", "title": "Friendly reminder that China is running concentration camps and interning up to an estimated 3 million people who are being brainwashed with communist propaganda, tortured, raped, humiliated, used as medical guinea pigs, sterilised, and executed for their organs", "url": "https://i.imgur.com/D6lyZz1.png", "subreddit": "pics", "author": "Ayy_2_Brute", "text": "", "comments": [{"id": "f3bq1gf", "author": "monokoi", "body": "Yet the world is busy doing business with the camp management."}, {"id": "f3cu7ms", "author": "_reykjavik", "body": "People talk about boycotting Blizzard, Apple, etc. and then continue to buy stuff they don't need. Endless consumerism is probably one of the most powerful tool that China has.\n\n**edit** I'm not saying buying stuff made in china is bad, I'm saying that buying useless stuff all the time is bad, hence *endless* consumerism."}, {"id": "f3c5j77", "author": "lowgskillet", "body": "call me cynical but I don't think any amount of awareness is going to change anything whatsoever. under what scenario would they decide to stop violating human rights?"}, {"id": "f3bq2qx", "author": "Fjdenigris", "body": "3 million??!!? We know for certain these are political/ethnic detainees?\n\nToo bad we care more about business than those guys... \n\n\nIT’S A GOOD THING FOR THE JEWS THAT THE NAZIS DIDN’T INVENT SMARTPHONES!!!"}, {"id": "f3cn2oq", "author": "I_am_chris_dorner", "body": "“Hey, lets send our business there”\n-fucking everyone."}, {"id": "f3c4gxa", "author": "nuclearguacamole", "body": "How can we delete someone else government? Asking for a friend"}, {"id": "f3cdz2z", "author": "imjorden", "body": "In twenty years when all is said and done I hope we as people united on earth can look back and say we did the right thing. I hope this is brought to the UN & something is done about this, if not I hope a country or countries stand up and stop these atrocities."}, {"id": "f3ct2b4", "author": "Wordsoffreedom", "body": "Friendly reminder, India still has 8 million people on a complete lock down.\n\nNot a single post on front page of r/worldnews. Fucking Modi Hindutva down votes anything related to Kashmir and  promote the fuck out of China related issues to deflect from Kashmir."}, {"id": "f3bqu3k", "author": "Ayy_2_Brute", "body": "[In May 2018, Randall Schriver of the United States Department of Defense claimed that \"at least a million but likely closer to three million citizens\" were imprisoned in detention centers in a strong condemnation of the \"concentration camps\"](https://www.reuters.com/article/us-usa-china-concentrationcamps/china-putting-minority-muslims-in-concentration-camps-us-says-idUSKCN1S925K)\n\n\n____\n\n>[\"...he faced endless brainwashing and humiliation, he said in an interview, and was forced to study Communist propaganda for hours every day and chant slogans giving thanks and wishing long life to President Xi Jinping.\"](https://muslimcouncil.org.hk/muslim-inmates-in-china-detention-camp-forced-to-eat-pork-drink-alcohol-and-physically-tortured-as-some-commit-suicide/)\n\n\n___\n\n>“The authorities put a helmet-like thing on my head, and each time I was electrocuted, my whole body would shake violently and I would feel the pain in my veins,” Tursun said in a statement read by a translator.\n\n>“I don’t remember the rest. White foam came out of my mouth, and I began to lose consciousness,” Tursun said. “The last word I heard them saying is that you being an Uighur is a crime.”\n\nhttps://www.apnews.com/61cdf7f5dfc34575aa643523b3c6b3fe\n\n___\n\n>[Some people were given pharmaceutical injections and pills, Mr. Samarkan said, describing the marks on the arms of those who had been given unknown medicines.](https://www.theglobeandmail.com/world/article-former-detainees-recount-abuse-in-chinese-re-education-centres/) \n\n____\n\n>[One reported being raped. Many said they were subjected to sexual humiliation, from being filmed in the shower to having their intimate parts rubbed with chili paste.](https://www.independent.co.uk/news/world/asia/china-uighur-muslim-women-abortions-sexual-abuse-genocide-a9144721.html)"}, {"id": "f3cr58l", "author": "coopercrepsl", "body": "**How we can help**\n\nThere are various ways we can help Hong Kong from abroad:\n\n* ⁠\\[**US**\\] A few options here:  \n\n   * Urge your representatives to support the Hong Kong Human Rights and Democracy Act 2019 \\[[H.R. 3289](https://www.congress.gov/bill/116th-congress/house-bill/3289?utm_source=share&utm_medium=ios_app&utm_name=iossmf), [S. 1838](https://www.congress.gov/bill/116th-congress/senate-bill/1838?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\\]. You can use this website to [send a pre-composed letter](https://actionnetwork.org/letters/co-sponsor-hong-kong-human-rights-and-democracy-act-of-2019?utm_source=share&utm_medium=ios_app&utm_name=iossmf).\n   * There is also the Protect Hong Kong act of 2019 \\[[H.R. 4270](https://www.congress.gov/116/bills/hr4270/BILLS-116hr4270ih.pdf)\\] that you can ask your representatives to co-sponsor.\n   * Talk to your representatives. Find their contact [through this website](https://www.callmycongress.com/).\n* ⁠\\[**UK**\\] Petition to the UK government to uphold the 1984 Sino-British Joint Declaration. [Link here](https://petition.standwithhk.org/?utm_source=share&utm_medium=ios_app&utm_name=iossmf). You can also write to your members of Parliament. [Find out how](https://www.parliament.uk/get-involved/contact-your-mp/).\n* \\[**Canada**\\] [Write an open letter](https://www.ourcommons.ca/Parliamentarians/en/constituencies/FindMP) condemning the Hong Kong government and demanding that the Canadian government sanction Hong Kong and propose concrete action to support protesters.\n* \\[**Australia**\\] Quite a few options here:  \n\n   * [Join a petition](https://www.change.org/p/the-senate-of-australia-impose-sanctions-on-persons-found-to-be-suppressing-human-rights-in-hong-kong-df999fe5-3d9f-434b-8f58-d0840619a046) to impose sanctions on people found to be suppressing human rights in Hong Kong.\n   * Petition the Australian House of Representative to bring the true condition of Hong Kong’s predicament to the United Nations Human Rights Council \\[[Petition EN1029](https://www.aph.gov.au/petition_sign?id=EN1029)\\].\n   * Petition Australia to add Human Rights clauses to the Australia - Hong Kong Free Trade Agreement \\[[Petition E1032](https://www.aph.gov.au/petition_sign?id=EN1032)\\]\n   * You can also just [write to your senators and members of Parliament](https://www.aph.gov.au/senators_and_members/guidelines_for_contacting_senators_and_members).\n* \\[**New Zealand**\\] [Write to your members of Parliament](https://www.govt.nz/browse/engaging-with-government/members-of-parliament/).\n* \\[**Everywhere**\\] A few small things that anyone can do, regardless of country  \n\n   * Here is [a list of companies](https://github.com/caffeine-overload/bandinchina?utm_source=share&utm_medium=ios_app&utm_name=iossmf) that have bowed to China’s various censorship demands, over Hong Kong and other issues. Do what you will with that information. (More on this at [r/BoycottChina](https://www.reddit.com/r/BoycottChina/))\n   * You can write a message to the government of Hong Kong through [Amnesty International](https://www.amnesty.org/en/get-involved/take-action/stop-the-hong-kong-extradition-bill/). It’s only a small gesture, but quick and easy to do.\n   * [Petition the United Nations](https://www.change.org/p/condemn-hong-kong-police-for-excessive-force-against-citizens-call-for-independent-inquiry) to condemn Hong Kong Police for excessive use of force and call for an independent inquiry.\n   * [Request the International Court of Justice](https://www.change.org/p/international-court-of-justice-request-international-court-of-justice-to-investigate-excessive-force-of-hong-kong-police) to investigate use of excessive force by the Hong Kong Police.\n* If your country isn't on this list, it may be [in this post!](https://www.reddit.com/r/HongKong/comments/cv0ws4/how_can_you_help_hong_kong_protests_from_abroad/) I only added certain countries to keep the comment more condensed.\n\nThis is [an example](https://www.reddit.com/r/HongKong/comments/cjj9f3/us_bill_to_impose_sanctions_on_chinese_and_hong/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) of when your involvement has helped the people of Hong Kong.\n\n(copied and pasted from another thread)"}, {"id": "f3ccylu", "author": "Buddy_is_a_dogs_name", "body": "Wouldn’t want to be the random Chinese citizen on the street who is the perfect organ match for President Pooh if he needed one!"}, {"id": "f3dgtpm", "author": "Comessuer", "body": "Anyone have a source besides a random picture? Would like to learn more."}, {"id": "f3cqt3r", "author": "br-z", "body": "There are two Canadians in Chinese prison and the Canadian government has done nothing to get them out."}, {"id": "f3by7yb", "author": "wekiva", "body": "China is a totalitarian shithole."}, {"id": "f3clbdf", "author": "sunshinesdownonme", "body": "Why do people always have to say friendly reminder before shit like this"}, {"id": "f3cmlye", "author": "murphysclaw1", "body": "is there a source for some of this? who is saying they are executing people for their organs?"}, {"id": "f3d17n6", "author": "verano56", "body": "Any evidence of raping, being used as medical guinea, sterilising? The paper referenced under the top comment is just a preliminary research, it's not actually applied. Many papers have been published on cancer curing medicine, but none of them is actually manufactured. This is because most of the researches are just a proof of concept study, trying to see what we can do with technology. However most of them fails, never meet the market. You can't use this as an evidence that China is torturing the minorities."}, {"id": "f3cghq6", "author": "syberpunknyc", "body": "yes Muslims  Uighurs and other Turkic Muslims"}, {"id": "f3c8ywn", "author": "interstat", "body": "And the Nba /blizzard don't seem to care"}, {"id": "f3cu0tj", "author": "bluebluebluered", "body": "Source for these claims? Not against it just want some hard evidence not a Reddit headline"}, {"id": "f3cvit0", "author": "OmegaEleven", "body": "Not trying to be a wise guy here but how exactly do we know what is happening in those camps? Do we have videos, pictures, eye witnessess etc andif so are those available somewhere to digest?"}, {"id": "f3dy108", "author": "StewAndBread", "body": "i'm genuinely curious how much truth there is to these reports. where do we get those numbers and how do we know those people are being \"raped, humiliated, used as medical guinea pigs, sterilised, and executed for their organs\".  honestly the way the post is worded seems to me as if a narrative is being pushed at the same such rumours gotta have some truth to them and they can't exist in a void."}, {"id": "f3cx6fq", "author": "Bigtowelie", "body": "Anybody has a proof?"}, {"id": "f3chjs6", "author": "AdventC4", "body": "I always love a good \"friendly reminder of propaganda\" via propaganda and an image"}, {"id": "f3dhb8u", "author": "gw3gon", "body": "IIRC these camps are equivalent of propoganda school where people go in and leave at the end of the day. \n\n\nOP describes it like a Holocaust-like scenario. If people were systematically being killed like that, we'd fucking know.\n\n\nSpreading fake news won't liberate Hong Kong/weaken the grip of the CCP."}, {"id": "f3ehcem", "author": "AnAstralOne", "body": "Ok this is starting to sound very \"third world war\"-y"}, {"id": "f59cpnj", "author": "April_Fabb", "body": "*“Never again”* became the mantra after the WW2 holocaust, yet here we are. Instead of watching Gypsies, Jews and gays being systematically oppressed, tortured or killed by Germany, it’s now China’s turn to eradicate non-Han ethnicities and political opponents. Oh right, it’s kind of different this time because China is also a great business opportunity."}, {"id": "f3cwat6", "author": "TheQinDynasty", "body": "This post itself is a propaganda."}, {"id": "f3cq0ig", "author": "xXnoobXxFIN", "body": ">communist propaganda\n\nif you actually think china is communist, holy shit your education has failed you"}, {"id": "f3co9cd", "author": "TheMightyGinger4", "body": "Why isn't the entire western world embargoing china for shit\n\noh right."}, {"id": "f3c9z2m", "author": "icegrillz", "body": "Post about Chinese concentration camps and about an hour in, most comments, including the OP are about America."}, {"id": "f3ctz1z", "author": "Callabos", "body": "Money moves the world. We have sold our souls. Hitler would win today because no one would want to upset the stocks. How sad for humanity it didn’t take an epic event but a slavery of currency."}, {"id": "f3cqhqq", "author": "mpgd8", "body": "China communist? Really, dude? At this point in time are you going to call that country communist?"}, {"id": "f3cvmc6", "author": "Khan_1917", "body": "\"tortured, raped, humiliated, used as medical guinea pigs, sterilised, and executed for their organs\"\n\nYou got a source for that? I heard of the brainwashing, which seems to be a pretty racist thing (they claim to need to get rid of radical-islamic thoughts), but the rest afaik seems to be just the typical internet bs."}, {"id": "f3ctdgv", "author": "xviisevil", "body": "It's true, they're the Uyghur Muslims. And that is one of the main reasons why China is so quiet on the whole Kashmir issue regarding India ( China overwhelmingly supports Pakistan due to their strategic economic corridor. )"}, {"id": "f3doym9", "author": "IWas1337", "body": "I don’t care what China does and am not willing to sacrifice a single American to stop them. If you feel strongly about it then buy a ticket to Hong Kong and lay down your own life for the cause. My son isn’t going to be used as a pawn so you can sleep better at night"}, {"id": "f3dc3wf", "author": "AnyNamesLeftAnymore", "body": "The 8 people on r/sino think you're all big fat western meanies."}, {"id": "f3dhycs", "author": "hung4hung16", "body": "We house more inmates than any country on earth based on our population. And many of those things happen in our prisons everyday. Where was your outage about this before?"}, {"id": "f3dkin5", "author": "Kattla", "body": "Wow, the american bots have been out in force in the last couple of weeks!"}, {"id": "f3dvnd0", "author": "AllegedlyCheddar", "body": "Don't you get it you stupid cocksuckers?  The world runs on Chinese made bullshit.  We're all complicit in this nonsense.  I'm sure everyone commenting here has a car and house made or filled with Chinese made bullshit, and I'm sure they'll be buying some more tomorrow.  My point?  I know I'm an asshole, but I love to see so many other smug pieces of shit pretending like their assholes don't stink, and Just like the noisy fuck sticks complaining about climate change who make little to no changes in their countless habits that make them complicit in the problem, I see this as a whole lot more bullshit from sheltered, entitled assholes who like to pretend to be virtuous on the internet, meanwhile, they're just another selfish jerk-off like every other mass-minded, thoughtless motherfucker out there.  Go fuck yourselves.\n\n&#x200B;\n\nPS - I see at least one person upvoted me.  Thanks for the upvote, asshole."}, {"id": "f3e5tog", "author": "Gravity_Beetle", "body": "Please learn more about these camps and spread the word. The Uighur community has said that they are waiting for the world to take notice. This is large scale, state-sanctioned genocide.\n\nhttps://www.hrw.org/report/2018/09/09/eradicating-ideological-viruses/chinas-campaign-repression-against-xinjiangs\n\nIn addition to reports of torture, brainwashing, drugging, herding people like cattle, shaving their heads, depriving them of food when they don’t sing Chinese national songs, forcing them into acts defying Islam, and other horrors, there is also reason to believe that the CCP is harvesting organs from innocent people. Wait lists for organ replacement in China are ~1 week.\n\nThe existence of these camps and the iron-grip lockdown of Xinjiang is a nightmare for millions of innocent families. They are powerless to do anything as their friends and loved ones are kidnapped and never heard from again.\n\nPlease do what you can to bring attention to this story."}, {"id": "f3ec5t9", "author": "thugzilla101", "body": "\"ReAl CoMmUnIsM hAs NeVeR bEeN tRiEd\""}, {"id": "f3egv0r", "author": "blkmge", "body": "This is why a boycott against Blizzard should last a lot longer than just a few days. Companies that bend the knee to China deserve death."}, {"id": "f3erjbp", "author": "cantpissoffmods", "body": "Also a friendly reminder that the whole world knows and wont do shit because China is a very important business partner."}, {"id": "f3cxczr", "author": "KiKoB", "body": "I know first hand that a woman I know was forced to get an abortion and was sterilized bc her governmental official husband. He didn’t want it to happen either, but they were stuck. She almost ran away but couldn’t leave her family. Shit is real"}, {"id": "f3crhm4", "author": "Bobby_Joe_90", "body": "China isn't communist they're state capatialist"}, {"id": "f3cnmis", "author": "PM_ME_ISSUES_4_HELP", "body": "So we are all just sitting back about to watch another holocaust because China hasn't invaded anyone but Hong Kong, Tibet, and Taiwan. Cool,cool,cool,cool,cool,cool."}, {"id": "f3csmt3", "author": "RampantShovel", "body": "Communist propaganda? Really? Something tells me China doesn't give a shit about Marxism anymore."}, {"id": "f3d5zgd", "author": "Mateussf", "body": "Top comment should be a buttload of sources because this is an extraordinary claim that requires extraordinary evidence."}, {"id": "f3ceo1l", "author": "soparamens", "body": "... and the iPhone you are using to read this was made by slaves in China, fueled by american corporation greed"}, {"id": "f3dme5i", "author": "analdestroyers", "body": "Daily Karma farmer with China issue haha"}, {"id": "f3ct3qb", "author": "RuckusStudios", "body": "I think the real issue here is China, is lacking Tegridy!"}, {"id": "f3cvl3q", "author": "CNegan", "body": ">brainwashed with communist propaganda \n\nhard doubt"}, {"id": "f3d82e5", "author": "charmanderaznable", "body": "Friendly reminder that the US is also running concentration camps but americans dont mind so it's cool I guess."}, {"id": "f3d0chu", "author": "ihadsexwithaunicorn", "body": "Do the concentration camps provide razors? I see a lot of clean shaven faces"}, {"id": "f3cx2ia", "author": "TrafficConesUpMyAnus", "body": "Interning?? Where do I sign up??\n\nr/Internships"}, {"id": "f3d2c59", "author": "jhphamwise", "body": "Propaganda, nothing communist about it."}, {"id": "f3d2vqb", "author": "TGMango", "body": "I don't understand - if China is committing all these atrocities, why won't the UN step in and intervene? Surely they are violating human rights, no?"}, {"id": "f3d4o60", "author": "Slazmeister", "body": "China has been doing this and a lot of sketchy shit over a long period of time. But y'all only seem to care when Hong Kong is on the line... Probably because they're \"westerners\". If there's people inspired to be activists for Hong Kong then fair enough. But y'all should probably consider that there's a hell of a lot of places in the world that are in a worse shape than Hong Kong and have largely been ignored by the \"West\"."}, {"id": "f3ddtzq", "author": "FlappyFolds17", "body": "But, they buy so many sneakers and basketball jerseys... we really must be careful what we say!"}, {"id": "f3de7bd", "author": "LandmassWave", "body": "Sad that this isn't causing more of a führer."}, {"id": "f3dh4gb", "author": "LostTimeFadesQuick", "body": "Nobody care's we all just want our I phone's."}]}