{"id": "dgua6k", "title": "The full Tiananmen Square Tank Man picture is so much more powerful than the cropped one", "url": "https://i.imgur.com/VsZHVCp.jpg?1", "subreddit": "pics", "author": "FS16", "text": "", "comments": [{"id": "f3f14ci", "author": "MCwaffle89", "body": "I think I remember the photographer telling the story of how he smuggled this picture out of the country. Apparently he was spotted taking the photo and ended up hiding the roll of film in a film canister in the water tank of his toilet. He then replaced the film in his camera with an empty roll of film. The police came in stole the camera and (empty) film and he smuggled the real roll with this photo out. The details may be wrong but I remember it being a kinda wild story about this picture."}, {"id": "f3ezwuo", "author": "PM_Me_Your_Furbabies", "body": "From [this video](https://youtu.be/dlo-ZzECkBA) we can see that someone stops to speak to Tank Man. More people appear running onto the scene and grab Tank Man, rushing him away before signalling to the tanks.\n\nNobody knows who Tank Man was or what happened to him. It's suggested that the people who grabbed him were plain-clothed officers. Considering what they did to the students in that square I don't have high hopes that they took him back home and he lived a long happy life.\n\nEDIT: the owner of the original video I posted disabled playback on applications other than YouTube. I've replaced the link with another video for convenience."}, {"id": "f3enfta", "author": "Donger69", "body": "Holy fuck.  I’ve never seen this pic before."}, {"id": "f3f3f1a", "author": "Bigbadwolf6049", "body": "Being 43 and seeing this picture a million times, I never really realized... I have no idea what happened after this...\n\nWhat happened to this guy?"}, {"id": "f3eq5c8", "author": "verytallmidgeth", "body": "Such a nice picture of an empty space where nothing specific happened in 1989"}, {"id": "f3ez3lc", "author": "Ricewynd", "body": "I like this picture, I studied it a lot when we did a brief course on Propoganda at school. I always find the most striking thing about this photograph is the behavior of the tanks. These are Chinese version of Russian T-62 tanks, they weigh around 37 tonnes and could easily run Tankman over and considering they are on their way to machine-gun down civilians running one man down wouldn't seem a problem.\n\nBut they don't, they stop, they all stop, on a road with 14 lanes where they could easily run down or simply drive around one man blocking the road they all get into a line and stop.\n\nThese soldiers were obeying orders, had they refused both they and their families would have been at risk, but suddenly they have an excuse to stop and that is exactly what they do."}, {"id": "f3f0cly", "author": "I_Support_Villains", "body": "43 tanks if anybody interested to count\n\nEdit - 45 tanks, thanks to u/i4mn30"}, {"id": "f3evn89", "author": "J-RocTPB", "body": "I've counted at least 30 tanks in that picture and probably way more off frame. \nThe cropped version only showed 3 or 2 tanks (Can't remember replaced my memory of it with this now).\n\nThis guy has become 10x more the hero than he already was, I've never ever seen this picture before. \n\nHe shows what people are willing to do for freedom and on the opposing side, he exposes the government and THEIR limits that they are willing to cross time and time again."}, {"id": "f3f1mmv", "author": "dafunkmunk", "body": "For anyone who might have noticed that the tanks towards the front are out of line, the reason is they tried to go around him when he refused to move. As they turned, he moved to continue to be in front of the tank. He didn’t just simply stop in the middle of the road in front of the tanks. He moved around to block attempts to go around him"}, {"id": "f3f1ddt", "author": "AlcoPollock", "body": "So it wasnt a handful of armoured tanks it was dozens of them... To kill unarmed citizens."}, {"id": "f3eycwy", "author": "fall3nmartyr", "body": "Keep sharing this photo.\n\nThese are the tanks that rolled over and liquified the bodies of the murdered students.\nThey then literally swept the evidence down their drains."}, {"id": "f3f1ppc", "author": "arizonatasteslike", "body": "The gory ones really got to me. Humans turned into paste by soldiers of their own country. Must be terrifying having this constant threat hanging over their heads."}, {"id": "f3f5eg6", "author": "Chummycho1", "body": "This is the oppression that we should all be fighting against. Politics all over the world have become so controversial that we forget that we should all be fighting for the right for everyone to be a part of those controversies. \n\nI often take for granted the right that I have to publicly criticize the President or other leaders while many others around the world dream of the opportunity to do so."}, {"id": "f3f3v42", "author": "WhatImMike", "body": "https://i.imgur.com/tjMcBBW.jpg \n\nHere’s a picture of the aftermath. \n\nFree HK!"}, {"id": "f3ezuyr", "author": "nuck_forte_dame", "body": "This is a response of like 30+ large battle tanks to an unarmed protest.  \n  \nNo matter how you look at it, that is just wrong.  \n  \nPeople like to complain at times about the western government response to protests of riot police and so on but it's nothing compared to the response in authoritarian dictatorships like China where they send in modern (at the time) battle tanks to put down unarmed protesters. \n  \nIf the Hong Kong protests were on the mainland this would be the response.  \n  \nI mean they've got a legit genocide going on in mainland China right now."}, {"id": "f3f0ert", "author": "bsrbsr333", "body": "what happened to him, finally?"}, {"id": "f3ezdlj", "author": "RyantheAustralian", "body": "I've never fully understood...why did they stop the tanks? Hadn't they already used tanks to squash people?"}, {"id": "f3f7d3n", "author": "SonofRaymond", "body": "It’s not cropped they’re different photos from different photographers."}, {"id": "f3g8lte", "author": "HeftyDolphin", "body": "I don't think people fully understand just how bad the Tiananmen massacre really was. The death toll originally was estimated at up to 3000 dead, there has since been documents released saying that AT LEAST 10,000 people were slaughtered. [Link](https://www.google.com/amp/s/www.independent.co.uk/news/world/asia/tiananmen-square-massacre-death-toll-secret-cable-british-ambassador-1989-alan-donald-a8126461.html%3famp)"}, {"id": "f3evmmg", "author": "BL64", "body": "Wow, this image is so much more dystopic than the original."}, {"id": "f3ezc28", "author": "vsuseless", "body": "I wonder what happened to this guy"}, {"id": "f3fd3i7", "author": "Sercrator", "body": "I know I may get downvoted because of this. But what ever happened to the guy?"}, {"id": "f3f48cj", "author": "bpw4h", "body": "If anyone is more interested in Tank Man, PBS did a documentary years ago about the event and the man. One of the best docs I've seen about the Tianamen Square Massacre.\n\nhttps://youtu.be/fHMZmthg-Vk"}, {"id": "f3f6y2f", "author": "ApatheticAbsurdist", "body": "It’s only powerful if you’re used to the cropped one. The reason the tighter framing is popular is that Tank Man is more easily noticed. It’s a trade off and if a viewer is not familiar with the image, this larger view might just look like a tank parade at a casual glance. Photography is always a game of trade offs."}, {"id": "f3fkkop", "author": "mongd66", "body": "One day the chinese government will fall and its leaders hung from the flagpoles.  It is the onward march of history who bends toward liberty"}, {"id": "f3fm9ki", "author": "cheekysquirrelss", "body": "Thank you for your hardwork and dedication.  However, we regret to inform you that we are no longer in need of your services and your position has been terminated."}, {"id": "f3exkng", "author": "Arcteryx81", "body": "Fuck China"}, {"id": "f3et61i", "author": "Chungles", "body": "OP, do I have your permission to repost this tomorrow? I need some karma too."}, {"id": "f3f7pdt", "author": "vader62", "body": "It is a shame that the courage that person showed is in as small amounts as the pic suggests as well. So many statists lined up in fancy armor and deadly cannons vs one person with freedom in their head and courage steeling their nerve. Thanks for the share."}, {"id": "f3fqb5b", "author": "XZTALVENARNZEGOMSAYT", "body": "China has 800,000 to 1,000,000 Muslims in concentration camps"}, {"id": "f3f2bzs", "author": "ionlyplayasdrumgun", "body": "This image is just a karma grab at this point. What message is being sent that hasn’t already been sent a thousand times?\n\nI can guarantee you, Reddit do not care if this image goes viral or not. It’s just free coverage for the site once a news article goes\n\n> Redditors just OWNED Reddit with picture of Chinese man and tank!"}, {"id": "f3et2bx", "author": "A1ThickNHeartyBurger", "body": "The China karmawhoring all over reddit is really getting old"}, {"id": "f3f336h", "author": "RickedSab", "body": "That guy standing infront of the approaching tank, was he squished by the tank? I've seen another image but it was like... horrible... the comments said they were ran over multiple times before being charred to ash and hosed down..."}, {"id": "f3fd7ge", "author": "an_agreeing_dothraki", "body": "I disagree with the OP. The cropped version focuses more on the tank man, bringing more into focus the humanity about to be destroyed.  \n\nI can understand their viewpoint though."}, {"id": "f3hzw0h", "author": "davinciturtle", "body": "Fuck the Chinese government! Ban me Xi JingPooo"}, {"id": "f3r7tu3", "author": "testinglitmus", "body": "Fun fact, after they got over the whole \"we'd rather not run them over thing\" they quite literally started running over the bodies intentionally to make it easier to clean up.\n\n\"Protestor paste\" is I believe the phrase I'd heard associated with it."}, {"id": "f3ep1f8", "author": "Micullen", "body": "Wait aren't you going to do the same title as all the other Tiananmen Square re-posters? If you wan't to get that good karma you gotta say it like \"Tiananman Square, 1989, 1.4 billion people in China have never seen this picture\" or something similar, you can be a bit creative and move some of the words around if you like, I don't think it effects how many thousands in Karma you can whore up."}, {"id": "f3f6wmd", "author": "Babladuar", "body": "man i wish the mods have the balls to delete karmawhoring shit like this. this shit has been reposted so much to the point it doesn't add anything value to this sub."}]}