{"id": "dsylqp", "title": "Picture of a political prisoner in one of China's internment camps, taken secretly by a family member.", "url": "https://i.redd.it/o7u3ffzyz9x31.jpg", "subreddit": "pics", "author": "takethi", "text": "", "comments": [{"id": "f6tnqs0", "author": "RamsesThePigeon", "body": "Hey, folks.\n\nAs many of you have pointed out, this image breaks the first rule of the subreddit, given that it is very obviously a screenshot. While that would normally merit a removal, we've decided to make a slight exception in this case. Our reasoning is as follows:\n\n1. The image is an aspect of a particularly impactful and important story.\n2. The digital elements included in the screenshot are small and unobtrusive enough to *almost* fall under the watermark-specific caveat outlined in Rule 1B.\n\nFurthermore, while the atrocities being committed are very disturbing, remember that encouraging or inciting violence – whether implicitly or explicitly – is directly against Reddit's site-wide rules... so while we may be justifiably outraged about what's taking place, please refrain from offering comments suggesting (for example) that Winnie the Pooh needs to be separated from his stuffing. (I'm assuming that \"stuffing\" is \"political support\" here, but you can see how it might be interpreted otherwise.)\n\nThank you, as always, for your participation in /r/Pics. Here's hoping that things improve soon."}, {"id": "f6ut4y6", "author": "JoeVagian", "body": "The picture is from this video: http://www.youtube.com/watch?v=0Q986fVFCDI \nIt was not taken in an internment camp and shows Shi Zhimin, a man who lost over 50lbs of body weight while he was detained in 1995."}, {"id": "f6t5h1b", "author": "JohnnyGuitarFNV", "body": "Well there it is. Holocaust footage in color, happening right now."}, {"id": "f6sph9p", "author": "Poolbar", "body": "Although it is very hard and difficult to look at this picture, thank you for sharing! People need to know and see the horrible truth."}, {"id": "f6t1aml", "author": "Spartan2470", "body": "[Here](https://www.dailymail.co.uk/news/article-7059781/Undercover-video-shows-brutal-treatment-Falun-Gong-practitioners-inside-Chinese-labor-camps.html) is the story with more disturbing pictures.\n\n**Edit:** For those wanting a better source, so do I.  But I've tried [TinEye](https://tineye.com/search/03c1f32ad13fbbc74152f751f0313e79531a6d08?page=1&extension_ver=chrome-1.3.0), [karmadecay](http://karmadecay.com/r/pics/comments/dsylqp/picture_of_a_political_prisoner_in_one_of_chinas/), [Google](https://www.google.com/search?tbs=sbi:AMhZZisXYddhFGjuMCiH0t1xVuM1j448voCgd5RDjBUEcdVjFRIIRj5wWvnSBHG29zPM1C47STutEL8yjEXDT9WtZBgCh63POIVWFnVDEkHg9seO7HJ4OFIi_18O2s3urTSvdpR_1DridgxUrFGqcxPJX46t_1Yom-18P36YOP1hrtuc8qw4PHHrjvXEv41aj-aQaXFnyfcqMUnNndF96D1lMwEK6tuYBHgyJUFwy0YeqU3ZW9pNc0fVibe2gMITobPxgURjES33bBUAAgW6s1EgAcEOmhL9pGd_1a_1xJRV1c-fgcxFCOqa9fNWrSe4nu0PS4xDEtVOxYyTLFLTvwznX-Zdf9PbVG5bMLg), and, god forbid, even [Bing](https://www.bing.com/images/search?q=imgurl:http%3a%2f%2fi.redd.it%2fo7u3ffzyz9x31.jpg&view=detailv2&selectedindex=0&mode=ImageViewer&iss=sbi&id=http%3A%2F%2Fi.redd.it%2Fo7u3ffzyz9x31.jpg&ccid=Vr1%2Bsu3L&mediaurl=http%3A%2F%2Fi.redd.it%2Fo7u3ffzyz9x31.jpg&exph=1080&expw=1920&vt=2&sim=1) with little to no results.   Whatsnew2day came up with [this](https://whatsnew2day.com/undercover-video-shows-brutal-treatment-of-falun-gong-practitioners-in-chinese-labor-camps).  I've never heard of them before.  [Over here](https://www.reddit.com/r/pics/comments/dsylqp/picture_of_a_political_prisoner_in_one_of_chinas/f6sp08l/) OP relayed:\n\n> The picture is from [this clip](https://www.youtube.com/watch?v=CedVnJOgwg4) by FOX 11 L.A."}, {"id": "f6sy5r1", "author": "YNotSocks", "body": "We are taught about the Holocaust to prevent similar atrocities from taking place. If this doesn’t qualify, then I am not sure what does\n\nhttps://collections.ushmm.org/search/catalog/pa1173707"}, {"id": "f6sp08l", "author": "takethi", "body": "The picture is from [this clip](https://www.youtube.com/watch?v=CedVnJOgwg4) by FOX 11 L.A.\n\nChina is currently still imprisoning political and religious prisoners in internment camps and reeducation camps. China has also been accused of harvesting organs from these prisoners.\n\nIn all likelihood, the person who took this image did so under the danger of imprisonment or death if discovered.\n\nedit: since people keep asking how they can oppose the Chinese government and their brutal methods against Falun Gong and Uyghurs as well as their \"invasions\" of Hong Kong and Taiwan in a meaningful way, I suggest [this page by the International Uyghur Human Rights and Democracy Foundation](http://www.iuhrdf.org/help), and [this reddit post](https://www.reddit.com/r/HongKong/comments/cv0ws4/how_can_you_help_hong_kong_protests_from_abroad/) in /r/HongKong.\n\nedit2: if you want to share this with your friends, /u/TheSwedishChef24 did a [comparison between this picture and a holocaust picture from 1945.](https://www.spotthedifferences.eu/)"}, {"id": "f6tdewd", "author": "Noexit007", "body": "It still blows my mind that basically we have Nazi Germany existing again with all its horrors, and yet because China is so involved in the world economy and so many companies (who pay off politicians) are so invested in the region that it is just being ignored. \n\nImagine if Hitler was just killing off all jews in Europe and the US and UK was just letting it happen because Nazi Germany made them money. At the moment, Xi Jinping is basically Hitler reborn for the modern times and China's government is the Third Reich, and China's people are the brainwashed, ignorant, or willing participants, just like Germany's population."}, {"id": "f6t0005", "author": "LadyOfAvalon83", "body": "What can a normal person do besides boycotting Chinese products and writing to MPs?"}, {"id": "f6sv9la", "author": "thegr8goldfish", "body": "There's money to be made so the world turns a blind eye. Watching the world burn is fucking depressing."}, {"id": "f6t6tla", "author": "123hig", "body": "\"Never again\\*\"\n\n\\* ^(unless it is country that is an economic superpower and confronting them would start another world war... cus then I guess they can keep it going if they're quiet about about it)"}, {"id": "f6thazx", "author": "nelsonbestcateu", "body": "Ever wondered how it was possible that Nazi Germany did what they did?\n\nEver wondered what it looks like when unwanted people are being murdered efficiently and on an industrious scale?\n\nEver wondered how Nazi Germany employed 1/3rd of its population to spy on the rest?\n\nEver wondered why the world did nothing to stop it for so long?\n\nYou are now watching Nazi Germany v2.0. It's here, right in front of you. Bigger, better and more powerful. And all the businesses in the world want to do business with Nazi Germany v2.0.\n\nThis is what it feels like when not enough people care."}, {"id": "f6tuloy", "author": "DRY_D3Y", "body": "I am German. We talk about WW2 and the Holocaust a lot, like seriously. A lot. I’ve had my fair share of pictures of mangled, beaten, starved innocent people. But they were all from the past. It’s what we want to learn from to never do that again. And yet, in this day and age we get pictures like these. On days like these i am ashamed to be breathing the same air as the people that commit these atrocities"}, {"id": "f6t2bfo", "author": "AngryGoose", "body": "This makes me so angry, yet as just an average guy with very little money and living in the midwestern U.S. I feel so completely helpless!\n\nWhat can I do? I want to help."}, {"id": "f6sy6cm", "author": "Turnburke", "body": "Fuck the Chinese Government"}, {"id": "f6talem", "author": "I_am_chris_dorner", "body": "[https://imgur.com/a/uqyv10A](https://imgur.com/a/uqyv10A)"}, {"id": "f6tfp7u", "author": "Funwithscissors2", "body": "THIS IS A HOLOCAUST. WHAT THE FUCK ARE WE EVEN DOING, PEOPLE?"}, {"id": "f6swn4p", "author": "penguinnnns", "body": "LeBron: no comment"}, {"id": "f6teopa", "author": "DrAugustBalls", "body": "“So many people could have been harmed, not only financially but physically, emotionally, spiritually.”\n\n-Lebron James when condemning the GM of the Houston Rockets for supporting Hong Kong"}, {"id": "f6t6ezu", "author": "CleverSpirit", "body": "The holocaust is real"}, {"id": "f6t228u", "author": "petdetectiveace", "body": "Title could have said “colorized photo from nazi concentration camp” and I would have believed it...."}, {"id": "f6tt7sq", "author": "SteelRazorBlade", "body": "If tomorrow we find out China has been burning Uighur muslims and Falun gong followers in giant furnaces the world will still continue as if nothing had happened. \"Never again\" is the biggest fucking lie the so-called \"civilized\" world has ever told itself."}, {"id": "f6t9hv4", "author": "RicoCat", "body": "This is what Blizzard/Activision supports. And the NBA."}, {"id": "f6swfkt", "author": "sand_opener", "body": "Tough to upvote this picture, but it deserves one for recognition of the situation. \n\nHeard. FuckChina."}, {"id": "f6w2rer", "author": "bolshevikshqiptar", "body": "this image is from 90s, and its not taken in secret. It is from a falun gong member during a hunger strike. Obviusly fake news."}, {"id": "f6syd23", "author": "Dahbakon", "body": "needs more upvotes, i knew things were bad in china but i made the mistake of thinking they were at least feeding their prisoners. Future generations will look as these times and ask \"what did you do about china\" just like we ask our old people what they did when germany was executing people. \n\n&#x200B;\n\n**FUCK CHINA**"}, {"id": "f6t3245", "author": "SpaceyCoffee", "body": "Fuck genocide. Fuck dictatorship. And fuck anyone who would allow either to ever happen. This is what happens when you give one man too much power."}, {"id": "f6tgg82", "author": "-gato", "body": " CNN,ABC,FOX,CBS,NYT Ect. why are we not hearing more of this?"}, {"id": "f6tya30", "author": "Insectshelf3", "body": "the world needs to know. report the fuck out of this, don’t stop. condemn it. get the UN on board, we can’t allow this to continue, profit be damned."}, {"id": "f6t56t0", "author": "BrandonTheFish", "body": "Fuck people on r/communism that claims this shit is just propaganda."}, {"id": "f6tfbia", "author": "ShadowStormDrift", "body": "So. I cautiously ask, how it is I can be sure that this image was indeed from a Chinese interment camp?  Not that I'm particularly fond of the CCP, but I'm also against being manipulated in any form so anyone got anything meaningful to link to? Like a reputable translation? of an interview or something"}, {"id": "f6sy2yg", "author": "Mr-Darkseid", "body": "China = NAZI 2.0"}, {"id": "f6tfxw2", "author": "roytown", "body": "Literally, parallel to the Holocaust images..."}, {"id": "f6tgllc", "author": "EthelMaePotterMertz", "body": "This is heartbreaking. They are starved, beaten, and medically tortured, just like those in the Nazi prison camps. Something needs to be done to help them."}, {"id": "f6ut8vi", "author": "rawdfarva", "body": "taken off the front page by reddit..."}, {"id": "f7b6217", "author": "DarthOswald", "body": "#This image is from 2004.\n\n\nhttp://imgur.com/a/dXxoNsj\n\nNot to downplay the significance, but just to ensure people understand that this isn't to be conflated with recent news."}, {"id": "f7bfa79", "author": "AristeiaXVI", "body": "This user is spreading [fake](https://www.reddit.com/r/conspiracy/comments/dv09ff/redditors_give_200k_upvotes_to_misleading/?utm_medium=android_app&utm_source=share) news"}, {"id": "f6ticfd", "author": "Osz1984", "body": "This really needs to be all over every news site.  I can not look at this picture a second time, but that is the point.  This is beyond terrible and should not be tolerated.  Action needs to be taken somehow."}, {"id": "f6t68oc", "author": "rmlx", "body": "Fuck LeBron. Fuck the NBA. Fuck China."}, {"id": "f6u56qs", "author": "realister", "body": "\"Dont trust China, China is asshowe\""}, {"id": "f6ticye", "author": "uzanur", "body": "Modern Holocaust. Shame on the world leaders. Shame on us to keep buying stuff from China. I am ashamed of my humanity. We are responsible for this shit. We have blood on our hands\nWe need a widespread boycott movement asap"}, {"id": "f6t03qh", "author": "Wayed96", "body": "Please tag the NSFW box"}, {"id": "f6thcvu", "author": "Payamux", "body": "Remember when we all said \"if it was us in the 1940s, we would have fought\". Well now is the time"}, {"id": "f6t6fcc", "author": "rane56", "body": "So were doing the Holocaust all over again huh?? Humans can be disgusting creatures."}, {"id": "f6tdnsl", "author": "weedexperts", "body": "It's 2019 and human atrocities are still happening on a daily basis at the hands of governments. But hey, what's on Netflix tonight chaps?"}, {"id": "f6szxfh", "author": "PauloTheOrangeKat", "body": "Dude barely looks alive, something needs to change last week."}, {"id": "f6t4uh6", "author": "Craftax", "body": "What can I do to help stop this?"}, {"id": "f6u0vb9", "author": "WhyRedTape", "body": "My dad used to have a random friend on Skype.\n\nShe appeared on day and asked my dad for screenshots of the front pages of loads of news websites like Wall Street Journal and The Guardian. When my dad asked why it turned out she was from China and was just wanting to know what was happening outside her town. \n\nHe hasn't heard from her in years now. Shit like this makes me worry about her"}, {"id": "f6t0w5e", "author": "TipsyPeanuts", "body": "Thank God we have a hero like LeBron who isn’t afraid to speak out against the... (checks notes).... economic impact words have?"}, {"id": "f6tidz3", "author": "wheelchairdolly", "body": "Ask LeBron if this spiritually affects him?\n\nJackass"}, {"id": "f6tsaiw", "author": "Frohbaer", "body": "How do we know that this is, what it is claimed to be? I don't want to deny it or lessen the impact of such a photo. It is simply that I'm worried, that fake news is not only existing by the hands of Trump and his friends at fox, but there is more than that. I would love to believe, that these kind of atrocities are nothing but fake though I have to admit, that the amount of reports is damning and worrying. How to know, which news sources are trustworthy? Sry for the bulk of questions ..."}, {"id": "f6u34bg", "author": "JoeFlaccosEyebrows", "body": "This photo should be posted to every one of LeBron's tweets. Then maybe he can understand"}, {"id": "f6v44dg", "author": "rj6553", "body": "Not to say that this is fake. But I'm slightly baffled that I can't even sneak a phone into an exam, and somehow this women can sneak a camera into a government controlled detention camp."}, {"id": "f6tj36j", "author": "-Jack_of_Spades-", "body": "##FUCK THE CHINESE GOVERNMENT##"}, {"id": "f6t5062", "author": "sandkillerpt", "body": "Nazi germany all over again"}, {"id": "f6tmkqu", "author": "Treetreetree23", "body": "This is horrific. How do we verify what is happening? I guess all this with the recent elections show how manipulated we are by social media. Is there any resource I can go to that helps verify this that’s at least somewhat neutral?"}, {"id": "f6t6j5e", "author": "clubcar", "body": "Thanks Lebron!"}, {"id": "f6t6t3c", "author": "Brian_117", "body": "and then Apple and Blizzard still make business with this government."}, {"id": "f6t8p0o", "author": "beepybeetle", "body": "is there a reliable, independent source that corroborates this?"}, {"id": "f6t3m8l", "author": "penguished", "body": "Yet the only thing every country will discuss with China: trade.\n\nWorld, we fucked up."}, {"id": "f6uuzzk", "author": "thailoblue", "body": "Can I ask the obvious? Do we have any confirmation of this image outside of OP's title?"}, {"id": "f6uvqs6", "author": "annieesquad", "body": "That's a human being. Someone who once had hopes and dreams. Someone who was loved by and loved family. Someone who experiences pain and fear and loneliness and despair. Someone who could have experienced joy and excitement and hope. Nobody should have to endure this."}, {"id": "f6v1sc7", "author": "JoelDubs", "body": "So odd, the most \"genuis\" of Reddit cannot do their own research and it takes posting torture pictures for shock value. All social media is dumbing people down in their echo chambers and even censoring views, while the woke be consistently asleep."}, {"id": "f6v2b0d", "author": "roxynin", "body": "To be honest, I err on the side of caution when it comes to images like this. Where are other pictures? What is the proof that this image is indeed from one of these ‘internment camps’?"}, {"id": "f6tlf7b", "author": "Lifejamar", "body": "Modern day nazis, and everyone is too busy complaining about trump to see it. Cant complain about china, we are all benifiting from their horrible human rights record, we need our i phones and other cheap chinese goods"}, {"id": "f6t1bbk", "author": "Onetimehelper", "body": "Holocaust 2.0\n\nWe in the West need to do something, otherwise we are literally hypocrites to everything we say we stand for."}, {"id": "f6tj85t", "author": "Some_random_guy89", "body": "I have seen such a picture somewhere....yeah...but it is 70 year old black and white picture....from Germany"}]}