{"id": "dwdllq", "title": "The most challenging painting I've ever done titled \"Recover\" #BrushstrokesinTime", "url": "https://i.redd.it/0nzln43z2py31.jpg", "subreddit": "pics", "author": "davidambart", "text": "", "comments": [{"id": "f7iao1b", "author": "StillJamesonsMom", "body": "This is incredible!"}, {"id": "f7iiao7", "author": "liarandathief", "body": "\n\nLove the painting.\n\nSo here's an interesting fact, before Manhattan was inhabited there was a deer trail that ran up the length of the island.  The Wecquaesgeek people expanded the deer trail into a proper trail through the forest brush, allowing them to move quickly across the island.  When the Dutch arrived they widened the trail into a road and called it *Heeren Wegh* or Gentleman's Way,  When the British took over NY, they renamed it Broadway because of it's unusual width."}, {"id": "f7ip0ic", "author": "lieutenant-dan416", "body": "At first I thought it was backwards in time to some canyon or so but it’s actually forward to some post-apocalyptic world. Awesome work!"}, {"id": "f7if0yh", "author": "gibson_supreme", "body": "Will Smith is about to drive by in his Shelby GT500 ;) Looks great!"}, {"id": "f7ifg1c", "author": "SinVice", "body": "Can I have this for Christmas. I'll pay my way to the top of the nice list."}, {"id": "f7isodi", "author": "ChrisKrypton", "body": "It's beautiful. A little bit of Oko everywhere"}, {"id": "f7ik6sm", "author": "melld86", "body": "Reminds me of PS4 game, The Last Of Us"}, {"id": "f7ilxmt", "author": "nemesisofmortals", "body": "Uh oh... Elks are invading r/pics!"}, {"id": "f7ieb6v", "author": "therocketflyer", "body": "I love how thick and visible the brushstrokes are even in this photo of the painting!"}, {"id": "f7iy6d0", "author": "missbitterness", "body": "Question: do you paint the background, do a thick stroke of paint, let it dry, and then paint over? I'm so curious about how this is made!"}, {"id": "f7iesmh", "author": "FrighteningJibber", "body": "Getting some good “I Am Legend” vibes from the deer."}, {"id": "f7ioa50", "author": "Char_da_mange", "body": "I've never felt the need to buy a painting until right now."}, {"id": "f7ihihy", "author": "lagutrop", "body": "Whaaat?! This is literally one of the best paintings I’ve ever seen. No joke."}, {"id": "f7iatm3", "author": "CTMOSHUN", "body": "This is one of the coolest paintings I have ever seen!"}, {"id": "f7itjmv", "author": "Novotisy", "body": "Reminds me of Dr. Stone, super cool"}, {"id": "f7ifnt3", "author": "RiftedEnergy", "body": "That's badass"}, {"id": "f7iiyx1", "author": "PelicanDesAlpes", "body": "Well slap my ass and call me Judy, that's incredible!"}, {"id": "f7is3jg", "author": "gratethecheese", "body": "Is this digital or real paint?"}, {"id": "ff25501", "author": "siberian_overture", "body": "Hello.\n\nI know this post is two months old, but I could not just upvote and leave it behind.\n\nThis piece - I don't know how to describe it. It's a masterpiece, for the lack of better words. The moment I saw it I inhaled instinctively and widened my eyes - it was so beautiful, so imaginative, so captivating.\n\nI saved the post(I rarely do this) and will definitely come back to it every couple of months just to remind myself that such a mindblowing work of art exists.\n\nI'm amazed at how much detail you were able to fit into this - especially the deer. The way its fur captures the sunlight and reflects it is just remarkable.\n\nThank you for this. It genuinely brought tears to my eyes."}, {"id": "f7ihoop", "author": "RTrent6", "body": "Oh my God this is AMAZING. Do you sell any of your works? I'd definitely be interested in buying one of your paintings!"}, {"id": "f7irjzn", "author": "Muffinmanifest", "body": "Why did that load in grayscale first"}, {"id": "f7ifxcs", "author": "purpleinme", "body": "That’s a really cool concept and execution! Kudos!\n\nLove the other work you’ve posted too."}, {"id": "f7il0og", "author": "jbhilt", "body": "Is it for sale?"}, {"id": "f7j5ln1", "author": "Deckhand47", "body": "basically the Dr. Stone anime plot line. Amazing painting"}, {"id": "f9kztb2", "author": "Spenround", "body": "wow, what a great picture"}, {"id": "fca4xul", "author": "frozenpyromaniac", "body": "This is one of the coolest paintings I have ever seen. I appreciate so much the time and tedious work put into this! 💜 of all, the meaning of it is the best."}, {"id": "f7igbpx", "author": "Wolowizard6", "body": "Sick"}, {"id": "f7igbw3", "author": "Goodgoodgodgod", "body": "I dig this a lot. I can see it being part of a series."}, {"id": "f7ihg89", "author": "Katorligan", "body": "Wow. This is awesome! This brings so much emotion, you're incredible."}, {"id": "f7iioer", "author": "angry_pidgeon", "body": "This is amazing! If you ever start selling them I'd love to buy one"}, {"id": "f7inwgl", "author": "DRVHP12", "body": "Reminds me of I am legend"}, {"id": "f7irxrx", "author": "mdw", "body": "This reminds me that sometimes I look at my town or other places and try to imagine how it looked without all the buildings and stuff humans put there."}, {"id": "f7is3xc", "author": "AnonymousFordring", "body": ">!Arthur Morgan's dream!<"}, {"id": "f7isqw5", "author": "PsykerSleaze", "body": "Reminds me of that scene from The Last Of Us where they’re going to the university after the apocalypse and nature basically retook the city or that part. They had the giraffes roaming in the streets. \n\nThat being said, this is an amazing piece."}, {"id": "fao9b5y", "author": "SawDoggg", "body": "Just bought this print as a Holiday gift for my sister, it looked fantastic when it arrived and I struggled not to keep it for myself lol good stuff"}, {"id": "f7iu819", "author": "daviedanko", "body": "It’s a great painting but is the message that destroying society and going back to nature is “recovery”? I really don’t get the anti human romanticism on Reddit."}, {"id": "f7iric3", "author": "braintuck", "body": "I have never seen anything like this before. The upper part even resembles water/waves with how you kept the texture. If you make prints, I would buy"}, {"id": "f7iqxab", "author": "Artrobull", "body": "tyler durden daydream?"}, {"id": "f7isqhf", "author": "patricksupra", "body": "I see stuff on here every now and then and I'm like \"damn that's pretty good\". I have never been speechless until now. You are truly talented. This is absolutely incredible."}, {"id": "f7ihyiv", "author": "HitNRun_", "body": "I really love your work and everything behind it. I hope you keep this up!"}, {"id": "f7inqde", "author": "GnomaPhobic", "body": "Awesome! I've never seen a theme like this before, I really dig it. I would totally buy a print of this"}, {"id": "f7inza5", "author": "MizFreeMarkets", "body": "I would like to buy a print"}, {"id": "f7ipqsm", "author": "thebrownkid", "body": "Can I buy this?"}, {"id": "f7iqeeg", "author": "thomasbeck", "body": "This is cool af. Great job on the creativity and adding the texture to it too. Like you are painting away reality with a remembrance of the way it used to look."}, {"id": "f7iqeku", "author": "Gridorr", "body": "Dammmmmmm"}, {"id": "f7iqfdp", "author": "AdministrativeMoment", "body": "Wow this is amazing!"}, {"id": "f7iqg6q", "author": "Tahk24", "body": "Love it"}, {"id": "f7iqhub", "author": "Makarov_NoRussian", "body": "\"The Recovery Stroke\""}, {"id": "f7iqln6", "author": "jroddie4", "body": "Did you just paint a fat dab on the middle of the finished thing, wait for it to dry, and then paint on the dried bit?"}, {"id": "f7iqrc0", "author": "abezeez", "body": "Absolutely incredible. Wow, just beautiful"}, {"id": "f7iqssg", "author": "Ratsniper", "body": "r/perfect"}, {"id": "f7iqvra", "author": "louis_1267", "body": "Bro that’s beautiful you have so much talent, wow"}, {"id": "f7ir2as", "author": "filmhamster", "body": "Your artwork is very cool - would you be able to share anything about your process to achieve this look?"}, {"id": "f7ir4bu", "author": "BellaB13", "body": "This is one of the most amazing things I’ve seen. Thank you so much !"}, {"id": "f7ir6j3", "author": "DonaldRonaldRon", "body": "What made it your most challenging?"}, {"id": "f7irdg1", "author": "Big-Hig", "body": "I like it."}, {"id": "f7ire7d", "author": "h3c70rsa", "body": "You are the legend"}, {"id": "f7irgeu", "author": "jinglejae", "body": "AMAZING"}, {"id": "f7irjd3", "author": "apocolypseamy", "body": "breathtaking\n\njust got a new phone yesterday- this is now my background- I'll see it 50 times a day\n\nabsolutely amazing, thank you"}, {"id": "f7irjzb", "author": "pigglywigglyhandjob", "body": "Absolutely amazing work"}, {"id": "f7irkb2", "author": "kevbino13", "body": "Wow..."}, {"id": "f7irlno", "author": "illoomi", "body": "that's fucking cool holy shit"}, {"id": "f7irlue", "author": "M0untain37", "body": "This is beautiful work."}, {"id": "f7irlwl", "author": "sanch0_", "body": "amazing"}, {"id": "f7irnpl", "author": "I_talk", "body": "This doesn't compute for me. How do you do this? What? Huh? Impossible"}, {"id": "f7iro7l", "author": "electric4568", "body": "noice"}, {"id": "f7irq6e", "author": "LoKnows95", "body": "I'm pretty sure this required a lot of test runs"}, {"id": "f7iru76", "author": "bulkandskull", "body": "Nice try obvious marketing shill for EuroPan.../s"}, {"id": "f7iruhs", "author": "Enools82", "body": "Amazing concept and beautiful execution."}, {"id": "f7irwam", "author": "NewLeaseOnLine", "body": "Hey you must be the same person who painted the Jurassic themed one with the dinosaurs and volcanic wasteland in the brush stroke which I have in my phone. Do you sell canvas prints?"}, {"id": "f7iry09", "author": "Why_Did_It_Stop", "body": "Truly a beautiful piece."}, {"id": "f7iryoa", "author": "Rig88", "body": "I will pay for this. Even if it's a quality copy. I want and will pay for this."}, {"id": "f7is2hq", "author": "SpooksMCduck", "body": "That’s fucking beautiful, you should sell these as posters or something id get my hands on one in a heartbeat."}, {"id": "f7is385", "author": "PM_ME_LETS_TALK_", "body": "Very cool! How did you do it?"}, {"id": "f7is5k0", "author": "JohanBroad", "body": "Beautiful and powerful.\nI know that a lot of people think that art has to 'make a statement', even at the expense of Aesthetic beauty.\n\nThis painting is beautiful, and makes a very powerful statement at the same time. \n\nAlso, this would do well in /r/Art and  /r/cyberpunk."}, {"id": "f7isplk", "author": "PlagueDilopho", "body": "That is breathtaking! Amazing work!!"}, {"id": "f7isso4", "author": "jackydubs31", "body": "Wow! I love the way the brushstroke literally jumps off the page. Never let me near this because I would undoubtably run my finger over the texture"}, {"id": "f7it68l", "author": "Fran6coJL", "body": "This looks awesome!! Where can I buy?"}, {"id": "f7itwu3", "author": "MrSocialClub", "body": "I feel as though there’s a lot of art that goes under appreciated due to over saturation and how commonplace artistry is in modern day. If this was made in a time where painting was a more niche skill, I think it would be heralded as a masterpiece. Very well done, thank you for sharing."}, {"id": "f7ivgzm", "author": "Faith_Sci-Fi_Hugs", "body": "I love this. My dad is always talking want wanting to go back in time and see what LA looked like before people got there. Are you still selling prints of your piece titled \"Human nature\" I'd love to get either that one or this one for him for Christmas."}, {"id": "f7iwwmy", "author": "valwow187", "body": "Wow I love the concept of this"}, {"id": "f7ixjqw", "author": "rachel72826", "body": "Absolutley amazing! You have an unbelievable talent, wow."}, {"id": "f7izpr1", "author": "xerbix", "body": "Great Work! \n\nPlease let me know if there is a higher resolution pic that I could use as phone wallpaper."}, {"id": "f7izz5g", "author": "JazzTrumpetMan", "body": "At first I thought this was a painting depicting the deer as being in the past but upon further inspection it appears that the buildings are also present in the background. Does this imply that the “brush stroke” is actually going forward in time to an abandoned city that has been overgrown or are I way off on this?"}, {"id": "f7j0ymq", "author": "Lenny_Cravatz", "body": "Wow. Incredible."}, {"id": "f7j5h14", "author": "happykal", "body": "Reminds me of I am legend."}, {"id": "f7j5ldv", "author": "Orchidbleu", "body": "Last of us."}, {"id": "f7j69rs", "author": "BurpeesHateYouToo", "body": "Imagine being this good at something."}, {"id": "f7j7mw8", "author": "Douglaston_prop", "body": "Love this even though that EuroPan spot is one of my least favorite eating establishments in the city."}, {"id": "f7j7p0p", "author": "SkyhighCanadianguy", "body": "Just wow. Absolutely beautiful! It's thought provoking and elegant"}, {"id": "f7j9imh", "author": "yintwint", "body": "And most rewarding, great job!"}, {"id": "f7ja3ao", "author": "WerewolfPandemic", "body": "I know this wasn’t your intention with the painting, but I felt a powerful connection when I interpreted it as a “recover”ing depressed person beginning to see the world in color again. Beautiful piece."}, {"id": "f7jasfp", "author": "LilianaIsGoals", "body": "Fucking oko"}, {"id": "f7jcmc0", "author": "ChaellExE", "body": "beautiful"}, {"id": "f7jem77", "author": "Marigold16", "body": "I love anything vaguely apocalyptic"}, {"id": "f7jgyuj", "author": "MFORCE310", "body": "This will be the most upvoted post of all time."}, {"id": "f7jh5a1", "author": "lovewaffule", "body": "Bruh"}, {"id": "f7jhqmw", "author": "lynyrdmoon", "body": "Wow! That is amazing. Imagine if you lived 200 years ago. You would be appointed by the king for work like that!"}, {"id": "f7jj2rw", "author": "CubingPotato", "body": "Dr. Stone be like"}, {"id": "f7jo6sn", "author": "wizzah2", "body": "Where can I buy it?"}, {"id": "f7jodvi", "author": "Denikkk", "body": "This is the most amazing thing I have ever seen."}, {"id": "f7jr6w1", "author": "superdragon640", "body": "All I can see is the city from I Am Legend :o"}, {"id": "f7jry0x", "author": "RedFox69420", "body": "Absolutely spectacular!"}, {"id": "f7jsasb", "author": "drpepperbrxnd", "body": "the amount of skill and time this must have taken, it looks spectacular!!"}, {"id": "f7jsb7i", "author": "youdirtyhoe", "body": "That’s incredible but obviously at 137k updoots. Do u do this for a job cause u should"}, {"id": "f7jv0ce", "author": "superdavit", "body": "“In the world I see you are stalking elk through the damp canyon forests around the ruins of Rock feller Center. You'll wear leather clothes that will last you the rest of your life. You'll climb the wrist-thick kudzu vines that wrap the Sears Towers. And when you look down, you'll see tiny figures pounding corn, laying stripes of venison on the empty car pool lane of some abandoned superhighways.”  \n\n\n\\-Tyler Durden"}, {"id": "f7jv89h", "author": "lilgamelvr", "body": "You did a great job"}, {"id": "f7jvwld", "author": "Killhank", "body": "This is amazing!"}, {"id": "f7jw2v4", "author": "Minahtobi", "body": "This kinda reminds me of the opening scene from I Am Legend"}, {"id": "f7jyoop", "author": "MyMorningJackit", "body": "Omg this would make a cool puzzle I think"}, {"id": "f7k0cvf", "author": "nexusmadao", "body": "This feels like a scene from I am Legend starring Will Smith."}, {"id": "f7k49nk", "author": "NobodyCanHearYouMeme", "body": "Don’t quit your day job"}, {"id": "f7kaex3", "author": "pandalover4ever", "body": "I want to buy this. My whole life my parents have drilled in my head to never hang things on the wall to keep the value of a house, therefore I never had any thoughts about hanging frames and things. Now I understand why people want to hang art by looking at this. Amazing"}, {"id": "f7kks7d", "author": "sherylroark", "body": "Beautiful!  Is it for sale?"}, {"id": "f7l3cbq", "author": "jcox043", "body": "One of the the most original and unique paintings I've ever seen. Amazing work!!"}, {"id": "f9g0aqu", "author": "yuge___", "body": "Damn, I’ve been looking at this since it was posted, and I’m just now realizing that the view with the deer is the same “view” looking down the same street in the future.  That just took this painting from from”amazing” to “fucking incredible”.  And I’m not even an art fan.  Great work!"}, {"id": "famc1rq", "author": "Brandon9one", "body": "Super Special Award on the way for this incredible painting."}, {"id": "faorntv", "author": "unclebuck925", "body": "I dont think there are words to try to describe how it must feel to be able to produce such work as yours. Because \"Amazing\" and \"Beautiful\" and words like that dont even come close. I'm speechless !"}, {"id": "fdxl0iw", "author": "noahshamas", "body": "Another interesting fact, when the Dutch inhabited the lower part of the island, they built a wall to keep out the natives and wildlife. It cut horizontally across the width of the island. Many years later that wall was destroyed and a street was built in its place, Wall Street. Apparently there’s still parts of the original wall visible."}, {"id": "fgnv6s6", "author": "AyyDashh", "body": "This is absolutely one of the best paintings I’ve ever seen period"}, {"id": "fkm4avs", "author": "ByroniustheGreat", "body": "Holy shit"}, {"id": "flw2iku", "author": "Smash_Nerd", "body": "Virus is happening. Animals are on the streets\n\nDamn it you wished for the wrong thing\n/s"}, {"id": "f7ierjx", "author": "SuperTully", "body": "Awesome stuff, reminds me of what’s happening in Chernobyl after the disaster there."}, {"id": "f7iys0j", "author": "TXxAS", "body": "r/im12andthisisdeep"}, {"id": "f7im9c6", "author": "EdwardLewisVIII", "body": "[Nothing But Flowers](https://youtu.be/2twY8YQYDBE) by Talking Heads is the musical version of this. Great painting. Great song."}, {"id": "f7j3we9", "author": "Nj_all_day", "body": "I'm not into art, paintings, or anything like that. I usually scroll right by those kinds of posts on reddit.\n\nBut wow, this has got to be the most incredible painting i've ever seen."}, {"id": "f7immek", "author": "papasimon10", "body": "This is staggering (pun intended). Above all, though, it's just got that great melancholic quality to it that takes you back to nature, bravo. I feel like I'm outta the city and back in the mountains in Colorado; I vividly remember seeing a stag look us straight in the eyes out on this beautiful trail in the Rockies when we were on a family vacation back in the 1980s . The light was just like in OP's photo and I wish I had a photo to share to show the similarity but unfortunately my son made a stupid noise and ended up scaring away, so I frogmarched him back to the car where I pulled a set of jumper cables outta the trunk and beat him senseless with them to teach him a lesson for disturbing wild animals in nature. I'm really in awe at OP's talent - I can't wait to cycle through his other work when I get home from work! Great job!"}, {"id": "f7ihi77", "author": "-7-Killa-7-", "body": "Very nice. I'd like to recover some jerky from that buck lol really like that you made it look like one large brushstroke over the city. How'd you work out that effect?"}, {"id": "f7ifhvl", "author": "soynanyos", "body": "Holy shit, this is beautiful!"}, {"id": "f7io8iw", "author": "SonOfCarcosa", "body": "Finally, some good fuckin' content"}, {"id": "f7ixdj9", "author": "Ewokhunters", "body": "Well split my dick and call me Caitlyn that there is real super fucken neato"}, {"id": "f7ifwou", "author": "sleepysheepsix", "body": "Wow. So cool. I can’t even begin to wrap my head around how you did this!"}, {"id": "f7jc0wj", "author": "DerekClives", "body": "Pointless shit."}, {"id": "f7iasql", "author": "Looksthesame66", "body": "Wow!!"}, {"id": "f7icg2m", "author": "Foxbox405", "body": "I love this! You did a fantastic job!"}, {"id": "f7idhwk", "author": "supra5mge", "body": "VERY cool!"}, {"id": "f7idkhu", "author": "Lucifire_Morningstar", "body": "INCREDIBLE!!"}, {"id": "f7idqn5", "author": "hatertator9000", "body": "This is really beautiful!"}, {"id": "f7iffjf", "author": "buckeyespud", "body": "At first I thought the brush stroke was going back in time, but there looks like building skeletons in the background so maybe it’s a post-apocalyptic future?  Very cool!"}, {"id": "f7igol3", "author": "KruegerBeats", "body": "Wow! Amazing!"}, {"id": "f7igw41", "author": "TheScribe86", "body": "*(paws at screen)*\n\n>[Oh good...***good***](https://youtu.be/A1vEdlD59mQ?t=1m46s)"}, {"id": "f7ih7dj", "author": "blameitonmyaddbabay", "body": "This has given me goosebumps, my body hair is erect for your artwork."}, {"id": "f7ih9do", "author": "cuschnei616", "body": "U paint good"}, {"id": "f7ihhyh", "author": "JungleLiquor", "body": "Ok so that the first post I see today and I’m amazed. Holy shit I thought it was a painting over a photograph. It’s so amazing!"}, {"id": "f7ihk52", "author": "AlexDeSnake", "body": "This is insanely cool"}, {"id": "f7ihw52", "author": "AgentFunk", "body": "Absolutely Gorgeous!"}, {"id": "f7iiffd", "author": "mrwhiskey1814", "body": "Holy moly. You're incredibly talented. I haven't painted in a long time and you have seriously inspired me to get back to it. This is absolutely beautiful. Thank you for sharing this."}, {"id": "f7iikpn", "author": "carbondrewtonium", "body": "“Wiping Away Modern”"}, {"id": "f7iix6t", "author": "k1rage", "body": "Not an art critic but looks outstanding to me\n\nI do believe you have talent"}, {"id": "f7iixvz", "author": "thenonapus", "body": "This is just amazing"}, {"id": "f7iizjv", "author": "Radioactive-donut", "body": "Absolutely stunning. You are incredibly talented OP."}, {"id": "f7ij4d9", "author": "roolinheart", "body": "THIS IS FUCKIN AWESOME, Bob Ross would be very very proud of you!"}, {"id": "f7ij8o3", "author": "Gael_13", "body": "The best painting I have ever seen"}, {"id": "f7ijp92", "author": "NonPolarVortex", "body": "Sooo... Upper east side? Round 79th street?"}, {"id": "f7ijxzx", "author": "imar0ckstar", "body": "This is super cool!  I really love it.  Is this your style or was it your first time trying it?"}, {"id": "f7ik0io", "author": "9McNuggets", "body": "this reminds me of The Last Of Us. Beautiful art man."}, {"id": "f7ik9ou", "author": "LargePersianSenip", "body": "Fantastic style!"}, {"id": "f7ikdxi", "author": "Lifeesstwange", "body": "Love it. \n\nDo you have a link to your store or page?"}, {"id": "f7ikee2", "author": "yohannalucia", "body": "One of the most amazing paintings I've ever seen!"}, {"id": "f7ikeka", "author": "alchemy21", "body": "I mean. Holy shit."}, {"id": "f7ikiis", "author": "Melker24", "body": "This, is brilliant."}, {"id": "f7ikjrw", "author": "Kaleena_Martin", "body": "WOW!!! Just WOW"}, {"id": "f7ikwz4", "author": "Alexander_the_Greatr", "body": "This is absolutely my favorite thing I've ever seen."}, {"id": "f7ilhku", "author": "_Shahnawaz", "body": "Fabulous work of art."}, {"id": "f7ili6i", "author": "theRealLotzz", "body": "Yo please pm me with your rate id like this painting hanging on my wall"}, {"id": "f7ilj26", "author": "kal2020", "body": "Well shit!!! You’re one talented motherf......\nThis is awesome. Love it."}, {"id": "f7ilnmq", "author": "pamdndr", "body": "Wow.  It's..just WOW!"}, {"id": "f7ilora", "author": "IN547148L3", "body": "How much would this cost?"}, {"id": "f7ilve8", "author": "WeptShark", "body": "Man, Chernobyl has changed"}, {"id": "f7imhpq", "author": "skinnergy", "body": "Very cool and unique concept."}, {"id": "f7in0hm", "author": "omegasting", "body": "Yo what the fuck. Put this in a gallery"}, {"id": "f7in3bz", "author": "rayferrr", "body": "I’ll just reiterate. This is incredible! May have been a challenge but you nailed it!"}, {"id": "f7in3et", "author": "TheTobruk", "body": "You're the guy who did the dinosaur one, right?"}, {"id": "f7in95x", "author": "beautyyetbrains", "body": "Nature taking back what we borrowed...or stole? Beautiful."}, {"id": "f7inmp4", "author": "HandOfApath", "body": "Man, i would insta but this printed on metal or canvas"}, {"id": "f7io6vb", "author": "seriousdeadmen47", "body": "This going to be my phone s wallpaper it s the best piece of art i ever seen"}, {"id": "f7io702", "author": "genevievemia", "body": "I am legend vibe, really dig your work. Keep it going!"}, {"id": "f7ioaeh", "author": "cgroi", "body": "One of the best paintings I've ever seen. Bravo."}, {"id": "f7iocbd", "author": "timebomb011", "body": "At first I thought this was looking back to the past before humans.. Then I realized the buildings were grown over and realized it was in the future and the deer was looking back at us in a past where there still was humans."}, {"id": "f7ioibc", "author": "Ithxero", "body": "Damn. Great job."}, {"id": "f7iosz7", "author": "PewpScewpin", "body": "This is on another level. Holy moly what a great vision!"}, {"id": "f7iouq5", "author": "Rocketsnowmen", "body": "Not sure if this is obvious but, if you zoom in then this painting is no longer black and white"}, {"id": "f7iowfy", "author": "jobbins", "body": "WOW"}, {"id": "f7ip0a7", "author": "Aperfectmoment", "body": "As a street sweeper I can say at leady in Australia it would only take a couple of years for nature to reclaim the road and footpath if they are not maintained."}, {"id": "f7ip49g", "author": "bluepoweraid1", "body": "Holy shit"}, {"id": "f7ipa70", "author": "illumillama", "body": "Absolutely beautiful."}, {"id": "f7ipfrm", "author": "salesmush", "body": "Dude - this is amazing - can you send me a copy I can use as desktop wallpaper or print and frame? \n\nSeriously that is some good artwork - don’t usually really care about stuff like this but.. damn"}, {"id": "f7ipgel", "author": "wyntre_russo", "body": "This is so amazing!!!!"}, {"id": "f7ipjno", "author": "Makonu2", "body": "High key, that shit's amazing."}, {"id": "f7ipmfr", "author": "DoctorBubba", "body": "Major I Am Legend vibes, I dig it"}, {"id": "f7iprs4", "author": "xyz_1232005", "body": "Global warming is real. Climate change is real."}, {"id": "f7ipu3l", "author": "Rhyff", "body": "Waow this is amazing, both idea and execution!"}, {"id": "f7ipyli", "author": "Exotic_Ghoul", "body": "Holy shit!"}, {"id": "f7iq4qc", "author": "MesaGeek", "body": "this is fine art."}, {"id": "f7iq5kz", "author": "GE15T", "body": "This is amazing/beautiful/wonderful! I'd love to have something like this hanging in my house!"}, {"id": "f7iq5qo", "author": "SlightyStupid95", "body": "Outstanding work"}, {"id": "f7iq8tg", "author": "CinnaMANtoast", "body": "Wait hold up this ISNT photoshop?"}, {"id": "f7iqc6e", "author": "kd2310", "body": "Amazing man"}, {"id": "f7iqcro", "author": "bobfnord", "body": "is there actual texture/thickness on the brushstroke paint, or is it painted to give the *appearance* of texture?"}, {"id": "f7iqdth", "author": "agirlinsane", "body": "Righteous."}, {"id": "f7iqwsl", "author": "boston_shua", "body": "Yeah this is pretty cool"}, {"id": "f7iqx95", "author": "LIGHTDX", "body": "The last of us?"}, {"id": "f7iqxza", "author": "spicyone15", "body": "Wow this is amazing!!!!"}, {"id": "f7iqyf4", "author": "justjoe1964", "body": "Love it"}, {"id": "f7ir1fi", "author": "TheRealSSpace", "body": "Sooo cool! Reminds me of ketamine"}, {"id": "f7ira24", "author": "mkalaf", "body": "FAKE"}, {"id": "f7irapp", "author": "usernameisonuse", "body": "I feel The Last Of Us vibes, idk"}, {"id": "f7irbgr", "author": "Chainsawninja", "body": "Ted Kaczynski was right."}, {"id": "f7iri0o", "author": "thvs86", "body": "I would remove the Europe reference because this is a world issue. \nOtherwise, this is a good piece. I would buy it if it was available."}, {"id": "f7irj6q", "author": "NewDisguiseNudistGuy", "body": "I Am Legend."}, {"id": "f7irpnd", "author": "kchasathi", "body": "Where can I buy this?"}, {"id": "f7irw9g", "author": "Bromaz", "body": "Reminds me of I Am Legend"}, {"id": "f7irypd", "author": "fadadapple", "body": "The city is the recovery, the nature is the poison"}, {"id": "f7irzl8", "author": "OfGodlikeProwess", "body": "Fantastic really!"}, {"id": "f7irzy2", "author": "jokdok", "body": "Holy crap, dude."}, {"id": "f7is17g", "author": "peng_shi_Panda", "body": "Wow"}, {"id": "f7is2ao", "author": "findingmemobro", "body": "I almost had a stroke trying to read the hashtag"}]}