{"id": "e5jy9g", "title": "Our school lunch lady made this Christmas display by hand ❤", "url": "https://i.redd.it/4pg4yxag8g241.jpg", "subreddit": "pics", "author": "Kwilos", "text": "", "comments": [{"id": "f9kch0p", "author": "gg2700", "body": "Absolutely beautiful and her proud smile is the best part!"}, {"id": "f9k6k6j", "author": "Phillipe1988", "body": "She’s did an incredible job!!! Every detail is perfect!"}, {"id": "f9kcc08", "author": "DrDocter84", "body": "She should be the art teacher"}, {"id": "f9k5l2l", "author": "Impossible_C", "body": "People who actually try hard at their job make schools better."}, {"id": "f9kmid5", "author": "ellefemme35", "body": "Oh man. I loved my elementary school lunch lady. Her name was Paula, and I never even got hot lunches. Mine were always sent with me. But she also worked the YMCA shifts, and I was a before and after school kid with the Y. To this day her and the gym teacher were my two fav “teachers” of all time. They were so good to me, and to so many other kids. \n\nThis lady likes her job and her kids. It’s wonderful to see people still caring in this world. This makes me so insanely happy."}, {"id": "f9kcsux", "author": "chickenwithaspoon", "body": "This is precious! The more you look, the more details you find. Even little things like paper poinsettia flowers are adorable! (And probably the only thing I could come remotely close to replicating, lol!)"}, {"id": "f9kcgqo", "author": "sxysteve", "body": "South Park has taught me not to trust those animals."}, {"id": "f9k7tey", "author": "cant_Im_at_work", "body": "This is so sweet.  My mom is a lunch lady so they always have a weird place in my heart."}, {"id": "f9kjajo", "author": "roorats", "body": "She deserves to get paid for that kind of skill"}, {"id": "f9laj0f", "author": "Kwilos", "body": "Mods, if I do a follow up post tomorrow and create her a go fund me for a reddit Xmas bonus, would that be allowed?"}, {"id": "f9k9gyf", "author": "Xertious", "body": "At least one of them is a South park Christmas critter"}, {"id": "f9kc2fk", "author": "DutchessRavenwave", "body": "This took so much time and love. I appreciate your dedication to the kids and I appreciate you, kind lunch lady."}, {"id": "f9kcsea", "author": "youngcoldhardcash", "body": "NGL the most valuable relationship I made in school was with the lunch ladies. Always had extra food on my plate."}, {"id": "f9k40k7", "author": "rmgk", "body": "A real life angel!"}, {"id": "f9kfkit", "author": "Rumple-Foreskin-420", "body": "Looks like a woodland critter Christmas!"}, {"id": "f9k9368", "author": "GlassApricot9", "body": "Every school has that one wholesome precious support staff member that must be protected at all costs."}, {"id": "f9kjgo2", "author": "lstn", "body": "What an absolute joy"}, {"id": "f9kp9im", "author": "Yoblix", "body": "If someone setup a way to donate money and could prove the money would go directly to this lovely lady I’d  throw in.\n\nGood on her."}, {"id": "f9kjtm0", "author": "wmorris33026", "body": "Well done!"}, {"id": "f9k796l", "author": "booboo819", "body": "This needs to go viral! I bet she treats every single student with love , respect and kindness. There should be more recognition for support staff like her- they make a school too!"}, {"id": "f9kmufv", "author": "FormerChocoAddict", "body": "The women in the front left looks incredibly life-like!"}, {"id": "f9kjwdg", "author": "tendeuchen", "body": "I wonder how many other people are wasting their amazing talents because the current structure of society forces people into taking jobs just for security.\n\nShe deserves to be doing this for a living and not slaving away in a hot kitchen in an essentially thankless and forgotten about job.\n\nIf anyone out there owns an art/decoration business, hire her!"}, {"id": "f9l6rlo", "author": "SirSodomizer", "body": "This comment will be probably be buried. I was a pretty troubled child back in the day. I remember every teacher and every lunch lady that showed me kindness and paitence. I'll never forget the positive influence they had on me."}, {"id": "f9kewmc", "author": "planxyz", "body": "Now that's a lunch lady land I wouldn't mind visiting. Amazing!! Very talented and I'm sure the kids love it."}, {"id": "f9klusl", "author": "StrangledByTheAux", "body": "No student can escape the magic of Lunchlady Land"}, {"id": "f9kskrm", "author": "FranticInDisguise", "body": "A woodland critter Christmas anyone?.."}, {"id": "f9kda72", "author": "DarkZero3", "body": "Wow! That’s awesome she’s talented and a great staff member to the school."}, {"id": "f9kl6kz", "author": "SeabrookMiglla", "body": "Wow. Very nice.\n\nI remember some of those lunch ladies at my school."}, {"id": "f9klv8d", "author": "daversa", "body": "People this nice make me feel like an asshole."}, {"id": "f9kn2lz", "author": "oi_Triplet", "body": "Please do something for her in Christmas, she deserves it."}, {"id": "f9kpu2h", "author": "ABeardedPartridge", "body": "Wow! Did she actually draw and paint all of the characters? If so I think she may be in the wrong profession. That's legit great work!"}, {"id": "f9kpucq", "author": "thebadpaladin", "body": "Of course she did. What aren’t lunch ladies capable of, god bless them."}, {"id": "f9ku2ji", "author": "MIRAGE44555", "body": "I believe they just found the new art teacher."}, {"id": "f9kwepe", "author": "theLoveGiant", "body": "Underpaid. I don't even need to know how much she gets paid to know it's not enough."}, {"id": "f9kxksj", "author": "TheDogLover27", "body": "Aww everything is so cute"}, {"id": "f9kxmar", "author": "Lifesuckscumfuck", "body": "I would die for this lunch lady"}, {"id": "f9l03br", "author": "Stroopwafel_", "body": "It looks amazing! She needs to be doing something else than being a lunch lady! Say hi to her from Rotterdam, the Netherlands :)"}, {"id": "f9m3q9m", "author": "justsomeh0b0", "body": "She should be offered to start painting classrooms from their drab normal interior especially for the youngest kids around the district or city she is in!"}, {"id": "f9kay7r", "author": "jer_iatric", "body": "This is lovely. You should show her the virtual love she is getting here on Reddit. I’m sure that would be the icing on the good vibes cake she enjoys in the cafeteria as well!"}, {"id": "f9kiimc", "author": "zersh", "body": "plot twist:\n\nshe's an art major, couldn't find a job and became the lunch lady"}, {"id": "f9khlpz", "author": "_MIH4I_", "body": "r/wholesome"}, {"id": "f9kcdnn", "author": "ArconV", "body": "She's incredibly skilled! Why is she a lunch lady?!"}, {"id": "f9kbpcx", "author": "JungleLiquor", "body": "Hope nobody will fuck this up this year"}, {"id": "f9kl8f1", "author": "unbalancedforce", "body": "I don't know this woman, I don't know this school. But when someone cares this much. I am willing to bet, the food she cooks is good, healthy, real. I also bet, there are no children in this school going hungry because they can't afford it. THIS is how it should be, and can be because of people like her."}, {"id": "f9kbj0x", "author": "Justin1387", "body": "Not all heroes wear capes... as we see here, this one rocks an apron!"}, {"id": "f9kj1yd", "author": "Dnvnlp", "body": "She sounds like an incredible human being. Amazing decorations and kudos to her!"}, {"id": "f9kk65l", "author": "Competitive_Rub", "body": "How is she not teaching art?"}, {"id": "f9kllm0", "author": "DawnMarina", "body": "She’s such a talented artist!"}, {"id": "f9klqfj", "author": "Loch_nar", "body": "Your lunch lady should be the art teacher."}, {"id": "f9klqid", "author": "NancyReaganTesticles", "body": "Lunch lady land. Sloppy joes sloppy joes."}, {"id": "f9km95z", "author": "MeyoMix", "body": "She deserves a raise"}, {"id": "f9knwck", "author": "32eugop", "body": "Clearly overqualified to be a school lunch lady. This is a grievous error of talent management by your school's HR Department."}, {"id": "f9kqd90", "author": "The_Razza7", "body": "That looks fantastic! What a great lady!"}, {"id": "f9kskhr", "author": "Soundcloudlover", "body": "It’s a woodland critter Christmas miracle!!"}, {"id": "f9kso97", "author": "ThatGirlOverThere9", "body": "its the christmas critters"}, {"id": "f9kt9az", "author": "HeyGoodCookin", "body": "Well I feel like a complete failure of a lunch lady right now."}, {"id": "f9kwzdk", "author": "crockfs", "body": "I SEE SEVERAL OF THE WOODLAND CRITTERS!!! SAVAGE"}, {"id": "f9kyz8o", "author": "wilfredthefeces55", "body": "love the  *Woodland Critter Christmas*  theme"}, {"id": "f9l0hgi", "author": "Christatik", "body": "I hope you showed this post to her op"}, {"id": "f9ljcx9", "author": "tubcat", "body": "Lunchlady is one of those jobs where I find they deserve all the high fives they can get. You're in a building packed full of folks, but you're in at weird hours and you really don't get to socialize with anyone in passing or breaks except during some very specific times. It's kinda thankless in general and you only hear when it goes wrong. And all the while, when you do get to interact with folks, you're in a customer service role and you've got to be kind and sweet to all or come across as a frigid ass. Oh and it's not the greatest paying job ever. \n\nSo yeah high five to this gal. She deserves to be paid in more than smiles on kid's faces even though they're probably worth more than the kids' weight in gold to her."}, {"id": "f9lz1wb", "author": "Tinknocker12", "body": "That’s the highest upvote count I’ve ever seen."}, {"id": "f9m1bkg", "author": "starrpamph", "body": "Fun fact: I have never seen a post with this many upvotes before"}, {"id": "f9m29o8", "author": "TheBigThot69420", "body": "Goddammit someone get this woman a raise"}, {"id": "f9kcgi5", "author": "creepyrob", "body": "Wouldn’t it be crazy if she’d used telekinesis."}, {"id": "f9ktzzo", "author": "Slobrodan_Mibrosevic", "body": "Not going to lie, I am crying right now. \n\nIn middle school, my lunch lady was one of my biggest mentors and closest friends. I was very quiet and shy; a sensitive boy. I knew I could talk with her about anything, and she had a daughter a few years younger than me but in the same school. We were a small private school, only 60 kids 6th through 8th grade. She was always kind and would ask me how my day was going. I volunteered for my service time in the kitchen helping her and she taught me how to cook--I am actually quite a good cook now and I loved learning with her.  She loved the kids in our school and we were all \"her bonus kids\", and she would have done anything for us. \n\nShe died suddenly, a little over ten years ago now. I cried harder at her funeral than I did for a few relatives. She was like my second mother. \n\nThis is a very special woman. I hope that she is happy and comfortable and that she has positive interactions with students every day. I would be willing to bet that there are kids several years out of school who remember her and how much she cared. I know I remember mine."}, {"id": "f9kj3eq", "author": "WhiteHotGhost", "body": "She should go be an artist.   She is wasting her God given talents 95% of the year."}, {"id": "f9kncjf", "author": "kbarney345", "body": "While we hate on the boomers there are alot of our elders we should cherish and learn from."}, {"id": "f9k8etl", "author": "LilGaryLaserEyes", "body": "Wow. That's awesome. Job well done!"}, {"id": "f9kaurk", "author": "Betsir", "body": "This makes me feel better about humans."}, {"id": "f9kbc8y", "author": "swartmann", "body": "When you love your work it becomes your hobby. That school is lucky to have her."}, {"id": "f9kklcq", "author": "Cjcp3", "body": "This women deserves all the good this world has to offer and it makes my heart so damn warm and big knowing she exist."}, {"id": "f9keuw2", "author": "sjaakarie", "body": "My mother did this too 30yr ago at my school, so nice to see more people do this too! Very cool!"}, {"id": "f9ki42j", "author": "campfirehorrorstory", "body": "They should have her do a display for every holiday/event she feels like. It's something cute to admire and take selfies in front of."}, {"id": "f9kk4am", "author": "Melmoney1", "body": "Give that woman a raise!!!"}, {"id": "f9klqh5", "author": "vjwidks", "body": "wrg, doesnt matter, schoolx not schooled nmw"}, {"id": "f9klrsi", "author": "RayCarlsJr", "body": "That’s the ideal lunch lady"}, {"id": "f9kltva", "author": "Doritoman25", "body": "I think she choose the wrong career"}, {"id": "f9km9t1", "author": "Ant1mat3r", "body": "Incredible. \n\nShe really cares. \n\nWe need more people like her in our schools."}, {"id": "f9kmfim", "author": "Ryunysus", "body": "Wholesome lunch lady. I really appreciate the Grinch representation. ❤️ ❤️\n\n&#x200B;\n\n \n\n# \n\n#"}, {"id": "f9koycx", "author": "LightUpLucas", "body": "This is truly remarkable for one sweet quiet lady to create for the joy of the students."}, {"id": "f9ks0xx", "author": "PetrcicSchilling", "body": "Well she deserves some presents i guess?"}, {"id": "f9kt5t5", "author": "imjustakiid", "body": "Wholesome"}, {"id": "f9kt65i", "author": "Stevens_Son", "body": "She looks so happy! What a wonderful job"}, {"id": "f9ktklo", "author": "Phoenixwade", "body": "Pretty sure some of those are the Forest critters from the Southpark Christmas episode."}, {"id": "f9ktrj6", "author": "RogueSpecTRe5", "body": "would be more impressive if she did it by foot. tear it down and start over"}, {"id": "f9kxkk7", "author": "GuyWithThermalShirts", "body": "👍👍👍👍"}, {"id": "f9kz4r7", "author": "DwasTV", "body": "Amazing work, time for some little shit to come by it and fuck it all up because he think it's cool."}, {"id": "f9l0pn0", "author": "ordy666", "body": "It looks great! Tell her i would give her 2 upvotes if i could"}, {"id": "f9l0sce", "author": "hellokittyface90", "body": "Aw, how sweet! That's talent there. She did a great job! 😊"}, {"id": "f9l0x39", "author": "Malefectra", "body": "Your lunch lady is amazing! People like her make school a much better experience for kids!"}, {"id": "f9l0xg4", "author": "skaiswaycool", "body": "The art teacher better not slack off the rest of this year... I think she's gunning for their job!"}, {"id": "f9l0xne", "author": "Skot_Skot", "body": "What a lovely gesture! She must be an amazing person."}, {"id": "f9l0yhi", "author": "BelowtheValleys", "body": "Give her some love from Reddit. She deserves every bit of it."}, {"id": "f9l106m", "author": "Lost_ina_fantasy", "body": "My heart grew three times more after seeing this post. She is beautiful and you can see it through her. More like this in the world please!"}, {"id": "f9l3gn6", "author": "jamster4699", "body": "That’s so sweet, that’s making my eyes leak!"}, {"id": "f9l3k1n", "author": "Minutewave13849", "body": "Please give her money"}, {"id": "f9l5xcp", "author": "exshortguy", "body": "I work in schools in lower income areas a lot and lunch ladies (and most people who work in schools in general) are  the heart and soul of this country. They love those kids and give them hot meals when they might get any other food at all. Props this this amazing person and to all lunch ladies out there."}, {"id": "f9l6k0e", "author": "pwilsonuga", "body": "They kinda look like the Christmas critters from south park"}, {"id": "f9l7rbw", "author": "ArticulateRhinoceros", "body": "She should be promoted to art teacher."}, {"id": "f9l7tg0", "author": "ka8778", "body": "That’s amazing!!! Tell her the interwebs loves it."}, {"id": "f9l7wvp", "author": "ChooDawn", "body": "Buddy the elf would be proud"}, {"id": "f9l8537", "author": "Taucher1979", "body": "Why is this lady a lunch lady?! She’s in the wrong job..."}, {"id": "f9l87yd", "author": "FallPhel", "body": "I hope she gets all the smiles and hugs. How sweet of her."}, {"id": "f9l9m9r", "author": "sohel666", "body": "OP please make sure you show your post to her and all the lovely comments the people have said. She's a complete sweetheart."}, {"id": "f9la0s6", "author": "moving0target", "body": "My store sells a framed quote of the \"Christmas doesn't come from a store.\""}, {"id": "f9ldh8d", "author": "illkeepyouposted", "body": "I hope she sees this post."}, {"id": "f9lepb3", "author": "dizzylyingdown", "body": "My favorite part is the trees! Look at that freaking amazing detail!"}, {"id": "f9li1ph", "author": "ThePrideOfKrakow", "body": "\n\n\nWhat's her name? Hopefully she deserves a little more credit than 'our lunch lady'. That said lovely display."}, {"id": "f9lifo0", "author": "gamercodent", "body": "Absolutely incredible! The design and her smile. :)"}, {"id": "f9lj71j", "author": "ArdiWants2Party", "body": "Not all heroes wear capes; some wear hairnets. We don’t deserve her."}, {"id": "f9ljvw0", "author": "CMUpewpewpew", "body": "sorry but all I could think of after I saw it was..  \n\n\nBLOOD ORGY!!!!!!"}, {"id": "f9lk0j0", "author": "atypicalvietguy", "body": "Too much skills to be a lunch lady, should be an art teacher."}, {"id": "f9ll47x", "author": "Philadahlphia", "body": "More money was spent gilding this post than was given to the lunch lady for making these displays."}, {"id": "f9lni9l", "author": "Tenshinoyona", "body": "Such a wholesome post and comment section. Very beautiful thing that lunch lady did for the school and the students!!! So talented and kind"}, {"id": "f9lnis4", "author": "JAK3CAL", "body": "Lunch ladies don’t get the respect they deserve. This ones for you bev, I still remember you"}, {"id": "f9lnmr1", "author": "kiddro651", "body": "Poor lady just spent 49% of her annual salary on art supplies"}, {"id": "f9lphcw", "author": "HansDeBaconOva", "body": "Talented doesn't even feel like a good enough word for this. She is an inspiration to what people should aspire to be!"}, {"id": "f9ly8t2", "author": "fearisthemindkillaa", "body": "I’m literally crying rn this is so sweet I LOVE HERRR 😭😭😭😭"}, {"id": "f9m02g1", "author": "KNoFace", "body": "This post has the most awards I’ve seen!"}, {"id": "f9m1wmu", "author": "GoldieTatar", "body": "She needs to be working at Disney Land as cartoon designer!"}, {"id": "f9m1wwi", "author": "FatWynn", "body": "She’s the best person ever, hands down."}, {"id": "f9m299u", "author": "HalfBakedPotato84", "body": "Tell her how amazing of a person she is for me please."}, {"id": "f9m2egu", "author": "ambrosesalley", "body": "This is absolutely beautiful! Way better than I’ve ever seen any of my art teachers even try to attempt. \n\nNow that I think about it... my art teachers never showed us any of their actual works when having us do assignments. Lol"}, {"id": "f9m7ysv", "author": "paintmybeet", "body": "Cherish her."}, {"id": "f9mcii3", "author": "jjayjam", "body": "This puts a smile on my face"}, {"id": "f9mcnbf", "author": "violethemlock", "body": "My hometown! ❤️"}, {"id": "f9mfbpn", "author": "PeaceLoveEmpathyy", "body": "Wow how clever and thoughtful ♥️🌻✌️"}, {"id": "f9mkjpj", "author": "handjivewilly", "body": "But which Kwilos posted it?  Saw this yesterday and didn’t even realize it was LS."}, {"id": "f9mzg27", "author": "intensive-porpoise", "body": "🎶Luuunch Lady Land🎶"}, {"id": "f9ohdgg", "author": "FrankieBlueEyes2", "body": "I would die for this woman, merry jesus birthday month you guys"}, {"id": "f9opygq", "author": "keyrfayd", "body": "LL Cool Linda is the best kind of people we have."}, {"id": "f9oqbep", "author": "timo606", "body": "Holy hell, it looks like this could be licensed merchandise it's so perfect looking!"}, {"id": "f9owppk", "author": "DJ605", "body": "Absolutely wonderful. What a fantastic human being."}, {"id": "f9oww4r", "author": "Jesssca", "body": "It’s pictures like this and smiles like that.. that make the world a happy place 😭😽"}, {"id": "f9oxmot", "author": "Lasci_Vious", "body": "This is the most old-school wholesome thing I've ever seen in my life."}, {"id": "f9p1ksq", "author": "spar3chang3", "body": "She should do one for every season! Those animals are adorable!"}, {"id": "fadup4e", "author": "Telescope_Horizon", "body": "Lunch ladies never get the credit they deserve. I remember when I forgot my lunch money and they'd let it slide, or help us out with math homework. Good people."}, {"id": "fahhg7y", "author": "TheLizzardMan", "body": "This is so freaking awesome!"}, {"id": "fakl9di", "author": "Icouldbeharrypotter4", "body": "She needs to take her talents to south beach"}, {"id": "f9klrnz", "author": "neckbeardProblems", "body": "What can I do to support this ❤"}, {"id": "f9ki7tl", "author": "_-Montag-_", "body": "That looks so BREATHTAKING!\nI love it!  ❤"}, {"id": "f9khq10", "author": "i_love_ffm", "body": "Well done, this is beautiful – thanks for this great work."}, {"id": "f9kljue", "author": "esqadinfinitum", "body": "I love seeing stories about school employees who genuinely care and work really hard to do nice things for the kids.  Where were they when I was in school?"}, {"id": "f9km6pp", "author": "h0bb1tm1ndtr1x", "body": "If that's her artwork then she should consider making kids books, or at least illustrating them."}, {"id": "f9kll0u", "author": "Capricore58", "body": "Annnnd it’s taken down because some triggered mom doesn’t celebrate Christmas"}, {"id": "f9k8l58", "author": "ThatGuy___YouKnow", "body": "She's good. And she makes a hell of a three bean salad."}, {"id": "f9kdvlt", "author": "wicktus", "body": "This is wonderful, thank goodness there are still people like her. Bless her."}, {"id": "f9ke6q3", "author": "sasayne", "body": "It's so sweet to see people going out of their way to do something so nice"}, {"id": "f9kfeco", "author": "motionviewer", "body": "Principal:  Agnes, Disney Lawyer on line 1.\n\nVice-principal:  Disney doesn't own Grinch.\n\nPrincipal:  Disney doesn't own Grinch yet."}, {"id": "f9kg3kn", "author": "CFL-74", "body": "Hidden talent!!  I wonder what her front yard looks like :) Bet it's super festive."}, {"id": "f9kgy55", "author": "favorscore", "body": "Why is this making me tear up"}, {"id": "f9kh02h", "author": "Bernie_Flanderstein", "body": "Crazy talented.  Great job!"}, {"id": "f9khh0e", "author": "twodayswrong", "body": "Beautiful!"}, {"id": "f9ki75r", "author": "JungleJay57", "body": "This is beautiful! I love The Grinch. I really hope the snot nose kids don't destroy this!"}, {"id": "f9ki7pp", "author": "VictorCrowne", "body": "I would say her talents are wasted as a lunch lady, but then again I’ve never eaten her sloppy joes so who knows maybe she’s better at cooking than art."}, {"id": "f9kinfo", "author": "darkwingduck487", "body": "Cherish her"}, {"id": "f9kj2od", "author": "proxy_senpai", "body": "yay! thank you for posting this. great way to start my day!"}, {"id": "f9kj5sz", "author": "pamdndr", "body": "Perfection"}, {"id": "f9kjy2m", "author": "Mutley1357", "body": "It's sooo wholesome up to the fact that you know a student is going to vandalize it when people aren't looking."}, {"id": "f9kk2mt", "author": "Clienterror", "body": "Can we trade?  I'm a 4th grade teacher and I'll trade you 4 of our lunchroom staff for her.  Totally fair trade I swear.  Our lunch ladies fall under two categories , either retired, smart, nice, hardworking, and caring or the lowest functioning people I've ever met in my life.  And they aren't mentally handicap or anything, they are just socially, mentally, no common sense, and in some cases hygiene deficient.  I literally have no idea how they survive in everyday life.\n\n&#x200B;\n\nTell her she's amazing every day, I do at my school."}, {"id": "f9kk46i", "author": "soyoucmenow", "body": "Amazing ❤️"}]}