{"id": "echrdd", "title": "This politican during the impeachment trial literally has cash coming out of his pocket like a cartoon.", "url": "https://i.redd.it/f9r2a4nc7g541.jpg", "subreddit": "pics", "author": "tugnasty", "text": "", "comments": [{"id": "fbbfl75", "author": "AutoModerator", "body": "It looks like this post is about Politics. Various methods of filtering out content relating to Politics can be found [here](https://www.reddit.com/r/pics/wiki/v2/resources/filter/politics).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/pics) if you have any questions or concerns.*"}, {"id": "fbbocra", "author": "Spartan2470", "body": "Is he in a habit of doing this?  He's also done this:\n\n* [February 5, 2019](http://www.apimages.com/metadata/Index/State-of-Union/efed24ff179b4dbe9d0a43945a4079be/16/0)\n\n* [February 6, 2019](https://twitter.com/USRepLong/statuses/1093337955924615168)\n\n* [April 6, 2019](https://www.gettyimages.com/detail/news-photo/rep-billy-long-displays-a-hat-with-the-slogan-make-trump-news-photo/1140891775)\n\n* [May 1, 2019](https://www.c-span.org/video/?460274-2/house-session) (skip to 2:30ish)\n\n* [May 9, 2019](https://www.gettyimages.com/detail/news-photo/trump-bills-stick-out-of-rep-billy-longs-pocket-as-he-news-photo/1142453717?adppopup=true) (while wearing the same tie) and [April 6, 2019](https://www.gettyimages.com/detail/news-photo/rep-billy-long-displays-a-hat-with-the-slogan-make-trump-news-photo/1140891775).\n\n* [June 4, 2019](https://www.c-span.org/video/?461381-1/hearing-satellite-tv-broadcasts) (skip to 1:55)\n\n* [June 7, 2019](http://bransontrilakesnews.com/news/local/article_3f681ed8-922a-11e9-b790-8b7d5078ca4b.html)\n\n* [September 17, 2019](https://www.c-span.org/video/?464291-3/house-session-part-2) (skip to 7:10)\n\n* [October 15, 2019](http://www.apimages.com/metadata/Index/Trump/5f68bc62770d4c6d8a71341edd034af6/1/0)"}, {"id": "fbbp2vt", "author": "Pho3nix322", "body": "This guy looks like if Gout was a person."}, {"id": "fbbfzsk", "author": "bobone77", "body": "I believe that is Billy Long from Missouri."}, {"id": "fbbgtca", "author": "jdawgcoolguy", "body": "This is the most photorealistic political cartoon I've ever seen!"}, {"id": "fbbw5ae", "author": "WendyArmbuster", "body": "That's Billy Long, from Missouri.  He's from Springfield, my hometown.  Those dollars in his pocket are almost certainly \"Trump Bucks\" which he *tips with*.  How do I know this? I have a relative who works at a restaurant that he eats at frequently, and he tips with Trump Bucks.  Billy Long, that Jabba the Hutt looking loser, tips with fake money."}, {"id": "fbbis43", "author": "Chester555", "body": "He looks like 350 pounds of used bubble gum."}, {"id": "fbbmqhr", "author": "i-hear-banjos", "body": "Baron Harkonnen!"}, {"id": "fbbhp6o", "author": "garlicgekko", "body": "That is Billy Long. And that could not be a more fitting picture to represent that Jabba The Hut looking pos!!!"}, {"id": "fbbl0jq", "author": "Fastestlastplace", "body": "He certainly holds his values near his heart."}, {"id": "fbbkgwc", "author": "PaperbackBuddha", "body": "Old Man Potter flaunting that $8,000 he gleaned from George Bailey."}, {"id": "fbbi7h2", "author": "notagoodboye", "body": "I didn't know Boss Hogg had gone into national politics..."}, {"id": "fbbj60a", "author": "theonetruekiing", "body": "that's what they use for pocket squares"}, {"id": "fbbqh04", "author": "Funkydart", "body": "Bring me Solo and the Wookiee"}, {"id": "fbblkgk", "author": "VoteDawkins2020", "body": "I'm gonna shamelessly plug my campaign for NC House here, because this one image is the reason I'm running.\n\nThis is a guy that who was already in the top 1% before elected, and now makes almost 200k per year from his salary, more than a whole hell of a lot of people who actually work for a living, so that he can protect a fake billionaire from a legitimate impeachment, and protect other real billionaires and corporate profits from proper government intervention, while a 20  or 100 dollar bill is just sticking out of his pocket. The obliviousness is astounding.\n\nI am poor and have been poor for most of my life, I volunteer, and the only thing I want to do is help the poor, working and middle classes to have better lives through things like a raised minimum wage and Medicare for All, and \"Munchies for Lunchies\", my bill to legalize marijuana and use the tax revenue to pay for every child's school lunch in NC.\n\nI guarantee he'd be against all of these.\n\nYou don't have to help me get elected, but at least stop electing guys like this.\n\nCheck out my campaign if you get a chance www.dawkins4nc.com\n\nEdit: I can't thank you enough to all those who gave silver, and those of you who have donated to the campaign. I'm truly humbled, and I'd like to add that I don't send out 10000 emails like other campaigns, so you'll likely never hear from me again except for a personal thank you that I send."}, {"id": "fbbhr91", "author": "maleorderbride", "body": "His tie is also off-center. This really looks like it could be a Far Side cartoon, especially with his build."}, {"id": "fbbhp1g", "author": "DrMux", "body": "His head looks like it has been melting since 1972."}, {"id": "fbbqrs4", "author": "hotlavatube", "body": "Reminds me of when [Boehner handed out tobacco lobby checks](https://www.youtube.com/watch?v=CARiB_eYwys) on the house floor. I wonder if someone is handing out wads of cash before the vote."}, {"id": "fbbmy97", "author": "Tragicanomaly", "body": "I can actually hear him breathing."}, {"id": "fbbqw23", "author": "Tweedie22", "body": "If you think the cash is concerning you should be watching him sweat those pounds off due to his obsessive blinking. He is blowing papers off the desk a head of him. I yield back."}, {"id": "fbbwttb", "author": "HelloweenCapital", "body": "I'll take a wild stab at his government affiliation. Rebublicunt?"}, {"id": "fbc3tnr", "author": "6-pence", "body": "This photo being taken today, along with the photo of the stack of legislation that has yet to be touched by the Senate, is the most apt and somber visualization of how our government is no longer serving it's people."}, {"id": "fbbnaif", "author": "DrLongIsland", "body": "I don't know in which party he is, but this gentleman looks very  exquisitely republican."}, {"id": "fbbjvrp", "author": "AmumuHug", "body": "I wonder who slipped that into his pocket."}, {"id": "fbbqbt3", "author": "Ravo93", "body": "Dude's got chins on the sides of his head as well as underneath."}, {"id": "fbblfwj", "author": "Stupid_Bearded_Idiot", "body": "That's Billy Long, aka the auctioneer rep. Dude's crazy as shit, so much so that even the Koch's are like \"Wtf no\". But, big big shocker here...He's a republican. Who woulda thought?! He's known as a fat fuck who doesn't tip and smacks waitresses asses."}, {"id": "fbbk1p4", "author": "namtaBehT", "body": "Oh yes, Daredevil's arch nemesis... BURGER KINGPIN!"}, {"id": "fbbotpf", "author": "Modernmunitions", "body": "I fucking hate Billy Long. He’s the rep for Southwest Missouri (Springfield area) and almost everyone here hates his guts. Fat ugly asshole who was bought and paid for. You are god damn right he will vote no, if he can keep a large amount of food out of his mouth long enough to speak."}, {"id": "fbbhtvv", "author": "abcdefghig1", "body": "Pay to play."}, {"id": "fbbnzae", "author": "inmyelement", "body": "Hey!!!!! That’s my tax money right there! I was wondering what happened to it!!"}, {"id": "fbbr2pu", "author": "abraxas1", "body": "At least it's not Rubles?\n\nwonder what exchange rate he got on that."}, {"id": "fbc2jcu", "author": "cianne_marie", "body": "I'm gonna go out on a limb here and guess that these dudes are on the Republican side of the room. Forgive me if I'm wrong, I'm but a lowly Canadian, but ... well, it's very old, and white, and wealthy."}, {"id": "fbbojxl", "author": "SudoDarkKnight", "body": "I'd claim this is photoshop but I'm watching live and can see it myself..."}, {"id": "fbbqm6j", "author": "trixodile", "body": "[Mr Waternoose](https://vignette.wikia.nocookie.net/kingdom-hearts-unlimited/images/a/a3/Mr._Waternoose.jpg/revision/latest/scale-to-width-down/340?cb=20141220015011) lookin boy"}, {"id": "fbbwf1b", "author": "AAC0813", "body": "Yoobah koh ra doh ka mallo wampa mah yass ka chung kawah Wookiee."}, {"id": "fbbjwzq", "author": "Bouffaloof", "body": "I feel like this is the political equivalent of getting a huge truck to show off but actually having an incredibly small penis."}, {"id": "fbbl8ku", "author": "Tillamook11", "body": " **impeachment trial**  \n\n&#x200B;\n\nThere is no trial yet.  The house makes an accusation and the senate holds the trial."}]}