{"id": "elxa0j", "title": "22-year-old Iranian here. Just wanted to share my love with my friends all over the world (Americans, Iraqis, Australians, etc.) as it is what the world needs the most in these hard times. #LoveBeyondFlags", "url": "https://i.redd.it/8tfwc6xpnl941.jpg", "subreddit": "pics", "author": "TheDaydreamerBoy", "text": "", "comments": [{"id": "fdl3rbf", "author": "alifeiliMD", "body": "I am an Iranian who was born in Iran and moved to U.S. roughly 20 years ago when I was 15 years old. Over the years, I have gone back to Iran a few times, as recently as a year ago.\n\nI have the same love for both Iran and the United States and I can attest that Iranian people truly love the American people and want nothing but peace and friendship with the Americans. Those who chant \"death to America\" are part of the Iranian government and account for a very small number of the population. Unfortunately the Iranian news outlets, which are run by the Iranian government only broadcasts these hateful idiots to try to influence the rest of the population, which has not worked well for them over the years. At the same time the U.S. media outlets also only shows those same hateful idiots for their own propagandas and to spread fear so they can manipulate people's emotions to get better ratings, because they have learned that nothing sells better than fear.\nPlease do not fall for these manipulative tactics by both sides and KNOW that you are truly loved by the Iranian people.\n\nEdit: Thank you all for your lovely and warm responses. I have read them all, and I am very proud and happy to know that there are still MANY good hearted people out there who have genuine empathy for others.\n\nI love you all and wish you all nothing but happiness for many years to come. \n\nLet's be better for one another and build a better and more peaceful society for our future generations.\n\nPlease get out and vote when the time comes. Your voice has a value and it's very important that its heard.\n\nEdit: Thank you for the gold."}, {"id": "fdkvqg4", "author": "sunabove", "body": "Humans, we share more bond than our governments will let you know. We're all connected, bonded. Much love from the US"}, {"id": "fdkton1", "author": "reddituser9871", "body": "Peace"}, {"id": "fdl12a3", "author": "grimmlibya", "body": "Please pray for Libya too \nWe are struggling"}, {"id": "fdkye5l", "author": "Ditnoka", "body": "Only when the power of love overcomes the love of power will the world be at peace. \n\n\n\n\n\n\n\n-Jimi Hendrix-\n\n\n\n\n\n\n\nBe safe friend."}, {"id": "fdkzsw5", "author": "_GroundControl_", "body": "Love to you, from me, in the USA!"}, {"id": "fdku8dr", "author": "cgally", "body": "We can be friends even though our governments can be rather douchey towards each other."}, {"id": "fdkzpwj", "author": "TheAssyrianAtheist", "body": "Love from Assyrians!!!\n\nWe live in Iran also!"}, {"id": "fdkx0lv", "author": "frenchmix", "body": "Love from USA right back."}, {"id": "fdl1frh", "author": "sofonisba", "body": "50 year old woman sending hugs to all from Maine, USA."}, {"id": "fdkyhrs", "author": "Aines", "body": "Love guys, we're all one on this tiny blue bubble."}, {"id": "fdktvnd", "author": "canuckcowgirl", "body": "Hello from Canada....pass the love around people."}, {"id": "fdkysd1", "author": "Lissftw", "body": "Cheers! Love you too, bro from the USA"}, {"id": "fdkvvbf", "author": "highcarlos", "body": "22-year-old American sending that love right back. Peace"}, {"id": "fdkyx3v", "author": "nirnova04", "body": "Peace from Kansas, in the USA!"}, {"id": "fdl1dp2", "author": "StiggyDaddy", "body": "Love to all in the world, from Ohio"}, {"id": "fdkywnp", "author": "WalkWeedMe", "body": "Peace from Israel"}, {"id": "fdl445o", "author": "Training_Error", "body": " Peace from Israel"}, {"id": "fdkvfko", "author": "ButtMcNugget33", "body": "Cheers from Oregon, USA.\n\nOnly love for all the people in Iran. It's the governments that deserve our anger."}, {"id": "fdkyhjl", "author": "Gingerman424", "body": "Florida Man here - be strong and know that the actions of a government do not speak for the people. \n\nMuch love and respect."}, {"id": "fdkx6c4", "author": "NeilDeCrash", "body": "Peace and love"}, {"id": "fdky4ik", "author": "lhommefee", "body": "Love from New England fellow human! We may write dates differently but our goals are the same."}, {"id": "fdkudz0", "author": "Matt3018", "body": "Love from the UK my friend. Hope you and your family stay safe, happy and healthy."}, {"id": "fdkydp8", "author": "Ntetris", "body": "Together. Forever. Love from South Africa"}, {"id": "fdkymfh", "author": "baddada1", "body": "Peace be with you, friend."}, {"id": "fdl0p58", "author": "DarkSummit90", "body": "I love you"}, {"id": "fdl258t", "author": "unit001", "body": "34 year old in Ohio. I love you and wish you peace."}, {"id": "fdl3162", "author": "puppytimepower", "body": "Love from Texas. None of this makes sense."}, {"id": "fdkx24d", "author": "hnglmkrnglbrry", "body": "The problem is between our governments, not our people. Wishing you nothing but health and prosperity."}, {"id": "fdl59ge", "author": "TheDaydreamerBoy", "body": "OMG!! You guys... melted my heart. You people are amazing. Thank you so much for all the love and awards."}, {"id": "fdkypp3", "author": "thekraken27", "body": "I’m American. I have absolutely no problems with Iranians, or middle easterners in general. Your leadership sucks, but so does ours. Your military does some questionable shit, so does ours. We’re the same, it’s the people in power who aren’t. Peace be with you friend, can we all agree that we don’t want to fight wars anymore?"}, {"id": "fdl0yjp", "author": "LousyTourist", "body": "so true, the folks I've met in the Middle East have been the kindest, most generous people I've met in my life. When you visit there, you discover what they mean by hospitality. A guest is KING in their house. You get the best chair, the first choice at dinner, everything!\n\nWe all know how there is a disconnect between regular people and their government....."}, {"id": "fdl5jbe", "author": "cerebralspinaldruid", "body": "Never confuse a government for its people. Salam."}, {"id": "fdky38s", "author": "ripplemon", "body": "Love from Iowa"}, {"id": "fdkyr99", "author": "AlysonWonderland7", "body": "Much love from Georgia, USA!"}, {"id": "fdl30ti", "author": "PTMegaman", "body": "Love from Los Angeles. My fiancee and I saw GooGoosh live here a year or so ago and were the only white folks in the audience. A lot of friendly Iranian folks around us were really curious how we had heard of her and even translated some of what she was saying to the audience for us unprompted(though appreciated!). Huge Iranian population in Southern California. Love you u/theDaydreamerboy"}, {"id": "fdkz3x8", "author": "moonlove_", "body": "love from Colorado!"}, {"id": "fdkyhvh", "author": "way_past_ridiculous", "body": "It's cool, man.  Most people understand it's just hard-liners trying to incite other hard-liners into a war.  For the rest of us, we're able to get along."}, {"id": "fdkyqfq", "author": "jashuo", "body": "Peace buddy"}, {"id": "fdktu6t", "author": "Globalist_Nationlist", "body": "Be safe bro!"}, {"id": "fdkw2tr", "author": "AMv8-1day", "body": "It's extremely important, now more than ever, to separate the deplorable actions of a select few, from associations with an entire country/region/religion/race.\n\nFuckHate"}, {"id": "fdkz6pw", "author": "_notthatotherguy_", "body": "Live long and prosper my friend."}, {"id": "fdl3q6s", "author": "uhp787", "body": "Love from Washington State <3\n\nthis made my heart smile so wide."}, {"id": "fdkys9w", "author": "bpkratz", "body": "Love from the USA. Stay safe out there!"}, {"id": "fdlc3lb", "author": "imalittlefrenchpress", "body": "I’m a 58 year old white woman living in Tennessee, and you are welcome in my home any time!  Come on over and I’ll cook you some Puerto Rican food! I’m not Puerto Rican, but I’ve had awesome Puerto Rican friends who’ve taught me how to make some delicious dishes. \n\nWe all have so much to learn from each other, and I truly believe that love and goodness can change the world. \n\nThank you for being the change we all need 💕"}, {"id": "fdl31id", "author": "Cafetario", "body": "Now that’s a message this 22 year old Yank resonates with, your call is happily answered"}, {"id": "fdkysag", "author": "westernmeadowlark", "body": "(hugs) thank you for posting this. We have more in common with each other than not. I may be an atheist but I'm still praying for peace"}, {"id": "fdkz4fp", "author": "noah190000000", "body": "Bro, love from europe bro"}, {"id": "fdl1air", "author": "zepolm5", "body": "Everyone in America: “how did you send that from August 1st”"}, {"id": "fdl1ht6", "author": "Planetable", "body": "During this entire ordeal I kept wishing there was some reliable way I could reach out to iranians and tell them that I / other americans really don't blame them for any of this and are really sorry for all of this shit."}, {"id": "fdl5jsh", "author": "SirPiffingsthwaite", "body": "Peace from Australia, I hope neither of your countries burn like Australia is, and none of either has to die fighting a stupid war started by a man-baby in an attempt to distract the american people."}, {"id": "fdl32e1", "author": "pescabrarian", "body": "Peace. This is beautiful."}, {"id": "fdky4i5", "author": "Rod_Skyhook", "body": "Love you too man- an American"}, {"id": "fdkxvp1", "author": "fiveupfront", "body": "There’s so much serious stuff going on in the world already, we really do not need nations chucking rocks at each other unless they really have to.\n\nI hope this can be sorted with a minimum loss of life, and few people having to live in fear."}, {"id": "fdl1khx", "author": "svene", "body": "love you too bro, thank you."}, {"id": "fdl2rr0", "author": "Stanzeil", "body": "One thing I hate the most people assuming the entire country is bad without realizing that they're great people.\nPeace to you my friendo"}, {"id": "fdkx1nm", "author": "texassadist", "body": "Texas checking in! We love you all! We're not all race hating fools like portrayed."}, {"id": "fdl1f2m", "author": "purpleWheelChair", "body": "Peace brother."}, {"id": "fdl3o5p", "author": "mallix1", "body": "Sending love from Cape Town, South Africa, we're all going through some shit too down here"}, {"id": "fdkx67i", "author": "zachwilson23", "body": "^^  The Iran the media doesn't want you to see"}, {"id": "fdky42f", "author": "minimagess", "body": "Heal the world..."}, {"id": "fdkyc0f", "author": "Sheldonleemyers", "body": "HugsX"}, {"id": "fdl1f43", "author": "klutze1", "body": "Thanks and right back at ya!"}, {"id": "fdl3o64", "author": "binarymichael", "body": "We need more like you.  \n\n\nLove from Canada."}, {"id": "fdl4jzw", "author": "tes_chaussettes", "body": "Love to you from me in America! I don't want us to fight :) <3"}, {"id": "fdkxpxq", "author": "morthos97", "body": "I love you too"}, {"id": "fdkz385", "author": "EddyFicio", "body": "Sending love from México to Iran, hope things get better!"}, {"id": "fdl30nt", "author": "TheKlucelG", "body": "There’s more that unites us than that divides us..."}, {"id": "fdl31ld", "author": "yeahokayalrightbud", "body": "Reciprocal love from Southern Illinois in the US my guy"}, {"id": "fdl31z4", "author": "marygogreen", "body": "Sending you love and peace from Atlanta"}, {"id": "fdktxm4", "author": "habitual_calculus", "body": "Love and peace for all of us"}, {"id": "fdkztrc", "author": "ride365", "body": "German/Irish/American here and I appreciate this post.    \nWishing us all a great 2020!"}, {"id": "fdkx6dr", "author": "coffmaestro", "body": "With love from Sweden!"}, {"id": "fdkx8ux", "author": "Westey", "body": "I love your handwriting!"}, {"id": "fdl4j95", "author": "Civics4me", "body": "Virginian here- Many suffer for the ego/stupidity of a few. I wish peace for you and all Iranians."}, {"id": "fdkxlfk", "author": "ChocDroppa", "body": "Peace and love from Australia friend."}, {"id": "fdkwg35", "author": "SpicyMcHaggis14", "body": "OH MY GOD HES FROM THE FUTURE"}, {"id": "fdkwxat", "author": "ThatGuy___YouKnow", "body": "Love to everyone, everywhere."}, {"id": "fdkwxwx", "author": "thisyearspossum", "body": "Love and peace from NJ, USA."}, {"id": "fdkxi7l", "author": "deepdowninaz", "body": "From Phoenix, AZ\n\nThank you OP!\n\nPeace to You and to All <3"}, {"id": "fdkybz2", "author": "sirphallicthe-lesser", "body": "Right back at you dude , it is what we all need ."}, {"id": "fdkykzz", "author": "FrogPosse", "body": "Mucho love from West Palm Beach, FL!"}, {"id": "fdl1d3h", "author": "Napalm_for_Narnia", "body": "Sending you love back from America!!  Sorry we let this warmongering pigdog wind up in charge - we’ve got no beef with you guys!"}, {"id": "fdkxhh3", "author": "pigglywigglyhandjob", "body": "Sending love back from New Mexico, USA!"}, {"id": "fdl31eh", "author": "Guguskis", "body": "Thank you, I really needed this <3"}, {"id": "fdkxdod", "author": "cheekycamo", "body": "Peace and love from Florida USA!"}, {"id": "fdkxfpr", "author": "MissusWan08", "body": "Peace and love from Arizona!"}, {"id": "fdl1sni", "author": "glowrocks", "body": "Peace from central Kansas.  \n\n\nOur shared humanity will (eventually) overcome our leaders."}, {"id": "fdku6a8", "author": "Jennelope", "body": "Peace to you and yours!"}, {"id": "fdkxv9k", "author": "gabeuscorpus", "body": "Peace to you too, with love from Florida. People, not nations, are what makes this world great."}, {"id": "fdl07mr", "author": "ephix", "body": "Peace man, some of us has seen how beautiful your country has been in the past. Hopefully it can go back to that in the future. Same goes for the USA."}, {"id": "fdl31yj", "author": "michelleglen", "body": "❤️"}, {"id": "fdl3n5y", "author": "sonofwhore", "body": "🖤 From America"}, {"id": "fdl3o6g", "author": "hendawg86", "body": "American here to tell you there are tons of ya who don’t want a war in your country or the Middle East at all in fact. Peace and love to you as well."}, {"id": "fdl4hae", "author": "Vaiden_Kelsier", "body": "Peace my dude. American here, I have nothing against Iranians or really anyone. We live in dark times, but that's why it's on us to help each other find the light.\n\nKeep on keeping on."}, {"id": "fdkxs5t", "author": "ASUStekNYC", "body": "Cheers from NYC, stay safe buddy!"}, {"id": "fdkxz1o", "author": "jonatkinsps", "body": "Cheers from Colorado"}, {"id": "fdl0mbk", "author": "Jussttjustin", "body": "Social media gets a bad rap but one of the most beautiful things is that it allows us to see past propaganda and blind nationalism, into the humanity on the other side of the aisle.\n\nI truly believed as a 12 year old in 2001 when the Towers went down, that the entire Arab world was dancing and rejoicing in the streets. That's what the media made it feel like. \n\nBut the truth is we're all just people trying to live our lives and do our best, and I think that the vast majority would prefer love and peace to hate, violence, and war.\n\nI won't be fooled again! Peace and love to you, sir, and all of Iran."}, {"id": "fdkxkqj", "author": "mydogdawson", "body": "40 year old American with love from Iowa."}, {"id": "fdkwuf8", "author": "Freeloader03", "body": "Peace from Canada!"}, {"id": "fdkxjwv", "author": "snydamaan", "body": "Love you too ❤️\n-California"}, {"id": "fdkxrok", "author": "pinniped1", "body": "Amen, fellow human.  Love from Kansas..."}, {"id": "fdkxt9k", "author": "CJnella91", "body": "Love, From a Small town in Nebraska!"}, {"id": "fdkybxu", "author": "EnaiSiaion", "body": "Stay safe, keep an eye on the news, stock up on cans and stay away from military assets."}, {"id": "fdl31l6", "author": "Looks_at_this_clown", "body": "I like this. Thus, I approve!"}, {"id": "fdl31sq", "author": "INDIANpassenger", "body": "Every human being has love for each other , but they are in the game of hide & seek . Where heart is hidden & seeking for something else, which is really heart breaking truth at the end ."}, {"id": "fdlx543", "author": "bhop11", "body": "So this post is currently 6 hours old with over 134k upvotes and over 6k comments. Everyone here despises the hate and violence, which is why we are all deeply encouraged by this message.\n\nThat's 134k people who want this message heard. How can this be expanded? How can we start the avalanche that results in the people of our countries expressing love for each other on a mass scale?\n\nI realize this is likely a pipedream - and I for one have no idea how to expand it - but with the impact viral messaging can have these days, I'm just picturing millions of Iranians and Americans seeing messages of hope and love from the other.... I feel like that could make a difference, even if it was a small difference."}, {"id": "fdkx9lz", "author": "Composition4", "body": "Respect."}, {"id": "fdkwrw9", "author": "PanickedPoodle", "body": "I often wonder if the internet would have made a difference with Vietnam or WWII. It's harder to kill people when you can see they just want to live their lives like you do.\n\nI hope this stupid week is the end of hostilities and you can go on living your life, dude. Let's get back to helping the koalas."}, {"id": "fdkxtpe", "author": "lord_ma1cifer", "body": "The only people who want this war are ghoulish old men and sociopaths who have no interest in peace only power"}, {"id": "fdl33h5", "author": "jabelsBrain", "body": "Cheers brother ❤"}, {"id": "fdl3qor", "author": "mrs_peeps", "body": "Love from Pittsburgh!!"}, {"id": "fdl7741", "author": "darlaka", "body": "Hey man, American here. Most of us don't want any conflict. Despite what our governments do. Much love from the Midwest."}, {"id": "fdl8ung", "author": "cactooz", "body": "Poland here. Peace and love to you. Stay safe."}, {"id": "fdl32d6", "author": "Muckdanutzzzz543", "body": "Thank you for posting this and we feel your love and send it back!  Most of us are heartbroken and pissed off at the behavior of our politicians. \n\nAmerica is in crisis... while some of America's people might be permanently lost there are many of us that are learning what really matters in this world and what most certainly doesn't. \n\nIt's hard to see or feel but the world is coming together and more each day see love as the answer."}, {"id": "fdl5jg5", "author": "3xTheSchwarm", "body": "American here. We are not as insane as our president. Love right back to you from America."}, {"id": "fdkx53p", "author": "long_black_backdrop", "body": "LOVE YOU TOO!"}, {"id": "fdkx5rc", "author": "happy_dance", "body": "Love from a New Yorker. Posts like yours give me hope <3"}, {"id": "fdkxlqf", "author": "spinfinity", "body": "Much love from the U.S., friend!"}, {"id": "fdkz0ik", "author": "rokstar00", "body": "Love u to too bruh from America"}, {"id": "fdl3qv5", "author": "YouDidNothingWrong", "body": "Love u"}, {"id": "fdl3rb2", "author": "Saltwater_Heart", "body": "American here. Thought you were from the future from a moment there lol"}, {"id": "fdl7uem", "author": "Aequitas49", "body": "Love and Peace from Europe my friend.\n\nThe oldest trick of the powerful is to divide us humans into \"We\" and \"Them\". As if we would have any interest to go after each other. Every human wants the same: An as peacful and as happy life as possible."}, {"id": "fdlg8gc", "author": "reidteeth", "body": "Peace and love from Austin, TX!!"}, {"id": "fdllw6y", "author": "TheShadowOfYourSmile", "body": "I just want to fucking hug you so hard right now. \n\nSigned ~ an American"}, {"id": "fdmah47", "author": "pharaohmaones", "body": "Dear Iran,\n\nI’m heartbroken that the story about us has always been one of confrontation, abuse, and fear. \n\nI love you, though I’ve never met you, and I vow that I will never be fooled by the hate-mongers who try to tell us we are so different that we must dislike each other, let alone fight each other.  \n\nI will never fight you and, if we get the chance, I look forward to putting the horrors of the 20th century behind us and leading our respective parts of the world out of the violent place we have ended up and into the world we always deserved. \n\nWe see you, hear you, and won’t let these animals ever let us make us hate you or wish you ill."}, {"id": "fdkwus4", "author": "Jasink1987", "body": "Hell yeah. This is absolutely what we need. Sending my love back to you. We're all brothers and sisters. It's a new decade. Time for the people to find new ways to deal with all the nonsense going on in the world. Stay safe my friend."}, {"id": "fdkypoc", "author": "MixmasterJrod", "body": "Honestly, I've never really thought about what Iran looks like but I certainly didn't picture this. This pic could have been taken in NJ and I wouldn't know the difference."}, {"id": "fdkx0bu", "author": "FALL3NS4INT", "body": "Good guy"}, {"id": "fdkx3o0", "author": "uncommon_freak", "body": "The world needs more people like you."}, {"id": "fdkx7lh", "author": "IM_CALM_LIKE_A_BOMB", "body": "Love to you as well my brotha"}, {"id": "fdkwx3x", "author": "Br0steen", "body": "We need more posts like this, keep fighting the most important fight of all"}, {"id": "fdkx28t", "author": "edgedancing", "body": "Love you too! /hug"}, {"id": "fdkxa2l", "author": "prognostikat", "body": "Love and kindness from New Hampshire, US.\nWe need to abolish governments and just live our lives!"}, {"id": "fdkxn23", "author": "HamiltonBlack", "body": "Thanks... I needed that."}, {"id": "fdkxolw", "author": "zanemn", "body": "And love from the USA back at ya!"}, {"id": "fdl4k8b", "author": "feetofire", "body": "Fuck all governments and all old men and women who send young people to their deaths. No one can stop us from connecting and sharing common interest here in the internet’s - peace out and enjoy what looks like a gorgeous day!"}, {"id": "fdl4stp", "author": "stereooptic", "body": "Much love from NY, NY"}, {"id": "fdl4zq3", "author": "srappel", "body": "> The world is not divided between East and West. You are American, I am Iranian, we don’t know each other, but we talk and we understand each other perfectly. The difference between you and your government is much bigger than the difference between you and me. And the difference between me and my government is much bigger than the difference between me and you.\n\n>And our governments are very much the same.\n\n\\-  Marjane Satrapi"}, {"id": "fdl57da", "author": "Mik-Hail-tal", "body": "Africans, Americans, Europeans, Asians, ... it doesn’t matter, we’re all equally stupid."}, {"id": "fdl5np3", "author": "zenDice", "body": "From Washington State, USA, same to you brother!"}, {"id": "fdl8yel", "author": "D4NNY_GR33N3", "body": "Love you too homie from Cleveland Ohio USA. ✊✊🏻✊🏼✊🏽✊🏾✊🏿"}, {"id": "fdl8yqj", "author": "HardcoreQuartz", "body": "Lotsa love from Turkey!"}, {"id": "fdld3if", "author": "ragby", "body": "Al-salāmu ʿalaykum, friend!"}, {"id": "fdlfatt", "author": "Flukaku", "body": "Much love from Singapore!"}, {"id": "fdlg5en", "author": "nineth0usand", "body": "Hi from Russia mate. :)\nRemember: “countries are just lines drawn in the sand with a stick” (Rou Reynolds).\nLove knows no borders. And people around the world are pretty much the same. \nFuck those greedy bastards who want to divide us and make us fight each other for their benefit. \n\nWe all are one. There’s only one race - human.\n\nWe must unite and help each other, spreading love and compassion instead of hate.\n\nPeace✌🏻"}, {"id": "fdllbz8", "author": "earthshatterinkaboom", "body": "Peace be with you brother.\n\nFrom Australia."}, {"id": "fdllerr", "author": "euroindo", "body": "Love you back from Canada."}, {"id": "fdllqg2", "author": "pipeanp", "body": "Sending nothing but love your way, friend. Much love from America"}, {"id": "fdm0vhk", "author": "idfk_idfk", "body": "Another American checking in. Nothing but love and respect for my fellow men and women.\n\nHere's hoping this all passes without more bloodshed."}, {"id": "fdm1br1", "author": "f_lou_e", "body": "Love & support from France, to all countries. As many said, humanity needs to connect and share kindness and we have the most powerful tools for it : internet, social media, like right here. It's tools that our elders didn't have so we must use it to reunite instead of scatter and that's a wonderful example you just did 😊"}, {"id": "fdm1y59", "author": "dself911", "body": "People are people. Families are families. All over the world are many good people and then there are governments using every tool create hate and fear. Hate Democrat’s, republicans, Mexicans, Koreans, gays, blacks, etc. it’s time to put aside hate and come together against evil regimes controlling our world. Why is there one person making decisions for the whole world. With all of the technology that we have the people should have more power in this country. \n\nFight hate with love!"}, {"id": "fdm3c1i", "author": "MiniTelevision", "body": "Sending you love from Pakistan.\n\nPeace and love to fellow Indians; both our governments gaslight us into thinking the other is the bad guy, when we are all the same. The same language, the same food, the same culture, the same people.\n\nI've got as many Indian friends as Pakistani friends, and I can proudly say we are the same people (if you put politics and propaganda aside, which ironically is also the same)."}, {"id": "fdm5vm0", "author": "jofene", "body": "Right back at you from New Zealand. Love will win in the end."}, {"id": "fdm5xe3", "author": "philosoqueen17", "body": "We are all one! Love from Virginia, USA"}, {"id": "fdm62ro", "author": "Lukeb822", "body": "Love from Virginia."}, {"id": "fdm65rx", "author": "meyee", "body": "Redditors coming together. You love to see it."}, {"id": "fdmqwj4", "author": "newbris", "body": "G'day from Australia. Just watched that documentary linked on another thread. Spent a lovely afternoon with your friendly people and world treasures. Thanks for your kind words."}, {"id": "fdkyzvh", "author": "chefr89", "body": "> picture of paper"}, {"id": "fdkx7cv", "author": "gordiarama", "body": "Peace to you."}, {"id": "fdkz3yc", "author": "Therpj3", "body": "Much love back to you from the states, brother."}, {"id": "fdkxrl7", "author": "froggison", "body": "The few Iranians I've met have all been very kind.  That helps to remind me that Americans and Iranians don't actually have a problem with each other...  Just the governments of our countries have problems with each other."}, {"id": "fdkxmb3", "author": "Mikef1tz", "body": "Love being sent back from New York. I apologize for what my country has done to yours, I hope we can grow up soon"}, {"id": "fdkx7a3", "author": "moonlitshroom", "body": "Howdy from Texas! Pass the love around!"}, {"id": "fdkzsug", "author": "gs12", "body": "Right back at you! People aren’t the problem, Govt’s are. Peace!"}, {"id": "fdl31r1", "author": "Doobz87", "body": "Love you my dude. Stay safe. From 🇺🇸"}, {"id": "fdl320r", "author": "jjohnisme", "body": "He's also a time traveler.  That's some nice August weather, my man!"}, {"id": "fdl3opk", "author": "just2play714", "body": "Thank you for this! From the perspective of a politically conservative American this is the best message!! I wish more people around the world shared! We've all had enough loved ones and countrymen die for stupid, politically motivated nonsense.  Doesn't matter what country you're from.   Thank you for starting this! You've got the support of most of the world :)"}, {"id": "fdl3p8s", "author": "JuanFromTheBay", "body": "Love from Tampa Bay, Florida, USA!!!"}, {"id": "fdl50je", "author": "AndygirlXS", "body": "\\*cracks knuckles and sorts by controversial\\*"}, {"id": "fdlgapa", "author": "aus10w", "body": "22 year old american sending that love right back to you brother. the world definitely needs more of it. stay safe! #lovebeyondflags"}, {"id": "fdljrh0", "author": "owl_beback", "body": "Love and peace to the Iranian people from Australia xoxoxoxo"}, {"id": "fdlwff6", "author": "fronkness", "body": "This post is wildly popular so I doubt anyone will even see my comment, but coming from an American, I wish you love and peace. What is happening in government and media infuriated me because it’s all pointless. I hope you are well 👍🏻"}, {"id": "fdlzwih", "author": "BBattah", "body": "Born in Baghdad, Iraq. Moved to the US over 20 years ago. Sending love to everyone all around the world. Glad to see that everyone on this thread are not brainwashed into hating someone just because they’re from another country. Or just because the media and government told us to. Let’s keep spreading love and acceptance."}, {"id": "fdm4zjg", "author": "Maddie_P71", "body": "Sending love from Florida. Not all Americans are hateful warmongers. i love all people even if our governments hate each other."}, {"id": "fdm5gxj", "author": "Diocleatian", "body": "Love from the Navajo Reservation, USA."}, {"id": "fdmjrx9", "author": "Noamch05", "body": "Israeli here. I hope we'll have peace"}, {"id": "fdmps0i", "author": "Sniffinberries32", "body": "God damn this shit is important. What a message! I dig it.. I'm from the US and I dont want you guys to die or have your history destroyed. \n\nPeace friend"}, {"id": "fdmrb94", "author": "loganlovesyou", "body": "Ex U.S Navy guy here. Got out about 8 months ago.  I am just hoping we can somehow not escalate this craziness. I have been all over the middle east in my travels and have had nothing but great experiences no matter where I went. I hate to think of all the people that could be hurt from all of these political moves."}, {"id": "fdkwp2l", "author": "philipjeremypatrick", "body": "I love the love that's floating around this post. Thanks OP."}, {"id": "fdkxp8i", "author": "chalwar", "body": "As a 53-year-old North Carolinian, I thank you for sharing you optimism.  I would love to shake your hand..."}, {"id": "fdl338m", "author": "ap1msch", "body": "44-year-old American dad. Our government is currently stacked with a cadre of morons. Few average Americans harbor any ill will towards any country, and we're focused on working, paying bills, and raising our families.\n\nThe best thing that can happen is for the entire world to communicate and talk, freely, independent of \"official government channels\", so that we can all get a better perspective; one that is greater than what we see in front of us every day. Government leaders aren't Captains of ships. They are footballs (soccer balls) that go where they are most forcefully kicked by individuals with the biggest legs (most money). By increasing the number of \"players\" kicking these balls (and being more worldly/culturally aware), the more likely we'll progress closer to any goal."}, {"id": "fdkucvh", "author": "PeacekeeperZforce", "body": "Is that includes  Israel too ?"}, {"id": "fdkxxm3", "author": "Drjakeadelic", "body": "Sending love from the US.  Hoping for everyone's safety at all corners and for all peoples.  Nameste."}, {"id": "fdl1ptd", "author": "wanderingT1diabetic", "body": "Much love from the US. Our president is a dumb cunt."}, {"id": "fdl3gpw", "author": "Searing75", "body": "Love conquers all!"}, {"id": "fdl3j56", "author": "Isntitabouttime69", "body": "God bless your kindness. The world knows we need more of it."}, {"id": "fdl3spp", "author": "xenomorph856", "body": "Love you too! I hope we can reconcile all of this foolishness with haste so we can get to stepping forward together.\n\nGodspeed!"}, {"id": "fdkwmxu", "author": "crimsonchin68", "body": "All aboooooooooard the Karma Train Express"}, {"id": "fdkzie0", "author": "t-h-a-t-o-n-e-8-6", "body": "#TO THE FRONT PAGE WE GO"}, {"id": "fdl1s8p", "author": "studpuffin", "body": "Picture of a post-it note, very cool. Very fun"}, {"id": "fdl5lxn", "author": "ravivooda", "body": "I'm surprised no Americans confused the date with August 1st. Impressive ;)"}, {"id": "fdl5nao", "author": "Primepal69", "body": "Love it and you as well.  Keep up the good work! 💪"}, {"id": "fdl5nit", "author": "TheTallGuy0", "body": "Back at you, man. Love to visit your beautiful country someday, if governments can pull their heads fully out of their asses..."}, {"id": "fdl5o4l", "author": "youregooninman", "body": "Much love from California (San Francisco). Peace is the way to go. We’re all human."}, {"id": "fdl6f18", "author": "Dawnchathink", "body": "Love from Southern U.S. and thank you."}, {"id": "fdl7q6n", "author": "CheesecakeTruffle", "body": "I'm in the USA. We want no more war anywhere. We want peace, love, caring, and cooperation. I love ALL of my human family."}, {"id": "fdl7qun", "author": "TedTheodoreLoganJr", "body": "Hey 22 year old Iranian. Much love brother, I hope you and your family stay safe and healthy.\n\nCheers, from Canada."}, {"id": "fdl7ttc", "author": "pschmidit", "body": "Love back to you man! As someone who wants to join the US Military, I want to only defend the country I love from people who intend to harm it, not for an unjustified war founded on bickering and egotistical delusion. I see no threat from the good people of Iran to the people of the United States, and I hope we can move forward as one, rather than fight."}, {"id": "fdl7ups", "author": "t-brave", "body": "Love to all from the airport in Dallas. Peace and good will."}, {"id": "fdl86rl", "author": "Kandossi", "body": "Im sorry our government sucks man. Deeply sorry. Much live my dude."}, {"id": "fdl8smo", "author": "Heliotrope88", "body": "I lay in bed last night and dreamed for a moment that there was no global warming, no fires in Australia or the Amazon, no “white supremacy,” no governments filled with corruption and greed, no war; just a good, mundane existence for us all. Waking up, getting breakfast, working, a meal, and coming home to our families. Sure, there would still be pain and strife. But this has been beyond. I had a dream of another, more mild existence for all of us. I wish it were real."}]}