{"id": "fdemc6", "title": "2500 mile flight, 2 hour drive, 6 hour hike, and my wife is at rest.", "url": "https://i.redd.it/jxxn2s6jbok41.jpg", "subreddit": "pics", "author": "MECHASCHMECK", "text": "", "comments": [{"id": "fjh3ia4", "author": "626Aussie", "body": "She was at rest before your journey began. Now, you can rest."}, {"id": "fjgzl4m", "author": "CaptainGrumps", "body": "What does this particular spot mean to you and your wife?"}, {"id": "fjh8byi", "author": "LeanderTrain", "body": "I am the one preparing to leave the love of my life after 19 years of marriage, as the cancer is bearing down on me now for the 3rd and looks like final time. My heart breaks - not for me, but for my love and best friend whom I have no choice but to leave behind, alone.\n\nOP is there one thing you wanted or needed to hear from your beautiful wife that she didn’t say? It needn’t be anything profound, just something extra that would have helped your heart heal. I don’t want to miss my chance, and I’m only getting one shot.\n\nGodspeed, OP. I’ll tell your wife how you’ve touched so many with the pictorial story of your love when I see her on the next level. I imagine her peacefully and joyfully waiting for you, right by the gate.\n\nNamaste"}, {"id": "fjh08ti", "author": "Calamlikeabomb", "body": "I saw your pictures around Christmas and I've seen your one from today. There are people around the world truly moved by your story, people around the world who will go out of their way to hold their loved ones a little tighter or say \"I love you\" that one more time than they would have done. Your love story has inspired that, help spread that love around the world and in doing so, make the world that little bit better.\n\nLife I can imagine is not going to be easy to recover, but you'll find a way I truly hope. But as someone else has said, thank you for sharing your story and thank you for spreading a message of love without constraint around the world, because I believe you have.\n\nThe chances are unlikely, but if you ever find yourself in a city called Norwich in Norfolk, England, send me a message, I'd happily buy you a drink and have a chat and thank you in person and listen to what you have to share.\n\n\nEdit: you guys are awesome and exactly what I mean about spreading their love around the world.\n\nEdit2: thank you all for making my evening, for showing the love and support we need to make the world a little bit better. I hope OP sees this and sees he has support all around the globe.\nTo any of you going through the same, similar or just need a bit of support, I hope this shows there are people out there, people who care and people who want to listen. You don't have to be alone.\n\nWherever you guys are, whatever you guys are doing reach out to someone if you can and let them know they are loved and also have a fantastic day or night and remember we are here and we care."}, {"id": "fjh991f", "author": "ATX_rider", "body": "I'm sorry for your loss but happy for whatever peace this brought you. \n\nIn May of 2017 I did the same thing for my brother, and for myself. A 1,300 mile flight, followed by a 6 hour drive, followed by a 10 minute walk got his ashes to where they needed to be.\n\nOne of the best, most difficult things that I've ever done.\n\nPeace."}, {"id": "fjh9wut", "author": "palabear", "body": "Your first post about her health issues was 108 days ago.  From the pictures you shared, she was an active healthy young woman who enjoyed life.  108 days later she is gone.  It is humbling how quickly your entire world can be completely changed.  Time is precious and we waste so much of it.  I’m sorry for your loss."}, {"id": "fjh1ra4", "author": "andyjaguar", "body": "This is an amazing tribute to what looks like a wonderful marriage. My wife was diagnosed with cancer about 18 months ago. She was 35 at the time and we had been married for 10 years, now almost 12. We have 4 small children and not a day goes by that I don't think about the very real possibility of losing her in the coming years. It completely changes the way you look at everything. Thank you for sharing your experiences publicly, for some reason I find it comforting to see others go through these horrible experiences, it somehow makes my own experience feel more bearable."}, {"id": "fjgx16q", "author": "panphyni", "body": "Oh my dear, this is such a strong picture."}, {"id": "fjguq4x", "author": "MECHASCHMECK", "body": " \n\nYes, I’m the same person from the Christmas tree photo and the highly controversial/misconstrued hospice photo.\n\nI don’t care about karma, I care that people know she existed. She was an amazing woman that I’m proud to have called my wife. We were married for 5 years, together for 7. Our journey in photos: [Our Life](https://imgur.com/a/6SBgdIe)"}, {"id": "fjh8rcl", "author": "dan3659", "body": "I've just looked through your post history, Jesus man, thst was an emotional journey I wasn't prepared for. \n\nI wish you all the best OP. I don't really know what else to say to you at the moment, you're both so young and my heart breaks for you both and that potential snuffed out.\n\nSomething I always think of is a quote from Sheltering Skies by Paul Bowles\n\n\"Because we don't know when we will die, we get to think of life as an inexhaustible well. Yet everything happens only a certain number of times, and a very small number really. How many more times will you remember a certain afternoon of your childhood, an afternoon that is so deeply a part of your being that you can't even conceive of your life without it? Perhaps four, five times more, perhaps not even that. How many more times will you watch the full moon rise? Perhaps 20. And yet it all seems limitless.\"\n\nTake care OP. X"}, {"id": "fjgvq60", "author": "HauteTater", "body": "And a beautiful resting spot it is. She was a lucky woman to have you by her side, may she rest in paradise."}, {"id": "fjgxw68", "author": "RedditedAnotherOne", "body": "I know she was here.\nI know she was loved.\nI know she is gone.\n\nNothing will replace her.\nNothing should replace her.\nNothing can replace her.\n\nShe was your gift in this world.\nYou were hers.\n\nThis world no longer exists."}, {"id": "fji6nis", "author": "Creepy-Crab", "body": "I lost my ex in a mass shooting june 8, 2017. It was the darkest time I’ve ever been through. Not only did I lose the only I ever loved, but we didn’t have the finality of a “funeral”, we never saw any of the victims. They were all cremated. I think the worst part is, the shooter had posted every part of his plan months in advance. No one reported it and we thought he was a friend. Never leave angry. Our last words were an argument."}, {"id": "fjgv1h5", "author": "bumpsmom", "body": "I’m so sorry for your loss. Your tribute to you wife is truly beautiful."}, {"id": "fjhnprm", "author": "softrice666", "body": "I saw this post and instantly knew it was the OP I found expressing his concerns and announcing the waiting game for your wife in the r/bloodclots subreddit. I want you to know a few days ago I remembered your posts and hunt it down. Cried a lil. You and your wife stuck with me."}, {"id": "fjhz4qm", "author": "aeistrya", "body": "I'm pretty sure this will get buried, but I really don't care. I have to put this in words. \nOP. First and foremost, my dearest condolences. I'm sitting at my desk at work in tears. I was having a bad day and I thought I'd take a scroll through Reddit when I saw your post. When I realized what I was looking at and read some of the comments, I went back and read your posts. \n\nThe love that you have for your wife, and the love she has for you was palpable. I don't know you guys, but I can see the joy shining in your eyes in some of the photos you posted. I am angry on your behalf that you didn't get more time with your beautiful wife. It was a pleasure being able to see just how much you love each other. I hope that you find the healing you're craving. I hope you smile. I wish you nothing but luck, happiness and health going forward. Sending all my love from my very small corner of the world to you and your family. Thank you for sharing your story. Your wife is immortalized in the memories and thoughts of millions."}, {"id": "fjh4ocp", "author": "Elmoocharino", "body": "I’m stunned at some of the awful comments here. Dude just lost the love of his life. He clearly states that he wants to celebrate her life by letting everyone know about her only for some awful keyboard trolls accusing him of karma farming, attention-seeking and telling him that something is wrong with him. I fucking dare each and every one of you to step away from your keyboard, find this guy and say it to his face. But you won’t. Because you know it’s a shitty thing to say. But you’re safe from any consequences behind the safety blanket of anonymity. Fuck each and every one of you. Heartless swine."}, {"id": "fji1xwq", "author": "mnmotxca", "body": "I saw this earlier but couldn’t comment. I lost my wife to suicide 6 1/2 years ago. We were together 23 years and married 18 years. My children and I have yet to fully accept it and move on with healthy lives. We have her ashes which she wants spread in Florida and Jerusalem. I know one day we will finally be able to come together and let her go. God bless you, your wife, your friends and family, her friends and family and the other hundreds of lives that her passing has touched."}, {"id": "fjhmr2c", "author": "MacWop", "body": "Just had a gander through your post history. Me and my wife are 28 and i cannot imagine facing what you have went through at 25. Shes in the bath and after looking at your posts ive came through to the bathroom to just sit and be with her. Your an incredibly strong person and i admire that. \nShes proud man.\n\nEdit: your also very good with a camera."}, {"id": "fjgv1a9", "author": "LadyDreamcatcher", "body": "Beautiful sentiment. Beautiful expression of love."}, {"id": "fjhbesa", "author": "ancroidubh", "body": "My condolences, brother.\n\nI’ve been married going on forty-five years and this is something we’ve each been facing since the early eighties in one form or another. As time passes, the inevitability rises and becomes closer to certainty. I honestly don’t know what I’ll do. For my part, dying is easy but its toll on my wife is what agonizes me."}, {"id": "fjhms3h", "author": "Callipygous87", "body": "Fuck man... 3 months from healthy and cycling to spreading ashes?  Crying on my lunch break was not on my to do list today."}, {"id": "fjhnxzq", "author": "Hobbs54", "body": "My father is buried on the slopes of Mt. Rainier in Washington State. He always loved the view of that mountain so it seemed appropriate. I (middle son) was asked where on the mountain would be best, so I picked near Mowich lake as that is the side of the mountain we could always see from the Seattle area."}, {"id": "fjh5ofk", "author": "iWantToRideHorses", "body": "I am bawling my eyes out. Had to run up to my husband and hug him before he left for work this morning. Your wife is absolutely beautiful with a contagious smile that made me smile on this rainy day. How lucky you both were to have each other."}, {"id": "fjh9rnq", "author": "ILoveVaporwave", "body": "This broke me man."}, {"id": "fjhr8ug", "author": "PCisButter", "body": "100k upvotes, 253 awards in 4 hours. Love this community and the support we have for strangers."}, {"id": "fjh72qc", "author": "rchase", "body": "God, this felt like a gut punch when I finally got it.\n\nCondolences OP. Worth every step of the journey, and thank-you for sharing."}, {"id": "fjh6oic", "author": "sammichmachine", "body": "I'm so sorry. This photograph and your story is breathtaking as I'm sitting in my own hospital bed learning about it for the first time.\nI am actually in the same position as your wife - Osteosarcoma and may only have a few months left in me. \nShe was incredibly lucky to have you."}, {"id": "fjgyxi6", "author": "NewsMom", "body": "The photos are very powerful---your love for each other very clear to see.  At 2-3 months, you might be at the \"what's the point?\" stage.  If that's ever the case, I hope you'll spend more time with family and friends.  For me, those people  have meant everything."}, {"id": "fjiccmf", "author": "picmandan", "body": "Edit: https://imgur.com/MerDulJ\n\nSlight adjustment to lighting.  I hope you appreciate this variation."}, {"id": "fjh9p56", "author": "Littlefoots_TreeStar", "body": "Been following your story on and off. Really hope you can find peace dude.\n\nLovely picture too."}, {"id": "fji1net", "author": "InsideCopy", "body": "Brutal post history.\n\nI'm sorry man."}, {"id": "fjgw1tr", "author": "lollipoped", "body": "Your love is genuine.\n\nI hope you find peace and remember her in times of loneliness.\n\nYou are a good husband."}, {"id": "fjh9sxw", "author": "rikemomo", "body": "And suddenly, everything that's really important in life comes flooding in. Thank you for reminding us how precious this time is...and I am so very sorry for your loss."}, {"id": "fjh4j1l", "author": "niggamachine312", "body": "Beautiful gesture and beautiful picture.\n\nI just have one question though: Isn't that illegal to dispose of someone's ashes like that?"}]}