{"id": "fi2zjs", "title": "If this is you: Fuck you", "url": "https://i.redd.it/b9hkx5md2hm41.jpg", "subreddit": "pics", "author": "onyxandcake", "text": "", "comments": [{"id": "fkf08eb", "author": "relaxlu", "body": "If you want to buy yourself a r/pics mod position or a place on the front page for your product then please contact us with your highest toilet paper bids."}, {"id": "fkf0frz", "author": "cHaOsReX", "body": "Pro tip: If you stop drinking hand sanitizer you won't shit so much."}, {"id": "fkevuzo", "author": "Tarchannen", "body": "Can someone explain the panic over toilet paper recently? I understand that it's somehow COVID-19 related, but were people not wiping their bums before the virus was a concern?"}, {"id": "fkesdz4", "author": "OldWitchOfCuba", "body": "These dudes look like heavy shitters though"}, {"id": "fkewk1b", "author": "Monster-Zero", "body": "My absolute favorite thing about this is that while every store in a 10 mile radius around me is sold out of TP, they all still have plenty of hand soap.\n\nPriorities."}, {"id": "fkeuyob", "author": "peculiar_liar", "body": "Every couple of weeks I go to Costco to buy TP for my workplace - it is a remote construction site with a crew of over 70 people. I usually buy three Kirkland packs at a time - and now I am dreading my next shopping trip cause I will look like a complete and utter idiot."}, {"id": "fkew6bn", "author": "Mythradites", "body": "Panic at the Costco"}, {"id": "fkeut3l", "author": "DarkGamer", "body": "When you're an asshole you need a lot of TP"}, {"id": "fkevbxt", "author": "Sparty013", "body": "If this is you: why? What the hell do you think is about to happen? Do you anticipate pissing out your ass for the next 3 straight years?"}, {"id": "fkeyydf", "author": "Noogatuck", "body": "I just don't understand this, at all. People act like the supply chains have shut down and no more TP is being made, you fucking idiots realize there's another semi, on the way, WITH MORE TP, WATER AND RAMEN RIGHT? \n\nEven in Italy and China where we've seen the worst of this so far, HOW MANY PEOPLE HAVE REPORTED THEY COULDN'T SHIT? NONE. You know how many people have reported they couldn't shit because some asshole bought all the TP? A LOT.\n\nBuy a bidet everybody, it's on Amazon for like $30 and you'll only need like 2 squares of TP for every shit after that, for eternity. If your store is out of lysol wipes, buy the spray bottle and use a cleaning rag. If they run out of bottled water, buy a filter for your tap.\n\nJesus, everybody who's panicking and doing all of this stuff, just stop. Think about the community at large and how you're impacting it."}, {"id": "fkf3jhc", "author": "Arayder", "body": "I’ve tested positive for corona??? But how is that possible??? I bought so much toilet paper!!!!"}, {"id": "fkesqzu", "author": "Monkeyboystevey", "body": "I would be embarrassed as fuck buying two packs for self isolation for my family of 5 let alone 10.  \nFuck these people..."}, {"id": "fkertwv", "author": "ejsandstrom", "body": "I have a few rolls left. I am wondering what I am going to do in a few days."}, {"id": "fkew6ri", "author": "De5perad0", "body": "Bidet gang represent!\n\n\n\nEdit: it seems the best bidets on Amazon are sold out  I WONDER WHY!"}, {"id": "fkes3x6", "author": "onyxandcake", "body": "~~My~~ A town has a seniors lodge that is currently outsourcing toilet paper from local residents, asking each household to donate a couple rolls. They shouldn't be in this situation in the first place.\n\nEdit: Not my town, turns out, but a nearby one. Local Facebook groups aren't the greatest for accuracy. Point still stands. \n\n**Photo credit @seanbradbery on Twitter**\n\nEdit2: [Someone's taking it personally](https://ibb.co/ZMs1TTd)"}, {"id": "fkf1gqf", "author": "Mecmecmecmecmec", "body": "I’m literally just in the market for toilet paper like usual...and can’t find a single fucking roll"}, {"id": "fkeuk6e", "author": "t1t50rgtf0", "body": "Stores should be responsible and put limits on how many you can buy\n\nWow 2k upvotes and an award! I never thought my best comment would be about toilet paper 😄"}, {"id": "fkf37h0", "author": "unicornsRhardcore", "body": "I feel like the people who buy all the toilet paper are not the people who would survive a real apocalypse.\n\nEdit: Damn, first award kind person!"}, {"id": "fkewk7a", "author": "LMBH1234182", "body": "Me and my roommates are ACTUALLY out of toilet paper and can’t find it anywhere. In Austin. Where there are a grand total of two people with corona. FUCK THESE ASSHOLES.\n\nEdit: ok fine there’s more than 2 cases but my point still stands."}, {"id": "fkeslot", "author": "EmptyCalories", "body": "[https://www.reuters.com/article/us-health-coronavirus-toiletpaper/rationing-and-robbery-coronavirus-outbreak-sparks-toilet-roll-panic-idUSKBN20T0YG](https://www.reuters.com/article/us-health-coronavirus-toiletpaper/rationing-and-robbery-coronavirus-outbreak-sparks-toilet-roll-panic-idUSKBN20T0YG)\n\n>“The size of toilet paper makes it feel like a substantial, big  purchase. It makes it feel like you’re doing something. It taps back  into that need for control. If you’re buying a hefty big pack of toilet  paper, you kind of feel like you’re ‘stocking up’. You signify to  yourself that you’re in control.”\n\nMeanwhile everyone with a bidet has a smile, and not just from the bidet.  :)  People hoarding toilet paper concerns me, a little.  I'll become worried when there's a shortage of penicillin and hamburgers."}, {"id": "fkeu1c9", "author": "GowWowGoliath", "body": "Except for that dude on the left. He looks like he drops them huge shit hammers that just go KERPLUNK."}, {"id": "fkes6i8", "author": "damn_yank", "body": "FFS, how much do these people think they are going to shit?\n\nEDIT: I would never have thought in a million years that one of my highest rated comments would be in a post about hoarding toilet paper."}, {"id": "fkeuvd1", "author": "mikehaysjr", "body": "My buddy works at a sporting goods store, and when their limited supply of TP ran out people literally started buying up all the guns and ammo"}, {"id": "fkf49c0", "author": "doglywolf", "body": "The supply chain is fine - the stores are fine its all the panic shopping that clears the shelfs  - normally the shelfs are enough for a 3-4 days so that swhat the trucks bring .  \n\nWhen people come in all at one and clear the shelfs - they stock them same day and clear them again - it will be next day at worst 2 for them to restock but all of sudden their are pictures of empty shelfs and people panic even more and go into a buying frenzy and it just repeats - there is more then enough for everyone and if you didnt buy 10x more then you need for your selfish self theere would still be enough for everyone and then some and there would be no panic. \n\n&#x200B;\n\nThis panic is 100% caused by selfish ignorant people over buying , and half the stuff they overbought will go to waste"}, {"id": "fkf1cza", "author": "Mustermuss", "body": "Can someone explain to me why people are stocking up on TP’s? People have gone mad."}, {"id": "fkfb1ey", "author": "_nayr_tremmin_", "body": "i work in a grocery store and today was probably the worst shift ever in my 3 1/2 years there. idiots"}, {"id": "fkf1e7a", "author": "Dose_One", "body": "As someone with a wife and 3 daughters this looks like a solid weeks supply for 4 women."}, {"id": "fkf5z42", "author": "147896325987456321", "body": "buying mass toilet paper is the stupidest trend i have seen in my lifetime."}, {"id": "fkf04uq", "author": "MeanwhileOnReddit", "body": "These people are going to be confused when they still have a ridiculous amount of TP in 6 months."}, {"id": "fkf0gh8", "author": "Tenagaaaa", "body": "In this picture, people who don’t wash their ass."}, {"id": "fkevnkr", "author": "annoyinglyskeptical", "body": "All y’all fucking rookies hoarding the TP when you should be hoarding the baby wipes.\n\nEdit- it’s a joke people. I don’t condone the hoarding of anything right now. I don’t see a point in it.\n\nEdit 2- so I thought this TP hoarding was a joke. A meme. I just went to Walmart to get some groceries and holy shit these turds are REALLY hoarding TP"}, {"id": "fkf29xt", "author": "artisticMink", "body": "Fallout had it wrong with the bottlecaps. \n\nIn the post-apocalyptic distopia, the toilet paper prepper is king."}, {"id": "fkf5oxo", "author": "TheTattedspyder", "body": "What. The. Fuck. Does. TP. Have. To. Do. With. COVID-19?"}, {"id": "fkeu5d6", "author": "katehaxu", "body": "there should be a limit."}, {"id": "fkf84ri", "author": "HRHqueenbee", "body": "My father who is in his 70s is going through cancer treatment.  One of his side effects from his medication is he poops a lot.  Like a lot.  I went to grocery store for him other day since I don’t want him out in public.  I bought two big pack of TP which will honestly probably not last that long.  I got glares and death stares.  Some of these people might be buying for other people or have medical issues as well.  Most are asshats hoarding TP because they are panicking and dumb.   But some might not be.  Just wanted to put that out there."}, {"id": "fkeuz7b", "author": "Slade_Riprock", "body": "Three are fuckers selling shit on eBay and Facebook marketplace. Shitty humans"}, {"id": "fketbyq", "author": "phatmattd", "body": "These people aren't stocking up like this to prepare for isolation. They're \"stocking up\" like this to resell knowing that store stock will be out for a while. \n\nGo check your local Facebook Marketplace, you'll see all of these assholes listing 1 or 9 packs for $10-$50, it's absolutely absurd."}, {"id": "fkf4h5o", "author": "Crucial_Taunt94", "body": "😂😂😂 these people are the last ones to survive any apocalyptic like scenario"}, {"id": "fkewfre", "author": "AntonDorado", "body": "I suppose it takes a crisis to learn just how full-of-shit your neighbors are"}, {"id": "fkf581i", "author": "iPhoneSEcretActnt", "body": "Covid-19 isn’t gonna give you diarrhea, what the fuck is wrong with people?"}, {"id": "fkevcgk", "author": "gsuEAGLE21", "body": "My boss makes a dollar, and I made a dime.  That's why I poop on company time."}, {"id": "fkf5a37", "author": "cosmic_riviera", "body": "Diarrhea is not a symptom of coronavirus. I don’t understand."}, {"id": "fkf126d", "author": "AidilAfham42", "body": "Y’know, this virus made me realize you Westerners are exactly the same as us asians. Fear to lose out, doing what others do, reselling for profit. Kinda brings us all together.\n\nWell except I can’t understand why people wipe their assholes with paper then walk off. Why don’t you wash it? You’re at home, go shit to shower. Use soap. All that shit stuck in between the wrinkly rectum and ass hair. How do you walk around like that? But then again you guys wear shoes from the outside directly into your own house, so you guys are really strange."}, {"id": "fkewvue", "author": "spdrv89", "body": "The media is one helluva drug"}, {"id": "fkf9x81", "author": "RealM-Fresh", "body": "It's times like these that make us realize the human race really is no better than the residents of South Park"}, {"id": "fkfq1zc", "author": "mysticalfruit", "body": "What saddens me more is these clowns are likely going to stash it in some place, like their damp cellar and it'll all be wasted.\n\nThis is my fear with people buying 8lbs of rice and 40lbs of flour. These clowns don't know how to cook from scratch. How do I know this? The flour is gone, but the baking powder, baking soda and yeast is still there.. It's going to end up in the back of the pantry until it's chucked."}]}