{"id": "fjbyok", "title": "Worker spraying the streets to prevent Covid 19. This is the most cyberpunk picture I've ever seen.", "url": "https://i.redd.it/ltv53wz6lxm41.jpg", "subreddit": "pics", "author": "cdicdd2018", "text": "", "comments": [{"id": "fkm512e", "author": "MostlyCorrectGuy", "body": "On a segway with a Lysol Thrower. Wild."}, {"id": "fkmen0m", "author": "JayLeeCH", "body": "\"Close the windows\" \n\n\"No leave them, free fumigation\"\n\nEDIT: Thanks for the gold stranger!"}, {"id": "fkm1x25", "author": "joemandro", "body": "This should be an album cover"}, {"id": "fkmbocb", "author": "CptnBlondBeard", "body": "This stuff is called VitalOxide (or is something similar). The company my dad works for is a distributor of it.\n\nQuoted from the website:  \"Vital Oxide is an EPA-registered hospital disinfectant cleaner, mold killer, and odor eliminator. Its formula contains a unique form of stabilized chlorine dioxide that is very effective at killing bacteria, viruses, and mold yet non-corrosive to treated articles and gentle enough to handle without causing skin irritation. It is ready to use with no mixing required—just spray, wipe, or fog right from the bottle.\"\n\nWhile his company doesn't make this stuff, they are an authorized distributor, and also manufacture some of the machines used to disperse it. The machines give the chemical particles a static charge as they are forced out of the nozzle, thus causing the particles to stick to most surfaces.\n\nThey are currently overwhelmed with over 1000 orders that they are unable to fill, as their supplier cannot keep up with the demand.\n\nHopefully this clears up some of the confusion and worries."}, {"id": "fkmaizd", "author": "rowdyjustice", "body": "Looks like the opening scene from Parasite."}, {"id": "fkm861n", "author": "Peanlocket", "body": "That's really cool but any source on this pic? I don't want to take it face value and be wrong after sharing it with others.\n\nedit: found it myself here https://www.theatlantic.com/photo/2020/03/photos-large-scale-disinfection-efforts-against-coronavirus/607810/"}, {"id": "fkm90uy", "author": "Xylitolisbadforyou", "body": "Is there any efficacy to spraying the streets in preventing the spread of this?"}, {"id": "fkm6s2b", "author": "Stickyouwithaneedle", "body": "What are they spraying?"}, {"id": "fkmfp1a", "author": "Zyron_", "body": "Cyberpunk? More like the cover for the Chernobyl series."}, {"id": "fkmbmy3", "author": "commutingtexan", "body": "This is a Golden Eagle Thermal Fogger, and can put out ungodly amounts of atomized solution. While I'm not sure of the effectiveness of the products being used, it can cover large areas very quickly."}, {"id": "fkmjcf3", "author": "mistweave", "body": "Original [picture](https://www.theatlantic.com/photo/2020/03/photos-large-scale-disinfection-efforts-against-coronavirus/607810/#img03) here.\n\nThe number plate on the car is cropped out in the blue filtered photo posted here, but \"鄂\" denotes Hubei, and \"A\" denotes the state capital (Wuhan).  \n\n\nEdit: [Higher Resolution image](https://i.redd.it/un6lu01nc3m41.jpg)  \n[365  解放大道](https://www.google.com/maps/place/365+Jiefang+Ave,+Qiaokou+Qu,+Wuhan+Shi,+Hubei+Sheng,+China,+430015/data=!4m2!3m1!1s0x342eac331ffc8ee1:0x51d7a31dc8018707?sa=X&ved=2ahUKEwivtuzsi57oAhXK4jgGHax7C58Q8gEwAHoECAsQAQ) on the street number sign"}, {"id": "fkm6808", "author": "Sip_py", "body": "Where is this in the world?"}, {"id": "fkmff22", "author": "kyan-", "body": "Chernobyl 2"}, {"id": "fkm5byc", "author": "newscotian1", "body": "Should be a Time magazine cover."}, {"id": "fkm7jmo", "author": "Jackums23", "body": "Who ya guna call?"}, {"id": "fkmhlhb", "author": "munomana", "body": "Picture's definitely cool and I'm not trying to knock it at all, but the scenery really seems to betray the cyberpunk feel right?\n\nMaybe I'm wrong, but I thought cyberpunk and futurism always involves like steel buildings and advanced architecture, rather than the stone material we see in the back\n\nThis image would terrify anyone from 100 years ago, still"}, {"id": "fkmouu0", "author": "snoozeflu", "body": "Whatever happened to those hoverboard things? They were popular for like one season and then everyone stopped using them."}, {"id": "fkmbut0", "author": "wjaspers", "body": "Whats the risk to normal microbial environments when the entire city is doused in this chemical concoction? What becomes of the city environment after this treatment has dissipated?"}, {"id": "fkme3vd", "author": "EastClintwood89", "body": "Reminds me of the box art of the Chernobyl Blu Ray."}, {"id": "fkm779t", "author": "VestrumTobias", "body": "I cannot imagine what the heck they might be spraying."}, {"id": "fkmgwoi", "author": "Got2Go", "body": "23-19 Weve got a 23-19!!!!"}, {"id": "fkmbxa7", "author": "mwaderun", "body": "The hoverboard is the icing on the cake, the cherry on top, and the house fire waiting to happen"}, {"id": "fkmm33i", "author": "bigmikey69er", "body": "Could somebody explain how spraying the streets prevents the spread? Is it a measure to prevent people from going out?"}, {"id": "fkmho35", "author": "ColonelClusterShit", "body": "This isn't cyberpunk at all?"}, {"id": "fkmqmow", "author": "thenationalblade", "body": "Does this actually do anything or is it just to make people think something (everything) is being done?"}, {"id": "fkmrz06", "author": "Zulu122AlphA", "body": "Dude this is it. We’ve made it to the timeline. This was drawn so many times and now it’s reality. I’m just like blown away by all this."}, {"id": "fkm26q7", "author": "rustyforkfight", "body": "Banksy IRL"}, {"id": "fkmetkg", "author": "c-digs", "body": "\"It's just the flu\"\n\nWhen's the last time you saw anyone spraying disinfectant like this and closing borders during flu season?\n\nPlease take that into consideration as you decide how serious this is."}, {"id": "fkmmcvz", "author": "MrCapedCrusader", "body": "Nothing cyberpunk about this AT ALL, lol."}, {"id": "fkm5xzg", "author": "FREE-AOL-CDS", "body": "I wouldn’t want to breath that shit in either wtf"}, {"id": "fkmjusz", "author": "WrecklessMagpie", "body": "These guys are in suits while my supervisors expect us school custodians to just use the regular old disinfectant and some rags to disinfect the schools next week. Cool beans."}, {"id": "fkmodjj", "author": "ernster96", "body": "Question: what is he spraying?"}, {"id": "fkmoxjd", "author": "ProScavenger", "body": "Is he on a fucking hoverboard??"}, {"id": "fkmp9eq", "author": "Generic_Male_3", "body": "More like Monsters Inc. than cyperpunk."}, {"id": "fkmsee4", "author": "Frencil", "body": "This reminded me so much of the UC Davis pepper spray incident [I had to put them together](https://i.redd.it/1cee48txgam41.jpg)"}, {"id": "fkmslm1", "author": "foxik20", "body": "A brief course of actions to take:\n\n1. Stay home, limit contact with friends and family. Read a book, play a video game, watch a movie. Don't go to the birthday event, a bar, or to the gym.\n2. Netflix, YouTube Premium and certain movies should be on a large discount or free, so more people would stay home and not contract the infection.\n3. Order groceries and food online and let them bring to your door. Wait 30 minutes to 1 hour in order to avoid the possible contamination from a delivery person. Your milk or ham won't spoil.\n4. Increase payouts to food delivery personnel and encourage them at least to wear a mask and carry a hand sanitizer.\n5. Prohibit all public events for just 2-3 weeks.\n6. Asian countries wear masks. Look at China, the infection rate is going down. 99.9% of the Chinese people did not get infected and the country is recovering!\n7. Do not air travel or go on a cruise. Air circulation in the airplane pretty much guarantees you getting the virus.\n8. If you are sick and between 18-59 years old, SELF-quarantine yourself and isolate from everyone!\n9. If you are sick and your age is 60+ OR if you have underlying medical conditions, then go to the doctor. In this case, the best course of action would be to mobilize special ER service, in which the service arrives at your home with the special protective equipment. Going to the doctor by yourself will just infect more people while you travel.\n10. Don't panic and stay vigilant."}, {"id": "fkmtqjj", "author": "Pinoyguy_14", "body": "*Plague* by [random artist]"}, {"id": "fkn05l7", "author": "DonS0lo", "body": "There's nothing cyberpunk about this. Dystopian? Yeah. Cyberpunk? Nah."}, {"id": "fkma5su", "author": "Rsubs33", "body": "Honest question, how cost effective is this since doesn't the sunlight kill the virus in a matter of minutes?"}, {"id": "fkma8z5", "author": "necromundus", "body": "/r/chinafuturism"}, {"id": "fkmm0w1", "author": "Riot_is_Dogshit", "body": "Why doesn't he spray behind him while moving forwards?  To move forwards into your spray seems illogical."}, {"id": "fkmoor2", "author": "jqrambo", "body": "I came back from China recently and these guys were everywhere spraying this. I actually have a few videos I might post later. I don't know what sub to post too though"}, {"id": "fkm7l7a", "author": "baaddaad", "body": "Rock, Paper, Scissors, Pandemic"}, {"id": "fkmhdo3", "author": "AlmanzoWilder", "body": "Typical very young person comment:  This is the most \\_\\_\\_\\_\\_\\_ \\_\\_\\_\\_\\_\\_\\_ I've ever seen."}, {"id": "fkmrhkg", "author": "ThorsonWong", "body": "r/NotCyberpunkAtAll\n\nOr\n\nr/CyberpunkAsABuzzWord"}, {"id": "fkm7xs0", "author": "Lord6Dog", "body": "Mall Cop: Virus Edition"}, {"id": "fkmdshm", "author": "nemthenga", "body": "This looks like a [Simon Stålenhag](https://simonstalenhag.se/) panel. Crazy."}, {"id": "fkmfch1", "author": "Urmomsdreamman", "body": "Is no one gonna y’all about how he’s on a hover board?"}, {"id": "fkmg5g3", "author": "dacoolboe", "body": "Half life lookin"}, {"id": "fkmg5wq", "author": "sWordLilylady", "body": "Where is this?"}, {"id": "fkmgyav", "author": "kiwiposter", "body": "What on earth would they be spraying? Ethanol?"}, {"id": "fkmh6z8", "author": "lolniclol", "body": "What are they spraying exactly?"}, {"id": "fkmhw2z", "author": "m777z", "body": "Reminds me of the [Gasman of Kiev](https://i.imgur.com/ARtFrSk.jpg)"}, {"id": "fkmkidm", "author": "Clown_Tempura", "body": "The hoverboard makes it."}, {"id": "fkmlwfw", "author": "Cool_underscore_mf", "body": "With a FOGGER! I love those things. I used to have to work on them forna while, used to tune them so that thel were the noisiest that thry could be. We would then wait for the fogger guy to come around fogging and get him to fog the tent poles: cue a half a dozen guys standing around thr fogger guy chanting  \"smoke my pole, smoke my pole\". He cottoned on after a while, told us to fuck off one time."}, {"id": "fkmm3w6", "author": "The_Flying_Potatoe", "body": "Straight out of Parasite"}, {"id": "fkmm46i", "author": "true4blue", "body": "On a hoverboard no less."}, {"id": "fkmmccp", "author": "LegoC97", "body": "r/Cyberpunk"}, {"id": "fkmmgbk", "author": "zoroark9904", "body": "Pull up on yo block w da smoke, hoverboard fresh out da box, virus here ain’t no joke"}, {"id": "fkmmhom", "author": "Theimpossiblespoon", "body": "This reminds me of parasite"}, {"id": "fkmmhqa", "author": "FulcrumTheBrave", "body": "The dystopia is at nigh"}, {"id": "fkmmo5o", "author": "dirtyhandscleanlivin", "body": "History books about this time period with all of the available documentation are gonna be incredible"}, {"id": "fkmmza1", "author": "Existingispain", "body": "Poisoning the streets."}, {"id": "fkmn6o2", "author": "nirtdapper", "body": "Instantly reminded me of that scene from Parasite."}, {"id": "fkmnfjo", "author": "MseMahi", "body": "Which place this?"}, {"id": "fkmousd", "author": "MasqueradeDance", "body": "BUM BUBUBUBABABABUBUBUBUM BUBUBUBABABABUBUBUUUUM"}, {"id": "fkmp2jw", "author": "HeddieORaid", "body": "He’s on a Segway mini! I have a mini plus. they’re the best. I’ve never sprayed the streets to prevent covid 19 on it though"}, {"id": "fkmp5cl", "author": "Finn-DC", "body": "Looks like a banksy painting."}, {"id": "fkmq64o", "author": "redonrust", "body": "We get it, you vape."}, {"id": "fkmqfdw", "author": "A-CHoo-CHoo", "body": "Hey they used to do something similar in the Philippines! But for mosquitos... we would run in and play like it was a haunted house because children are dumb."}, {"id": "fkmqi2p", "author": "studiomiguel", "body": "Leave the windows open, we'll get a free fumigation."}, {"id": "fkmqofl", "author": "infamouscar", "body": "Is there a sub for dystopian looking photos that are taken today?"}]}