{"id": "fkq3qb", "title": "I decided to finally go vaccinated behind my anti-vax parent's back! :)", "url": "https://i.redd.it/83sx1koevfn41.jpg", "subreddit": "pics", "author": "tazijade", "text": "", "comments": [{"id": "fku8tka", "author": "zerbey", "body": "Well done you, my wife has an autoimmune disease and we thank you for being socially responsible.\n\nEdit: I've had several anti vaxxers PM me already. Stop wasting your time, I'm blocking you on sight."}, {"id": "fku646k", "author": "MyBroPoohBear", "body": "Question:  are you going to tell your parents?"}, {"id": "fku5mps", "author": "bgolbov", "body": "Uh-oh, now you’ve done it. Now you’ll live a long, healthy life."}, {"id": "fku432w", "author": "MrAlexius", "body": "Congratulations and my condolences, I imagine it's quite an experience having antivax parents"}, {"id": "fku2pde", "author": "thefearguy4218", "body": "I am proud that their dangerous beliefs haven't tainted you and you did the right thing"}, {"id": "fku7bhf", "author": "SergeBaldini1980", "body": "Just out of robo-curiosity, I’m generally intrigued as to how anti vaxxers are viewing the Covid-19 pandemic and whether they support widespread use of a vaccine? I don’t want to put you on the spot, but I don’t know any anti vaxxers. Also, good job! 👍👍"}, {"id": "fku4iof", "author": "New-Age-Jesus", "body": "Hey congrats! Needles suck but these ones are so worth it. And i love your glasses btw, they look freaking adorable.\nEdit: I'm a woman. I was just complimenting another woman. I'm not trying to get in her pants. You guys need to chill"}, {"id": "fku6n11", "author": "bwbloom", "body": "[https://youtu.be/HrAYhuGFa0U](https://youtu.be/HrAYhuGFa0U)"}, {"id": "fku4yvu", "author": "mehow5000", "body": "Well done for taking your life into your own hands. High fives to your friends for being there for you."}, {"id": "fku8d2x", "author": "aloepant", "body": "Please please please also get your HPV shots If you can.  It’s a series so you will need multiple. My parents were all “ewww sex” about it in the mid 2000s and I am sure I was unnecessarily put at risk of cervical cancer because of their backwards beliefs"}, {"id": "fku7rxz", "author": "Cuylar", "body": "Will they disown you like mine did?"}, {"id": "fkuyr56", "author": "Travisx2112", "body": "Cute girl? Anti anti vax? May as well shut down reddit now."}, {"id": "fku7ynk", "author": "Taggart451", "body": "I'm 31 years old and just got vaccinated a few months ago. Go us OP!"}, {"id": "fku4224", "author": "LeFirecracker", "body": "Good for you! You keep believing in modern medicine and STAY HEALTHY!"}, {"id": "fku2fbz", "author": "IrishmadeinCanada", "body": "Good job! Show them this post!"}, {"id": "fku7zvb", "author": "I_Enjoy_Cashews", "body": "✔Cute girl  \n✔Pro-vaccination  \n✔Overr 4,500 uovotes and rewards before an hour\n\nOh boy, this is your typical reddit post. See you with 50k upvotes soon, lads"}, {"id": "fku86g2", "author": "MrLethalWeapon", "body": "The fact that the diseases people are vaccinated against are largely gone should clue people in to how they probably do exactly what they say."}, {"id": "fku63i4", "author": "SomeFreeTime", "body": "So i understand that the belief that anti vaxxers have is that vaccines cause autism in children... So what's the deal with not letting adults get vaccinated?"}, {"id": "fkuhfsi", "author": "Batyak", "body": "Oh hey! Familiar face! Now with the power of vaccines you'll beat infected Traitor Lord in no time;) \nBut seriously good for you, congrats! I work with a guy who has EIGHT unvaccinated kids at home, this whole antivax movement is ridiculous!"}, {"id": "fku353p", "author": "rufotris", "body": "So glad you lived to an age that you were able to. Sadly to many children die from their parents refusing to vaccinate. I would give you reddit gold if I could. Spread the intellectual decision you made as widely as possible. Un-brainwash those who think vaccines are mind control agents and cause autism. Fix the stupid!!!"}, {"id": "fkulba4", "author": "FlaminEddy", "body": "Behind your parents back? You look 27"}, {"id": "fkvntvm", "author": "bozak_137", "body": "Why is this getting so many awards? Genuine question."}, {"id": "fkwca5j", "author": "Kamikaze_AZ22", "body": "182k?!?!?"}, {"id": "fku44nh", "author": "vainCiel", "body": "Live long and prosper"}, {"id": "fku8xwu", "author": "inksmudgedhands", "body": "This is the type of kid rebelling against parents that I can get behind."}, {"id": "fkuyl1c", "author": "ThePonyMafia", "body": "Reddit: A Cute Girl AND Anti Anti-Vax in one post? \n\nReddit: *Explodes*"}, {"id": "fkv28x5", "author": "Sigmatronic", "body": "So Many simps in the commentés funniest shit ever"}, {"id": "fkvc0f1", "author": "ashleyc18", "body": "This is literally just a picture of someone getting a flu shot. Why is it on r/pics?"}, {"id": "fkvhnjn", "author": "oceans_call", "body": "So this is how to get karma and awards:\n1. Be in a doc's office\n2. Have someone take a picture of you getting a shot\n3. Make a backstory about coming from antivaxx parents or a position where you had no vaccine access, and post.\n4. Watch your post explode (Especially if you are a female)"}, {"id": "fku8721", "author": "seve_rage", "body": "This website is the biggest fucking circlejerk in existence."}, {"id": "fkupglr", "author": "DannySmashUp", "body": "This warms my heart to see!\n\nI teach a lot of college freshmen, and when I do the “issues survey” in class, I consistently get 6-10% of students who you’d basically call anti-vax.  And they’ve almost always become that way due to either their parents, or from tons of YouTube videos. \n\nI also get a few students every semester who say they’re not entirely sure if the earth is flat or round.  “There’s evidence on both sides”, to quote one young scholar from last semester.  Sigh."}, {"id": "fkubiye", "author": "_foxwell", "body": "Conventionally attractive female gets a vaccine in a short skirt—immediately Reddit suggests it to all users and all normie fedora-tippers start jerking off feverishly “Good job, ma’am”\n\nStupid as fuck trite post. God I fucking hate Reddit sometimes\n\nEdit: added “sometimes.” Does not take away from how much of a dumpster fire this website can be very frequently. Regarding this post, it’s gonna be a yikes for me dawg."}, {"id": "fku6ekm", "author": "baycommuter", "body": "Excellent! It’s legal where you live for them to vaccinate you without a parent’s signature? A lot of places it isn’t."}, {"id": "fkub9j0", "author": "lolschrauber", "body": "This comment section is basically 1/3 people saying that this is awesome, 1/3 thirsty guys and 1/3 haters. Nice."}, {"id": "fku7n7a", "author": "Tobi-tre-fot", "body": "Perfect combo of attractive woman and one of Reddit's favorite themes. To the front page we go!"}, {"id": "fkuc32p", "author": "Beer_Is_So_Awesome", "body": "My dad’s brothers are anti-vaxxers and raised their kids with those beliefs. My youngest cousin had to get vaccinated in order to attend college, so she did. In the process she became interested in immunology. Fast forward several years, she’s starting a graduate degree in Austin studying infectious diseases. I’m so proud to see her patiently correcting her family on their bullshit assertions about science.\n\nWhat’s most amazing is that her parents are incredibly supportive of her. “Who knew she was the smartest one in the family?” her mom asked me, as her daughter pursued an advanced degree in a field that she herself believes is all a conspiracy to endanger folks and keep them sick. And she’s proud of her. \n\nI guess people compartmentalize their beliefs."}, {"id": "fkv2cfi", "author": "namdude0373", "body": "I feel like anti-vax people support freedom of choice so it should go both ways lol"}, {"id": "fkv5g72", "author": "Goobaka", "body": "You want internet points?  This is how you get them!  Nice job!"}, {"id": "fkva68q", "author": "brosafari_", "body": "wow so edgy"}, {"id": "fkvodka", "author": "The-Goat-Lord", "body": "Completely unrelated, but that belt is cute, can anyone tell me where it's from?"}, {"id": "fkx45ma", "author": "AVP_mememanjeff", "body": "Oh no you are gonna get autism"}, {"id": "fkx5w6f", "author": "azahar3", "body": "You go girl👏💪"}, {"id": "fkx847d", "author": "GeovanaSB", "body": "Good job soldier!"}, {"id": "fkxdz0y", "author": "gayasaurus", "body": "How the hell did you get all of those awards? And good job on the vaccination!! We're all proud of you!!"}, {"id": "fkxo3di", "author": "Onextto0", "body": "what a fucking simp fest"}, {"id": "fm1ezth", "author": "Raggedybonemeister", "body": "I tried to get myself vaccinated but when i went to get 'the jab' i was told that i had to have it inserted directly into my urethra. I considered running away as they sauntered towards me, but the sheer size of the syringe could reach my wibbling cheeks from across the room and the EVIL SATANIST doctor impaled me rectally with the exit wound being through my urethra. Now i have autism and i cant stop watching Doctor Who and playing minecraft. I beg for death but since i am not an unborn foetus they said that they wouldn't kill me. But that's just life i guess. Hail Satan."}, {"id": "fku5cw5", "author": "ThisGuy09s", "body": "Here for a good time and a long time."}, {"id": "fkufuec", "author": "panamasucks", "body": "who gives a fuck lmao"}, {"id": "fkub7gt", "author": "Ryanindustrial0912", "body": "reddit full of simps"}, {"id": "fkuapn5", "author": "tgellen3692", "body": "Pic of a girl getting an injection. Garbage post. Literally only upvoted bc there is a pretty girl"}, {"id": "fku8wb1", "author": "joric6", "body": "You're so brave."}, {"id": "fku831u", "author": "IthinkIcan_ty", "body": "Guys just encourage her, she probably still loves her parents very much, and even if she doesn’t, there isn’t any need to bash them. We don’t know the situation. It was clearly a very difficult decision to make for herself. Maybe don’t bash the parents and just congratulate her on educating herself and making a decision she felt she needed to and to finally make her own choices. That’s a hard step."}, {"id": "fku509k", "author": "bestower117", "body": "Let us know if you end up being autistic"}, {"id": "fkua8ma", "author": "iWinston", "body": "Ok...?"}, {"id": "fkufc2n", "author": "EmirSc", "body": "vaccinate your parents when they're asleep"}, {"id": "fkucw1x", "author": "BunnyTown77", "body": "Lol typical front page post"}, {"id": "fkuf5v4", "author": "patricje", "body": "I took a note to school every time they gave vaccinations because our church didn’t believe in doctors. Got to be the weird kid that didn’t get a shot. Now my parents are old and terrified Bernie is going to take away their healthcare or put them on a death list. I guess doctors aren’t from the devil anymore"}, {"id": "fku2m25", "author": "sean488", "body": "You look like an adult.  You need to to sneak around to do it why?"}, {"id": "fku622v", "author": "jet_heller", "body": "From the rest of the herd: Thank you."}, {"id": "fkuia1s", "author": "dust1ng0ff", "body": "This sub fucking SUCKS\n\nHOLY FUCK THIS SITE IS DEAD"}, {"id": "fkub48f", "author": "Raragalo", "body": ">Cute nerdy girl + political position that Reddit likes\n\nTo the front page you go."}, {"id": "fkub37b", "author": "DrSmotPoker", "body": "Twitch stream in bio? I smell a Karma whore. They’ve even got the perfect upvote formula of  girl + making fun of antivaxxers."}, {"id": "fku7ntd", "author": "Arch27", "body": "Congrats - Just a heads up, be prepared to kind of feel like crap for a bit. That's a common side effect. It's a terrible time to mildly feel under the weather but rest assured it's rather typical.\n\nI'm serious - you might get the same symptoms that are floating around about COVID-19 infections, but you'll be fine. They should fade in a day."}, {"id": "fkub2ml", "author": "crookedmasterpiece", "body": "Never thought I'd see you on the front page of Reddit!! Super proud!! ;)"}, {"id": "fkuhb1c", "author": "Zer0M0ti0nless", "body": "If you want to pull off the ultimate heist, vaccinate your parents without them knowing. That’ll teach em!"}, {"id": "fkuk49b", "author": "ashishvp", "body": "Godamn. This just reminds me that we're going to develop a vaccine for COVID-19 within a year and there will STILL be idiots that refuse to take it"}, {"id": "fkulhyn", "author": "nonvaxxer", "body": "You look like a girl I know on Instagram, it's scary. You even have the same glasses"}, {"id": "fkupcst", "author": "binarycodedpork", "body": "They'll be unbearable now if you live"}, {"id": "fkuuzul", "author": "dalen52", "body": "I don’t know if anyone else said this because I’m too lazy to look, but thanks for posting this! Maybe someone else in your shoes will do the same thing. Many blessings to you."}, {"id": "fkuvygr", "author": "SignificantMidnight7", "body": "You picked a perfect time"}, {"id": "fkuzam2", "author": "DrizzyDrizzt", "body": "Honestly this looks like one of those photos that would be in a museum and 90 years. \"A woman deciding to get vaccinated despite having anti-vax parents\" -2020"}, {"id": "fkv3npr", "author": "adamant0720", "body": "Yes! Congrats! Good for you! \n\nSorry to know your parents are so poorly misinformed."}, {"id": "fkv51zw", "author": "DumbassAustralian", "body": "Fuck this sub is trash now"}, {"id": "fkvd7ow", "author": "Deaddybearphoto", "body": "I have to ask, how dies it feel to be I control of your own body autonomy after being raised in that sort of household,. This is an open question to anyone with antivax parents"}]}