{"id": "1i1zq2", "title": "I was told this subreddit would enjoy this quite a bit.", "url": "http://i.imgur.com/55o75hQ.jpg", "subreddit": "humorousreviews", "author": "GetThatSwaggBack", "text": "", "comments": [{"id": "cb0816s", "author": "SirJefferE", "body": "5 hour energy is approximately 200 milligrams of caffeine (The other ingredients do very little in regards to energy)\n\n22 of those is 4400 milligrams of caffeine. The median lethal dose of caffeine is approximately 200 milligrams per kilo of body weight. Doing this -probably- wouldn't kill you, but would definitely be enough to cause \n>>restlessness, fidgeting, anxiety, excitement, insomnia, flushing of the face, increased urination, gastrointestinal disturbance, muscle twitching, a rambling flow of thought and speech, irritability, irregular or rapid heart beat, and psychomotor agitation.\n\n>> In cases of much larger overdoses, mania, depression, lapses in judgment, disorientation, disinhibition, delusions, hallucinations, or psychosis may occur, and rhabdomyolysis (breakdown of skeletal muscle tissue) can be provoked\n\nI had 1.6 grams once over the course of an hour. It was an interesting time."}, {"id": "cb094jd", "author": "Gil_V", "body": "You were given good advice."}, {"id": "cb2w7bj", "author": "Cobrapants", "body": "When I have too much coffee, I always end up yelling \"I CAN SMELL SOUNDS.\" "}, {"id": "cb2ky5f", "author": "-Clarkasaurus-", "body": "Reviewed by penfifteen."}, {"id": "cc97ud0", "author": "toleran", "body": "Most caffeine I ever had was when I worked at a Starbucks and a coworker dared me to full one of their large cups (like 20oz maybe?) with espresso shots. I don't remember exactly how many shots fit in there, but I'm pretty sure I teleported home immediately afterward.\n\nI also smelled like coffee for at least the rest of the day."}, {"id": "cb0tcpg", "author": "GetThatSwaggBack", "body": "Thank you guys so much, 21 hours and already the top post in this subreddit? thank you so much!"}, {"id": "cb07ifn", "author": "mrkamikaze5", "body": "Oh god my sides... 10/10 would read again."}, {"id": "cb8m500", "author": "5teak5auce", "body": "i dont think i have laughed that hard since osama bin laden died."}]}