{"id": "29kd1x", "title": "My dead girlfriend keeps messaging me on Facebook. I’ve got the screenshots. I don’t know what to do.", "url": "https://www.reddit.com/r/nosleep/comments/29kd1x/my_dead_girlfriend_keeps_messaging_me_on_facebook/", "subreddit": "nosleep", "author": "natesw", "text": "Tonight’s kind of a catalyst for this post. I just received another message, and it’s worse than any of the others. \n\nMy girlfriend died on the 7th of August, 2012. She was involved in a three car collision driving home from work when someone ran a red light. She passed away within minutes on the scene.\n\nWe had been dating for five years at that point. She wasn’t big on the idea of marriage (it felt archaic, she said, gave her a weird vibe), but if she had been, I would have married her within three months of our relationship. She was vibrant; the kind of girl that would choose dare every time. She was happiest when camping, but a total technophile too. She always smelled like cinnamon.\n\nThat being said, she wasn’t perfect. She always said something along the lines of, “If I kark it first, don’t just say good things about me. I’ve never liked that. If you don’t pay me out, you’re doing me a disservice. I’ve got so many flaws, and that’s just part of me.” So, this is for Em: the music she said she liked and the music she actually liked were very different. Her idea of affection was a side-hug. She had really long toes, like a chimpanzee. \n\nI know that’s tangential, but I don’t feel right discussing her without you having an idea of what she was like. \n\nOnto the meat. Em had been dead for approaching thirteen months when she first messaged me. \n\n---\n[**September 4, 2013.**](http://i.imgur.com/UMh0nZl.png) This is when it began. I had left Emily’s Facebook account activated so I could send her the occasional message, post on her wall, go through her albums. It felt too final (and too un-Emily) to memorialise it. I ‘share’ access with her mother (Susan) - meaning, her mother has her login and password and has spent a total of approximately three minutes on the website (or on a computer, total). After a little confusion, I assumed it was her.\n\n---\n[**November 16th, 2013.**](http://i.imgur.com/y0yzVaj.png) I had received confirmation from Susan that she hadn’t logged in to Em’s Facebook since the week of her death. Em knew a lot of people, so I instantly assumed this was one of her more tech savvy ‘friends’ fucking with me in the worst possible way. \n\nI noticed pretty much immediately that whoever was chatting with me was recycling old messages from [Em and my’s shared chat history.](http://i.imgur.com/fw80ZJG.png)\n\nThe ‘the wheels on the bus' comment was from when we were discussing songs to play on a road trip that never eventuated. ‘hello’ happened a million times.\n\n---\nAround **February 2014**, Emily started tagging herself in my photos. I would get notifications for them, but the tag would generally always be removed by the time I got to it. The first time I actually caught one, it felt like someone had punched me in the gut. ‘She’ would tag herself in spaces where it was plausible for her to be, or where she would usually hang out. I’ve got screenshots of two (from April and June; these are the only ones I’ve caught, so they’re a little out of the timeline I’m trying to write out):\n\nhttp://i.imgur.com/X9G5agJ.png\n\nhttp://i.imgur.com/55FwXKt.png\n\nAround this period of time, I stopped being able to sleep. I was too angry to sleep. \n\nShe would tag herself in random photos every couple of weeks. The friends who noticed and said something thought it was a fucked up bug; I found out recently that there have been friends who have noticed and didn’t say anything. Some of them have removed me from their Facebook friends list.\n\nAt this point, some of you may be wondering why I didn’t just kill my Facebook profile. I wish I had. I did for a little while. On days when I can’t get out there, though, it’s nice having my friends available to chat. It’s nice visiting Em’s page when the little green circle isn’t next to her name. I was already socially reclusive when Em was alive; her death turned me into something pretty close to a hermit, and Facebook and MMOs were (are) my only real social outlets.\n\n---\n[On **March 15th,**](http://i.imgur.com/KIL2Mx5.png) I sent what I assumed was Em's hacker a message.\n\n---\n[**On March 25th**, I received an ‘answer’.](http://i.imgur.com/j3HwZzv.png)\n\nIt wasn’t until I was going over these logs a few months later that I noticed she was recycling my own words as well.\n \nMy response seems kind of lacklustre here. I was intentionally providing him/her with emotional ‘bait’ (‘This is actually devastating’) to keep them interested in their game; I was working off the assumption that the kind of person to do this would be the kind of person that would thrive on the distress of others. I was posting in tech forums, looking for ways to track this person, contacting Facebook. I needed to keep them around so I could gather ‘evidence’.\n\nBefore anyone asks, yes, I had changed the password and all security info countless times.\n\n---\n[**16th of April.** I receive this.](http://i.imgur.com/uvadlGa.png)\n\nThis seems like word salad. Like all our conversations so far, it’s recycled from previous messages she’s sent.\n\n---\n[**29th of April.**](http://i.imgur.com/FGmhuUQ.png)\n\nI hadn’t discovered any leads. Facebook had told me the locations her page had been accessed from, but since her death, they’re all places I can account for (my home, my work, her mum’s house, etc). My response here wasn’t bait. ‘yo ask Nathan’ was an in-joke too lame worth explaining, but seeing ‘her’ say it again just absolutely fucking crippled me. My reaction in real life was much less prettier. I’m not expecting my bond back.\n\nHer last few messages had started to scare me, but I wouldn’t admit it at this point.\n\n---\n[**8th of May.** I don’t really have the words for this.](http://i.imgur.com/GNL8TcO.png)\n\n‘FRE EZIN G’ is the first original word she’s (?) made. This has given me nightmares that have only started to kick in recently. I keep dreaming that she’s in an ice cold car, frozen blue and grey, and I’m standing outside in the warmth screaming at her to open the door. She doesn’t even realise I’m there. Sometimes her legs are outside with me.\n\n---\n[**24th of May.**](http://i.imgur.com/z295fHw.png)\n\nI wasn’t actually drunk. She wasn’t an affectionate girl, and it always embarrassed her to exchange ‘I love you’s, cuddle, talk about how much we meant to each other. She was more comfortable with it when I was boozed up. I got fake-drunk a lot.\n\nHer reply is what prompted me to finally memorialise her page, thinking it might help curb this behaviour. It might seem innocuous compared to her previous message - it’s pasted from an old conversation where I was trying to convince her to let me drive her home from a friend’s. \n\nIn the collision, the dashboard had crushed her. She was severed in a diagonal line from her right hip to midway down her left thigh. One of her legs was found tucked under the backseat. \n\n---\n[**Going back in time. 7th of August, 2012.**](http://i.imgur.com/ujUNJQm.png)\n\nThese are logs from the day she died. She was usually home from work by 4.30. This, alongside a couple of voicemail messages, is the last time I talked to her under the assumption that she was alive. You’ll see why I’m showing you these soon.\n\n---\n[**Yesterday. 1st of July, 2014.**](http://imgur.com/W6qzAZI)\n\nI memorialised her page a couple of days after I received the message about walking. Until today, she’d been quiet; she wasn’t even tagging herself in my photos. \n\nI don’t know what to do anymore. Do I kill her memorial page? What if it is her? I want to puke. I don’t know what’s happening. \n\nI just heard a Facebook alert. I'm too afraid to swap windows and check it.\n", "comments": [{"id": "cim04aj", "author": "neckbeard_paragon", "body": "Good thing I read this in the middle of the fucking day. I'm gonna go do my taxes or something. "}, {"id": "cilsgvn", "author": "acematt", "body": "I hope you don't take this the wrong way, as your ordeal seems truly terrible.  I would ask someone else to change the password and see what happens.  From a logical standpoint, it makes far more sense that you are actually doing these things yourself, to yourself, then your departed loved one from the grave.  The messages are using your words, and your thoughts.  Have someone you trust change it and not tell you the password.  I hope your situation improves."}, {"id": "cilt9pi", "author": "Talking_Head", "body": "When my wife died I immediately deleted all her accounts- gmail, Facebook, Twitter, Netflix, etc. and wiped her phone clean without reading anything. Sometimes I regret it, but after reading this I don't."}, {"id": "cimkn0k", "author": "krustyloustudio", "body": "the thing that gets me about this story is the \"So cold\" and \"Freezing\" comments. A few years ago when flip phones were still a thing, i got the creepiest text. My best friends Chris' brother Pete (who was like my big brother I never) had killed himself. Fast forward a few years to one day when I was thinking about Pete all day randomly and I receive a text from Chris that says \"so cold 0 chills\" then it said \"freezing\" I replied to Chris saying \"what the hell are you talking about lol\" He didn't reply just another text saying \"where am I?\" It also said \"Pete\" as well but this is going back almost ten years ago so I can't fully remember what else it said. \n\nSo I call Chris laughing saying are you having a stroke or something? He said he has no idea what I'm talking about. So I explain to him the text I got thinking he pocket texted me or something. He checks his phone and nothing is in his sent box. He's FREAKING out saying he didn't send it and starts telling me that he was thinking a lot about Pete the last few days as well. Pete had been dead at least 6 years at this point so it was odd that we both had him heavily on our minds that particular day. Also to receive that text. I know Chris would never and I mean NEVER joke about Pete texting me. He was almost in tears when I read the text. \n\nSo seeing the cold and freezing thing here on a screen sent chills down my spine like i haven't had in a very long time. Regardless of this being true or not it definitely struck a nerve."}, {"id": "cily56z", "author": "washbelly", "body": "There is one other person who may be even more traumatised than Nate. She has lost her Daughter. She has access to the page. Susan may be the one who has disassociated and is trying to bring her beloved Daughter back to life."}, {"id": "ciltip2", "author": "natesw", "body": "**UPDATE**\n\nI checked the alert. I heard it as I was compiling and editing the post. This was the message.\n\nhttp://i.imgur.com/PMdhkfm.png\nhttp://i.imgur.com/DihTyeh.png\n\nThat's my door. That's my computer. It's taken from outside. I got the message three hours ago but didn't check it until now. \n\nI'm on my tablet in my garage. Zen for now. Going to drive to friend's. Forgot to open the garage door in my panic so building up the nerve to get out to do that now. "}, {"id": "cilxivq", "author": "dntbstpd1", "body": "Just me, but do some of the pics look like unix commands? For example, l*, -12, -15. \n\nIn my line of work we use l* to list items in a directory. We can use -12 to indicate 12 lines above the item we were listing/searching for. \n\nIs it perhaps that someone is using a unix command to simply display your previous messages, etc?"}, {"id": "cim7u6j", "author": "natesw", "body": "I should be scared. I've occasionally opened a heart\n\njust fucked up It's very not me\n\n    She's more real to me\n     \nin that state"}, {"id": "cils3g4", "author": "MrPrezbo", "body": "Have you considered that you may be the one writing these messages as Emily subconsciously?\n\nA few key pieces of information:\n\n1. You have changed the password multiple times. I don't know a lot about password cracking, but unless someone has a keylogger trojan installed on your computer, it should be very difficult to consistently log on as her.\n\n2. \"She\" knows things that only you and those closest to her know, such as the extent of her injuries.\n\n3. You are obviously traumatized by losing someone you care about. Anybody would. It's not outside the realm of possibility that you are suffering mentally from this loss. Receiving \"messages\" from your dead girlfriend is only compounding this trauma.\n\n4. The locations of her messages are only places you have been. As close to proof as we got.\n\nPerhaps, subconsciously, you are unable to let her go. You could very well be disassociating (a common side effect of PTSD) and logging in as her, or suffering from memory lapses, for obvious reasons.\n\nMy thoughts are with you. Perhaps you should speak with a friend or a therapist. You know she is gone. The onus is on you to be able to move on in a healthy manner.\n"}, {"id": "cilv4qe", "author": "_Kryptix_", "body": "Listen, I know this sucks and is incredibly hard to accept but you are most likely doing this to yourself. I say this as someone who did something similar to myself because I couldn't handle the situation. \n\nPersonally, I would send my self messages without realizing it, mostly in my sleep, or if i was really stressed I would do it when I would zone out or when I would day dream.\n\nLook at the signs man, no matter how hard they are to read, they are there. She only messages you at night or randomly hours before you get them, and responds instantly when you are stressed from the message. Your friends have defriended you because of it? Maybe because they see the signs that you cant, the way you act or the things you say without you realizing it. Take this as \"food for thought\".\n\nMy advice, seek professional help my friend, the human psyche is nothing to fuck with and you are doing a number on yourself. No one blames you for missing her, no one is at fault for wanting attention from her or anyone else. This path you are on is not a good one, I just hope you seek help before its too late."}, {"id": "cilsrqq", "author": "Iceis", "body": "My aunt who passed away earlier this year had a facebook account created to look identical to her own page and started sending messages to all the 'Family members'. Started out the same way. Said Hello over and over. It is a huge scam going on right now; A very disgusting one.\n\nIf someone can tell me how to blur out the names on the screenshots I can post a picture of my uncle letting people know that the person contacting them was not her nor done on her account.\n\nEdit: Sorry guys I posted the picture but was immediately alerted that I hadn't covered some names and I can't find where I missed. Now I'm scared to post again. >.<\n\nEdit 2: Here I cropped the hell out of it. http://imgur.com/tnOO3dl\n\nEdit 3: I forgot to explain how very sorry I am that this is happening to you. It's sick and really hurt when it happened to me. I always assumed it was some kid who didn't understand just what they were harming. When they grow up they will regret this."}, {"id": "cn6pyfu", "author": "tiff-the-great", "body": "It really upsets me that we will probably never get an update with this."}, {"id": "cilsrxi", "author": "lalaloopyla", "body": "http://i.imgur.com/n5jb79k.png\n\ni threw it in Photoshop to try and see what was in the shadows.... it... looks like a floating heart.\n\nEdit: also theres nothing else back there, when i adjusted the levels it would have picked up on SOMETHING if it wasnt just a dark room."}, {"id": "ciluz1d", "author": "indoloks", "body": "This is one of the creepiest things I have seen on reddit. "}, {"id": "cilqxkl", "author": "uknowthetruth", "body": "Tell her you love her and it's okay to move on. You'll see her soon. Then kill the page and move on with your life. If it's a sick joke, maybe they will realize what they did wasn't funny. If it's something else, maybe she can move on. "}, {"id": "cimaila", "author": "JustSpeakingMyMindOk", "body": "I'm Native American, we have beliefs towards the dead and how they pass on to the spirit world and we have a ritual to give them food/beverages and their belongings to them from this world to the next.\n\nIf you have a fire place at home or at your friends home, start a fire and cook up food and place it on paper plates (paper forks etc, they need their utensils, your loved ones *aren't* savages who eat with their hands)\n\nSay there names, tell them you love them and that this is for them.\n\nAfter the food burns, (the food moves on from this world to the next) you place their belongings. (***Notice how Emily is always freezing? and says she has a jumper in the closet/whatever***, take that same jumper/coat and place it in the fire. After it burns it will be taken from this world to the spirit world and they'll receive it.)\n\nYou can burn whatever belongings she use to have that you want given to her and she'll get them.\n\nJust remember to say her full name (first, last and middle) and that the stuff is for them and that you love them etc. (keep it short)\n\nMaybe by doing this you'll finally get some closure.\n\nI don't know. It's just something my Native Grandparents and Elders have taught me as a child growing up.\n\nEdit: Spelling.\n\nEdit #2: Because I think...\n\n\nHis girlfriend (supposidly in the picture) is dead wearing a bikini (the heart on the bottom half) and this is why she's freezing and she wants her clothes. (Standing in her closet) \n\nThat's why I brought up the suggesting of duing the ritual (Called \"The Burning\", by my Native Elders) \n\n(For some reason she ended up in the Afterlife in only her bikini and wants the rest of her clothing so she wouldn't be freezing anymore)"}, {"id": "cilrvia", "author": "shmee16", "body": "I'm not trying to be rude but what if its yourself? Like it's kind of a 'Fight Club' situation. Maybe you're not conscious of what the 'other you' is doing. You even said yourself that the location of the messages being sent from this 'Emily' is places you've been. Maybe it's just you trying to hold on to your love.\nAgain, not trying to be rude. I'm sorry for your loss. Stay strong! "}, {"id": "cilvs6e", "author": "bloodloverz", "body": "Fuck this shit really. It's 2 am and I am living alone. FUCKING shadow with legs a belt and clearly visible shoulder. And now pictures coming from where that shadow came from. Ive gotten goosebumps for 40 minutes now. Im starting to feel cold..."}, {"id": "cilqrb8", "author": "extrasmallbunch", "body": "Ask her specific questions that can be answered with pieces of old conversations.  If she is unable to get any other information, she may be able to piece things together a bit easier without having to struggle.  I wish you the best, OP.  This sounds so heartbreaking..."}, {"id": "ciopq7t", "author": "genesmodel", "body": "I found a fatal accident august 7th 2012 south wales. Since some people I still commenting I figured i would post this. This doesnt fit 100% with OP but some striking similiarities. 2 teenage boys in south wales were in a motorbike accident and one was killed. The names were not revealed but a picture of the memorial reads \"RIP NATH\" next to a heart (noting the unexplained heart in OP's earlier picture). Also the boy who survived had a broken leg...(theme) This happened in broken hill, lots of trails around and LOTS of camping grounds (OP's gf liked camping). Also grey street is at a national park outside sidney..(maybe trail there?) http://www.abc.net.au/local/stories/2012/08/07/3562400.htm link to story\njust the picture http://imgur.com/yKKAwDj\n\n\nON another note. I noticed that freezing was broken apart into FRE EZIN G is broken into 3 making it look like a code. add the number of the corresponding letters in each group  (i.e. f-6 R-18 E-5 =29..) you get 29-44-7. according to asis.com that is depature, perdition (hell), and then completness and perfection to the end. perhaps perdition in this case could be pergatory.\n\nand... genisis 44-29 \"If you take this one from me too and harm comes to him, you will bring my gray head down to the grave in misery.\" This is referring to god having already took one of this mans 2 sons (like the motorbike accident) gray occuring again, seemingly a theme.\n\nWell thats how i spent the past 4 hours. Probably just coincidences but i was entertained.\n"}, {"id": "cip9hi6", "author": "vrsx", "body": "I've seen people requesting a timeline, so I typed one up as best as I could. \nhttps://docs.google.com/document/d/16-FWvimWnG2vHu_MUjAjEnr6ULZ3xH7gd2XsqR2Unu0/edit?usp=sharing\nHope this helps some of you :)"}, {"id": "ciltd6w", "author": "ShockerOnShockStreet", "body": "Many of these messages seem to be sent late at night or at very least sent long before you can reply. Set up a camera by your computer. Maybe you are the one typing from her account. You may not even be aware of your actions if the grief worked it's way that deeply into your mind (also isolation can cause you to forget chunks of time or perceive it incorrectly). Alternately, the paranormal explanation could be that she is typing through you, and typing into her Facebook account to identify that it's her and that you haven't gone mad just jotting random messages onto a piece of paper or something like that.  "}, {"id": "cim2bey", "author": "dissonysus", "body": "Uh, guys...\n\nhttp://fotoforensics.com/analysis.php?id=8fb6deff2a2d9ca9143ac64c41f7bf6cd4311f87.526948\n\n\nAnyone else see a person in the photo with the creepy \"face\"? Here's an outline of it: http://i.imgur.com/8SJOLbB.png"}, {"id": "cimgzsv", "author": "guicoelho", "body": "IDK if I should post this but this is clearly fucked up. A post containing this screenshot just got deleted! The strange part is... it was deleted when I sent my comment and it's one of the few (if not the only) comment with hugh karma deleted at this thread.\n\n\n\nThe links:\n\nhttp://imgur.com/nofVBtb\nhttp://imgur.com/lR7jXio\n\n\n\nShit"}, {"id": "cilvu6h", "author": "CaptainPillowLicker", "body": "I find it interesting you have not replied to a single person who has suggested you were typing the messages, OP (Unless I missed it). I think that is a very real possibility though. I say give her mom complete control over the Facebook page (or someone more tech savvy in her family) and see if the posts continue. As others have said, the mind can do some pretty incredible/terrifying things when in such a state of mourning or shock. "}, {"id": "cilqugj", "author": "ryanprobro", "body": "http://imgur.com/NZXb9iO what is that in the door??"}, {"id": "cilv1uo", "author": "Massive9", "body": "The trail that was mentioned in one of her first messages, does it have any importance in the relationship between you two? If so, maybe she's asking you to go for one final walk with her. I feel like the wheels on the bus comment is her way of asking you to go there. After time and you still haven't gone maybe she's starting to feel like you wont ever go. Maybe you should grab a sweater of hers and go to the trail. Take a slow walk, stop at the usual places you would and just talk to her. Tell her you miss her, and tell her you're there to say goodbye. It may be the release you're both looking for. Afterwards you could message her either with a simple I love you goodbye or something else. Or you could not say anything.  One thing for sure if you do go make sure you take your phone, if it's her only way to communicate you want to be sure she has the opportunity to do so while you are there."}, {"id": "cin9juj", "author": "lukehiatus", "body": ">I'm on my tablet in my garage. Zen for now. Going to drive to friend's. Forgot to open the garage door in my panic so building up the nerve to get out to do that now.  \n>Zen for now.  \n>zen for = frozen  \n>FROZEN  \n\nSo it seems it was definitely an auto-correction (or something more?)\n\nHe hasn't posted in over a day. If you read his last reply backwards...\n\n\"In that state, she's more real to me, just fucked up it's very not me, I should be scared. I've occasionally opened a heart.\"\n\nConclusion: He was too scared to move (frozen) or open the garage door, and died of carbon monoxide poisoning from his car."}, {"id": "cilwdak", "author": "StormFaction", "body": "What the honest fuck...I dated a girl named Emily (we all called her Em for short), with a mother named Susan, who died by freezing to death in her car.  Dead serious.  The only thing that doesn't fit is that she didn't die in a car crash and that she passed at 18, and definitely didn't date anyone for that long.  What the fuck."}, {"id": "cilu5qz", "author": "lawn_gbord", "body": "Every. Single. Fucking. Picture. Gave me goosebumps like never before. Someone else mentioned a strange, prickly feeling. And I have to say I agree, this isn't a regular case of the heebie jeebies, this is full on what the fuck is the hair on  my neck standing so tall for.   \n\nI'm so sorry Nathan, honestly. I'm sorry you had to endure such heart ache with her death, but  I think she wants you to move on. \n\nHave you cried? I know it's a silly question but when my mom passed away, I didn't cry for close to a year or so after her death. Have you released the pent up rage and grief that is bottled inside your heart? Maybe she can't leave until you do, she wants you to live and flourish happily, she wants you to live to the potential she saw in your eyes. Tell her how  much you love her, and how much her presence in your life meant to you, and that you will do everything in your power to live to be the best you can be. \n\nOr if it's some sick joke, i'm so sorry for that too. \n\nBut the messages seem too robotic.. they seem too robotic to be written by human hand. Like as if they are being choked out, and whoever it is that is writing them is doing so through different planes of existence. Explaining the recycled messages. And the one attempt she tried to produce original content, the word was chopped up, again, like it was being choked out \n\nFRE EEZIN G"}, {"id": "cilqbhn", "author": "SleepySpirit", "body": "Wow... That's just wierd and actually a bit heartbreaking.. I'm so sorry about her.. dunno wut to say .."}, {"id": "cjngc4t", "author": "tiff-the-great", "body": "So this is the timeline starting from yesterday:\n\n8/10/2014\nOkay, lets see.\nSo I'm guessing you know about the EmNatFor account posting cryptic as fuck shit and you can find the translations here: http://www.reddit.com/r/nosleep/comments/29kd1x/my_dead_girlfriend_keeps_messaging_me_on_facebook/cjmkxdl\n\nThere is also a picture, but upon googling, I found that it belongs to a Russian article about an accident, but i'm not sure if it's related. You can find that stuff here along with the cryptic fucking weird wiki post: http://www.reddit.com/r/nosleep/comments/29kd1x/my_dead_girlfriend_keeps_messaging_me_on_facebook/cjltnjv?context=3\n\nOther than that, we're pretty much waiting for the new Emily/Nate account to post again.\n\nOh, and incase you want to view all the comments the new account has posted, you can find that here: http://www.reddit.com/user/EmNatFor\n\nDid I miss anything guys?\n\nEdit: Added text for Wiki post.\nEdit: Here are SS of the wiki links. http://imgur.com/IofXkzN & http://imgur.com/O6EJfe1\nEdit: EmNatFor's overview shows all comments have been deleted!\n\n/u/skenyon02 caught this last night before it was deleted:\npab kom txhob tag nrho cov no thov lawv tsis xav kom koj nyeem kuv cov post pab kuv ob txhais ceg khov tsis tau txav\n\n796f7520676f696e6720646965lif eart\n\n*\"She\" knows things that only you and those. alcor. closest to her know, such as the extent of her injuries. SHhe kNo O ws Th i z st OP*\n\nThis translates to: to avoid all this they do not want you to read my post helped me strong legs can not move\n\nHere is the picture link: http://imgur.com/T6c6OrG\n\n8/11/2014\n\nIt appears that /u/EmNatFor's comments have been deleted yet again! Luckily /u/Jminka copied the text before it was deleted:\n\n*T He En D <ClO is koj tam sim not tuaj nrog kuv your kheej tuag fcs heev txias kev pab thov pab kuv thov i .im gur. com / EJM K Cmv.jpg AM 1? 5603 6465616420627261696e2073706c6974 796f7520676f696e6720646965\nTranslation The end close you now eat with my own death fcs very cool service request help me please* \n\ni.imgur.com/EJMKCmv.jpg (This is a very striking image)\nNo idea about the numbers.\n\nHere is the image {TRIGGER WARNING; NSFW: THIS PICTURE IS GRUESOME AND MAY DEPICT SEXUAL ASSULT, PROCEED WITH CAUTION}\nhttp://i.imgur.com/EJMKCmv.jpg {The picture shows a young Mexican girl laying in the grass with her head angled revealing a gunshot Wound to her head. She appears to only be in a bra. There are scribbles all over the picture, possibly from MS paint. This may be to prevent someone from tracking down the source.}\n\nI restored the image and was able to trace it back here:\nhttp://www.porjati.net/awful/12256-raznoe-uzhasnoe-2.html {TRIGGER WARNING; NSFW - THIS LINK CONTAINS HORRIFIC IMAGES OF DEAD AND SOME MUTILATED PEOPLE}\nhttp://www.documentingreality.com/forum/f10/young-woman-found-bullet-head-138827/ {This is just a forum post}\nThe article suggests she was from Mexico and died from a gunshot wound to the head.\n\n/u/orgulus took a plunge and conerted from hex to ascii and got this:\nResult: 796f7520676f696e6720646965 converts to: you going die\nResult: 5603 6465616420627261696e2073706c6974 796f7520676f696e6720646965 converts to: Vdead brain splityou going die\n\n\nAlso, the word 'LifeArt' and 'Alcor' were taken from the number series.\nLifeArt is an Australian company that makes personalized coffins with pictures.\nAlcor is a cryonics company.\n\n\nAlso, /u/shelzymac and I both messaged /u/EmNatFor and recieved the same reply: http://imgur.com/2LtSI8B\n\n\n\nDid I miss anything?\n\nEdit: Format\n\nEdit: Picture description.\n\nEdit: /u/EmNatFor IS FUCKING GONE!"}, {"id": "cinxyu8", "author": "incotb", "body": "THIS MIGHT HELP WITH SOMETHING, I GUESS\n\n\nSo I decided to check on G.Maps for a Grey St or Grey Street in New South Wales (after seing this https://i.imgur.com/ujUNJQm.png)\n\nThere are many Grey St's in South Wales, but at the same time I looked for Mount Druitt and here's what I found:\n\nSince there are many Grey St's in that area, I looked for one that had any connection with Mt Druitt or Mt Trickett. \nIn that screenshot, he is answering about someone's whereabout, and I think no one would be stading just in the middle of a street. \n\nHOWEVER, there's another Grey St, that's not really a street: its a Sandwich Shop named \"Grey St\" and its kinda far, but not that far, from Mount Druitt\n\nI linked the two places on google maps:\n\nhttps://www.google.pt/maps/dir/Mt+Druitt+NSW,+Australia/Grey+St,+Silverwater+NSW+2128,+Australia/@-33.8176124,150.8859982,12z/data=!3m1!4b1!4m13!4m12!1m5!1m1!1s0x6b12908f9ba83c33:0x5017d681632c230!2m2!1d150.8167644!2d-33.7661974!1m5!1m1!1s0x6b12a35651f91b79:0x22ccc715ae08ce68!2m2!1d151.0452432!2d-33.8394987\n\nI dont know if this can help with something, but at least its something in South Wales, not that far from Mt Druitt\nEDIT: the sandwich shop street is actually named Grey St too, my bad\n\nEDIT 2: Check out the door at the house with the small truck next to it https://www.google.pt/maps/@-33.76617,150.816608,3a,41y,214.1h,87.03t/data=!3m4!1e1!3m2!1sHc-2RAXZAGIAq-OCyyh5EQ!2e0   \n\nthat's at Mt Druitt, and it looks like OP's door/window. Although i realize it is not op's house\n\nEdit 3: i just wanted to find an house that had a window/doorway like that, so we could assume other houses at SW have similliar characteristics and help prooving that OP does in fact live in SW. Since then I found some other houses with similliar windows/doorways.\n"}, {"id": "cipj07h", "author": "____blank____", "body": "Anyone else have the feeling that the next reply won't come until august 7th?"}, {"id": "cilvopd", "author": "jericon", "body": "Personally, I do not believe in this kind of paranormal activity.  So my gut says it is someone pranking you in a horrible fashion, or as someone else mentioned, yourself doing it subconsciously to help you deal with the loss.\n\nWhat I would recommend is lock the facebook account down hardcore.\n\nFirst Enable [Login Approvals](https://www.facebook.com/help/148233965247823) and [Login Notifications](https://www.facebook.com/help/162968940433354).  This will require an additional code to login, and also notify you when a new login is made.\n\nYou can also go and check the IP address of the [current active sessions](https://www.facebook.com/help/174571515935086).  Maybe this will help you track down who is behind this, if anyone.\n\nAnother action you could take is to [memorialize] (https://www.facebook.com/help/359046244166395/) the account.  A memorialized account exists as it is, but is locked down.  It disables logins to the account, and prevents modifications to the account.  If privacy settings allowed for it, you can still message the person, post on their wall, and view all of their content.  The account also will no longer show in public searches.\n\nI think memorialization is your best bet here, as it allows you to continue doing what you had been doing, but locks down the account so no one can access it.\n\n\n\n"}, {"id": "ciml3fm", "author": "poppunkprincessx", "body": "I keep coming back to this post every hour to check for updates."}, {"id": "cilqatn", "author": "idunno_man", "body": "If somebody is messing with you, it's a sick, sick joke!"}, {"id": "cimeqjd", "author": "a_drunk_Jon_Snow", "body": "Contact Mark Zuckerberg, he'll want to know ASAP so he can buy the afterlife and figure out a way to display advertisements while you're dying/a ghost. - “When I stand before God at the end of my life, I would hope that I would not have a single bit of talent left, and could say, 'I used everything you gave me...except Facebook” "}, {"id": "cilsc0y", "author": "CG1991", "body": "Have you noticed certain messages repeat themselves? I.e \"no chance of passing\".\n\nHave you considered there's any significance to these repeated messages? Can you piece them together?\n\nI only had a quick look but I saw \"Nathan\" \"I\" \"no chance of passing\". If we look at things from the illogical supernatural perspective she could be trying to pass on a message.\n\n"}, {"id": "cn2eerd", "author": "LordStormfire", "body": "This is awful. Five months after the events, may I ask, for closure, what happened in the end?"}, {"id": "cilvkvb", "author": "sleepyshouse", "body": "Ghosts freak me right the fuck out OP, I suggest curling into a ball and crying."}, {"id": "cilyard", "author": "emuly", "body": "Spooky-- my name is Emily, my mother is Susan, I've never been very affectionate, and I also have [creepy long toes like a chimpanzee](http://www.imgur.com/L7Tj4al.jpeg)... I haven't been sending those messages though."}, {"id": "cilz7e2", "author": "ClicheTheCamgirl", "body": "This is truly chilling. Best story of July 2014."}, {"id": "cilvqwr", "author": "Jman311311", "body": "Did anyone else notice that under the part (Yesterday. 1st of July, 2014.) that the time is incorrect (from the original post).  \n\nThe original post shows, \"I rang (name) and they said you left at 4\"\n\nThe response from his g/f's account says \"5\"\n\nThis obviously means that someone is posting this to him (I feel bad for you Nate) and not some virus reposting old messages."}, {"id": "cilrmc5", "author": "this_is_my_work_alt", "body": "I'm really sorry to hear that you're dealing with this, regardless of what the actual facts may be behind it.\n\nDoes the account show up as online via web or mobile? Did she have a laptop that may still have login credentials? Same with her phone. I'd suggest taking a look at anything that might have had her account on it and take an inventory of where those things may be.\n\nYou also stated that the login information has been changed several times, but the user continues to have access. Have you checked your computer for viruses or root kits? If you, by chance, have a trojan on your account, you may have a hacker who's doing this just to inflict emotional damage. \n\nA rootkit would also explain the login coming from your location, as they could be routing the traffic through your computer, and may explain how they've pieced together bits about the accident (have you ever written to someone concerning the details from your home computer?)\n\nI'd also check your cards and online accounts for activity that you don't remember. This may be able to confirm this, if you're unable to find a virus.\n\nPlease follow up if you are/aren't able to find any kind of compromise in your computer. I'd love to try to come up with more possible explanations."}, {"id": "cilzjbl", "author": "JonnyBhoy", "body": "Well, this has upset me more than I thought it would. I have no idea if it's even real or OP fucking with us, but I'm incredibly sad for him.\n\nWhatever it is, I'm going to give my gf the biggest hug when she gets home."}, {"id": "cin1gfn", "author": "ohaijoe", "body": "I've refreshed natesw's overview 10,000 times today. "}, {"id": "ckcwkts", "author": "LK_WINS", "body": "Long time user, first time poster. \n\nI have wasted a ridicules amount of time on this thread. Didn't pay attention to other then OP's postings and comments regarding his posts (completely ignoring for example the youtube videos and everything else that came along from copycats). \n\nStill a mystery how the original post really got to me so much. As with many others here I have been online for so long and read so much weird that I used to believe I was immune to getting obsessive about a forum post :) There is something about the way OP express himself that give me a strong sense of honesty, probably based on years on IRC, ICQ, MSN, SKYPE etc.......after some years you just read between the lines, and this post got me good.\n\nI had so many theories at one point and still keep checking to see if anything is happening but there is not. Marketing value of this post when it was on it's peak must have been 6 figures in USD. So when there is no marketing stunt, no \"post of the month\", no updates and nothing I am left with only the conclusion that OP is mentally in a very unhealthy place and hopefully taken care well care of wherever he might be.\n\nSo when you come to /nosleep for \"scary\" the irony is that one the scariest thing(madness) unfold right in front of your eyes as the story progressed."}, {"id": "ckx0y3e", "author": "Jasondazombie", "body": "\"who are you\"\n\n\"THE FUCKING WHEELS ON THE BUS DUMBASS\""}, {"id": "cilubrk", "author": "Skrendie", "body": "One of my best friends died in a car accident ten years ago (Miguel) when he was 21(he went upside down in a river with his car when he was alone). \nI've always known there was more between heaven and earth, but grasping it is and was always difficult. At first (in the same year he died) I tried to connect with ghosts on an Ouija board. And had so much success connecting with (probably) spirits, that no one could convince me to thinking there is only the biological form of body that we live in (I do want to advice you against using a Ouija board, but that's another story). After that, I researched a lot about it and found people that could connect to spirits (yes, there are enough people that can deceive you, so watch out). At that time I had dreams of him, mostly dreams of me thinking he was still alive (which was probably my subconscious that didn't wanted to let him go).\nThen I went to a hypnotherapist, who put me under light hypnosis (here you can still fully grasp the situation, not as the hypnosis you see on TV). My friend talked with the therapist through me. You could probably understand how this made me a bit confused. I saw images of him in the car and having the accident in first person. Miguel even said he tried to punch the window, but was not successful. I asked his parents about this fact later, and they told me he had a bloody fist after the accident. Then the therapist finally told him to move on.\n\nMiguel was locked on to me for over 4 years, because I was investigating things about the paranormal. For him it was the easiest way to still be with us for a bit. But it did cost me a lot of energy. After the session until now, I haven’t been as tired as the first 4 years after he was dead.\nAs most people don't believe the stuff I sometime tell about spirits/ghosts (even most of my friends), I mostly don't talk about it. But this is my story about spirits. For me\nthis is one of the reasons why I know life is more than a biological coincidence.\nThis is the summarized version of the things I’ve witnessed in this regard. \n\nMy guess is that she may be stuck in the car accident as a spirit. Or that you still keep here around you because you haven't let her go yet. The only thing you can do is wait, indeed tell her you love her, and she can move on. Closing the page is up to you.\n\nSorry for my English, it’s not my native language\n"}, {"id": "cn5bq46", "author": "xfxkewki", "body": "This has got to be the only /r/nosleep post to creep me out. It's past midnight, I'm in a big dark house. Lovely."}, {"id": "cily0hk", "author": "Saarnath", "body": "I have a theory about why she only repeats things you've already said. She may not be able to form her own thoughts, wherever she is. Or it may be too hard to \"input\" her thoughts into the computer. Her energy may be strong enough to send signals and messages, but not strong enough to actually input (a.k.a. type) them. And remember what a ghost is, in the purest definition of the word: A lingering piece of the past that can't move on. \n\nPerhaps you aren't really communicating with her in a traditional sense. The cosmos/her energy is just throwing lingering bits and pieces at you. She isn't forming new thoughts... Just regurgitating old ones. If you really, truly want to know, you have to ask her questions. Ask her and she will answer. Never come out and tell her that she is dead, she might not know.\n\nI would recommend gradually moving on and getting back on track with your own life. It's impossible to maintain this connection with the other side and simultaneously live your own life. You'll never meet anyone else, concentrate on a good job, etc. This is a horrible skeleton to have in your closet. Never, ever invite her to come closer. Never. You can always tell her to go away. I know this is a cliche perpetuated by shows like American Horror Story, but if you tell a ghost to GO AWAY most of the time they will listen. I know this from experience.\n\nMore than likely, part of her essence lingers in the network. You might be dealing with a small shell of her old personality: This is not \"her,\" but a shred of her energy trapped in a thing that she was close to. Since she used the account so often, part of her lingers there. If you want to help her (and you) move on, you need to close the account.\n\nFor my own peace of mind, in closing. Go away. You aren't welcome here and I have nothing for you."}, {"id": "cim9j13", "author": "cutepuppiesRcute", "body": "I'm pretty sure OP is in Australia. He said \"kark\" and he called July 1st yesterday, plus he disappeared between around 1AM and noon in an Australian time zone. \n\nJust saying."}, {"id": "cio5kii", "author": "Guild_Navigator", "body": "I sure hope this isn't a viral campaign for some upcoming horror movie..."}, {"id": "cjsnpmc", "author": "lovescats32", "body": "I still check this post every friggin day for an update even though I KNOW we're never gonna get one. I wonder if this was OP's plan all along..."}, {"id": "cim5hjs", "author": "Hugsnkissums", "body": "Think about this logically. Your girlfriend can't Facebook anymore. That's the reality. These messages you're receiving are coming from a real source. Look at the dates. Account for your actions on those days, perferrably by an outside source. You're involved with this so don't trust your memory. \n\nFirst things first, you need to remove her so this bastard can no longer communicate with you. This is just some sick person's idea of fun and you're paying the emotional price of it all. You have to walk away from this tie to her if you want things to get better. Whose doing it makes no difference. The Internet is full of assholes who are fine with doing emotional pain to people they don't really know. Don't let yourself be the victim any longer. \n\nIt may hurt and it may not be what you want to do, but these \"phantom\" messages took away your choice. You no longer have the freedom to let it go in your own time. Understand this...sticking around will only make things worse. You will only get more emotionally invested in it and it will tear you apart, making you unavailable to move on. \n\nI'm really sorry this is happening to you, but the reality is the dead can't Facebook. Block her, remove her, whatever you gotta do just eliminate that communication from your life. Remember her in other ways. Catching the guy/girl fucking with you will do nothing for you except make you wish it was genuine. Please, get away from this for your own sake. "}, {"id": "cim9weu", "author": "Feygraphica", "body": "What if you sent her a message so she could move on?\n\n\"Emily, you have been in a car accident and died. You can't stay here. I love you, I miss you. But, you have to move on to the next phase in your life. You can't stay here with me even though I wish you were here every single day. It's time to let go. \"\n\nSomething like that?"}, {"id": "cimf5gm", "author": "sarahg312", "body": "This is crazy creepy, especially because I had something similar happen after my father died in 2010 when I was 16. For nearly half a year after his death (coincidentally also a car accident) I would sporadically get messages from his facebook, usually just things like hello or random words. Once he messaged my childhood nickname, which really freaked me out. I never did figure out who or what was messaging me, because at some point facebook deleted his profile (memorializing it wasn't an option at that point)\n\nI hope you figure it out dude and you get some peace of mind. It's been four years and the messages still haunt me."}, {"id": "cimmxrg", "author": "nicolahowe13", "body": "This is where he is! \n\nhttp://imgur.com/sSGeBVv"}, {"id": "cimy9d7", "author": "spacetesticles", "body": "It's a Markov Chain. My friends and I did some speculating over a chat, and one of my friends noticed that OP said his girlfriend was a technophile, so one day she thought it would be silly to fuck around with the Facebook API and create a Markov Chain to play with his head a little because relationships are weird sometimes. And so she set it all up, and then BAM, she died, and now he's left with broken from a Markov Chain she created and it's ruining him. Unlikely, but it's just a theory."}, {"id": "cinuag1", "author": "Investigating", "body": "Hello.\n(Firstly i apologize for my poor english, obviously it's not my native language)\n\nMy daily job is as a Photography Forensics, i work with very very expensive programs (Up to 2000$ pr programme).\n\nAnyway, i tried running a basic ELA on the \"trail\" screenshots, and i can tell you that there is an \"O\" in the middle of the word. How did i find this? This program can detect different layers in the digital picture, thank god he used \"Paint\" as this program leaves A LOT(!!) of trails of the edited picture to start with (Even though he completely covered the word). He actually missed a lot covering the \"Trail\" word, though it is not visible to the naked eye, it certainly is visible to my programs. A friend of mine told me to check this one out and i had some spare time. Back to topic: He missed a lot of the word, and i can bring a \"O\" and something that looks like a \"J\" or \"I\" or \"T\" (Its not written with capital letters), but the \"o\" is definitively visible for my program. I thought this might help.\n\nI will working with these pictures, but they don't have much \"secret\" information.\n\nHere's my other work with images:  "}, {"id": "cinx19c", "author": "theHannig", "body": "There is literally only one thing I'm sure of right now, and that is that you guys should club together and fight crime. The amount you  have managed to find out is insane."}, {"id": "cim3828", "author": "artrag", "body": "this is so fucking sad I want to cry..\n"}, {"id": "cim5921", "author": "kinjinsan", "body": "Your computer is haunted. Drop it into a bucket full of holy water."}, {"id": "civzlld", "author": "vengeance01", "body": "I want to get back to where we last heard from OP. That was the last of the \"reliable\" information. So he says he's going to stay at a friends... Maybe he's still there? I know when im super stressed about things, i just dont deal with them at all until im good and ready. The only perplexing thing is the last message that emulates the way Emily was talking...but it wasn't in the same way. Emily started off very basic with hello. And it was very choppy. OPs last comment was fragmented, sure, but it maintained complexity. If the text manipulation had to be learned, and OP was dead, theoretically he would start at the same place as her...so given that fact I would have to say that's not OP but somehow Emily. maybe he ditched his electronics (tablet he was on) in the garage while it was still logged in? I dunno. Just ideas."}, {"id": "ck8617x", "author": "missupsetter", "body": "I don't know if this was posted previously...I've tried to keep up with all the comments since this was posted, but I figured I'd post anyway...\n\nI was googling around on this story (because it's driving me mad, I want to know what happened/happens!!) and I came across a hacker forum that discussed this story. It seems like the person who posted it was in touch with Nathan and got a screen cap of his facebook logins. Here's the link to the forum: http://www.hackforums.net/printthread.php?tid=4317868\n\nand the screen cap: http://i.imgur.com/Edv9DSQ.png\nShows that the location is in Melbourne..interesting."}, {"id": "cindd4d", "author": "baribaribarto", "body": "made an account just to leave a comment. i hope this hasn't been said before but i thought it was interesting that although emily isn't very affectionate she seems to be dropping love notes left and right~\n\nin the first tagged photo, the heart belt buckle. in the second tagged photo, op's hands are in the shape of a heart and he's holding a bottle of wine from a winery called \"gossips.\" [the label on the bottle is rather sweet.](http://www.wineshop.com.my/images/products/Gossips%20Pink%20Moscato%20Sweet%20Lip.jpg0) it's an australian wine, if you're wondering. it's interesting that these photos get tagged in february. happy valentine's day!!\n\nop also says something about opening hearts in the comments section.\n\nsomething i also found interesting was the frequency of the number three, although i could just be reading into things there.  it's a three car collision, op would have married her three months after meeting her, he receives the message after being approximately three minutes on facebook, emily says hello three times before her first message, the messages start thirteen months later in the year of 2013, the first word of her own (\"FRE EZIN G\") is broken up into three parts, the accident left her in three parts, and hearts have three points\n\nwell maybe that's nothing, but you know.\n\ni love a good mystery."}, {"id": "cils2p2", "author": "AthinaMK", "body": "Reading this made me well up, whoever, or whatever is happening here - you don't deserve to be tormented any more. So sorry for your loss. "}, {"id": "cimgmzt", "author": "Nickster79", "body": "I've read a lot of great threads on here, but this is the first one to actually scare me so badly that I can't sleep. "}, {"id": "cino9ur", "author": "Tuminus", "body": "This guy is a genius. He not only provided us the most disturbing and weird r/nosleep post ever, but also vanished out of nowhere. He leaves us here trying to figure out what the actual fuck happened and I can imagine he reading this while eating some popcorns.\n\nWhat is scarier? The facebook ghost, the pic from outside, or his disappearance? All of them fucking together! That guy is a genius."}, {"id": "cio3eeb", "author": "guardian_ares", "body": "I'm intrigued by this thread. I've done a fair share of searching and I have come up empty handed (no solid evidence.) I found \"Road Deaths Australia-Annual Summaries\" report and went through it. I immediately went to August 7th, 2012. There were two reported fatalities that day (Tuesday), one was a single vehicle at 6:45 a.m. involving the driver (only) which was a female aged 66. The second was a multiple vehicle accident at 5:30 p.m. and the deceased was a male motorcycle rider aged 38. \n\nAnd as I typed that I remembered a couple other posts saying he was dead and whatnot and it kinda creeped me out. Maybe it was him. Perhaps he was rushing to see if she was Ok an \"hour and a half after she got off of work\" and he ran the red light and his person was ultimately severed in two... It'd make more sense since he was on a bike. I ride myself... Jesus.\n\nWhat if he died and she's the one alive posting and suffering from Dissociative Identity Disorder because he ran the light and she was the one who hit him? And she can't cope with it cause she thinks it's her own fault. And that may explain why he (she) posted that about being in the garage and that links up with other Redditors saying he (she) died from carbon monoxide poisoning cause he (she) she wanted to end it himself (herself) which lends more to the fact that we haven't heard anything recently...\n\nI'm starting to creep myself out, I'm gonna go do some gardening. F**k this.\n\nEdit: some spelling and grammar.\n\nEdit #2/3 (link to the report): http://www.bitre.gov.au/statistics/safety/fatal_road_creash_database.aspx <- The report. It says May because that's the month (2014) it's up to date to."}, {"id": "cils4sw", "author": "oldenberg", "body": "Cant r/hacking reach out and do something "}]}