{"id": "3iex1h", "title": "I'm a Search and Rescue Officer for the US Forest Service, I have some stories to tell", "url": "https://www.reddit.com/r/nosleep/comments/3iex1h/im_a_search_and_rescue_officer_for_the_us_forest/", "subreddit": "nosleep", "author": "searchandrescuewoods", "text": "I wasn't sure where else to post these stories, so I figured I'd share them here. I've been an SAR officer for a few years now, and along the way I've seen some things that I think you guys will be interested in. \n\n* I have a pretty good track record for finding missing people. Most of the time they just wander off the path, or slip down a small cliff, and they can't find their way back. The majority of them have heard the old 'stay where you are' thing, and they don't wander far. But I've had two cases where that didn't happen. Both bother me a lot, and I use them as motivation to search even harder on the missing persons cases I get called on. \nThe first was a little boy who was out berry-picking with his parents. He and his sister were together, and both of them went missing around the same time. Their parents lost sight of them for a few seconds, and in that time both the kids apparently wandered off. When their parents couldn't find them, they called us, and we came out to search the area. We found the daughter pretty quickly, and when we asked where her brother was, she told us that he'd been taken away by 'the bear man.' She said he gave her berries and told her to stay quiet, that he wanted to play with her brother for a while. The last she saw of her brother, he was riding on the shoulders of 'the bear man' and seemed calm. Of course, our first thought was abduction, but we never found a trace of another human being in that area. The little girl was also insistent that he wasn't a normal man, but that he was tall and covered in hair, 'like a bear', and that he had a 'weird face.' We searched that area for *weeks*, it was one of the longest calls I've ever been on, but we never found a single trace of that kid. \nThe other was a young woman who was out hiking with her mom and grandpa. According to the mother, her daughter had climbed up a tree to get a better view of the forest, and she'd never come back down. They waited at the base of the tree for hours, calling her name, before they called for help. Again, we searched everywhere, and we never found a trace of her. I have no idea where she could possibly have gone, because neither her mother or grandpa saw her come down.\n\n* A few times, I've been out on my own searching with a canine, and they've tried to lead me straight up cliffs. Not hills, not even rock faces. Straight, sheer cliffs with no possible handholds. It's always baffling, and in those cases we usually find the person on the other side of the cliff, or miles away from where the canine has led us. I'm sure there's an explanation, but it's sort of strange.\n\n* One particularly sad case involved the recovery of a body. A nine-year-old girl fell down an embankment and got impaled on a dead tree at the base. It was a complete freak accident, but I'll never forget the sound her mother made when we told her what had happened. She saw the body bag being loaded into the ambulance, and she let out the most haunting, heart-broken wail I've ever heard. It was like her whole life was crashing down around her, and a part of her had died with her daughter. I heard from another SAR officer that she killed herself a few weeks after it happened. She couldn't live with the loss of her daughter.\n\n* I was teamed up with another SAR officer because we'd received reports of bears in the area. We were looking for a guy who hadn't come home from a climbing trip when he was supposed to, and we ended up having to do some serious climbing to get to where we figured he'd be. We found him trapped in a small crevasse with a broken leg. It was not pleasant. He'd been there for almost two days, and his leg was very obviously infected. We were able to get him into a chopper, and I heard from one of the EMTs that the guy was absolutely inconsolable. He kept talking about how he'd been doing fine, and when he'd gotten to the top, a man had been there. He said the guy had no climbing equipment, and he was wearing a parka and ski pants. He walked up to the guy, and when the guy turned around, he said he had no face. It was just blank. He freaked out, and ended up trying to get off the mountain too fast, which is why he'd fallen. He said he could hear the guy all night, climbing down the mountain and letting out these horrible muffled screams. That story bothered the hell out of me. I'm glad I wasn't there to hear it. \n\n* One of the scariest things I've ever had happen to me involved the search for a young woman who'd gotten separated from her hiking group. We were out until late at night, because the dogs had picked up her scent. When we found her, she was curled up under a large rotted log. She was missing her shoes and pack, and she was clearly in shock. She didn't have any injuries, and we were able to get her to walk with us back to base ops. Along the way, she kept looking behind us and asking us why 'that big man with black eyes' was following us. We couldn't see anyone, so we just wrote it off as some weird symptom of shock. But the closer we got to base, the more agitated this woman got. She kept asking me to tell him to stop 'making faces' at her. At one point she stopped and turned around and started yelling into the forest, saying that she wanted him to leave her alone. She wasn't going to go with him, she said, and she wouldn't give us to him. We finally got her to keep moving, but we started hearing these weird noises coming from all around us. It was almost like coughing, but more rhythmic and deeper. It was almost insect-like, I don't really know how else to describe it. When we were within site of base ops, the woman turns to me, and her eyes are about as wide as I can imagine a human could open them. She touches my shoulder and says 'He says to tell you to speed up. He doesn't like looking at the scar on your neck.' I have a very small scar on the base of my neck, but it's mostly hidden under my collar, and I have no idea how this woman saw it. Right after she says it, I hear that weird coughing right in my ear, and I just about jumped out of my skin. I hustled her to ops, trying not to show how freaked out I was, but I have to say I was really happy when we left the area that night.\n\n* This is the last one I'll tell, and it's probably the weirdest story I have. Now, I don't know if this is true in every SAR unit, but in mine, it's sort of an unspoken, regular thing we run into. You can try asking about it with other SAR officers, but even if they know what you're talking about, they probably won't say anything about it. We've been told not to talk about it by our superiors, and at this point we've all gotten so used to it that it doesn't even seem weird anymore.\nOn just about every case where we're really far into the wilderness, I'm talking 30 or 40 miles, at some point we'll find a staircase in the middle of the woods. It's almost like if you took the stairs in your house, cut them out, and put them in the forest. I asked about it the first time I saw some, and the other officer just told me not to worry about it, that it was normal. Everyone I asked said the same thing. I wanted to go check them out, but I was told, very emphatically, that I should never go near any of them. I just sort of ignore them now when I run into them because it happens so frequently. \n\nI have a lot more stories, and I suppose if anyone's interested, I'll tell some of them tomorrow. If anyone has any theories about the stairs, or if you've seen them too, let me know. \n\n**EDIT: Part 2 is up: https://www.reddit.com/r/nosleep/comments/3ijnt6/im_a_search_and_rescue_officer_for_the_us_forest/**", "comments": [{"id": "cuftz65", "author": "BluRnbw", "body": "Whooooa! Those are good stories but the one that has me tripped up the most is the thing about the staircases.... say what? Are these like ruins or just some random staircases? Do you have any pictures of these? And why are you guys told to NEVER go near them? Any weird stories as to why?"}, {"id": "cug24er", "author": "queen_of_the_spammed", "body": "Not SAR or \"elite\" hiker by any means. But my two stories - and I will post the \"reveals\" because they're honestly mundane.\n\nA few years back, with a large group of Scouts in Butano SP, we were hiking some godforsaken dense forest trail, in the wet california winter rains.  The first night, the racoons rolled a bunch of our bear containers down a gully into a creek. We were able to find them.  The second day, we encountered a road, and a checkpoint. The guard-booth was abandoned. There were no signs, but we concluded that it was an abandoned prison. We adults would have gone in there, but we didn't want to endanger the kids, so we hiked on.\n\nLater that night, right around 1am, I was awakened by the sound of gunfire. It was about 100 + yards away, and it was not pistols. It was some very loud, sharp, poppy guns. Different guns.  It started off slow, and then after a dozen, or so - a pause, then more, then it was steady for maybe 100+ or more, from several different guns.  Then when the other guns stopped, the loudest one kept firing, and it wasn't full-auto, but a lot of rapid fired shots.  Never got the count of the magazine between reloads, but this went on for about 20 minutes in total, then just stopped.  \n\nI got out of my sleeping bag, out of my tent, and hiked about 30 yards through the brush to the other campsite, in the dark, without my light on.  I didn't want anyone else to see me.  I got to the campsite, and the kids were all still asleep, but the other adults had heard it - had no idea what it was. Maybe pot farmers in a gunfight with intruders? Next morning, it was a topic of conversation, but most of the kids had actually slept through it.\n\nAfter we left and got home, I talked to the ranger; and they said that sometimes, people break into the prison, and use the old gun range (unauthorized).\n\nMy other story was camping in Big Sur; Silver Peak.  I was alone, but only about 5 miles from the road.\nI had just finished dinner, and lay down to sleep. After a few minutes, I heard kind of a \"crunch crunch crunch crunch\" sound, that sounded like foot steps outside. I moved my head to try to figure out what direction they were coming from, and they stopped.  I put my head back down, and a few minutes later, they started again.  \"crunch\" \"crunch\" \"crunch\" \"crunch\" - Again, I lifted my head to see what direction they were coming from, or whether it was close.  Nothing.  This cycle repeated a couple of times until I decided to turn over and open my tent flap to get a look around outside with the flashlight.  I was expecting to see a person out there, walking around in the dark, but I saw nothing. Heard nothing. Zipped up, put my head back down, tried to go back asleep.  \nAgain, \"crunch\" \"crunch\" \"crunch\" \"crunch\". Again, lifted my head, it stopped.  I tried to re-adjust, I looked outside again, I couldn't find the source.  It certainly wasn't my heart, because that was thumping like mad.  This kept me awake for hours that evening. I was terrified that there was someone or something out there; who heard my move my head, and stopped walking, only to continue, when they thought I had fallen back asleep. Maybe past midnight; but eventually I fell asleep.\n\nNext morning, I had breakfast, broke camp, and as I set up my tent, I noticed that my head was over a gopher hole."}, {"id": "cufyyib", "author": "cuntdestroyer8000", "body": "Man I have a bunch of these stories. I was in SAR as well, but all my creepy experiences have happened while camping or hiking. \n\nThis one's pretty tame...I almost always camp waaaay out, I'm talking 30-40 miles down unnamed dirt roads, up mountains, in canyons, etc. A couple years ago I was camping alone out on a prairie flat, halfway surrounded by a forest. It's nearly winter and there's not a soul within 50 miles I bet. My big hound dog was with me, as always. It was cooold, like well below freezing, so I had a roaring campfire going. Jake the dog was in & out, he'd wander off for awhile, get cold, and come back for attention and warmth. He has a bell around his collar so I can know where he is. I'm drinking beer and listening to music, so I'm not paying much attention to his whereabouts. Mind you, it's pitch black out there other than the stars. So after about 20 minutes, I hadn't seen Jake, so I call him. Nothing. I turn off my music and call louder. Nothing for about 5 minutes. I hear his bell, so I'm relieved. I heard his bell behind me, which was odd, the treeline was in front of me, where he had been sniffing around earlier. Thinking he was nearby, I relaxed and refocused on chopping some more wood. I could faintly hear his bell jingling behind me still, sometimes closer or further, and I figured he was doing the hound dog's job and smelling all around. I'd say about 40 minutes goes by, and I hadn't heard his bell or seen him. So I call him again, and get up to walk towards the treeline. Big dark forest of ponderosa pine looms in front of me. I shine my fairly bright flashlight around and into the trees. Nothing. No sound, no sight. I'm starting to get nervous, getting \"the willies\" or whatever you want to call it. I hear some crunches in the woods, like sticks and stuff breaking. Not knowing where my dog is, or much of anything other than \"ok I'm going back to the fire where my shotgun is\". I get back to my truck and my fire when I hear absolute PANIC barking from directly in front of me, from the treeline. Tearing across the field is my dog at full tilt. You could never mistake a hound dog's panic bark from a bey or a yip or whatever else, it's unlike anything. He ran behind me for a moment, and then underneath my truck. Here's the creepy part: no bell. He had his collar on, and the bell was clipped to it with a carabiner. Sure as shit I put us both in the cab of the truck for the rest of that frozen night.  To this day I still have no clue who or what was wearing that bell behind me for a few hours on a rural prairie flat in winter. "}, {"id": "cufx39b", "author": "jeepdave", "body": "How about that. I didn't realize the stairs were that common. Came across a set in rural West Virgina. I don't think I was quite 40 miles deep but atleast 10 or better. I thought maybe a house had once stood there but there was no cellar or other debris that would indicate a home was there before. Just a set of stairs with a base that went up maybe one flight. 16 or so steps if I remember right. And sturdy. Could barely Shake em. I didn't climb up though. Worried it might break/fall over and I was alone. "}, {"id": "cui99oq", "author": "killerbenman125", "body": "I went camping at Crater Lake in Oregon, and where we camped it was heavily wooded and there were about 2 or 3 other people besides us. We get there around mid day and we set up, and relax. By now it begins to get dark so we decide to cook some food and call it a day after we eat. Now me, my cousin, and my brother, shared a tent to sleep in so I'd say around 2-3 am rolls around and I have to pee like a motherfucker. Anyways I do my stuff and head back to the tent to find the zipper wide open and my little brother gone. So I start freaking out and I wake my cousin up to tell him what happened and essentially we search until about sunrise and then we call the Rangers. They search for about 4-5 hour and they find him 10 miles away from our campsite and he has no clue how he got there all he has on is his underwear and nothing else now after this whole ordeal our cousin tells us about David Paulidas and his whole research on missing people's in national parks. Needless to say it was the most jarring and disturbing things that has ever happened in my life. It really in all honesty ruined camping for all of us and i had loved camping too. But needless to say Crater Lake is the place to go for some creepy paranormal shit. "}, {"id": "cug022a", "author": "feeling_psily", "body": "When I was in the Boy Scouts of America there was a well known campfire story of \"the man with coal eyes\" basically about a strange man people would encounter in the woods at night that seemed to have coal in his eye sockets. Needless to say, your story about the man with black eyes made my eyes water."}, {"id": "cugkhx1", "author": "Traffix_Lord", "body": "The first rule of stair-club, is not to talk about stair-club! Jesus."}, {"id": "cuftvxf", "author": "BeigePhD", "body": "Holy shit OP, these average person, extraordinary experiences stories really freak me out. Reading this with complete cold chills, ALMOST makes me regret reading alone. Please post more!"}, {"id": "cufx9vy", "author": "greenswampblue", "body": "Maybe the staircase is more of a platform...for addressing followers at secret meetings. I'm really not sure where I'm going with this."}, {"id": "cufutw3", "author": "Kootenaygirl", "body": "You should really email David Paulides with your Search and Rescue stories. He and his son have the largest private database of missing cases. They have a really hard time getting information about them unless its first-hand. Apparently FOIA isn't very forthcoming with missing persons cases or deaths in National Parks or Forests."}, {"id": "cufyh6s", "author": "mrheh", "body": "Welp, No longer have the urge to go camping like survivor man."}, {"id": "cug2dry", "author": "CookiePuck", "body": "When I was really young I had a dream I was walking in the woods. I wasn't lost, I was just in the woods for some reason walking forward. It was pretty dark, just enough to see if I focus on a single tree in front of me, when all of a sudden the forest starts to clear just a bit. It gets a little brighter and there was a staircase in the middle of the woods. And just as you described it.. looked like a staircase right out if a house just in the middle of the woods. so now I'm prety freaked out. If you get any more info about the staircase I'd really appreciate it!!\n"}, {"id": "cugzw6i", "author": "TheKnightsWatch", "body": "You may find it interesting to know that there is a man named Dave Paulides who investigates and documents cases exactly like the ones you describe, and he has accumulated a data set that contains hundreds of cases of strange wilderness disappearance from all over the world. These cases follow a specific pattern that involves circumstances which defy explanation/physics, and often involve a \"bear man\" creature (just like yours). In fact, I bet he would love to hear from you. He has written books on the subject (Missing 411 by Dave Paulides). Perhaps your stories could be investigated further and included in his next book? Most people just vanish completely. Finding someone alive after a strange disappearance like that is a very rare thing for him, and you have two such cases, so I guarantee that Mr. Paulides would love to open up files on them if at all possible. That is what he's up to these days. He's trying to get to the bottom of it this obvious pattern and being very thorough, but he says that there is absolutely no tracking system or database for these, and finds resistance when he inquires through official channels. It's like the people at the top know about this, but don't want it to get out. There are cases that go back 100 years. It's been happening as long as we've been keeping track. "}, {"id": "cufubkt", "author": "alkemical", "body": "Yes to more stories...also you have my interest piqued. \n\nOP your stories with the \"missing\" books (people who disappear in state and national parks) has struck a chord with me."}, {"id": "cuxf0f8", "author": "lost_magpie", "body": "Oh man. The staircases.\n\nAcross the street from the farm we used to live at in Oregon, there was a huge abandoned plot of forest. It was probably 50 acres or so. It belonged to a widow who lived elsewhere, according to the older families in the area.. She and her husband had planned to build a house on it after razing the forest, but he died before the plans took root. \n\nWe used to ride our horses through the woods on dry days, and we always passed by this staircase that was leaned up on a tree a few miles in. There was never a house built there according to neighbors; the forest was too dense and old anyway. It always gave me the creeps and we jokingly called it the \"stairway to heaven\" to alleviate the tension when we rode by it. The horses weren't fans either; they got particularly spooky and snorty when we went to pass it. I'd always wondered what on earth it was doing there. "}, {"id": "cugyo9y", "author": "Moosebrawn", "body": "I've seen these trails. I work for the <underpaid grunt work forest-y job> and we ended up closing up some illegal trails in Annadel State Park. That place isn't too big, but those trails - unmarked and unmapped - will take you all sorts of places. \n\nOne day we're walking along, seeing weird shrines and smiley faces carved into these young, dense pines. The trail was getting steeper and thinner the further we went, and every now and then we'd see another trail crossing our path. Our crewleader just had us bris it up, and wouldn't let us explore them like usual. Said we were too far in, and that he had a funny feeling. We all did, but we kept going, cause the day was still young.\n\nEventually we rounded a corner and saw them, just a set of five steps in the middle of the wood. We looked around, saw that there was no good reason to have a set of steps there, and gave the nod to our ax man. He hops up with his ax and destroies it. Completely.\n\nWe got out of there just fine, though. Still felt funny about it the next day, but it's almost like a dream, now."}, {"id": "cusxp0d", "author": "RebelRaider5", "body": "Could the guy with no facial features in the parka and ski pants have been wearing a mask like this: http://cdn1.evike.com/images/large/head-em6631-cb.jpg in a flesh color? \n\nMaybe he startled the climber, climber ran away in a panic, fell, guy in the face mask saw him fall, face mask guy walked around all night yelling trying to find him, maybe thought he either died from the fall or saw a ghost? "}, {"id": "cufyy1g", "author": "sneakyasfuckk", "body": "Stopped reading no sleep but I clicked on this, did not disappoint. "}, {"id": "cug03v6", "author": "idrawmonsters", "body": "These are phenomenal. Been reading nosleep for almost 4 years now, this has restored my faith in it for sure. PLEASE keep writing more stories. I could read these all day."}, {"id": "cug6mt0", "author": "mocktheweakforfun", "body": "holy mother of Jesus, I've heard the cough before, back when I was doing survival training in the army. I was alone in the woods of Canada with nothing but a ration kit and a knife. they even took our belts so we couldn't hang ourselves if we lost it ( we did this as a unit but we were each at least 5 miles apart). late one night I was having some serious trouble sleeping, my shelter was rustling but there was no wind, that's when the coughs began. I was freaking out trying to dismiss it as one of my platoon mates hunting in the woods or something (even though we were explicitly told to stay within visual range of our shelter.) I decide to investigate the sound and look toward the entangled door of my shelter...a bare foot with frayed jeans at the ankle...after reading the black Eyed man story 20 minutes ago I still have chills running down my spine."}, {"id": "cug1rxp", "author": "oektem", "body": "Wow OP. Stairs in the woods are a thing where I'm from, but we know that we shouldn't go near them and avoid them when we run into one. That's what I've been told by my family, like anybody else in my country for generations. I suggest you to listen to your superiors and not even talk about the stairs. It gives me the chills even while I'm writing about them here."}, {"id": "cug2j50", "author": "poctordepper89", "body": "Ive been having acute insomnia lately, hence why im on reddit at 3am. However im in a conservation corps and im going on project tomorrow in manti national forest. I loved the stories but, respectfully, fuck you. "}, {"id": "cuge0df", "author": "Metalman1988", "body": "I'll tell you that I lived out in a very rural area growing up.  There was a mountain and plenty of woods around us.  We had neighbors and all that but they were far enough away that you could just see their houses.   We had a pitbul named Buster out in the back who had a nice doghouse and plenty of room to run around and play.  There was a nice fenced in area where he couldn't just run off.  One night I awoke to this loud screaming.  I swear it sounded like a woman almost.  It was terrifying and sounded like something painful was happening to whatever was making that sound.  In panic I thought about Buster and grabbed a .357 magnum that my father gave me for my 18th birthday.  Without getting dressed I ran to the kitchen to get to the back door so I could check it out.  Fortunately my father was awake and had his shotgun and a big spotlight.  We could hear rustling way out back and more of that damned screaming.  We started running towards the noise only to spot Buster face up against the fence and screaming an angry, \"I'm gonna kill you\" type of bark that a dog only does when they feel threatened or if they've been attacked.   We could hear what sounded like limping for a bit and then it stopped.   Buster calmed down after a few minutes and we were scanning the treeline like crazy.  Finally Buster walked away and went to his bed.  We decided to let him go into the house that night.  It was a nice summer night, but we didn't want to wake up again in case anything happened.  When I got Buster to my bedroom his inside dog bed was layed out at the foot of my bed.  He went to lay down and I went back to sleep.  The next morning I woke up and looked at him and found that he had scratch markes all over his body.  Two puncture wounds on his back left thigh as well.  I rushed him to the vet and he was given antibiotics and some some other medication.  I went to where he was and found a blood trail.  Turns out he got into a scuffle with a big wildcat.  Found it dead about 50-60 yards away from the fence.  It lost too much blood and died.  Not scary or interesting I guess but it freaked me out that night."}, {"id": "cufxr9e", "author": "Astroknottie", "body": "More! More! Is it sad I'm terrified but extremely intrigued by the staircases? My family and I are very avid outdoorsmen and my dad has told me he's seen something like that before. He joked about it at the time but now it really makes me wonder. He said it was like a house had just been lifted away and the staircase stayed and didn't seem to really have any purpose. "}, {"id": "cufxxac", "author": "CherryCherry5", "body": "Where the crap do you live?! That tree story is really really weird, and the \"man with big black eyes\" is really freaky. "}, {"id": "cug1wji", "author": "stogiethesailor", "body": "holy fucking shit. i grew up in the country and spent alot of time out in the boonies of eastern nevada. ive seen the stair cases you were talking about. its normal to just be hiking and come across a random stair case. i grew up just knowing it was normal. has no one on here seen them? "}, {"id": "cugxgy4", "author": "Is_This_An_Username", "body": "I have a similar story about stairs. Me and my friend were sailing on a lake (lake ponchotrain) and we saw a flight of stairs in it. They came out the water about 5 feet. We just stayed away from them because we figured it was attached to a larger structure we couldn't see but it still scared the shit out of me."}, {"id": "cuh4drb", "author": "Zeyda", "body": "Thank you /r/nosleep, now I have a fear of stairs."}, {"id": "cufz5hk", "author": "donaldrosentel", "body": "On the first story did it ever cross your mind that the reason you couldn't find any other trace of humans in either of the cases and the victims just vanished is because that's what was suppose to happen, as in it was planned by the people. Its pretty fucked up to think a little girl would lead her brother out with fatal intentions in mind, but if i was a little kid having some mystical bear man steal my brother would be a good cover. And the other girl climbed a tree never to return? The only two witnesses have no idea what could have happened, maybe the two were in cahoots...."}, {"id": "cufvhxv", "author": "yonikasz", "body": "Do you believe in these oddities personally, or do you think there is a more simple explanation for the stairs, and the weird people in the woods?"}, {"id": "cufyhu6", "author": "Mintaka85", "body": "Make me wonder in American Indians have any legends about these stairs or insect sounding beings... Love the stories bc in my experience real life is always stranger than fiction... "}, {"id": "cufwzci", "author": "muigleb", "body": "I suddenly lost my enthusiasm for bush walking..."}, {"id": "cughbyq", "author": "dosaki", "body": "Weird stuff.\n\nAbout the stairs...\n\n\nI've seen a few stairs leading up to nowhere in Portuguese forests and fields.\n\n\nThey don't look creepy. Perhaps the only unsettling thing about them is that there were no visible signs of that area ever having a building.\n\n\nI live in North Yorkshire, England now and I do a fair bit of hiking. I'll keep an eye out for them. "}, {"id": "cug3j4x", "author": "Case_9", "body": "I found a staircase very similar to the ones you've mentioned, I've told this story many times so please forgive the well worn rhetoric. I found the staircase while walking through foliage so thick I didn't see it until it was almost underfoot. The stairs were made of loose cobble and moist earth like they were a work of masonry once, long ago. They were dusted with shards of worn glass and shreds of burnt parchment, at the base I found a rusted tin medallion no larger than a coin resting on the moss. Now I couldn't have been too far from civilization but in that moment I felt like I was the only human on earth, standing there wrapped in walls of leaves and branches. I climbed the stairs thoughtlessly, effortlessly, half expecting there to be a landing to greet me at the top. There wasn't though. Just another crumbly step and an unimpressive view. I could see the red tin roof of the DPW yard I cut through to get here, and beyond it glistening smoke-stacks reached up towards the clouds, spilling white smoke into the clear blue sky. Each stack topped by a hazy red light blinking lazily, beckoning me back to reality. To my right the tall, thick brambles bled into cat tails that stretchedall the way to a distant tree line. Something caught my eye as I craned my head, the bushes were packed tight except where the stumps of long dead trees formed sunken wells around them, and from one of the craters someone was looking at me, their gaze fixed. I remember clearly their dark, lean face, their round eyes black like the eyes of a doll flashing in the sun. No sooner had I seen the face than it disappeared again, only then did I have the foresight to take off down the steps and back through the bushes and brambles towards the buildings I could no longer see. It's a different world in the bushes, a claustrophobic world of sharp sticks and thin corridors, a blur of green and black that blots out the sun. Thankfully I was younger then, my feet carried me over the marshy ground and delivered me to freedom, delivered me to the chainlink fence that drew the line between realities and the hole I'd cut that blurred it. It was on that day I swore never to visit Detroit again.\n\n"}, {"id": "cuh9o7g", "author": "OrderInThePack", "body": "And the forests will echo with laughter...."}, {"id": "cv5hkqk", "author": "tigalima35", "body": "i'm from Indonesia, there are many stories that people found a traditional market in the middle of the forest, a kind of market that many merchants gathering in one place selling their stuff.\n\nAnd usually it is a remote area, no way that people will develop a market there. You know, maybe it's another \"people\"'s market"}, {"id": "cvgyinr", "author": "funkmastersara", "body": "Physics-defying, extra-dimensional staircases are a major theme in the book \"House of Leaves\". At one point in the book, a diary entry written by a man lost in the woods near Roanoke in the 16th century (if I remember correctly) talks about his spotting a random staircase after wandering hopelessly around in the snow, starving, for a few days. That was the creepiest part of the book (which was already creepy as fuck in general) for me."}, {"id": "cufv7dq", "author": "dick-nipples", "body": "Go up the stairs. "}, {"id": "cufxur7", "author": "reefman_22", "body": "Smokey the Bear says look out for me behind you! \nBut maybe these stairs are \"portals\" from other dimensions, bringing in the spooky creatures and figures you have encountered/heard about. Just throwing my idea out there, but like others, I would love to hear some more Officer."}, {"id": "cug539m", "author": "Mhmmer", "body": "3 of my friends and myself have seen something akin to the 4th story once at night\n\nfirst it looked like a frail old man walking like he's drunk who went ahead and picked up a dog out of a garden threw it up a few meters in the air and kicked it rather gracefully to fly across the street\n\nwe yelled at him to stop then it became agitated and bulged up to the build of a bodybuilder or rather a gorilla but you couldn't see any skin only something that looked like a cows black fur and it also had a blank face but really big eyes\n\nas we got closer(we were pretty drugged out we got back from a party else we woulda just run) it started screaming in a deafening way that no one seemed to hear(no lights turned on middle of the night) we didn't back off then\n\nthen it started to go crazy and punched a sandstone wall(it broke 2stones on that) after that it started shaking a streetlight so hard that it almost ripped it out of the ground(all the stones around the pole were ground up and the street light out of service for 2weeks)\n\nmy friends and i theorized that the screams were not heard by anyone it didn't intend to hear it(other than all dogs in the neighbourhood who ALL started barking) as nobody woke but as soon as it manipulated shit in our world(lamppost) people could hear that(sound of lamppost almost being rippedo ut of the fucking ground) and woke up in reaction to this if they could have heard its screams they would have woken up they shook you LITERALLY to the bone\n\nafter that happened it jumped on a wall(which is about 2.30meters high) then ran off in a way that seemed like a timelapse like it would teleport a few meters at a time and if you didn't look at it it could cover a seemingly endless distance in an instance\n\nthen it sat waiting at a crossroads seemingly waiting for us to pass with a cocky attitude(arms crossed leaning on a railing)\n\nbefore this happened i heard about this thing from 3 different people at different timest it's called \"kurdismonster\" here(cause the first guy who saw it saw it at the \"kurdis-damm\" it has that name)\n\nthis was 3years ago and i'm still scared to go out past 10pm this is some supernatural shit and the strangest thing was that a friends mother goes to some gypsy fortuneteller who just happened to tell her that the shit her son encountered is not to be fucked with and is a demon\n\nmake of it what you will i care as much as about my formatting and grammar "}, {"id": "cufviel", "author": "asleepypuppy", "body": "Read Missing 411 by David Paulides or listen to his interviews on YouTube, better yet just contact him. "}, {"id": "cug20x4", "author": "HulkSmashRocks", "body": "I TOLD YOU ABOUT THEM STAIRS BRO, I TOLD YOU!"}, {"id": "cugkwry", "author": "Essie101", "body": "For the little boy that went with the bear man, did you ever find him later on? \n\nThe stairs might be sending you into another realm, I've seen photograph of stairs in cemeteries. now what they are doing in a forest I dunno."}, {"id": "cufxmj0", "author": "Generic_User7", "body": "You had originally got me hooked with the woman telling you the thing doesn't like the scar on the back of your neck, then, I was enthralled with the staircases.  \n\nI could understand if they're old and dilapidated.  For them to be in good shape, doesn't sound right.  Are there typically trails that lead out to them?  Maybe not obvious trails, but are there clear enough clearing that would lead to them?  I have to assume that they had been there for originally settlers, and the the housing remains would also be accompanying them.  Looking forward to more on this one..."}, {"id": "cuftzzd", "author": "SolarDriftwud", "body": "Yes please, more stories! "}, {"id": "cugcyi1", "author": "driftwork", "body": "OP is clearly in the Bookhouse Boys. "}, {"id": "cum150n", "author": "Gohagan", "body": "I am the 667th comment on this thread you are welcome"}, {"id": "cuzn2ye", "author": "alumavirtutem", "body": "I haven't gotten chills from a story in a long time but I am looking around my living room making sure some man with black eyes isn't watching me."}, {"id": "cufxfux", "author": "squishyburger", "body": "The no face guy is really weird but the staircases, now that is something I haven't heard of before and I have seen and heard of a lot of wilderweirdness. Was the no face guy wearing the parka? "}, {"id": "cugijcf", "author": "grimmjow66", "body": "Well, I believe this thing is Jin.. They live among us but in their own world so do we, unless if you step in their territories and mess it up somehow, then the trouble starts.. \nMaaan your stories sent a chill down my spine for god sake now i need to find something else to forget about it.. Jeeez "}, {"id": "cuoiw56", "author": "oneill815", "body": "I don't know about any stairs but my father and I were elk hunting way out in the middle of no where. We hiked down a deep draw with a creek running through the bottom of it and there was a deck. A perfectly built, 8 sided round deck. I have no idea how the hell anyone built it or how they got the tools and materials down there to do so."}, {"id": "cufyvoj", "author": "CoreNerd", "body": "Please regale us with as many of these as you have! Maybe even make them super long? I won't mind!"}, {"id": "cuh9dc2", "author": "LunchForBrunch", "body": "I'm fuckin scared somebody hold me"}, {"id": "czba3dz", "author": "DiscoStillSucks", "body": "I guess I know what the creature that stole kids was...\nHere in Russia/Ukraine people calls him \"Леший\", he is something like the demon who lives in the woods. He often stole kids, or messing with people who lost in woods, he is not kind, even more, he's very unfriendly to people, for example he often make people \"lost\", he can change forest's landscape, he can create haze and stuff like that, most likely if you meet him out there in the woods, you have all of the chances to disappear completely, like those people from stories.\nBack then, when old Russian Empire (not USSR/ or Russian Federation) wasn't yet into religion of Jesus Christ people were really close to nature and they could easily fight such creatures with rituals,or if they were in trouble they're just started to pray to Gods of forest so they're protected people from such creature's. But nowadays it's all gone and probably if you will be unlucky enough to meet such creature today, you are dead men, so be very careful next time when you'll be in the woods."}, {"id": "cztowqo", "author": "Lilliecf", "body": "So I joined Reddit just so I could post this comment. And read more nosleep stories of course, but still. \nAnyway, I used to work at a lot of conventions when I was about 20. I lived in the Delaware valley. My manager lived in upstate PA and there were a lot of car, truck & hunting shows that way that his agency would book shows for us. Anyway, my parents were out of town and I was watching their dog, Blue. He was an 80 lb English shepherd and an alpha. He didn't respect me much but he would have died protecting me bc he knew I was pack. Anyway, there was a show that weekend and I usually stayed at my manager's house in his guest house for the weekend shows. I had to take my dog w me since I was watching him. \n\nI got there the Friday before the convention and took my dog for a walk down the road. It was dusk and gorgeous and way more wooded and secluded than my hometown so I was enjoying it. We walked a fair way down the road and then I decided to take him off the path and into a little clearing I could vaguely see through the trees. So we get into this clearing and there is lots of tall grass and it is dusk so visibility is low. He is sniffing around and generally enjoying himself and then at the same time we both notice the grass at the opposite side of the clearing moving (probably 200-300 ft away). He immediately stiffens and lets out this visceral growl that I have never heard him make before. Not just the \"someone is at the door\" growl, but a \"our lives are in immediate danger and I will attack and kill if need be\" growl. So I start getting nervous and back up a bit. I'm thinking from the size of the movement (the grass was a little over waist high) that it's maybe a cougar or wolf or whatever my imagination is scaring me with. In retrospect I WISH it was a cougar or wolf. Anyway, I am trying to get Blue out of the clearing and back to the road but he is frozen stiff and not budging. He is in full flight or fight mode and he's obviously chosen the latter. The thing is moving around, kind of foraging and what seems to be looking for food. While it's moving back and forth I catch a glimpse of it really fast through a sparse area of grass and it looks seriously like one of the werewolves from tv. It was mostly naked with a ridge of fur down its back and it's face kind of looked like a hyena. In all honesty it could have been a huge dog or wolf with mange. But it's legs were all wrong. Most canine-like animals walk on their toes with the first bend in their legs being their ankle. The second bend is their knee, and their hips aren't visible the way ours are. So their legs look like this:\n<\n _>\n(Poor rendering, I know). \nAnyway, this thing's legs were backwards. It's feet pointed backwards and the first bend in it's leg pointed forwards. The second (that should have been it's knee) pointed backwards. Like this:\n   >\n<_\nSo, I dragged my dog by the scruff of his neck and jogged home at a brisk pace. \nIt never noticed we were there. My only logical explanation was that maybe it was a large dog or wolf with mange and a severe genetic defect. But I have done a lot of work in dog rescue and I've never seen a defect like that. That being said, it might exist, but any kind of defect I've ever seen of that magnitude has rendered the dog immobile. This thing was walking and trotting like nobody's business. \nStill don't know WTF that thing was and would prefer there to be a logical explanation but I haven't really found one. "}, {"id": "cug3wp6", "author": "LifeFailure", "body": "Speaking of strange wilderness occurences, my first camping trip was when I was about 8 or 9 years old. One of my mom's friends invited us to stay at her family's sort of mini-cabins (they were like one-room cabins that each had two twin beds in them and an end table in between). \n\nI don't remember much of the trip very vividly, but I do distinctly remember walking with my dad and brother through the woods to meet up with my mom and the other campers. I kept getting scared/panicky and wanting to go faster because every tree and log I looked at seemed to have reptilian eyes peering out of knotholes. One in particular looked exactly like an alligator with grey-brown skin (think ash tree), and I swear I even saw it blink. When I freaked out and told my dad and brother, they said I was being silly and it was just a dead/hollow log. I looked back and it was indeed just an empty log with a hole in the side.\n\nThis might have just been me terrified of alligators and snakes and things, or having been too affected by that one scene in Snow White where she runs through the woods and sees eyes everywhere (or a combination of the two), but I swear I wasn't just imagining the eyes. The log was more of a \"first glance\" sort of mistake, especially because I was already on edge, but I kept seeing the eyes in literally every knothole before they disappeared when I looked back. While I have a damn vivid imagination, I *never* hallucinate things, and by that I mean I never actually see things that aren't there. Even my imaginary friends were always strictly invisible, so if I ever saw something I was very sure it was real. Ever since then I've just been very uneasy about the wilderness."}, {"id": "cufuri3", "author": "Abzone7", "body": "More !!! This is some scary shit OP but im need more."}, {"id": "cufva1f", "author": "seversonda", "body": "I loved your stories as sad as most of them are.  I'm so glad I hate camping or hiking in the woods. Whew!"}, {"id": "cuwkfno", "author": "QuinzelRose", "body": "Half of me really wants to become a SAR officer now, experience this for myself.\n\nThe other half of me never wants to even look at the woods ever again. Which is impossible where I live. "}, {"id": "cux0sqc", "author": "ToKillAMockingAudi", "body": "Forests hide some serious shit."}, {"id": "cug0ztp", "author": "angelangeline", "body": "Bra tell us more about those stair cases. Thats sounds weird as fuck. I dare you to go touch one."}, {"id": "cufywgg", "author": "david_yarz", "body": "The second to last gives me the fucking creeps but the last one...\n\nSeems a little out of place "}, {"id": "cug22hk", "author": "oblivion_crisis", "body": "I. Need. More."}, {"id": "cug3jhy", "author": "Canadian_Hooker", "body": "I did a Google search of \"forest stairway to nowhere\" and was fairly happy with the results. It gave a slight idea what these stairways might look like. Hoping to hear more about them. "}, {"id": "cug3lbd", "author": "averysneakysnail", "body": "Really want to know more about the stairs Please tell us more on it."}, {"id": "cug47xl", "author": "holymother", "body": "This is the first story to rustle my jimmies in a while. "}, {"id": "cugcgs1", "author": "hun-dawg", "body": "Should have added...take the pictures of the stairs anyway.  Compile them in a coffee book."}, {"id": "cuh48tb", "author": "MalevolentTwilight81", "body": "By any chance have you talked to a man named David Palidies? He talks about missing person cases and I have a few of his books...if not you should definitely get in touch with him!!\n"}, {"id": "cuh81pm", "author": "arkzist", "body": "I need to hunt down these stair cases"}, {"id": "cuh9ceu", "author": "jshepardo", "body": "Please tell us some more of these stories. They are fascinating. I get scared of lots of things, but I've only *truly* been scared once and it was in the woods. I didn't see anything, smell anything, or even hear anything; this wave of pure fear just washed over me and it is hard to describe. More so since I was surrounded by other campers, but alone at that moment. "}, {"id": "cuhzug0", "author": "CaptainIzab3lla", "body": "Wow these are awesome and really interesting! Thank you so much for sharing - I rally hope you do more. I just wanted to say I think you're awesome :)"}, {"id": "cui83vv", "author": "TheGreenShitter", "body": "So many in the comments too"}, {"id": "cur97dm", "author": "TobiBaronski", "body": "No one else reminded of the \"ftaires! we have found ftaires!\" part from House of Leaves? Also, literally sleeping with the lights on tonight."}, {"id": "cvg8360", "author": "yesimfluffy99", "body": "In upstate NY, there are a lot of staircases in woods. I always figured they used to lead to houses that have now deteriorated. Or shacks for the lumber men that destroyed that area in the 1800's "}, {"id": "cw8gbli", "author": "NoSleepSeriesBot", "body": "1993 current subscribers.  Other posts in this series:\n\n* [I'M A Search And Rescue Officer For The Us Forest Service, I Have Some Stories To Tell](http://reddit.com/3iex1h)\n\n* [I'M A Search And Rescue Officer For The Us Forest Service, I Have Some Stories To Tell (Part 2!)](http://reddit.com/3ijnt6)\n\n* [I'M A Search And Rescue Officer For The Us Forest Service, I Have Some Stories To Tell (Part 3!)](http://reddit.com/3iocju)\n\n* [I'M A Search And Rescue Officer For The Us Forest Service, I Have Some Stories To Tell (Part 4!)](http://reddit.com/3jadum)\n\n* [I'M A Search And Rescue Officer For The Us Forest Service, I Have Some Stories To Tell (Part 5!)](http://reddit.com/3kd90k)\n\n* [I'M A Search And Rescue Officer For The Us Forest Service, I Have Some Stories To Tell (Part 6!)](http://reddit.com/3pg566)\n\n* [I'M A Search And Rescue Officer For The Us Forest Service, I Have Some Stories To Tell (Part 6!)](http://reddit.com/3ppq81)\n\n_____\n[^Click ^here](http://www.reddit.com/message/compose/?to=NoSleepSeriesBot&subject=series-subscription&message=1103) ^to ^receive ^a ^message ^when ^this ^series ^is ^updated. [^^^Send ^^^<3](https://cash.me/$bubbarowley)"}, {"id": "cw947m2", "author": "VAPossum", "body": "FYI, a website is using this post as content.  Not sure if you knew or approved.  http://www.tickld.com/x/search-and-rescue-officer-shares-terrifying-stories?source=whats_hot"}, {"id": "cwzf8pq", "author": "tomios010", "body": "These sound a lot like accounts from a book by David Paulides called \"missing 411\".  First heard his reports on coast to coast but since have looked into the cases further.  I used to really like camping..."}, {"id": "cy375zu", "author": "madhousechild", "body": "I'm also a fan of David Paulides' Missing 411 stories. There has to be something coming from above. \n\nIn so many cases, there are no footprints or tracks of any kind. Dogs lose the scent. People just disappear, in a blink of an eye.\n\nPeople, especially kids, are found ridiculous distances away from where they go missing, sometimes these are toddlers who could not possibly cover that amount of ground even if it were flat. Climbing a tree and never coming down. \n\nAnd people are found at higher ground, sometimes up or over sheer cliffs they could not possibly scale. They are found in the middle of ponds with no footprints on the edge. Some appear to have fallen from a great height. They are found in places that multiple search teams covered.\n\nFor small children, it would seem plausible they were carried away by eagles or other large birds of prey. I don't think there are many stories like that coming from survivors, though. If they remember anything and are able to communicate, they talk of being lured somehow. The stories seem idiosyncratic; some see relatives or strange people, some see odd animals. \n\nThe stairs are definitely creepy, and I'd never heard of them before. I kind of wonder whether strange stuff would happen if people purposely built stairs in the middle of nowhere — like, if you build it, they will come. Anyway, these are great stories."}, {"id": "cyd1idb", "author": "toremygooch", "body": "Relevant [news story](http://www.idahostatejournal.com/members/how-could-a--year-old-vanish-without-a-trace/article_10d44717-75dc-5601-aa30-5726228128f8.html)"}, {"id": "czac83k", "author": "Benkuszak", "body": "I have a story that is unexplainable by me and my friends that sounds unbelievable. When looking back at it, we don't know what to make of it. This isn't a scary story, but it's just straight weird.\n\nMy three friends and I ventured out into the woods by my house at about 1 in the morning. We've done this on multiple occasions but when we go out, we travel in camo and packs. (At the time were about 16 years old). But as we went out, we found this fence and so we decided to crawl underneath it. This required us to use a shovel to be able to fit underneath it. When we were looking at the dirt, we found this glowing white substance. I don't really know how to describe it, but it was like, several very small glowing specs. This seemed unusual to us, but my two other friends claimed to have seen this before on previous adventures in the woods. \nWe continued forward through the woods and all of us started to get this very freaky feeling. It was a full moon out but the woods that was in front of us was completely pitch black and full of thick brush, so we decided to go back since we didn't want to risk anything. We began to hear some things move in the brush. Literally as we decided to go back, I swear, we saw this beam of light come up from the woods and into the sky. I don't know what it was but it was about 100 feet away from us. After seeing this we left the woods.\nTo this day we can't explain how it happened but all of us saw it with our individual eyes."}, {"id": "czbxlka", "author": "Ethanguy77", "body": "Weird coughing.... Must just be Ethan from h3h3!"}, {"id": "czou4bo", "author": "gibson_mel", "body": "\"The finest trick of the devil is to persuade you that he does not exist.\"  -Charles Baudelaire"}, {"id": "czsds7j", "author": "NovaRasta", "body": "Sounds like Slenderman."}, {"id": "czzkr3x", "author": "Garyhandbag", "body": "https://www.reddit.com/r/LetsNotMeet/comments/3cs2xt/shing/\nOne I posted a while back"}, {"id": "cug1e0s", "author": "findvision", "body": "Now THESE stories are the ones that scare the shit out of me. The unknown in nature. "}, {"id": "cugz4yb", "author": "bombadiltomatoes", "body": "Really interesting post. I worked in New Mexico in the early 1990s assisting a professor from Highlands University sampling mountain streams for invertebrates. We worked mainly in fairly remote back country in the SW part of the state, and during one long day of hiking came across a staircase just in the middle of nowhere among some Ponderosa pines. "}, {"id": "cug1dpq", "author": "Gkjones87", "body": "Please, please don't stop the conversation here.  I believe!  Need to know wtf happened.  Will you please get to the bottom of these staircases at least.  That's the only one that we truly can figure out."}, {"id": "cugt3hs", "author": "Texaslovakian", "body": "Sleep deprivation includes crazy ass hallucinations. Those people lost in the woods could have easily seen these things and, in their mind, they were absolutely true. The Bear Man is pretty freakin creepy."}, {"id": "cvq5t2f", "author": "InhaleDankness", "body": "You could say that the brother got into a **HAIRY** situation...I'll take my downvotes now."}, {"id": "cufv06h", "author": "aw2BFree", "body": "Wow, yes please share more - so intriguing! Thank you!"}, {"id": "cufx6ys", "author": "harraiak", "body": "These are amazing. "}, {"id": "cufxldz", "author": "themonotonousguy", "body": "Phenomenal accounts of these events. Couldn't imagine having to go through them again when re telling them. "}, {"id": "cug2dib", "author": "KnightSolaire___", "body": "Holy shit, yes, post more, please!"}, {"id": "cug3bbo", "author": "Pappar", "body": "The stairs thing was really unexpected! More on them, please!"}, {"id": "cug3l74", "author": "omgLoLowl", "body": "Normally nosleep doesn't freak me out that much, but honestly that \"bear man\" freaks me the fuck out. Great job man. \nI also feel like all of these are connected, but I don't want to go back and read them because they freak me out."}, {"id": "cug40x9", "author": "Flaccid_Antacid", "body": "The bear man reminds me of the spaghetti monster in True Detective"}, {"id": "cug670l", "author": "Flanchester", "body": "This is awesome please post more OP I love this shit. "}, {"id": "cug6o9e", "author": "Cha1upa_Batman", "body": "I think stories are a lot more scary when a real profession is involved. And the fact anything to do with the forest creeps me the fuck out."}, {"id": "cug6tc6", "author": "stuckinnm", "body": "[Stare Case in the Woods](https://www.reddit.com/r/pics/comments/1wuhg6/stairs_to_nowhere_in_new_hampshire_480x640/) like this?"}, {"id": "cug7f6d", "author": "OuttaSightVegemite", "body": "Please tell us more stories!\n\nThe ones where people clearly see things....the faceless man, the bear man, the man with black eyes....they're the ones that scare me the most and really remind me that there's *so* much more out there than we're aware of. *shivers* The Bear Man one is getting to me..."}, {"id": "cuga0rr", "author": "blueliner25", "body": "OP. I love camping and hiking. Please give us part 2 of the stairs story. \n\nI may have seen some in Washington state. But you already know the first rule of stair club....dont tell anyone about stair club. "}, {"id": "cuga8kd", "author": "The_JoshS", "body": "The stairs in the middle of nowhere instantly made me think of House of Leaves.  Truly disturbing and frightening..."}, {"id": "cugaytg", "author": "It_was_mee_all_along", "body": "**wow PLEASE can we get picture of those stairs? That would be amazing!**"}, {"id": "cugb3oq", "author": "raptor08", "body": "OP, you should post these great stories on /r/bigfoot\n\nEdit: I see it has been posted already by another. \n"}, {"id": "cugdpc5", "author": "elaearae", "body": "Yup, not sleeping tonight. Mission accomplished, nosleep!"}, {"id": "cugdw76", "author": "eccofire", "body": "Has anyone gone up the staircase?"}, {"id": "cugg0mr", "author": "TheKintaiBridge", "body": "Glad I read this at 1 pm at work 0_o"}, {"id": "cugjmlv", "author": "doselan", "body": "I really enjoy hiking and camping in the woods where there aren't trails in places that aren't frequented.  It has been quite peaceful in the past.  \n\nBut now you have taken that from me.  O_O"}, {"id": "cugme37", "author": "Drawberry", "body": "I feel like more comments should be questioning why the fuck some stairs are casually chillin' out in the woods?!!!"}, {"id": "cugoa80", "author": "LyeNess", "body": "Wow. Well this one genuinely freaked me out...and that's rare for me on nosleep. Desensitized I suppose but this...this was truly frightening. More stories please!!!\n"}]}