{"id": "4ykg8g", "title": "Something happened 63 years ago that's haunted me my entire life. I’ve never told anyone about it—until now.", "url": "https://www.reddit.com/r/nosleep/comments/4ykg8g/something_happened_63_years_ago_thats_haunted_me/", "subreddit": "nosleep", "author": "Sergeant_Darwin", "text": "It’s official: I’m an old man.\n\nFor the last couple years, I’ve comforted myself by saying I’m in my “early 70s,” but math is simple and unforgiving. Today is my 75th birthday, and God, the years do fly.\n\nI’m not here for your well wishes; this is hardly a milestone I’m excited about. I’m glad to still be here, of course, but I find I have less and less to live for with every passing year. My bones ache, my kids live far away, and the other side of my bed has been empty for just over eight months now. In fact, once I cast my vote against that goddamned Trump this November, I may have nothing to live for at all.\n\nSo spare me your “happy birthdays” and your congratulations, if you please. I’m here because I have a story for you, and it’s one I’ve never told before. I used to think I kept it inside because it was silly, or maybe because nobody would believe it. I’ve found, though, that the older you grow, the more exhausting it becomes to lie to yourself. If I’m being perfectly honest, I’ve never told anybody this story because it scares me, almost to death. \n\nBut death seems friendlier than it used to, so listen close.\n\n*****\n\nThe year was 1950; the setting a small town in Maine. I was a boy of nine, rather small for my age, with only one friend in the world to speak of—and his family, seemingly on a whim, decided to move 2,000 miles away. It was shaping up to be the worst summer of my life.\n\nMy pop wasn’t around and my mom was a chore-whore—boy, was I proud of myself when I came up with that one—so I wasn’t apt to hang around the house. With some hesitation, I decided the public library was the place to be that summer. The library’s collection of books, particularly children’s books, was meager to say the least. But within the walls of that miserly structure, I would find no undone chores, no nagging mother (God rest her soul), and perhaps most importantly, no other children with whom I would be expected to associate. I was the only kid with a low enough social status to spend his precious days of freedom sulking amid the bookshelves, and that was just fine with me.\n\nThe first half of my summer was even more dreadful than I had imagined it would be. I would sleep in until 10, do my chores, and then ride my bike to the library (and by bike, I mean rusty log of shit attached to a pair of wheels). Once there, I would split my time between unintentionally annoying the elderly patrons and deliberately doing so. One pleasant lady actually interrupted my incessant tongue-clicking to hiss a “shut the fuck up!” at me—the first time I ever heard a grownup use The F Word. Big fuckin’ deal, I know, but in those days it was unheard of.\n\nThe dreary days turned to woeful weeks. I had actually begun praying for school to start again—until I discovered the basement. I could have sworn I’d roamed every inch of that library, but one day, in the far corner behind the foreign language collection I stumbled across a small wooden door I had never seen before. That was where it all began.\n\nThe door was windowless and made from oak that looked far older than the wall in which it rested. It had a knob of black metal that quite literally looked ancient—I wouldn’t have been surprised to learn it was crafted in the 17th century. Engraved on the knob was what appeared to be a single footprint. I had the sense that whatever lay beyond this door was forbidden to me, and therefore probably the most interesting thing I would encounter all summer. I quickly glanced around to make sure nobody was watching me, then turned the heavy knob, slipped behind the door, and shut it.\n\nThere was nothing; only darkness. I took a couple of steps and then stopped, unnerved by the totality of the shadow which surrounded me. I waved my hands in front of me in an attempt to find a wall or a shelf or anything to hold on to. What I actually found was far more subtle—a small string, dangling from above—but far more useful. I grabbed it firmly and pulled it down.\n\nBack in the day, lots of lightbulbs were operated with strings, and this was one of them. My surroundings were instantly illuminated. I was standing on a small, dusty platform that looked as though it hadn’t seen life in quite some time. To my left was a crickety-ass spiral staircase, made of wood and appearing ready to collapse at any second. The bulb was the only source of light in the room, and it was feeble, so when I peered over the railing to see what lay below, the bottom of the staircase dissolved into the darkness.\n\nI was beginning to feel scared. This place—wherever I was—seemed to have no business in a town library. It was as though I were in a completely different building. But no nine-year-old likes to let a mystery go unsolved. Looking back, I wish I could tell my prepubescent self to turn around, go back, do anything else besides descending that staircase. “You’ll be spared a lot of sleepless nights,” I’d say. But, of course, I didn’t know that then—and I may not have listened even if I had. So instead of turning back, I took a deep breath, gripped the railing, and glared resolutely forward as I began my descent.\n\nThe wood on the railing was dry and covered with splinters. I immediately let go, holding my hands out for balance as I carefully traversed the staircase. It was (or at least seemed) very long, and with only the dim glow from the string-bulb far above me, my heart pounded mercilessly in the darkness. Even kids can sense when something isn’t right, I think—they just don’t always give a shit.\n\nBy the time my feet reached the cement floor at the bottom, the light from the bulb above was very nearly a memory. But there was a new light source, and God, I’ll never forget it. Directly in front of me was a door, massive, and a deep shade of red. The light was coming from behind the door, and it shone out in thin lines from all four sides—a sinister, dimly glowing rectangle. For the second time, I took a deep breath and went through a door I shouldn’t have.\n\nIn contrast to the dank room I entered from, the room behind the door was blinding. When my eyes adjusted, what I saw nearly took my breath away. \n\nIt was a library. The most perfect library imaginable.\n\nI gaped in wonder as I stepped, almost reverently, further into the room. It was beautiful. It was smaller than the library above, much smaller, but it seemed to be almost tailor-made for me. The shelves were packed with brightly colored titles, both armchairs in the middle of the room were exquisitely comfortable, and the smell—my God, the smell—was simply unbelievable. Sort of a mixture of citrus and pine. I simply can’t do it justice with words, so I’ll suffice it to say that I’ve never smelled anything better. Not in my 75 years.\n\nWhat was this room? Why had I never heard of it before? Why was nobody else here? Those were the questions I should have been asking. But I was intoxicated. As I gazed around at all the books and basked in the smell of paradise, I could only form one thought: *I will never be bored again.* \n\n*****\n\nIn truth, boredom only hid from me for three years. It was on my 12th birthday, 63 years ago to this day, that everything changed.\n\nBefore that day, I visited my basement sanctuary as often as I could—usually several times a week. I never saw another soul down there, yet strangely remained free of suspicion. I never removed a book from that room, but instead would pick up a particular volume wherever I had stopped reading during my previous visit. I sat, always in the same deep purple armchair, and always leaving its twin barren and directly across from myself. That armchair was mine, the other was—well, I suppose I couldn’t have articulated it then much better than I can now. But it wasn’t mine, that’s for damn sure.\n\nOn my twelfth birthday, I arrived later than usual. My mom had invited a couple classmates and some cousins over to our house to celebrate, a gesture which I found more tedious than touching—really, I just wanted to spend my birthday sitting and reading and smelling paradise. Eventually, our guests went home, and I made it to the library about fifteen minutes before closing time. That didn’t matter; the workers never checked down there before they locked up. I was free to stay as late as I wished. This particular night, I was devouring the final chapters of an epic adventure; knights, swords, dragons, and the like. I didn’t smell it until I read the final words and closed the book.\n\nThe once exquisite aroma of that room had turned sour. I sat for a moment, unsettled. Objectively, I could recognize that the smell was actually the same as it had been before—that mixture of citrus and pine. I just perceived it differently, and I didn’t like it anymore. It was the nasal version of an optical illusion; you know, the one that looks like a young woman glancing backward, but all of a sudden you see that it’s really an old woman facing toward you? You can’t unsee that, and I couldn’t unsmell this. The spell was broken.\n\nThe odor also seemed, for the first time, to be coming from somewhere specific. With a fair amount of trepidation, I stalked around the room, sniffing the air like a crazed canine until I came to a shelf near the back. The shelf was perfectly normal, with the exception of one title—a large, leatherbound cover of solid faded maroon, with one striking black footprint at the top of the spine. This was the source of the smell. I opened the front cover, and saw one sentence scrawled neatly in blood-red ink atop the first page: \n\n*Rest your sorrows down, friend, and leave them where they lie.*\n\nI stared at this sentence, mesmerized, as I began to retreat to my chair. I turned a page. Blank. The smell became stronger. Another page, blank, and the smell grew stronger still. I stopped for a moment, suppressed a gag, and continued walking. Then, as I neared the armchairs, I turned one final page—and there, in the same sinister print, was the last thing I expected to see: my own name. I dropped the book. I began to sprint toward the door, but as I shifted my gaze forward, my heart leapt to my throat and I stopped in my tracks.\n\nThe empty chair wasn’t empty anymore.\n\nAn aged man in a suit sat before me, one leg crossed over the other, contemplating me with piercing gray eyes and a light smirk. This was all too much. I fell to my knees and expelled the contents of my stomach onto the carpet. I wiped my mouth, staring at my vomit, when I heard the man let out a chuckle.\n\nI stared at him disbelievingly. “Who are you?” I asked, panic in my voice.\n\nThe man leapt to his feet, grabbed me gently by the shoulders, and helped me to my chair. He sat, once again, in his own. “I fear we got off to a bad start,” he said, glancing at the pile of sick on the carpet. “The smell . . . it does take some getting used to.”\n\n“Who are you?” I repeated.\n\n“Tonight, you will know hardship like you’ve never before known,” he said. “I come as a friend, offering you refuge from it, and from all other storms which lie ahead.”\n\nI wanted nothing more than to leave at that moment, but I remained seated. I asked him what he was talking about.\n\n“Your mother is dead, my boy. By her own hand, in her kitchen. The scene is gruesome, I must admit,” he said in sorrowful tones, but was there a playful glint in his eye? “Surely you wish to avoid this path. I can show you a safer one.”\n\nMy blood ran cold at the horrors this man spoke of, but I did not believe him. “What do you want with me?” I demanded, trying to sound braver than I felt. He laughed, an old, raspy yelp that seemed to shake him to his bones.\n\n“Nothing but your friendship, dear boy,” he said. Then, sensing I found his answer inadequate, he expounded. “I want you to come on a journey with me. My work is noble and you will make a fine apprentice. And maybe, when I’m done”—he sighed tiredly, running his bony fingers through his thin white hair—“maybe then, my work can be yours.”\n\nI stood up, shuffling toward the door but never breaking his gaze. “You’re crazy,” I told him. “My mom isn’t dead. She’s not.”\n\n“See for yourself, if you must,” he said, gesturing toward the door. I threw him a contemptuous glare and bolted for the exit. As my hand closed around the knob, he said my name softly. In spite of myself, I turned around.\n\n“Your road won’t be easy, friend. If it ever becomes too much for you, and I mean ever,” he said, pausing to sweep his hand over the room, “you know where to find me.”\n\nI slammed the door behind me and took the decrepit stairs two at a time. I exited the library, clambered onto my bike, and high-tailed it home. The front door was wide open. I dismounted, leaving my bike in a heap on the ground, and approached the house cautiously. The old man was lying—he must have been. Still, tears began to sting my eyes. Heart pounding, I stepped inside and called for my mother. I heard no answer, so I turned into the kitchen.\n\nTo this day, I don’t know why she did it.\n\n*****\n\nI’ve lived in that small town in Maine my entire life, although I’ve kept mostly clear of the public library. Once, in my late 20s, I summoned the courage to step inside. Life was good at that time, and my fear had begun to morph into idle curiosity. Where the door to my basement sanctuary once stood was only a blank wall. I asked the librarian what had become of that basement, though in my heart I knew the answer. There was no basement, she said. There had never been a basement. In fact, if she had her facts correctly, city zoning ordinances prohibited a basement in the area.\n\nI’ve been haunted by that sickly-sweet smell, that poisonous blend of citrus and pine, ever since that long ago birthday. When I saw my mother in the kitchen that day, collapsed in a pool of her own blood, I smelled it. When a man claiming to be my father knocked on my college apartment door, begged me for money and beat me to within an inch of my life when I refused, I smelled it. When my wife miscarried our second child, I smelled it, and again when she miscarried our fourth. When our oldest son got behind the wheel of the family Buick completely shitfaced and got his girlfriend killed, I smelled it.\n\nI began to smell it periodically as my wife became sick. She died late last year, and now, I’m alone for the first time in more than half a century. Now, I smell it every day, and it feels like an invitation.\n\nA few months ago, I went back to the library and the small oak door with the ancient handle was there—right where it used to be. My evening walk has brought me past that library every day since, but I haven’t gone inside. Maybe tonight I will. I’m frightened to die, yes, but lately I’m even more frightened to keep living. The old man was right—my road hasn’t been easy, and I doubt it will get any easier.\n\n*Rest your sorrows down, friend, and leave them where they lie.*\n\nHe promised relief. A refuge, he said. Was he right about that too? There’s only one way to find out. After all, I still know where to find him.", "comments": [{"id": "d6p4b6r", "author": "Nadodan", "body": "I was thinking he'd turn out to be the old man himself. Going back and trying to convince his younger self to stay in the perfect room instead of having to suffer through the life he's led."}, {"id": "d6ojdf8", "author": "yungauthor", "body": "Absolutely incredible story telling my friend. Visualizing this seemed easy, you truly have a way with words. Awesome story, let us know what happens tonight! "}, {"id": "d6onq6r", "author": "bachoman", "body": "But where are parts 2-16?"}, {"id": "d6oddhs", "author": "jmf530", "body": "Holy fuck this is great!"}, {"id": "d6oqbyc", "author": "Ethan819", "body": "That awkward moment when you live in a small town in Maine..."}, {"id": "d6p3u5i", "author": "MeliaeMaree", "body": "Either I am having crazy accurate and strong deja vu or I have read something *extremely* similar to this before.\n\nCan anyone think of something similar? \n\nI knew so much of the content before I got to those parts, maybe the personal library exists for many people ;)"}, {"id": "d6oeqz4", "author": "JustAnOldRoadie", "body": "Oh.  My.  Word.  Fellow bibliophile, kindred spirit, aged peer... life without adventure isn't Life, but Existence.   Open that door, meet as equals.  Choose Life.      (PS: salt.  Take some along, because you may encounter stuff that makes Walmart bathrooms look holy.) "}, {"id": "d6p0b0p", "author": "spleefmaboff", "body": "i'm constantly self hugging myself in disbelief"}, {"id": "d6ohwfr", "author": "icemaster83", "body": "Incredible story! Made me shiver from top to bottom."}, {"id": "d755rbc", "author": "WTF_am_I_doing_here1", "body": "> But death seems friendlier than it used to, so listen close.\n\nI knew this was going to be great when I read this line. I'm so glad I was right. I swear it was like a movie in my head."}, {"id": "d70r9hd", "author": "sweat119", "body": "I wish I could unread this so I could read it again"}, {"id": "d6pbcdu", "author": "ExtraCheesePlease88", "body": "I've never visualized like that for awhile from reading. Great story!"}, {"id": "d6pgv72", "author": "laz_luke", "body": "One of the great things with this story is that it's a fast read. I scrolled through, thinking it would be long, but as I was reading, I was hooked. Please update us!"}, {"id": "d6pklc9", "author": "RoiEX", "body": "What. The. Fuck.\nThis story blew my mind!"}, {"id": "d6ohz3h", "author": "Ejacksin", "body": "What a fantastic story! Thank you!"}, {"id": "d6ooi1o", "author": "ewemousebeekitten", "body": "Very nicely written! It was storming and there was a boom of thunder right when the part about reading your name in the book was read.... Scared the shit outta me! "}, {"id": "d6ox36l", "author": "MrNinetyNine", "body": "Maine confirmed as most terrifying state. Good lobster though."}, {"id": "d6p473y", "author": "civilizer", "body": "like everyone has said already, absolutely great story"}, {"id": "d6pr6ai", "author": "Restrayned", "body": "Beautifully dark story and wonderfully written!"}, {"id": "d6wd0nm", "author": "ahugefan22", "body": "> Rest your sorrows down, friend, and leave them where they lie.\n\nWhat an incredible line, such good rhythm to it. Can't get it out of my head. You truly are a great writer; I hope to see more! "}, {"id": "d71podo", "author": "markpigeault", "body": "Anyone who comments againt this post because of this mans Trump remarks is simply stupid. Don't get me wrong I myself support Donald Trump (go ahead and downvote all you want because of that) but I don't *not* read something or dislike it because of a political statement in it. If anything I liked this post and it was very well written"}, {"id": "d72zfel", "author": "jaimefeu", "body": "You have to let us know what it's like being the grim reaper's apprentice! :)"}, {"id": "d73zoxs", "author": "Horror_Author_JMM", "body": "Fantastic and self contained story. The diction and writing is tight, and the concept is freaky as hell. Got me good, that's for sure, and when I go to the library later tonight I'll be checking for that door..."}, {"id": "d7oe2oi", "author": "Ascension646", "body": "To be honest this doesn't seem very scary to me.  It sounds more... Comforting.  Someone or something who sat in that little cubicle of a library to offer a place of sanctuary during your darkest moments. Who was always there unseen, but made himself visible when your mom passed.  Wish I had something like that.  Peace be with you mate, may you see your wife at the crossroads.  "}, {"id": "d7qhfn5", "author": "SludgeFactoryAiC", "body": "Reading this made me late for work. Great stuff!"}, {"id": "da35nvx", "author": "TheButchman101", "body": "I don't get it. Why didn't he return after his mother died?"}, {"id": "dcma8pj", "author": "SamanthaSaphique", "body": "The old man is the devil"}, {"id": "d6ormie", "author": "Carlin47", "body": "Could it be, that the old man, was you?"}, {"id": "d6ol6w1", "author": "willm0013", "body": "Amazing, chilling story. Please keep us updated."}, {"id": "d6oppqt", "author": "sparkybarr", "body": "oh that was great"}, {"id": "d6oqn9q", "author": "hannahlynn1987", "body": "This story is brilliant and so intriguing. Please keep us updated!"}, {"id": "d6ojs0h", "author": "wydidk", "body": "This was a great read!"}, {"id": "d6ok7nn", "author": "vikingogordo", "body": "What a great story!"}, {"id": "d6opnvn", "author": "AngelofDarkness", "body": "Wow that was amazing!"}, {"id": "d6oq1xr", "author": "Lydbear", "body": "Incredible! Beautiful wrighting, tear jerking story ♡"}, {"id": "d6or8qa", "author": "Doakungfu", "body": "Brilliant! Loved reading this!\n"}, {"id": "d6p1icx", "author": "baptizedinbeer", "body": "I love when stories play out like movies in my head, so effortlessly I can visualize everything. I felt as if I were in your shoes sitting in that little basement , with a pungeunt smell of citrus and pine in my nose. Great read all the way through, not drawn out nor too rushed."}, {"id": "d6pbv7a", "author": "scratchpoint", "body": "Best part is the shoehorned Trump commentary."}, {"id": "d6omipk", "author": "Lord_Krabman", "body": "A Buick in Maine, huh? :^)\n\nGood writing OP."}, {"id": "d6oohgv", "author": "mousieee", "body": "I need more of this!"}, {"id": "d6p37xq", "author": "jamphace", "body": "Thank you for sharing, beautifully written...it gave me goosebumps. Just incredible."}, {"id": "d6p3ekc", "author": "haydentalbert23", "body": "That was some deep shit man"}, {"id": "d6p4n4v", "author": "Whiteelchapo", "body": "This didn't scare me so much as I was engrossed and surprisingly felt good after this"}, {"id": "d6p4pwh", "author": "Vynakros", "body": "Damn, this was so good dude!"}, {"id": "d6p4xvr", "author": "KorzunAlpad", "body": "Awesome story, hope you update it"}, {"id": "d6p5886", "author": "Lemonta-rt", "body": "Simple and brilliant... I absolutely loved it!!"}, {"id": "d6p5njp", "author": "DumbassJ", "body": "I was hooked from the start to finish! Also really easy to visualize as the story went along. Keep us updated! Also pretty believable as well!  "}, {"id": "d6p5ueu", "author": "RudolphMorphi", "body": "This is great!"}, {"id": "d6p5y2m", "author": "walkingxbeard", "body": "Every word in this story was so vivid. I read this with so much imagination. Amazing I loved it"}, {"id": "d6p60pg", "author": "Tiffanimorgan", "body": "You spun the story you lived so great that I could smell citrus and pine. I hope your days get better and you never see that door again. "}, {"id": "d6p6pvf", "author": "Bobcat698", "body": "Great story. Please tell me you aren't voting for Killary if you aren't voting for Trump though... "}, {"id": "d6p6ttd", "author": "RickAmber", "body": "Holy shit I really felt this. "}, {"id": "d6p6wj1", "author": "TepsTwo", "body": "I was mind blown throughout the entire read. It's been awhile since I encountered such beautiful, grasping yet caliginous way with words... I hope MC won't mind me direly attempt trying to translate it into my mother tongue..."}, {"id": "d6p739m", "author": "love2readafraid2post", "body": "Totally captivating. Bravo."}, {"id": "d6p73y2", "author": "MrOtakuGuy", "body": "godDAMN THATS A GOOD ASS STORY"}, {"id": "d6p7cw0", "author": "themanwhatcan", "body": "Chore whore! Rusty log of shit attached to a pair of wheels! Brilliant! Life is strange for only the curious experience adventure "}, {"id": "d6p9sem", "author": "WhatABlindManSees", "body": "Loved that! "}, {"id": "d6pa120", "author": "TheHolotapes", "body": "Made me shiver at the end! Amazing read"}, {"id": "d6pa28v", "author": "Arazos", "body": "Incredible writing, thank you."}, {"id": "d6pa586", "author": "Chinapig", "body": "That was really good. Well written."}, {"id": "d6paekk", "author": "Joker409", "body": "Damn this was amazing. "}, {"id": "d6panuc", "author": "sexxxy_latin", "body": "Outstanding!"}, {"id": "d6pboyq", "author": "backtobow", "body": "Absolutely riveting from beginning to end. Please write more! I'd love to hear what would happen if you return to the basement, but do be careful! I wonder whether he is truly a friend or foe, perhaps he could have offered respite all this time?\n\nMaybe before you go you could find out if others have been down to the basement? Or smelled that smell? Maybe the basement was created especially for you, maybe he lures others with their own personal paradises and volatile smells."}, {"id": "d6pbsd7", "author": "miscojones", "body": "Wow this was very good, well done "}, {"id": "d6pc8hp", "author": "cwecam", "body": "Damn"}, {"id": "d6pcanj", "author": "tboxmy", "body": "Glad I took the time to read. Very descriptive.\n\nYou may never know who is the one on the other chair."}, {"id": "d6pe2z6", "author": "okayben", "body": "man. this story is incredible. thanks for sharing, please keep us updated."}, {"id": "d6pe421", "author": "glennesmith", "body": "I was with you on every word. Awaiting the unfolding of your life's adventure."}, {"id": "d6pfpq2", "author": "Fourth_Mind", "body": "This is so vivid and well written. I honour your bravery for sharing this story with us too, it must've taken a lot. "}, {"id": "d6pfzh6", "author": "curlycrumpets", "body": "Incredible story and so beautifully written, I felt I was there through it all. \n\nEveryone's saying let us know what happens tonight but guys, I don't think he's planning on coming back. \n"}, {"id": "d6pg8g0", "author": "Tyvicden", "body": "This is even more creepy since I live in Maine and we have sooooo many tiny ass towns that it would be impossible to know which one you live in..."}, {"id": "d6ph2a0", "author": "jacqieisapunk", "body": "So many lingering questions, yet still perfect."}, {"id": "d6phrbu", "author": "jdj0367", "body": "I like how the vocabulary seemed to place all my mental pictures in an era correct setting "}, {"id": "d6pi8bd", "author": "Larudyn", "body": "I live in Maine and your story was amazing, if you want somebody to accompany you to that door I would in a heartbeat. "}, {"id": "d6pivz3", "author": "drummie9909", "body": "Daaanng, such a good story! I hope to hear more stories in the future! "}, {"id": "d6pj41w", "author": "catsncrows", "body": "Wow, that was fantastically written. I'd love to hear if you go back into the basement and through that door. "}, {"id": "d6pndny", "author": "TheRealRajan", "body": "You should have gone back there way earlier my friend...! Shouldn't have waited this long...!"}, {"id": "d6pobxq", "author": "kingdabbington", "body": "Damn this is an incredible story and well written. Sometimes our elders have the best stories about things we have never expirienced like World war 2 or even the Great Depression"}, {"id": "d6pqus4", "author": "mr3ender", "body": "Amazing man! Made an account just to post! Creeepy!"}, {"id": "d6pubwf", "author": "myronn132", "body": "Awesome story! I hope for an update soon!!"}, {"id": "d6pwg7v", "author": "Nightmare-Kitty", "body": "Shit maybe it's the Pine-sol lady disguised as an old dude coming and wrecking your shit so you have nothing to live for but a life of selling cleaner on cable television....Hollywood really is fucked up...."}, {"id": "d6q2mc2", "author": "sweat119", "body": "I've read this atlest four times now. Truly incredible and haunting down to the core"}, {"id": "d6rdpq7", "author": "ImBuGs", "body": "Holy fuck this is SO good "}, {"id": "d6ri0oe", "author": "crystalina1984", "body": "Amazing story."}, {"id": "d6romuc", "author": "fallen_angel_81", "body": "Even though this is a sad story, I enjoyed reading it immensely. Such fantastic writing! I really hope you have more stories to tell."}, {"id": "d6rw7vg", "author": "5ystemic29", "body": "incredibly well written story!"}, {"id": "d6toild", "author": "Meatmow", "body": "\"But death seems friendlier than it used to, so listen close.\" Great line"}, {"id": "d6uij60", "author": "DoomOnTheWay", "body": "Wow amazing. Nicely written."}, {"id": "d6xdpc1", "author": "letmelurkaround", "body": "Genuine writing OP. Absolutely incredible."}, {"id": "d6y9ddb", "author": "throwaway4dumbshit", "body": "Really well written. Got chills."}, {"id": "d732rju", "author": "mantar12", "body": "> In contrast to the dank room I entered from\n\nI'd say the second room was even more dank than the first"}, {"id": "d7jlie1", "author": "watrudoininmaswamp", "body": "Amazing. Just... Amazing! Gave my goosebumps! \n\nThankyou OP."}, {"id": "d7y7mql", "author": "Phisharella", "body": "I hope OP gets a good wifi signal in the basement to let us know how it goes. "}, {"id": "d8744dl", "author": "_Saw", "body": "I am literally amazed  by this story, I am hoping for a second part thou I know it won't be possible."}, {"id": "d92d870", "author": "153799", "body": "This is so good. "}, {"id": "d6ozxya", "author": "iris201", "body": "Jumped out of my boots when you implied Hillary is a viable choice for president."}, {"id": "d6opxun", "author": "fastnfurious76", "body": "Fantastic story! Please keep them coming!"}, {"id": "d6owcvj", "author": "chubzta96", "body": "Fucking loved it. Although I'm stunned - a 75 year old sir used the word 'dank'. Well I'll be."}, {"id": "d6omdjg", "author": "palabear", "body": "Well done.  "}, {"id": "d6opky6", "author": "KenXyroReal", "body": "Amazing. So well done!"}, {"id": "d6os4at", "author": "schumacher72", "body": "Scary shit but was gripped to find out what happened. Good reading. "}, {"id": "d6oxmym", "author": "mortequiescam", "body": "Simply magnificent."}, {"id": "d6oi8x0", "author": "BeautifullyBroken7", "body": "Perhaps you can lead Hillary Clinton to this door??"}, {"id": "d6p5erg", "author": "AxeManJack", "body": "Why the trump dig? Ruined it for me."}, {"id": "d6ohqr6", "author": "phuzzy1deep", "body": "Wonderful Thank You!\n"}, {"id": "d6oizgs", "author": "Shadow_Clarke", "body": "Simply amazing to read, thank you for sharing your story with us,sir"}, {"id": "d6okn78", "author": "Hestad", "body": "Amazing.. "}, {"id": "d6ttexw", "author": "Metalhead242", "body": "Seems like an old man would be more likely to identify with Trump rather than Hilary."}, {"id": "d6ol244", "author": "girls_withguns", "body": "Up vote because you're not voting for Trump! Also your story is amazing."}, {"id": "d6onzg6", "author": "ch111i", "body": "Fcuk me...loved the story OP👍🏼"}, {"id": "d6oo7sx", "author": "Fluffygsam", "body": "I'm hoping desperately for an update. "}, {"id": "d6oop02", "author": "pbmm1", "body": "You're more restrained than I would be. I if had the choice I would have taken the old man's offer, smell or not"}, {"id": "d6opl1s", "author": "newatthis17", "body": "More please. We are all waiting "}, {"id": "d6osk58", "author": "lubabe66", "body": "Great read. More!"}, {"id": "d6ouqut", "author": "ImCBass", "body": "I'm a Maine resident and I wondering where in Maine this library was "}, {"id": "d6ouvnj", "author": "DocHolliday637", "body": "Sounds like a deal with the devil"}, {"id": "d6ov5mv", "author": "pumpkin0916", "body": "Awesome read, loved it!"}, {"id": "d6ov86j", "author": "Disciple_of_Crom", "body": "Very enjoyable read. Thank You."}, {"id": "d6ovhq7", "author": "picworthe", "body": "god dammit, im staying in a cabin in a small town in maine right now. needless to say this story spooped me pretty bad"}, {"id": "d6ovmrf", "author": "manfred_space_mann", "body": "I really really loved this story."}, {"id": "d6ox6sp", "author": "Euc99", "body": "Wow, absolutely insane writing. "}, {"id": "d6oygxv", "author": "QueenAnnalise", "body": "Wow. This gave me goosebumps."}, {"id": "d6oyiax", "author": "Magillchi", "body": "Enjoyed reading this... What a fantastic story!! "}, {"id": "d6oyl3l", "author": "alflup", "body": "Great great writing. "}, {"id": "d6oyzb7", "author": "TheColdPeople", "body": "I want to know more..."}, {"id": "d6ozels", "author": "srizen", "body": "That was great "}, {"id": "d6ozenh", "author": "CaptStickStickly", "body": "This is utterly amazing."}, {"id": "d6p1dxh", "author": "YxDOxUx3X515t", "body": "Great read"}, {"id": "d6risoo", "author": "EffinCory", "body": "I hate reading, I skip lines and jumble my sentences in my head, but this, this masterpiece made me finish it, struggled, but I did it, and I'm thankful I did.\n\n\nGood luck on your travels, wherever the spiral stairs take you"}, {"id": "d7zx30s", "author": "randomusername7725", "body": "Sorry but Hillary is worse"}, {"id": "d86er78", "author": "melisrose721", "body": "If you're voting for Hillary because you don't like Trump, what a sad country ours has become "}, {"id": "d6pbg2b", "author": "WingedWinter", "body": "Make sure to vote against Trump before going downstairs again.\n\n\nOk, seriously now. Amazing writing."}, {"id": "d6ojlbx", "author": "yungauthor", "body": "Really makes me wonder if you're just crazy, or some sort of weird power has reached out to you for a reason. I am sure you've contemplated the crazy part enough by now. The fact that you returned several years later to find the same damn door is mind blowing, even after the woman says there is no basement. Absolutely insane! Thank you so much for sharing this. These powers know the secret is out now."}, {"id": "d6ou71j", "author": "Mikefromalb", "body": "Against Trump. That's a sad goal to have in life "}, {"id": "d6oxmdg", "author": "TheWorkforce", "body": "Go back to that basement and report your findings! I'm so curious..."}, {"id": "d6oxufn", "author": "fearthekoch", "body": "Absolutely fantastic! Please do keep us updated. Very interested to see if your old \"friend\" is waiting."}, {"id": "d6oyqr5", "author": "Sattvaya", "body": "Apparently this is a mental issue. When one's parent does child abuse or commit suicide, the victim at a young age would be traumatize because it is too much for someone of that age."}, {"id": "d6p1f4o", "author": "gonnaherpatitis", "body": "Happy birthday! Now go visit that library, you aren't getting any younger."}, {"id": "d6p1pgw", "author": "Numanoid101", "body": "Given your difficult road, do you regret not joining the old man?"}, {"id": "d6p1pm8", "author": "xSamples", "body": "a little tinfoil, but what if the old man was his present self looking out for the younger version? knowing which path to take in life "}, {"id": "d6p2hw1", "author": "GarRadio", "body": "If he wasn't wrong about your mother, what's to say he's wrong about the refuge? You're a 75 year old man. Do it. "}]}