{"id": "5j6p8x", "title": "A Package Marked “Return to sender”", "url": "https://www.reddit.com/r/nosleep/comments/5j6p8x/a_package_marked_return_to_sender/", "subreddit": "nosleep", "author": "manen_lyset", "text": "My neighbor is one of those annoying wannabe YouTube personalities. Over the years, I’ve seen him cough out cinnamon, lay flat on the hood of his car as it slowly creeps down the driveway, and douse himself in lukewarm water, all the while screaming *epic win*, *epic fail*, or, fuck, *epic maintenance of the status quo*, for all I know. It can get tiring to watch him go about his shenanigans in the pursuit of viral fame. So, when he knocked on my door the other day, told me he was going away for a few weeks, and asked that I get his mail, honestly, it was a relief. I can’t explain the peace of mind I had knowing I didn’t have to brace myself for any of his stupidity for a while. I was always afraid his stunts would wind up bleeding over into my life.\n\nThings were pretty normal for the first couple of days. He received a few bills, a bit of spam, and what I could only assume was a birthday card. Then, one evening, I got home to find a cardboard box waiting on his front porch. In big red letters was written “Return to Sender”.\n\nI’m no small fry, but I admit I had trouble lifting the box on my own. It was really freaking heavy. Lugging it across the road to my house was even harder, and I quickly realized there was no way I was going to drag it up the stairs and through my front door. I decided I’d leave his package in my garage. It wasn’t like I kept my car in there: the garage door was a piece of shit that refused to open without a good thug and a whack. It was less trouble just leaving the car in the driveway than it was to fight with the garage door every morning and night. In hindsight, I should have set the package down while I struggled to open the tricky door, but you know how it is when you’ve got a good grip on something, no point in setting it down if you don’t have to.\n\nIt was as I kicked the door for a third time that I lost my grip on the package, and it fell to the ground. I heard a light crack inside.\n\n“Shit,” I cursed.\n\nI hoped I hadn’t broken anything important, but figured I just wouldn’t tell my neighbor about it and let him assume the break happened en-route.\n\nHands free, I finally managed to get the garage door unstuck, and boy did it screech in protest as it rolled up and over me. I dragged the box the rest of the way, setting it in the corner for whenever my neighbor would come back to claim it. And then, I forgot all about it. Until a few days passed, that is.\n\nI’m not sure exactly how long it took for the smell to waft in from the crack under the garage-to-house door, but it came in in slow progression. It was a sickly sweet odor similar to a skunk, and for the first few days after I smelled it, I genuinely assumed that’s exactly what it was: roadkill that had left its mark on my house. It was only when I realized the scent was growing more intense instead of fading that I went looking for a source. That’s when I opened the garage door, and that’s when the odor knocked me back, holding my nose.\n\nThe culprit wasn’t hard to identify. The only change in my garage was the box in the corner. I remember thinking it must have been one of those meat-of-the-month subscription boxes. The meat must have gone rancid from being left out of the fridge for so long. How much meat could have been in there for the box to have been so large and heavy? An entire freaking cow?\n\nI covered my nose as I approached the box, a pair of scissors in my hands. I probably wouldn’t have needed them to open it, as it had become soggy enough at the bottom to poke through with a finger, but I wasn’t about to poke my finger into spoiled meat juices. That soggy bottom was the reason I had to open the box in the first place. If I tried to drag it out whole, everything would spill onto the floor. I was going to have to dump the pieces of meat one garbage bag at a time, and take them down to the dumpster, a process I wasn’t looking forward to.\n\nMy scissors tore through the tape along the top of the cardboard box. I thought the smell couldn’t get any worse, but as I flipped the flaps open, I discovered a whole new gamut of stink. It was like opening a burning oven, but instead of a heat wave, I was met with waves of piss, sweat, shit, and putrefaction. It was so bad that I staggered back and had to force down the puke begging to guzzle out of me. I don’t think I could have handled that scent mingling with the horrors coming out of the box. I’m not ashamed to admit I ran out the door for a breath of fresh air, but in the short time I’d spent in the garage, the smell had become so ingrained in the fabric of my clothes that it clung to me like a shadow.\n\nNothing I tried could keep the smell out of my nostrils. Not air fresheners, not a face mask, not three showers and a change of clothes. Every second that box lay open in my garage was another second the smell was allowed a foothold into my home. I had to bite the bullet.\n\nI returned to the garage, the flaps of the box still open as though inviting me to look. I was prepared, a clothespin pinning my nostrils shut, a garbage bag in one hand, the strongest cleaner I could find in the other, and long rubber gloves to keep my skin from having to touch what was inside. But, as it turns out, I needed none of those things.\n\nI wouldn’t have to touch or clean the contents of that box, I would only have to suffer the nightmares every night. You see, there was meat in that box, but it didn’t come from a cow or a pig. No, it was worse than that. It was my neighbor. Dead. Still in one piece, but dead.\n\nI called the cops, and naturally, they took me in for interrogation. It’s kind of hard *not* to suspect the man with a corpse in his garage, after all. Thankfully, they soon realized I wasn’t involved. My DNA might have been all over that box, the smell might have left a mark throughout my house, but there was one piece of irrefutable evidence in my neighbor’s own hands that proved my innocence: a vlogging camera.\n\nThey showed me the footage only once. I’m not sure if they were allowed to, or if they felt so bad for me they figured it couldn’t hurt. Either way, I saw it.\n\nMy neighbor was sitting in the box outside of a shipping facility, laughing as he told the world how he was going to mail himself across state lines. He’d brought pee bottles, food, a pillow, and a few flashlights. His friend – a guy I’d seen at his place several times to help with his stunts –, closed the lid and presumably dropped him off for shipment. Throughout the next couple of hours…or days, I’m honestly not sure, my neighbor recorded a few short clips about his progress. ‘I think I’m in a truck now, I can feel it moving’, ‘Must be in a warehouse. Pretty warm here. Still got plenty of food!’, that kind of stuff. And then, on the last entry, the box toppled over. He broke his neck, and that was it. The camera recorded until either the memory card got too full, or the battery died.\n\nThere’s one thing I didn’t tell the police after they showed me the video. One thing I heard in the footage that will haunt me to the day I die. Just after the tumble that broke his neck, I heard the familiar screeching sound of *my* garage door.\n\n***\n[ML](https://www.facebook.com/lyset.manen)", "comments": [{"id": "dbdyj9g", "author": "Verruckter_Ingenieur", "body": "> I was always afraid his stunts would wind up bleeding over into my life.\n\n\nwelp...\n"}, {"id": "dbdqv03", "author": "Bruticai_Thezarii", "body": "This was a really good read, glad they let you go."}, {"id": "dbeexk1", "author": "TrueVerthandi", "body": "- Heavy box\n\nOkay, there's gonna be a corpse inside.\n\n- Few days later the box starts to stink\n\nYep, there's definitely a corpse inside.\n\n- Box turns out to contain neighbour's corpse\n\nOk I didn't see that coming... Maybe he was murdered by haters?\n\n- Turns out OP was the murderer by accident\n\nHoly shit."}, {"id": "dbe4y5r", "author": "psykoeplays", "body": "glad i unsubbed his channel, his stunts were getting stupid anyway"}, {"id": "dbdr4go", "author": "peachesandpetunias", "body": "I just saw those shipping box videos trending on Youtube, too. They didn't seem like too smart of an idea, but a lot of them seemed fake. Great story! Good luck getting that smell out of your garage!"}, {"id": "dbelcnr", "author": "SurrealJay", "body": "you know you've read too many horror stories before when you instantly think \"body\" as soon as it was said that the box was heavy..."}, {"id": "dbdy5ps", "author": "J_Dub2385", "body": "ive had packages show up saying fragile and looking like they went through a tornado, a 25 car pile up, and off loaded with a baseball bat. with that said he had to know it could end up that way... oh well he probably should have told you oh btw when i really heavy one shows up open it dont stash it"}, {"id": "dbdwg3d", "author": "CombatDeffective", "body": "I work in a shipping facility. If you hadn't dropped him and snapped his neck, someone else would have, for sure. So, don't beat yourself up. It's his fault,  not yours."}, {"id": "dbee9bd", "author": "s_m_f_a_h", "body": "Jesus, that last sentence literally gave me chills."}, {"id": "dbdxwv6", "author": "Leah1098", "body": "Honestly, as soon as I read the title I started singing Elvis. "}, {"id": "dbe1vzz", "author": "2BrkOnThru", "body": "You shouldn't feel guilty about what happened. Your neighbor should have clearly labeled the package \"Handle With Care\" or \"Fragile\" or something to indicate that there was a living idiot in the box."}, {"id": "dbe3tlq", "author": "_Pebcak_", "body": "I'm genuinely surprised he'd lived through the shipping process.  I can barely get a letter delivered without it being partially opened, let alone a box.  That's some tough luck there :/  It was an accident!  Surely they couldn't convict you?"}, {"id": "dbex692", "author": "urk870515", "body": "It sounds like your garage door needs a couple of new springs and a set of rollers; the newer nylon ones really reduce the noise level and keep it running smoothly. Other than that, make sure to use a synthetic lubricant (not grease!) on all hinges and moving parts every 3-6 months to keep it in good working order. Let me know if you ever need a quote for the replacement."}, {"id": "dbe48o5", "author": "Awokenstu", "body": "Epic fail.."}, {"id": "dbduc8n", "author": "crystalina1984", "body": "Oh shit!\n\nSorry.\n\nNice ending,though!"}, {"id": "dbe1c6k", "author": "cthulhulikescats", "body": "Neighbor should've said something before OP had to lug him over to his house anyway wtf. You definitely shouldn't blame yourself for his stupidity. If he had ended up on a cargo plane he would've froze to death anyway."}, {"id": "dbe8e57", "author": "IAEInferno", "body": "Holy hell, the last part got me good."}, {"id": "dbdv7p4", "author": "gackt2", "body": "I think it not your fault at all, OP, who the hell know your neighbor is crazy enough to mimic Mr.Bean...."}, {"id": "dbe34zt", "author": "ClownOnHer", "body": "\"It's just a prank bro!\""}, {"id": "dbe70p8", "author": "iComplimentPplAlot", "body": "The cracking noise. Dammit😩"}, {"id": "dbe36mh", "author": "overbend", "body": "He deserves a Darwin Award for that level of stupidity. "}, {"id": "dbdudml", "author": "SheikahLink", "body": "Sounds like someone forgot to use packing peanuts.."}, {"id": "dbefa9m", "author": "QueenGamer1992", "body": "Damn, I kind of figured early on that there would be a body in the box, but I didn't think it would be your neighbor and I definitely didn't see the very end coming. That last bit sent chills through me."}, {"id": "dbe0jss", "author": "FaithCPR", "body": "I don't see how he planned to get out of that one anyway... Not your fault OP!"}, {"id": "dbe7zhc", "author": "Alic3_in_zombi3land", "body": "I mean, even if they did know you dropped the box causing him to die, it's not your fault. You didn't know he was in there, it's still his fault. "}, {"id": "dbdqxrx", "author": "blondeviolence", "body": "So who was he mailing himself to? Who did he think would open him?"}, {"id": "dbetl86", "author": "Sophmorrisox", "body": "you know its going to be the \"I Mailed Myself\" challenge when OP mentions youtube, and a box"}, {"id": "dbekbby", "author": "Angry_Pacifist", "body": "Please tell me it was PewdiePie in the box"}, {"id": "dbdw92q", "author": "AccursedShade", "body": "Good riddance."}, {"id": "dbdzdwv", "author": "87MaleCanadian", "body": "Very well written!!  \nWay to get off the hook!"}, {"id": "dbtvgm5", "author": "robotfromfuture", "body": ">I hoped I hadn’t broken anything important, but figured I just wouldn’t tell my neighbor about it and let him assume the break happened en-route.\n\nLOL"}, {"id": "dbeylth", "author": "LadyGallifrey", "body": "His mate should have been tracking the package. "}, {"id": "dbhl0n4", "author": "zeldadaisy", "body": "You are the squidward of your neighbourhood "}, {"id": "dbe31so", "author": "sirenCiri", "body": "At first I thought this was on r/letsnotmeet. I'm so glad I was wrong. "}, {"id": "dbfkfx8", "author": "L1ghtlyS4lted", "body": "r/tifu"}, {"id": "dbfvr4v", "author": "TheLastUpvote", "body": "Twist was so strong that hs broke his neck"}, {"id": "dc7lyqz", "author": "Shayneros", "body": "Add the Curb Your Enthusiasm song to the end of this and it goes from creepy to funny"}, {"id": "dbf0jx0", "author": "seanazepam", "body": "I award your neighbor the Darwin Award. "}, {"id": "dblwfyj", "author": "kinokomushroom", "body": "Ending really made me shiver. Seriously, that was scary, I don't know why, but that made my spine go cold."}, {"id": "dcxde6x", "author": "t_whistah", "body": "I feel Roald Dahl may have especially liked this one. A modern-day tale of the unexpected. "}, {"id": "ddhfk28", "author": "chichikorita", "body": "I can handle so much horror but this actually made me throw my phone across the room as soon as I realized what happened. Amazing story."}, {"id": "dg4ys9e", "author": "Ironicbanana14", "body": "The most unexpected plot twist I think I've ever fucking read."}, {"id": "dbeizl9", "author": "WildFoxHD", "body": "That was honestly a fantastic read. Great job!! "}, {"id": "dbej6lw", "author": "banloosewalls", "body": "This was a very good read, thank you!"}, {"id": "dbeke0m", "author": "Rebelwerewolf", "body": "Well congrats, you got rid of your annoying neighbor! :D"}, {"id": "dbete9v", "author": "LiquidSwords89", "body": "Man that was really good"}, {"id": "dbew5pm", "author": "Grottystatute74", "body": "I'm really glad this didn't turn into a supernatural or fantasy ending. You know, instead of scratching my head to why aliens would try to kill him, your ending makes perfect sense. Very sad, but makes sense."}, {"id": "dbeynwk", "author": "rubydrops", "body": "Were there no air holes for you to look inside? Hell, and didn't say a thing when the box was being moved? Also, mate, you might want to give the last paragraph a check in case the police sees this and put you back in the suspect pool and charge you for manslaughter or something."}, {"id": "dbezzq2", "author": "phoneutriabitch", "body": "I broke my own birthday present once -- a family heirloom porcelain teapot over a century old -- because my mother handed me this heavy grocery tote bag (unbeknownst to me filled with surprise presents) and I sort of petulantly lugged the bag along and then let it drop to the floor with a thud. I heard a faint crack and I thought, \"I hope I didn't break eggs or something. Mom'll be pissed.\"\n\nShe sobbed when I opened the present and the handle had snapped off. She assumed she broke it. I told her it wasn't her fault, it must have got crushed in the car. Yeah, I'm a horrible person, and I've never forgiven myself for breaking that beautiful, hand-painted antique. (I did eventually confess that I broke it, years later.)\n\nAll that said, I guess I'm just trying to say I kind of understand where you're coming from, OP. But it was really your idiot neighbor's fault. I think it's actually a pretty serious crime to try to mail yourself, for the very reason illustrated here: it puts all the people handling the package at risk for negligence, up to and including negligent homicide."}, {"id": "dceadks", "author": "Unknownchill", "body": "Oh my god... be careful with other people packages man! "}, {"id": "dbdqxtl", "author": "vampire_DBR9", "body": "Such a good story... I think he had it coming for him though, packing himself in a box, and mailing it to himself/ you. A pretty dick move,  if you ask me"}, {"id": "dbeb5eq", "author": "SquaggleWaggle", "body": "Don't worry, its not your fault. His own stupidity killed him, not you."}, {"id": "dbebrld", "author": "Deadpool_the_skrull", "body": "So the smell was the guys bowls flowing free?"}, {"id": "dbed3i1", "author": "timchar", "body": "Holy shit!"}, {"id": "dbegdg1", "author": "scbejari", "body": "Whoops you did that!"}, {"id": "dbew7ev", "author": "ElectroArtist", "body": "Um, I love these bone-chilling stories, thanks."}, {"id": "dbeww9b", "author": "TheMagickConch", "body": "Welp no pesky neighbor."}, {"id": "dbex0uv", "author": "prozach50", "body": "Thanks.  This was delicious"}, {"id": "dbezlxs", "author": "Wheynelau", "body": "Expected the corpse thing but I thought it was gonna be a prank thing. Never expected the neck breaking. And the ending too,  wew."}, {"id": "dbf6jjk", "author": "notanotherstalker", "body": "Considering that OP hadn't mention the size of the box, I was imagining something about the size of a box of reamed papers.\n\nWhen the smell started, I thought hmm could it be something supernatural?? \n\nTalk about being caught by surprise when he mentioned it was the neighbour's body!"}, {"id": "dbfb2ab", "author": "SacMetro", "body": "PRANK GONE WRONG!"}, {"id": "dbfp4n0", "author": "sumostar", "body": "that was absolutely fantastic"}, {"id": "dbfxysd", "author": "filthyrichX", "body": "TIFU by killing my neighbor accidentally "}, {"id": "dbi0uf6", "author": "taylorallenpoe", "body": "Wait, why didn't the guy scream or make noise when you were lugging him around, OP?"}, {"id": "dbmswn4", "author": "LakshmiShanti", "body": "wow... AWESOME"}, {"id": "dchdhzq", "author": "DownWithDiodes", "body": "> Just after the tumble that broke his neck, I heard the familiar screeching sound of my garage door.\n\nNOOOOOOOOOOOOOOOO"}, {"id": "ddh08ue", "author": "papilionidae97", "body": "I gotta say that twist was really good, upvoted!"}, {"id": "dgnzqdu", "author": "rusty811", "body": "This reminds me of the song \"The Gift\" by the Velvet Underground."}, {"id": "dhgd7sk", "author": "fayescarlet", "body": "My jaw dropped. Holy shit, son. Don't feel bad this isn't your fault at all."}, {"id": "dbe0k04", "author": "Rocksword100", "body": "Well you didn't kill him your completely innocent and it's his fault for sending his mail to your house and what kind of dumbass thinks it's a good idea to hide in a box for a few days unaware of what's going to happen if I were him I would have faked the video"}, {"id": "dbe7rl2", "author": "Nian70", "body": "Now if he had only told you, dude, if you get a package marked 'return to sender', please be careful with it, and under any circumstances, do not drop it! Dude might have lived!"}, {"id": "dbe8whg", "author": "Neodios", "body": "Man, I hope the smell got away."}, {"id": "dbeau1j", "author": "iHeartCandicePatton", "body": "A dead letter marked return to sender"}, {"id": "dben5gt", "author": "Sablemint", "body": "Don't blame yourself. The guy was an idiot. He couldn't even label the package right."}, {"id": "dbeot7j", "author": "SureNick", "body": "I don't know if it is any consolation, but Lou Reed new a girl who went through a similar experience: https://youtu.be/mI-YiaWDgB4"}, {"id": "dbex8gn", "author": "Lemonta-rt", "body": "Whoops.... My bad..."}, {"id": "dbex8yp", "author": "adultinglikewhoa", "body": "Grease up those rails, homie! Might prevent this happening again in the future"}, {"id": "dbey12d", "author": "AngryBlondie", "body": "Ohhhh I loved this. Very original. I guessed it was a body but never guessed the rest. Excellent"}, {"id": "dbf2jp6", "author": "PeculiarFossil", "body": "Prank gone deadly wrong"}, {"id": "dbf3rrb", "author": "IPlayForCoins", "body": "Lmao someone watched rice gums video"}, {"id": "dbf53ak", "author": "Villeneuve_", "body": "> Hands free, I finally managed to get the garage door unstuck, and boy did it screech in protest as it rolled up and over me. \n\nHere I half-expected the garage door to roll down by itself once the OP got inside, shutting him in with the horrors of the package. "}, {"id": "dbf57cc", "author": "fuckingunapologetic", "body": "Perfect story. Totally saving this one. "}, {"id": "dbffhvg", "author": "Sheikashii", "body": "Holy shit man. That's was a shock. I should have seen that coming but this story was the best. "}, {"id": "dbfgzz5", "author": "meinkush", "body": "Holy shit that was the best no sleep I've read in a while! "}, {"id": "dbfjuau", "author": "secretlyfromatlantis", "body": "That ending. Holy fuck."}, {"id": "dbgit7f", "author": "khelekmir", "body": "Damn the shipping must have been high on that package"}, {"id": "dbgn07p", "author": "Ady2Ady", "body": "Return to sender!\nNo such number!\nNo such zone!\nEDIT: TIL : it's not \"no such song\"."}, {"id": "dbpwhav", "author": "Lunalanana", "body": "That's horrifying, OP. It's so sad you have to live with that guilt... I guess his antics did spill into your life after all."}, {"id": "dbttftd", "author": "hahayeahthatscool", "body": "How do those cops have a job if they couldn't match the recording dates and the date the package was delivered."}, {"id": "dbx7tp6", "author": "findmeatnoon", "body": "Shit... The ending got me so bad."}, {"id": "dccgzu3", "author": "riggers_vr", "body": "Loved the ending, totally unexpected. "}, {"id": "dceo6xz", "author": "DrCorian", "body": "Crap.\n\nI was fine until the end. Probably a bad idea to get on here at 12:00 A.M."}, {"id": "dcg4nxn", "author": "BrodAdams", "body": "OH NO HE DIDN'T "}, {"id": "dcnxyms", "author": "Bladeration", "body": "First I thought ok corpse in box, nothing new and not that original and scary/unsettling but the ending gave me some shivers. Nice use of plot twist!"}, {"id": "dcu8s80", "author": "ausername95", "body": "Best I've read here in awhile."}, {"id": "dcuykcw", "author": "nessknowsbest", "body": "I kinda saw the twist coming."}, {"id": "dczsaox", "author": "setagllib", "body": "This is incredible."}, {"id": "ddoi6sx", "author": "MaydWithSugar", "body": "He would've had to reach his destination for \"return to sender\" to have been written on the box..."}, {"id": "de23su5", "author": "-Alphys", "body": "That ending fucked me over so much.\n\ni love this great work OP!"}, {"id": "dbe2a42", "author": "KaraWolf", "body": "Why the hell didn't he send himself to the same guy willing to ship him in the first place? Or track the package and bring a phone with him? Or actually tell you hey I've got an important package coming in the next few days, would you please open it right when it arrives? Your neighbor was an idiot. And I'm sorry his stunts finally ruined your life."}, {"id": "dbek48w", "author": "fgl723", "body": "Not my box not my problem... thats what i say. "}, {"id": "dbe6hin", "author": "I_love-Kingfishers", "body": "What was that last part suppose to mean? \"Their garage door opening\""}, {"id": "dbdvuvd", "author": "yakbur", "body": "interesting. He should have written fragile/ or handle with care on the box though."}, {"id": "dbenrlz", "author": "wundrwweapon", "body": "Took me a few reads of that last paragraph to get the memo. That was some heavy shit!"}, {"id": "dbepsbq", "author": "RUBIXWARRIOR", "body": "Bit predictable,  but the wording was so great I had to keep reading! :)"}, {"id": "dbeqjsi", "author": "jduder107", "body": "I legit thought I was on /r/needadvice until he reached the part when he found the dead body."}, {"id": "dbeqsy6", "author": "JShad007", "body": "Omg my stomach dropped at the end"}, {"id": "dbeswnq", "author": "Pillarsofcreation99", "body": "Gj , 5 stars "}, {"id": "dbewhu2", "author": "tensing99", "body": "Epic fail!"}, {"id": "dbezvtw", "author": "just__peeking", "body": "My first thought was \"huh, heavy box... someone managed to snag a copy of Kingdom:Death?\" Turns out not as traumatic as that game."}, {"id": "dbfh7se", "author": "AciDic_Pleb", "body": "wow that was a suprise at the ending"}, {"id": "dbgh50g", "author": "samirhyms", "body": "Why do packages sometimes say return to sender? Did it never get to his friend across the state line?"}, {"id": "dbgie9r", "author": "jumbo1980", "body": "Got it. Thanks "}, {"id": "dbigezl", "author": "vaaern", "body": "Return to sender, address unknown... "}, {"id": "dcix160", "author": "cactustit", "body": "omg you got away with it"}, {"id": "de1ktbg", "author": "imma_llama", "body": "Turns out you didn't need to hide anything from your neighbor about dropping the package!"}, {"id": "dev0ucp", "author": "Desidiae", "body": "Wow!!!!!!"}, {"id": "df3bwlt", "author": "dboyd1234", "body": "I heard the light crack and immediately thought... yea the neighbor is now dead."}, {"id": "dflq13l", "author": "LeProYasuo", "body": "That last sentence made me feel very uneasy "}, {"id": "dfta80n", "author": "Zerjua_783", "body": "[Your title reminded me of Fallout: New Vegas] (http://fallout.wikia.com/wiki/Return_to_Sender)"}, {"id": "dh5bpmu", "author": "rythian_", "body": ":<"}, {"id": "di8r461", "author": "immahufflepuff", "body": "The dude should have had a \"This End Up\" label on the box."}, {"id": "di8wtxq", "author": "Aksten", "body": "I'm sorry this happened to you. But this is just too perfect! "}, {"id": "dieeumt", "author": "agenttux", "body": "Is it weird that I find this funny"}, {"id": "dig1nhi", "author": "NoviceApproach", "body": "Well, I guess 'play stupid games, win stupid prizes' applies here"}, {"id": "dih0rdu", "author": "onetruetune", "body": "This just fucked me up forever."}, {"id": "dbdyocx", "author": "Insertnamesz", "body": "What if they had mailed the box through an airplane or something? Would have been the opposite result described here! "}, {"id": "dbei71z", "author": "Beautifly", "body": "Why didn't the guy in the box say anything when op first collected it?"}, {"id": "dbe1txm", "author": "LeakyLine", "body": "RIP PewdiePie\n\nOkay, Pewdiepie breaking his neck belongs in r/yourfantasies :L"}, {"id": "dbdwx8f", "author": "hongvanngh", "body": "Oh shit......\n\nGot yourself some counseling, OP, I honestly think it wasn't your fault. It was an accident, it just happen to be you become the one deliver that . I mean, during his trip, there are million chance his box would topple, bad road, car accident etc, or you also went out of town and leave him there couple days without food or water....."}, {"id": "dbe4bh2", "author": "WeirdWanderer", "body": "I'm confused; did the neighbor ask this guy to get his mail, assuming he that he would open up the box and the neighbor would jump out, telling about the stunt? "}, {"id": "dbet4gw", "author": "myrish___swamp", "body": "I guessed the ending about halfway through but was still shook at the end. Great read 10/10"}, {"id": "dbexg95", "author": "Jintess", "body": "Just so I get this straight (or show what an idiot I am), he made it back home safely, you got the box and while hauling it to the garage, you heard the light crack (after dropping it) which is how his neck broke, right?\n\nHow long was he planning to stay in the box after he arrived home in it? Was he speaking when it happened?"}, {"id": "dc1j30k", "author": "AlvinGT3RS", "body": "Skunk isn't a sweet smell "}, {"id": "dcxurbg", "author": "thexkfedist", "body": "Damn, how small is your neighbor that you thought the box contained meat?! "}, {"id": "ddflcdm", "author": "TheMightyFishBus", "body": "How did the guy smell terrible if he had just died though? I get that he pooped and such, but the way you described the smell was nothing like that. Am I missing something?"}, {"id": "dfwwfa3", "author": "nvk3m", "body": "This sounds like an R-rated episode of Spongebob with the main character being Squidward."}, {"id": "dgnbjj7", "author": "Galgenfrist", "body": "Just read this and ugh that ending, i winced pretty badly :/"}, {"id": "dgny27r", "author": "logrey-joyrider", "body": "This reminds me of that velvet underground song"}, {"id": "dhad1i0", "author": "MidichloriansNevaSlp", "body": "This story really reminded me of \"The Gift\" by The Velvet Underground."}, {"id": "dicj7xx", "author": "mattcopf", "body": "It took me a while to get it. Now I can't forget it\n"}, {"id": "dbdxgyx", "author": "jumbo1980", "body": "I don't get the ending "}, {"id": "dbe0tc6", "author": "Calofisteri", "body": "I wonder if Pewds and Marky will be your neighbor and want to mail themselves?"}, {"id": "dbdx06h", "author": "arthurillusion", "body": "You should feel happy that you ended the life of that motherf***ker by yourself, instead of letting the fact haunt you. "}]}