{"id": "5wduaf", "title": "***EMERGENCY ALERT***", "url": "https://www.reddit.com/r/nosleep/comments/5wduaf/emergency_alert/", "subreddit": "nosleep", "author": "TheCrystalGem", "text": "***EMERGENCY ALERT***\n-THIS IS NOT A TEST\n-IMMEDIATE THREAT FOR RESIDENTS OF [withheld] COUNTIES\n-BE WARY OF:\n  -SEVERE WINDS\n  -LIGHTNING\n  -SEVERE RAIN\n  -FLASH FLOODS\n-RESIDENTS ARE ADVISED TO STAY INDOORS\n  -PLEASE LOCK OR BAR ALL ENTRYWAYS INTO YOUR HOUSE\n-RESTRAIN FROM USING ANY DEVICES THAT EMIT LIGHT OR LOUD NOISE\n-PLEASE ENTER A ROOM WITH NO WINDOWS\n-EFFECTIVE INDEFINITELY\n-ISSUED BY THE NATIONAL WEATHER SERVICE\n\nThis was the message I was greeted by in the middle of an episode of Big Bang Theory in my living room. Frozen halfway through a forkful of Kraft Mac N' Cheese, I sat bolt upright and turned around to look out the window. The sky, as I thought, was crystal clear. A few clouds, but nothing crazy. No rain. No thunder. Nothing. Confused, I turned off the TV, erasing the alert from the screen. My two dogs came walking over to me and I patted them on their heads. One of my dogs, the other's brother, was shaking profusely from the buzzing noise that always shows up with Amber Alerts and the like. I left them in the living room and walked through my kitchen and onto my front porch. My neighbors, too, were standing outside their houses, all looking at the sky in bemusement.\n\nAn immediate threat? It didn't seem like it, I thought as my phone started buzzing with the same tone. One by one, everyone else's phones started ringing.\n\nI should explain, I guess, that I have never experienced a severe weather warning for real. Not once in my life. I suppose it should come as no surprise, seeing as I live in Oregon of all places. I supposed maybe it was just a mistake, but just as the thought floated across my mind, I heard the  siren.\n\nThe siren of the squad car coming down the street. An officer talked through the speaker. \"This is not a drill. Please enter your homes immediately. Do not go outside under any circumstances.\"\n\nNever the kind of guy to ignore higher authorities, I entered my house nervously, turned off all the lights on the above-ground floors, and took my dogs into my basement with a sleeping bag, some food, my phone, a charger, some spare batteries, flashlight, and other essentials. I called my brother, who lives a couple of blocks away, and asked him if he had gotten the message. He had. I considered saying we should stay together to wait out the storm, but then I figured we'd probably get in trouble for that. So I hung up, got comfortable on my sleeping bag, and started browsing Reddit. Eventually, I fell asleep, seeing as I was under stress and had woken up pretty early. When I woke up, I realized that I still didn't hear any rain. Seriously, nothing at all. More confused than ever, I decided to see if the alert had been called off. I turned on my phone and called my brother again. It went straight to voicemail, though, so I gave up. I decided to risk it and go upstairs. I had to squeeze between the door and the wall to keep my dogs from following me upstairs, but I won and they stayed in the basement. I walked through my kitchen to the front door and looked out the window part of it. As I squinted to see outside in the dark (strange, seeing as it was only 2:00 PM judging by my clock), the TV flickered briefly. I looked around at it and it flickered again, but this time every device on the ground floor flickered. Thinking little of it, I turned around and looked through the door again. Every house on the block had its lights turned off. Nobody was outside.\n\nExcept for one teenage girl.\n\nA thin, short-haired girl wearing what looked like a pillowcase walked unsteadily down the street, very slowly, looking as though she was having some difficulty. I turned around, now extremely confused and worried, and got the dogs' food bowls, which I had forgotten earlier. When I looked up, one of the houses, the one diagonally across from mine (right next to the house across the street and to the left) had it's lights on and one of its windows broken. I shuddered and rushed back into the basement as the lights flickered intensely.\n\nI locked the door to the basement and sat on an old, tattered couch that I had brought down here--the basement is where I put everything I didn't have room for. So, yeah, it's packed. Oh yeah, I forgot to mention something that may be worth noting: I live in a small town. A very small town, probably with a population of under 500. Or less. As a matter of fact, it isn't even on most maps. We never make any news, we never have any scandals or anything. This is the first interesting thing that's happened, I think, since Mrs. [withheld] lost her dentures to a raccoon. So, it's possible this whole thing seems way worse than it is.\n\nCall me crazy, but until a few minutes ago, I was thoroughly enjoying myself. I love these scenarios, and my basement is totally secure, so I'm having the time of my life. Well, I was. I decided to turn on my radio--what harm could it do, as long as I didn't turn the volume up to high?\n\nI was surprised to find that our local radio station was still up and running. They were talking about the weather, so I listened hard for any news that I hadn't heard. There wasn't any--they were just as confused as us. Not wanting to listen to crappy pop music indefinitely, I tuned into another station. This one was one I hadn't heard before.\n\n-\"Could you give me the status of [withheld] county? Over.\"\n-\"No new developments. Over.\"\n-\"Okay. Any fatalities? Over.\"\n-\"What part of \"no new developments\" do you not understand, McClellan? A squad car will be passing through soon to scan the area for the target. Over.\"\n-\"Any ETA on that? Over.\"\n-\"No, not yet. Over.\"\n-\"And any word from HQ, Jones? Over.\"\n-\"No, McClellan. Not yet. Not since 013 first got out. Over.\"\n-\"Well, let me know if and when they contact you. Over.\"\n\nAt that point, I lost the signal. Well, not really, but the connection got so weak that I could barely make out anything they were saying. I figured I must have found a police communication channel. And I had been left with no answers whatsoever.\n\nThat was about forty-five minutes ago, as of me writing this now. Guys, I don't know what's going on. Do any of you live near me? You'll know if you've received the warning. I'd say what county I live in, and which ones were affected, but I don't know to for privacy reasons. Anyway, I'll keep you guys updated, okay? Until then, wish me luck.\n\nEDIT: Woah, guys, this has blown up. I'll be sure to keep you posted over the next few days!\n\nUPDATE: Just a quick update before the first major update--about five minutes ago, a car alarm went off somewhere to the right of my house. I'm too freaked out to go check it out, but I'll go up and see how it looks tomorrow morning, and I'll update you then.\n\nNEXT UPDATE COMING TODAY", "comments": [{"id": "de9geyw", "author": "M0n5tr0", "body": "Have you every questioned the quirks of your town?  Less then 500 pop and never been in severe weather is pretty odd.\n\nNow that you have the time to sit and think is there anything else about your town that is off.  Like something that has always nagged at you but is just pushed to the back of your thoughts?"}, {"id": "de9q9sh", "author": "GormBerry", "body": "> Oregon\n\n>A very small town, probably with a population of under 500.\n\nDo you live in Gravity Falls?"}, {"id": "de9db6n", "author": "SardonicAlien", "body": "This sounds like Stranger Things, just a little bit!  Stay safe, OP - weird stuff out there!"}, {"id": "de9b60c", "author": "realchloeprice", "body": "Wow, that seems pretty scary, OP. I'm not sure what that girl in the street was doing, but I would recommend to be very wary. I think that \"013\" may be some kind of experiment done by the local government, and it got out of containment some how. If anybody knocks on your door, don't open it, and stay in your basement with the dogs. I think that you aren't supposed to use devices that emit light or loud noise in case it alerts whatever got out. Be safe, OP."}, {"id": "de9b430", "author": "Wolfy_McDerpbutt", "body": "Fellow Oregonian, but I haven't heard anything OP. Good luck, and keep us updated"}, {"id": "de9gzqc", "author": "CherryThePanPyro", "body": "Op, \n\n[I found the post I was talking about](https://www.reddit.com/r/nosleep/comments/56t06u/alert_threat_level_severe/) \n\nyou might want to check this out. "}, {"id": "de9j7un", "author": "ChargedMedal", "body": "OH FUCK, MAN, I HAVEN'T READ SHIT YET BUT I READ SOMETHING ABOUT FUCKIN WEATHER AND FUCK MAN WEATHER GETS ME"}, {"id": "de9g7rw", "author": "Chody__", "body": "Is this going to be continued "}, {"id": "de9ffio", "author": "BunnyBoise", "body": "Oh wow this sounds very scary, have you tried contacting your brother again? Or anyone that lives near you?"}, {"id": "de9kguj", "author": "alicevanhelsing", "body": "Finally. Someone who's smart enough to stay indoors, secure their home, and gather enough provisions. Too many people on this site would have done something stupid like convince themselves there's nothing wrong and go outside.\n\nAnyway, continue to lay low. Keep the house locked and secured and stay in the basement as much as possible. I say stay indoors as long as you can or until there's been news that everything is okay already. Don't let your dogs out at all either. Make sure they don't escape the basement. They may bark and alert someone/something to your place. If they need to do their business, take them to the shower and let them go there. You can wash away whatever you can and just throw everything else in the trash. I don't think it's worth it to even head outside quickly to let them go in the yard."}, {"id": "de9ysn1", "author": "notashleyjudd", "body": "WHERE ARE THE DOGS POOPING???"}, {"id": "de9hcth", "author": "Joeenid1", "body": "A pillow case & a boxy hospital gown can look similar- call & tell the sherriff station about the girl you saw RIGHT NOW."}, {"id": "dea3me9", "author": "TheCrystalGem", "body": "UPDATE COMING TODAY"}, {"id": "de9nlk3", "author": "theedoctap", "body": "Poor Mrs. [withheld]"}, {"id": "de9gu8w", "author": "CherryThePanPyro", "body": "OP, I remember this but someone posted here with a similar situation? It was a guy with cats in his basement and he heard something terrifying outside. He was told the same thing but it wasn't the EBS it was it's own program? OP should try to find that post. "}, {"id": "de9czj2", "author": "Deusraix", "body": "*Stranger Things intensifies* Maybe she's related to 011? Stay safe OP, that little girl you saw outside seems suspicious and dangerous. Don't turn on any lights, make loud noises and avoid windows as the warning said. "}, {"id": "de9jry1", "author": "aangdresskwang", "body": "Let her in and let the plot of Stranger Things begin.\n\nIn all due seriousness though, stay safe and be wary of demagorgons."}, {"id": "de9oo9p", "author": "Metafrey", "body": "Dude, you didn't get a little bit suspicious that this was not a weather event when the warning included \"no lights or loud noises?\"\n\nYou aint going to attract much assistance from emergency services without making noise or flashing lights, so why would the weather service tell you this?\n\nClearly you are in some kind of lockdown event, from the sounds of it you may have either a military experiment running loose or a creature not from around these parts.\nThe pillow case on the young girl is pointing more towards an experiment as i think that could of been a gown used by hospitals.  You may of seen what they are looking for.  Try to make contact with them and tell them where she is, best of luck with surviving this!"}, {"id": "deahr37", "author": "TheCrystalGem", "body": "OKAY, SO I just tried to post part 2 but I have to wait 5 hours. It'll be up soon!"}, {"id": "dggmngs", "author": "Whiskey_Warchild", "body": "where's the update??"}, {"id": "de9fmy4", "author": "ForwardHamRoll", "body": "***ALERT: THREAT LEVEL SEVERE***"}, {"id": "de9jcrx", "author": "DillPixels", "body": "After reading the first few lines I had to come down to say I feel like this has happened before?! To another redditor?? Like it's happening again?!\n\nEdit: Finished reading and dude please stay in your basement with the lights out. I'll have to go back and find it but several weeks ago there was another post where something similar happened we all kinda thought it was some government test went wrong covered up. T them stalling everyone to lock themselves in windowless rooms to minimize fatalities and witness. Play it safe OP. "}, {"id": "de9en3q", "author": "agentfubar", "body": "That girl sounds creepy as hell, but I guess she could just be sick? Poor thing. Anyway, is the door the only way into your basement? Stay safe, OP!"}, {"id": "de9hzex", "author": "bwave1", "body": "I remember the first time I received an EMERGENCY ALERT.   It was 3:03am and when it sounded it was the LOUDEST KLAXXON SOUND you've ever hear.  Since I never heard my phone do that ever, and I was barely awake, at first I didn't even realize it was my phone and it scared the shit out of me.  I truely thought as I slowly realized it was my phone that I was going look and see we were under nuclear attack.  (i after all live just 100 miles from Washington, DC) - And there it was \"Flash Flood Warning\" - what the actual fuck.  I live 30 miles from the ocean (and any other known body of water) if the fucking ocean overflows by 30 fucking miles then we're in worse trouble then I ever could have imagined, please Verizon, don't warn me next time!  "}, {"id": "de9shou", "author": "Lordlemonpie", "body": "OP, do not look outside! Avoid looking at the night sky at all costs!\n\nI got the same video broadcast as you, do not trust anyone, don't let anyone in!\n\n[Here's the broadcast](https://youtu.be/-oyrcxgY6YM) as displayed in my county. I was browsing 4chan's /x/ at the time, so it switches back to that for a second or two. The end is absolutely frightening."}, {"id": "dfgh9ch", "author": "bq909", "body": "Scariest part is the fact that you watch the Big Bang theory "}, {"id": "de9itvh", "author": "sweaterfeathers", "body": "Reddit crashed every other time I tried opening this"}, {"id": "de9ogch", "author": "degenerate777", "body": "Feed that girl eggos. Problem solved."}, {"id": "de9l2ir", "author": "Riggybee", "body": "Block any possible above ground windows, vents and cracks under your basement door, just to be safe. Do your dogs bark? If so... And I know it sounds horrible... But you need to put them upstairs. You're not gonna have anything good if they start barking downstairs w you and leads whatever possible... Thing to you. I don't trust that girl. I don't trust the police. Make sure you have water and some sort of food down there with you. Do not make a sound. Do not emit light. Do not attract.. It? "}, {"id": "de9l4ak", "author": "StephanieZD", "body": "I'd be freaking the hell out (I am, let's not kid). There isn't a room in my house without windows. I'd be screwed. Stay safe, OP. My goodness.  "}, {"id": "de9h4jf", "author": "somnusxen", "body": "Don't mean to stress you out. But are you worried about your dogs making any noise? You should take some precautions in case they start barking."}, {"id": "de9rj4v", "author": "foghaze", "body": "Google police scanner in your area. They have them online. This might help you get answers. Keep us posted and let us know what you hear on the scanner. "}, {"id": "de9hy2x", "author": "martinsonsean1", "body": "Well, it's definitely not the SCP foundation, I'm pretty sure SCP-013 can't get out on their own, and would generally not be dangerous enough for an operation of this scale."}, {"id": "de9o0af", "author": "LPTme", "body": "Damned raccoons. I can't tell you how many toupees I've lost to those little thieving bastards. "}, {"id": "de9r94h", "author": "foghaze", "body": "I'm not saying this to scare you but I've been in many severe weather scenarios and police do not drive around telling people to go inside. Whatever is happening there it's not about the weather.  The broken window and the female in the street is very strange.  Hoping this clears up in the morning and you are given an explanation.  Sounds military related IMO. "}, {"id": "dea50wn", "author": "coldcoffeecup", "body": "Well, on the upside at least you didn't have to keep watching The Big Bang Theory."}, {"id": "de9fok2", "author": "HisCricket", "body": "Please keep us updated m"}, {"id": "dhj1qpi", "author": "AnybodysAnswer", "body": ">in the middle of an episode of Big Bang Theory\n\nDownvotes immediately"}, {"id": "de9j0ww", "author": "unrestricted_domain", "body": "Almost sounds like an Electro-magnetic pulse"}, {"id": "de9kug1", "author": "ouroboro76", "body": "How much water do you have? You can live weeks without food, but only a few days with no water. Is there a tap in your basement?"}, {"id": "de9h14x", "author": "FuckWhileYouTuck", "body": "Is your home near any government research facility/prison or Area 51?"}, {"id": "de9mwtx", "author": "RevanisAlive516", "body": "It's the Predator. Do not. I repeat, do **NOT** grab a weapon. Predator will not hunt you if you're unarmed. The Predator is a noble creature. "}, {"id": "de9yjxh", "author": "JinjaHD", "body": "I'm new to nosleep. Is this a story or an actual event?"}, {"id": "de9ecrl", "author": "Iwilleatyourwine", "body": "I live in the U.K. Near a primary government used air base, sometimes they cut the phone signals out for us, and we are able to tune into what they're saying on radios if you toggle enough so I find this fascinating.\n\nLook forward to hearing updates about this, stay safe, sending love from London💖"}, {"id": "de9fams", "author": "Counterattack199", "body": "Have you posted about this before? Reminds me of something I saw a while ago. Maybe something similar is happening in other places as well?"}, {"id": "de9lqwk", "author": "macster725", "body": "Lets all just hope that IF this is a government test they don't take down this post."}, {"id": "de9p7dd", "author": "fallen-fawn", "body": "I hope your doggos will be okay!"}, {"id": "de9jqv2", "author": "cisagent", "body": "I live on the other side of the country but this sounds scary AF. Be safe, stay off your phone for a while and draw or do some reading until this whole thing blows over. "}, {"id": "de9klql", "author": "inactivewink", "body": "Try to stay safe OP! Don't try to help that teenage girl and stay barricaded. Are you alive?"}, {"id": "de9pwwf", "author": "Ivelostmydrum", "body": "Is there a bathroom in your basement? "}, {"id": "de9rxr3", "author": "pointofgravity", "body": "SCP Containment Breach at [REDACTED], MTF Intel compromised. Procedure Aleph-Maetus recommended, high priority to civilians."}, {"id": "dea1c68", "author": "Ultraman5000", "body": "No activety for 9 hours. looks like he's dead. oohhhh well"}, {"id": "de9hgcy", "author": "raddchloe", "body": "Good luck. Be calm and please try not to leave the house. Also, be VERY WARY when going upstairs, who knows what might be up there. :/"}, {"id": "de9twg2", "author": "pabbylink", "body": "Why does this sort of stuff always seem to happen to Americans?"}, {"id": "dea2cfe", "author": "Kikikay0010", "body": "Of course I read this when it's raining hardcore in my city, everything's quiet, all of my windows are wide open (my roommate hates having things closed...) and my rice cooker just went off. Nearly pissed myself. \n\nKeep us posted OP! Hoping you're okay from good ol Bama❤️"}, {"id": "deaenmy", "author": "Haikubo", "body": "I'm really concerned as a scatophobe.  Are your dogs pooping in the basement?\nEdit: grammar"}, {"id": "deaziks", "author": "TheCrystalGem", "body": "PART 2 IS LIVE! PROBABLY FOR GOOD NOW!"}, {"id": "de9e6du", "author": "racingstripes103", "body": "Are you into Steven Universe? Just a question, because of your username."}, {"id": "deabr1d", "author": "Eternal_Bumpus", "body": "The Big bang theory is a horrible show that's the real horror. "}, {"id": "dea57ze", "author": "W-h3x", "body": "Been digging through Google about this broadcast... \n\nCan't find anything.\n\nShove really scary stuff."}, {"id": "de9l2q2", "author": "_DarthJawa_", "body": "This seems like an SCP containment breach or something. You might want to consult /r/SCP to see if they have had any recent breaches"}, {"id": "de9p4g1", "author": "thundergun661", "body": "Im thinking the weather has something to do with the girl, and the girl is the target"}, {"id": "de9qh59", "author": "kenzie-tea", "body": "stranger things vibes af"}, {"id": "de9z2ds", "author": "ultimatecaissie", "body": "Listen, looks like you got an unenncrypted signal which is odd in such cases, don't expect to get any of these from the military since they use crypto's in such situations and are impossible to tune in without the same crypto on the same frequency. \n\nNow, besides that. Explain to me what the girl looked like, she was walking in a pillowcase like uniform, any other distinct features ? Blood ? A number on her clothing ? What kind of clothes did she have (I need colors, markings?\n\nSeems like someone escaped from a facility, either mental institute or test facility. Either or, stay safe. "}, {"id": "deabw0e", "author": "Lazeruse", "body": "Remind me when the update comes "}, {"id": "deai38x", "author": "Crimson_Lavender", "body": "Oregon? Severe weather? Confused girl? \n\nHold up are you actually just seeing Max Caulfield? Was there a blue headed woman who kept dying nearby? "}, {"id": "ded2a42", "author": "jory4u2nv", "body": "To those who can't find the updates, visit OPs profile and you'll find links to both updates 2 and 3. For some reason OP didn't post the updates here."}, {"id": "de9gq7a", "author": "jennaleighlegge", "body": "Fuck"}, {"id": "de9n2fl", "author": "MegaPuft", "body": "Why would I read this if I knew I wouldn't be able to sleep... Sigh I hate myself"}, {"id": "de9obdz", "author": "Politico_Manifesto", "body": "Hey it's me ur neighbor."}, {"id": "dea97d8", "author": "Megafeto", "body": "Two things:\nSTAY THE FUCK DOWN THERE AND DON'T LOSE THAT STATION. Don't risk it. Don't peek again to watch out for her, or anything. And the police radio is the best source of information you have. "}, {"id": "deaa3fc", "author": "DIESASTERR", "body": "Make sure not to eat cheese cubes, wear hoop skirts, wave flashlights, or wear clown shoes you never know when a sea bear could be afoot. "}, {"id": "deab2j5", "author": "NightReaper3210", "body": "Netflix can have an endless supply of originals from r/nosleep"}, {"id": "deabh2m", "author": "marctheguy", "body": "Reddit noob here. How can I set an alert for when the next part is posted?"}, {"id": "deahr5l", "author": "ayyak", "body": "Wait is this for real? I thought these were just stories "}, {"id": "deai2is", "author": "iDoctorSmitty", "body": "Is there a way I can get a notification once the second part is out? "}, {"id": "deayz7l", "author": "Rcordalis", "body": "Still waiting for the update..."}, {"id": "debmvjn", "author": "iampretendingtowork", "body": "OP UPDATE THIS SHIT SO I CAN READ PART 2 WHAT THE FUCK!"}, {"id": "debn5sw", "author": "Placher1", "body": "Where's this update from yesterday??"}, {"id": "de9skuv", "author": "yaddar", "body": "Strange.\n\nI have a family member who lives in [whithheld] but she had to drive to Seattle because work.\n\nShe just sent me a message on FB telling me she had to spend the night in a Motel because when she was driving home, the road was blocked by firefighters and State Police around 30 miles from [withheld], around by the state road junction that leads to [withheld] so they were diverting all traffic there.\n\nShe told me the traffic was slow and, judging by the number of ambulances, she at first had tought that a traffic accident had occured, but then when she heard the military helicopters flying overhead, the people stuck in traffic seem to have gotten really nervous, thinking that a terrorist attack might have occured... but then again, these counties are far from being an ideal terrorist target so everyone was checking radio stations for news but finding nothing out of the ordinary.\n\nWhen she arrived to the Motel, there were a few people in the lobby texting and calling their families, and, since the place was small, it got booked really quick so the front desk girl was making calls to the already-booked rooms to see if people agreed to share a room for the night with a fellow stranded traveler (my family member, she got lucky BTW, since she met this woman at the parking lot who already had a room and she agree'd to host her)\n\nThe rumors she heard among the people in the lobby were quite odd, though. She told me that this \"Truck driver guy\" [sic] was talking about how he got a call on the radio from a fellow trucker that happened to come from [withheld] en-route to [whithleld] and informed him and fellow truckers tha situation at that end of the inter-state was the same, blocked by state, paramedics and a military truck. But, he (the second truck driver) also reported having witnessed some state police officers who were discussing over a map with a soldier, pointing at it and apparently ddiscussing \"like they had no fucking clue where the town was\" [sic]. So in the end it seemed that on both ends of the road no one was really sure how to proceed or where to go.\n\nI know this is second-to-fourth hand rumours, and don't know if this relates to your story, but seems no one really knows for sure and if you say your town is around 500 people I guess you live in [withheld] which is just 12-15 miles from [withheld], which is my family member's hometown."}, {"id": "de9qrwj", "author": "LeakyHourglass", "body": "The girl is the one that's in danger, not you. She possesses some special qualities that are of interest to a certain Government agency. The girl escaped the facility where they were performing tests on her, and now she's being hunted. Thing is they're afraid of her now, so they're keeping their distance.\n\nYou could help her if you wanted. She's scared though, so it might take a bit of persuasion, especially after what she went through.\n\nIf you decide to help her, just open the door and tell her 'The northern lights are special'. She'll know what it means and tell you where she needs to go.\n\nTry to only travel by night. If not, find her a pair of UV-blocking shades. Also, don't touch her skin. And by all means stay away from power lines, transformers and the like.\n\nGood luck!"}, {"id": "de9ke66", "author": "paganminkin", "body": "I'm going to reckon some kind of government experiment has escaped. It's something dangerous enough to make them put up fake weather warnings. Keep your lights off and bar that door; don't just lock it. I wouldn't go out again until the all clear is given, OP. And make sure the dogs keep quiet, too."}, {"id": "de9klel", "author": "velcrorine", "body": "for me, 013 is a sick number, it just rolls out from your tongue perfectly..\n\nthoughts aside, you should be wary of everything; what if they're too determined to stop 013? assuming if it is a person.."}, {"id": "de9ktcy", "author": "Unlimited_Cha0s", "body": "Ooo i like these, stay safe and update us, alright?"}, {"id": "de9m5d5", "author": "MrHorseHead", "body": "> r/nosleep\n\n>  Eventually, I fell asleep,\n\nhttps://youtu.be/OqjEGI2jk2A"}, {"id": "de9n0ro", "author": "Ace1999", "body": "What's really scary is eating a Kraft dinner while watching BBT."}, {"id": "de9nii1", "author": "MrVeezinator", "body": "https://www.weather.gov/wwamap/wwatxtget.php?cwa=pqr&wwa=all"}, {"id": "de9q3by", "author": "duck-in-space", "body": "Neither the Police or the Army use actual names in radio comms. Probably a joke by some third party... "}, {"id": "de9syx6", "author": "13igworm", "body": "I'd be pretty peeved if an emergency alert interrupted my show and withheld the name of the town too."}, {"id": "de9tu4n", "author": "ComicGirl1234", "body": "Stay in the basement. Don't go outside in the morning. Don't you realize all movies have a character do something they shouldn't, and then they get in a perilous situation? You are not a movie character. You will most likely die if you go out.\nEdit: Auto correct is weird"}, {"id": "de9u65d", "author": "FishFruit14", "body": "Nice username, by the way. If you don't die, you should visit is over at /r/stevenuniverse"}, {"id": "de9xi6o", "author": "General_Stone_Star", "body": "OP was last active 9 hours ago. I'll guess he was planning on getting 8 hours of rest. \n\nWe should have an update pretty soon since he probably has only been up for an hour. "}, {"id": "dea97is", "author": "Megafeto", "body": "Two things:\nSTAY THE FUCK DOWN THERE AND DON'T LOSE THAT STATION. Don't risk it. Don't peek again to watch out for her, or anything. And the police radio is the best source of information you have. That girl reminds me of the movie \"The Ring.\""}, {"id": "deabmws", "author": "MegaUltraJesus", "body": "I live in the cascades and I  haven't heard anything about a weather alert. Just a rainy day like any other. Source: currently pooping at work"}, {"id": "deaeja4", "author": "fatfatman3", "body": "Before I started reading this, I thought to myself that sounds like a weather warning Oregon would get. Then I keep reading and it's Oregon :)) then I see it's a small town :)) I live in Oregon in a small town. Luckily not as small as that but with around 2,000 people.\n\nPartially another reason this freaked me out is due to the fact that all those weather conditions just started happening a couple days ago around where I live. Even though it doesn't appear to be happening to you. "}, {"id": "deanb28", "author": "CypressJoker", "body": "Where's series bot when you need it?"}, {"id": "deatkva", "author": "artinchaos", "body": "This post actually gave me a nightmare. "}, {"id": "deavns7", "author": "Nozart79", "body": "The anticipation is killing me, but I can't imagine how you feel right now"}, {"id": "dezz3a1", "author": "Rs_Zkazim", "body": "Is there actually gonna be and uppdate it was it meant that you died? "}, {"id": "de9halm", "author": "SonkBandvich", "body": "Kraft? lol get out of here __with that weak shit skrub__"}, {"id": "de9w7wl", "author": "Kyro92", "body": "I'm hunkered down with my family as well, and we haven't noticed any odd weather to justify the alert either. Thing is, we're a farming family and the animals obviously need to be cared for- my Father is insisting that the alert is a load of hooey and that we should tend the animals as per usual, while my Mother is begging him to heed the alert- she \"has a bad feeling\". \n\nWell, it's been almost 24 hours now, and I'm starting to agree with my Father- 24 hours, and it's been *so quiet*, nigh silent. The animals need tending... there's something prodding at the back of my mind though. I can't put my finger on it...\n\n\n\n"}, {"id": "de9k3mt", "author": "evection94", "body": "That first part immediately made me think of [this](https://www.youtube.com/watch?v=mw_HKzo9Ync)!"}, {"id": "de9hae0", "author": "N-K_N3CR0S1S", "body": "Call in the MTFs"}, {"id": "de9hya6", "author": "darkrider400", "body": "Could SCP's be real then? Maybe this is a new one and they had no idea what it was capable of. Id sit this one at as long as possible, OP. Live to tell the tale."}, {"id": "de9jja4", "author": "XxxDracoMalphasxxX", "body": "Sounds like a containment breach to me "}, {"id": "de9jp0e", "author": "Ultraman5000", "body": "It seems like they have been doing some MKultra experiments or something like that. if the government were to be doing some experiments it either be in the middle of nowhere, at a super secure and secret military base that is also in them middle of no where, or near a small town like yours. Makes you question if these crazy things like mind over matter and telepathy are real.  "}, {"id": "de9m55y", "author": "Fadedgogeta", "body": "Wanted to say the SCP Foundation is in the area, but SCP-013 is nothing special, so yeah. If it is the Foundation you are surely fucked beyond belief."}, {"id": "de9qc4j", "author": "Foenix499999", "body": "Holy hell. I was on the frontpage and this popped up and didn't notice the sub that it was from until I finished reading. I'm spooked."}, {"id": "de9qxhc", "author": "mechadine", "body": "And now -- THE WEATHER!"}, {"id": "de9rkdq", "author": "OGCoon", "body": "Any updates OP? wishing you well from Australia "}, {"id": "de9x087", "author": "sierra_hotel81", "body": "Do you know of any nearby prisons or mental hospitals? Sounds like someone got loose and broadcasting safety precautions from the NWS was the most effective way to alert the locals.\n\nEither way, good luck and stay safe!"}, {"id": "dea17zu", "author": "LaLiLuLeLo7891", "body": "30 Days of Night meets Stranger Things. I am intrigued."}, {"id": "dea4d93", "author": "RevanisAlive516", "body": "I'm still saying it's the Predator. "}, {"id": "dea5qkp", "author": "JoanofArc5", "body": "Did you call the police to report the girl in the pillowcase? You can't go outside but you should help her "}, {"id": "dean7r4", "author": "johnbmx00", "body": "Do you have any social media we can communicate through?\n"}, {"id": "deaosp0", "author": "Nilloc8", "body": "Do you have a prison nearby?? 013 almost sounds like a prisoner identification number. Especially if a window was broken and a car alarm went off. Be careful!"}, {"id": "deb8o8z", "author": "cabsence", "body": "Please put links to your updates in your originals."}, {"id": "debjfpf", "author": "sadso2", "body": "Yo the second one just got deleted the girl has found op or the police shut this down to stop us from learning the truth "}, {"id": "debleuu", "author": "CaptainEdgy", "body": "Still waiting for an update OP, everything good?"}, {"id": "dexoamn", "author": "InkyQuillsRN", "body": "So aren't you concerned you'd drown in your basement if there is a flash flood?"}, {"id": "de9gqg3", "author": "B1gD1ckL0v3r", "body": "It's eleven from Stanger Things"}, {"id": "de9j6rg", "author": "theskyalreadyfell217", "body": "It's totally that teenage girl.  Go see if she is still out there. "}, {"id": "de9kuot", "author": "IrIsFox1", "body": "Wait what part of Oregon do you live in, I live in Oregon too but I haven't got any alert since the big 2014 winter storm"}, {"id": "de9lnq0", "author": "Themarcusman14", "body": "OP I made it out of town and am heading to Portland. Do NOT engage with 013! Stay indoors, stay dark, stay quite. "}, {"id": "de9m39p", "author": "jazzinyourfacepsn", "body": ">Big Bang Theory\n\n\nAaaannd interest is lost."}, {"id": "de9lw93", "author": "macster725", "body": "Probably just a similar monster from Super 8"}, {"id": "de9n0id", "author": "alt-227", "body": "Wait, your left or my left???"}, {"id": "de9oeiw", "author": "Ninjasaurus1", "body": "remind me! 2 days"}, {"id": "de9puog", "author": "Lynjamin08", "body": "I know Stranger Things,...but what about a Storm, mutant x gene type deal?\n\n"}, {"id": "de9rb4q", "author": "SomeoneTrading", "body": "Don't worry, you'll get your amnestics soon enough. "}, {"id": "de9sr6s", "author": "BDunnn", "body": "Holy fuck. When I was reading this last night, a test Amber Alert hit my TV with that awful sound. It scared the living shit out of me. \n\nNeedless to say, I didn't sleep all that well last night. Thanks OP"}, {"id": "de9tjxu", "author": "Mentioned_Videos", "body": "Videos in this thread: [Watch Playlist &#9654;](http://subtletv.com/_r5wduaf?feature=playlist)\n\nVIDEO|COMMENT\n-|-\n[Local 58 - Weather Service](http://www.youtube.com/watch?v=mw_HKzo9Ync)|[+5](https://www.reddit.com/r/nosleep/comments/5wduaf/_/de9k3mt?context=10#de9k3mt) - That first part immediately made me think of this!\n[Barzoople (Big Bang Theory Parody) [Panoots Cartoons]](http://www.youtube.com/watch?v=YjMWnOezGU0)|[+2](https://www.reddit.com/r/nosleep/comments/5wduaf/_/de9owdo?context=10#de9owdo) - BARZOOPLE  EDIT:   it's a reference to this you dickweeds\n[Family Guy The Phony](http://www.youtube.com/watch?v=OqjEGI2jk2A)|[+2](https://www.reddit.com/r/nosleep/comments/5wduaf/_/de9m5d5?context=10#de9m5d5) - r/nosleep  Eventually, I fell asleep,\n[Tropical Skeleton Dance - PlayStation 4 Dynamic Theme](http://www.youtube.com/watch?v=tGGVmecOpO4)|[+1](https://www.reddit.com/r/nosleep/comments/5wduaf/_/de9tj8y?context=10#de9tj8y) - Their so horrifying\n[Stranger Things  Title Sequence [HD]  Netflix](http://www.youtube.com/watch?v=-RcPZdihrp4)|[+1](https://www.reddit.com/r/nosleep/comments/5wduaf/_/de9hx2x?context=10#de9hx2x) - http://www.youtube.com/watch?v=-RcPZdihrp4\n[weatherbroadcast](http://www.youtube.com/watch?v=-oyrcxgY6YM)|[+1](https://www.reddit.com/r/nosleep/comments/5wduaf/_/de9shou?context=10#de9shou) - OP, do not look outside! Avoid looking at the night sky at all costs!  I got the same video broadcast as you, do not trust anyone, don't let anyone in!  Here's the broadcast as displayed in my county. I was browsing 4chan's /x/ at the time, so it swi...\nI'm a bot working hard to help Redditors find related videos to watch. I'll keep this updated as long as I can.\n***\n[Play All](http://subtletv.com/_r5wduaf?feature=playlist&ftrlnk=1) | [Info](https://np.reddit.com/r/SubtleTV/wiki/mentioned_videos) | Get me on [Chrome](https://chrome.google.com/webstore/detail/mentioned-videos-for-redd/fiimkmdalmgffhibfdjnhljpnigcmohf) / [Firefox](https://addons.mozilla.org/en-US/firefox/addon/mentioned-videos-for-reddit)"}, {"id": "de9tpxc", "author": "redditreader_v", "body": "Time to call in the SCP foundation."}, {"id": "de9tzv0", "author": "SovekNA", "body": "You should try to find your brother if his house is not too far"}, {"id": "de9vf9o", "author": "____Batman______", "body": "The aliens are coming down guy this some war of the worlds type shit "}, {"id": "de9x032", "author": "LordLOLZ", "body": "Am I the only one who is reminded of stranger things while reading this?"}, {"id": "de9xxgk", "author": "Sarahsparkleshine", "body": "WHAT'S HAPPENING???"}, {"id": "de9xxgq", "author": "Annie_Kay", "body": "013? How's 011 doing ? I can't wait till Halloween to find out "}, {"id": "de9y53o", "author": "Dontayy", "body": "Please remain in your homes, if you are not at home, find shelter immediately. Close all blinds and shades, block out all windows.\nDo not look outside.\nDo not look at the sky.\nDo not make noise.\nYour cooperation is vital to your survival"}, {"id": "dea1dur", "author": "blazing420kilk", "body": "Whatever you do, **stay in your basement** do not try to be a hero, do not go up to *check on things*\n\nThose are the easiest ways to get screwed over in situations like these"}, {"id": "dea45xc", "author": "osallivan", "body": "Daaamn Eveline. Sounds like Resident Evil to me :P"}, {"id": "dea544g", "author": "TheFallen__", "body": "Sounds like the start of a zombie movie XD \n\nI wouldn't worry to much though just stay safe for a day or two maybe it's a drill or somthing weird "}, {"id": "dea7qy7", "author": "Funandgeeky", "body": "Reminds me of how Akira got started. If at all possible, stay far away from that child. She could be far more dangerous than even the authorities know."}, {"id": "deacl4t", "author": "Alarabi98", "body": "Is the government doing some test on your town dude? This is a whole mystery of itself."}, {"id": "dead0e6", "author": "McSmartAlec", "body": "My good sir or ma'am OP, you affected my dream last night. That was by far the weirdest dream I've ever had. Except mine was like aliens or some shit. My fish turned into a hamster, then back to a fish. It then caught on fire and I walked outside to hear \"ohhhhOHHHHHHHHHHohhhhhhhhhhOHHHHHHH.\" After then noises I had what felt like zero gravity and floated away. Thankfully I've had so many nightmares as a child I can wake myself up from dreams, was not ready to confront that being. "}, {"id": "deaes4t", "author": "cliffnmoon", "body": "Where's the update? Hope you made it alive. "}, {"id": "deajln3", "author": "elementgermanium", "body": "013? That gives an SCP feel right there."}, {"id": "deal7hm", "author": "GirlShapedAnomaly", "body": "Lemme give you advice:\nStay in your basement, and keep your radio on that channel. Eventually, what the people are calling 013 might be captured and you will be safe. Though you are withholding your county, may you please give us your general area (state or country)?\n\nStay safe OP.\n\nSince everyone seems to survive on no sleep its a good thing you posted this.\n\nEdit: Sorry for not noticing in Oregon\n"}, {"id": "dealaw8", "author": "shortyolordy", "body": "I live in Oregon and haven't heard anything of this sort so it must not be in effect in our county. We mostly got a snow warning. Where abouts are you? N, S, E, or W?"}, {"id": "dealgv2", "author": "x0_Kiss0fDeath", "body": "Stay safe, Night Vale!"}, {"id": "deanspk", "author": "Artificer_Nathaniel", "body": "In michigan our afternoons in the summer swing from sunny/very hot to massive thunderstorm cell with hail and cold temperatures in about 10 minutes (around 4 or 5 o'clock), we usually hear a siren and then head downstairs for a half hour, occasionally an hour, then when its done continue our day like nothing happened. Sometimes in the news you see some people who wernt able to carry on their day/lives like nothing happened and usually school students do a money drive to help people in need.\n\nGood decision to not try to go to your brothers place.  I drove a few times during an alert, nearly died all three times."}, {"id": "deatnlc", "author": "superblobby", "body": "I gotta reprimand McClellan, idiot didn't use his private comms. The O5s will be hearing about this."}, {"id": "decdik0", "author": "poppypodlatex", "body": "The lone girl walking the streets is odd. I'd bet money she is the 013 that  \"first got out\"."}, {"id": "defn5am", "author": "doinkrr", "body": "Inb4 bazinga"}, {"id": "de9l4lm", "author": "SomeDumbKid213", "body": "\"Im from Oregon\"\n\n\"I would tell you which country im from but no\"\n\nSo thats a little zombie girl in the states then?"}]}