{"id": "61b5ls", "title": "Fran and Jock", "url": "https://www.reddit.com/r/nosleep/comments/61b5ls/fran_and_jock/", "subreddit": "nosleep", "author": "Pippinacious", "text": "I was the last in a long line of grandkids on both sides of the family. No one has ever said as much, but I'm pretty sure I was an \"oops\" baby; the result of one too many glasses of wine and a couple over forty who thought unplanned pregnancies were for teens.\n\n\nOops.\n\n\nBy the time I came along, both of my grandmothers had already passed away and my grandfathers were elderly and lived in different states. Trying to coordinate travel plans for a family of five, including an infant, was difficult on a budget and neither of my grandpas were up to frequent trips, so visits were rare and spaced out over long periods.\n\n\nStill, both of my parents wanted me to have a relationship with them, so we'd trade phone calls so they could hear my nonsensical baby babble, they'd write me letters for Mom and Dad to read to me, and they'd get crayon scribbles in return. \n\n\nWhen I was three, they both started to experience declines in health. First my maternal grandpa, then my paternal one. Fearing the worst, Mom purchased a pair of teddy bears, the kind that had recorders in them so you could record a message that would play when the bear was hugged, and made sure to get a message saved from both.\n\n\nMy mom's father died when I was four. A few days after his funeral, I was given a white teddy bear with bright blue eyes that twinkled from beneath a plaid flat cap and a green sweater. When I gave it a squeeze, I heard my grandpa's slightly muffled voice from its stomach.\n\n\n\"I love you, Sadie.\"\n\n\nTwo years later, after Dad's father passed, I got the other one. It was a slate gray color and the stitching on his face gave him a rather serious expression for a stuffed animal. A pair of red suspenders held up his tan trousers. I fell asleep hugging it and my dad told me some years later, with tears in his eyes, that randomly throughout that night, he kept hearing Grandpop's voice coming from my room.\n\n\n\"I love you, Sadie.\"\n\n\nI named my white bear Fran and my gray bear Jock and put them on a shelf above my bed, where they sat throughout my childhood. Honestly, I didn't give them much thought; they had become fixtures of my room, the same way the lamp and dresser were. Every now and again, I'd come home from school to find one of my parents standing beside my bed, looking up at the bears or giving them a little squeeze. Even as time passed, they still recited their single phrase without fail.\n\n\nAside from those instances, though, Fran and Jock were little more than dust collectors from my childhood.\n\n\nWhen I went away to college, the two didn't make the cut and were left behind while I made my way out into the world for the first time. I think my parents were a little disappointed that I wasn't more sentimental over the teddies, but any memories I had of my grandpas were hazy at best and I didn't have the same emotional connection that they did. \n\n\nWhen Mom gently asked about whether I would like them when I moved into my first apartment, I told her no, that they were probably better off with her. \n\n\n\"Ok.\" She said. \"Well, they'll be here if you change your mind.\"\n\n\nI was pretty confident I wouldn't.\n\n\nThe next time I went back to my parents' place was to housesit while Dad took Mom on their long awaited vacation out west. He'd been promising her they'd go for over thirty years and they were both buzzing with excitement. In typical Mom fashion, however, she was also very nervous.\n\n\n\"You remember where all the financial documents are in case anything happens to us, right?\" She asked from the backseat at least six times on the drive to the airport.\n\n\n\"Yes, in the white bin under your bed.\"\n\n\n\"And the wills?\"\n\n\n\"Fireproof lock box in the back of your closet.\"\n\n\n\"And th-\"\n\n\n\"I think she's got it, hon.\" Dad said, reaching back to give her knee a squeeze.\n\n\nMom harrumphed and sat back. \"Just call if you need anything.\"\n\n\n\"I'll be fine, don't worry! You're only going for a week.\"\n\n\n\"A lot can happen in a week.\" She said.\n\n\nI grinned at her in the rearview mirror, unconcerned, and she made a face at me, but seemed to relax.\n\n\nAfter I dropped them off, I drove back to their place and started to make myself at home again. I tossed my suitcase on my bed and went to the kitchen to make some dinner and catch up on one of my shows. It had been a while since I'd had a true, completely free week all to myself and I planned to take full advantage of it. After I ate, I kicked up my feet, stretched out, and commenced \"Lazy Lump\" mode.\n\n\nI managed to get almost three episodes in before I started to nod off. I checked the clock over the TV and sighed. It was only just after eleven; was I really turning into an old, early-to-bed woman already? The horror! I rolled off the couch and shut off the tv and all the lights, plunging the house into a deep darkness.\n\n\nEven in the inky black, I didn't feel even a twinge of nervousness. I'd grown up in the house, I knew it like the back of my hand, and all of its creaks and groans were almost comforting. I made my way to my room and flipped on the light. It had been at least five years since I lived there, but my parents hadn't done much to change my room except store a few bits and bobs in the closet. They said it was so I'd know I'd always have a place with them. I thought it was because changing it would make the fact that I was out for good more real. \n\n\nWhatever the reason, I appreciated the familiarity.\n\n\nAs I started to unpack my bag, my eye was drawn to the shelf over my bed. Fran and Jock, ever vigilant, were sitting in the same spots they'd occupied for most of my life. I don't know why, but I couldn't help but smile and reach out to them. \n\n\nI took Fran down first and gave his little cap a tweak before squeezing him around his stomach.\n\n\n\"I love you, Sadie.\" Grandpa said.\n\n\nAfter putting Fran back, I did the same to Jock, who stared up at me with his usual sternness even as I plucked one red suspender. \n\n\n\"I love you, Sadie.\" Grandpop said.\n\n\nIt was the first time I'd listened to them in a while. Even if they didn't resonate as deeply with me as they did my parents, I was glad to find their recordings still worked.\n\n\nA quick trip to the bathroom and a change into my pjs later, I was in bed and fast falling asleep.\n\n\nI can't say exactly what woke me. A nightmare, I figured, given that my heart was beating quite quickly, but I couldn't remember any details. I took a deep breath and rolled over, already falling half asleep again, and found myself face to face with a dark figure on the pillow beside me. I yelped and sat up, grabbing at my phone, my nearest source of light, and shined it towards my bed.\n\n\nFran was lying on his side beside me.\n\n\nI let out a small chuckle and gave myself a little shake to dismiss the lingering fright that he'd caused and picked him up.\n\n\n\"Did you fall off the shelf?\" I asked him quietly. I must have put him back too close to the edge earlier and gravity had done its duty. \n\n\nI gave Fran a gentle squeeze.\n\n\n\"Get out.\" \n\n\nI stared down at the bear and blinked once, very slowly. I must be more sleepy than I realized, I thought. I was hearing things. To prove to myself that it had just been my imagination, I squeezed him again.\n\n\n\"Get out.\"\n\n\nIt was still Grandpa's voice, but instead of the soft warmth it had always had, it sounded cold, almost menacing. I threw Fran across the room, where he hit the wall.\n\n\nFrom over my head, I heard Grandpop's more gravely voice.\n\n\n\"Get out.\"\n\n\nI whipped around and looked up at Jock. He was sitting in the same place as always, but now he was turned towards the door instead of facing forwards. Had I put him down like that? I couldn't remember.\n\n\n\"Get out!\" Grandpa's voice came from Fran again, louder this time. \n\n\n\"Get out!\" Grandpop echoed from Jock.\n\n\nThe two went back and forth, their voices getting louder and louder, until I slapped my hands over my ears and leapt from my bed. I wanted to scream, but my voice was stuck behind my fear tangled tongue. I stumbled across my dark room, chased by my long dead grandfathers' voices.\n\n\n\"I know you're down there!\" Jock shouted with Grandpop's voice.\n\n\nI froze. Down there? Down under the shelf? I glanced over my shoulder at the gray bear staring silently down from over my bed. I had to get out of my room. I had to get out of the house! I yanked open my door.\n\n\n\"I see you!\" Fran said in Grandpa's voice.\n\n\nI was halfway out into the hall, tears streaming down my face. I didn't know what was happening, was I going crazy? Was I dreaming? All I knew was that my two childhood toys were screaming threats at me and I had to get away from them. I turned towards the stairs.\n\n\n\"You take one more step, I'll make sure it's your last!\" Jock bellowed. \n\n\n\"Get out!\" Fran roared.\n\n\nFrom somewhere downstairs, a step creaked. \n\n\nSomeone else was in the house. \n\n\nThey weren't yelling at me at all, I realized with a very strange mix of confusing relief and newly formed horror. They were yelling at the intruder who was making their way up the stairs, towards me.\n\n\n\"Get out!\" My grandfathers howled together.\n\n\nFootsteps clamored across the wood floor downstairs. Something fell over in the living room with a loud crash, and again in the kitchen, before the back door slammed against the counter as it was thrown open and a car engine rumbled to life. \n\n\nSomehow, I regained my wits enough to run to my parents room and look out the window to the driveway below. An SUV was peeling backwards out into the street. It slammed into the neighbor's mailbox, righted itself, and then screeched off into the night.\n\n\nA heavy quiet had fallen over the house again.\n\n\nAfter waiting a few, long, tense minutes, I crept back across the hall and peeked into my room. Fran and Jock were where I'd left them, both completely silent. When they stayed that way, I hesitantly approached Fran, who was lying on his side with his little flat cap beside him. I picked him up and, with trembling fingers, squeezed his stomach.\n\n\n\"I love you, Sadie.\" Grandpa said warmly.\n\n\nI put his cap back on his head and gently put him back on the shelf beside Jock and backed out of the room, watching them the whole time with wide eyes. As I rounded the corner, heading downstairs to the phone, I heard Grandpop's voice trailing after me.\n\n\n\"I love you, Sadie.\"\n\n\nThe police arrived a bit later, following my frantic call to 911. I filed a report, leaving out the bit about my talking bears, and allowed them to collect whatever evidence they could. Every so often, I found myself glancing at the stairs, almost like I was expecting a repeat of whatever had just happened. It never came and the cops wrapped it up, leaving me alone again.\n\n\nWhen I called my parents to tell them about the break in, they immediately wanted to rush home, but I assured them there was no need.\n\n\n\"Really,\" I said, \"I don't think I have anything to worry about.\"\n\n\n\"We could be on the next plane.\" Mom insisted.\n\n\n\"No, I'm ok. Whoever that guy was, I'm pretty sure he won't be back.\"\n\n\nIt took a few more go arounds, but I eventually convinced them I was safe.\n\n\nAnd I felt it, too, for the most part. After the initial shock had worn off and I'd had time to process what had happened, I really was ok. I couldn't explain it, I couldn't tell anyone what had happened without sounding crazy, but I knew it had been real and I knew, as long as I had Fran and Jock sitting on the shelf above my bed, I could sleep easy.\n\n\nA few days later, the cops did find the guy who broke in. He was a coworker of my dad's who'd overheard he'd be out of town. He thought the house would be empty and easy pickings. When he tried to tell them about the two crazy guys upstairs and their violent threats, they rolled their eyes and laughed at him. He was very surprised to hear that only a twenty-two year old woman had been in the house during his botched burglary. \n\n\nWhen I returned home to my apartment a week later, Fran and Jock were with me. I keep them on the tv stand in the living room now, where they have a full view of the front door. Whenever I start to feel a bit anxious about being alone, I'll give each bear a little squeeze and smile as they speak.\n\n\n\"I love you, Sadie.\"\n\n\nAnd now I respond. \"I love you both, too.\"", "comments": [{"id": "dfdd4sd", "author": "Rodrimar015", "body": "This is so pure. 💜 Now I want to get a Teddy bear for my family when I'm gone at college 💜"}, {"id": "dfdexe1", "author": "thefawnboy", "body": "It went from considerably spooky to uniquely heartwarming, and I appreciate that a lot. A nice turn!"}, {"id": "dfdi3iw", "author": "Emranotkool", "body": "Nosleep? More like NoDryEyes amirite?"}, {"id": "dfda5ew", "author": "2quickdraw", "body": "Dang it, this made me cry...  😢 \nFabulous!!! "}, {"id": "dfdgpjf", "author": "NotJustSomeGuy123", "body": "SomeSleep :)"}, {"id": "dfdkhog", "author": "Swordildo", "body": "Now introducing dead grandparents, the world's most effective home alarm. "}, {"id": "dfd6wbo", "author": "osoleve", "body": "This is so wonderful."}, {"id": "dfdfuoo", "author": "HWenham", "body": "The first no sleep that has made me really happy, I love this, as someone who has one grandfather gone and one in bad health, let me just say hold onto them and any other memories as tight as you can"}, {"id": "dfd99sk", "author": "xmunkyx", "body": "That is a beautiful story! I like happy endings!"}, {"id": "dfdvuey", "author": "AIfie", "body": "> I threw Fran across the room, where he hit the wall.\n\nGrandpa probably thought for a fleeting moment \"On second thought stay awhile.\""}, {"id": "dfdfkwp", "author": "yrcntxt", "body": "Oh my god.... I am bawling. This was so good! Thank you for this, it was very cathartic for me, having experienced the early loss of my grandparents as well."}, {"id": "dfdlit7", "author": "VorpalisRabbitus", "body": "Way to mix things up, we see evil things happen all too often here, but to read about a good supernatural happening was a nice change of pace.\n\nGood job, and glad that you decided to keep Fran and Jock with you in the end."}, {"id": "dfdilxr", "author": "MelaniumFalcon", "body": "I was super close to my grandpa. He would have been 97 yesterday. This story really touched my heart ❤️"}, {"id": "dfdh878", "author": "SantGamer", "body": "Seriously, keep them bears handy, and keep their batteries fresh!  Bears like that, not easy to come by."}, {"id": "dfebroe", "author": "Shoutcake", "body": "When I heard the first \"get out\" I thought they wanted you to escape the house because of a burglar but this is much more awesome of them! They were kicking that asshole out. What kind of place does your dad even work at for him to have such scummy coworkers? "}, {"id": "dfdfqrn", "author": "sterling_caim", "body": "Absolute excellence. "}, {"id": "dfdi025", "author": "Franii", "body": "Haven't read yet but being in this subreddit, my name being Fran and my fave artist being jock, I was spooked "}, {"id": "dfduwaa", "author": "phoneutriabitch", "body": "> *\"I wanted to scream, but my voice was stuck behind my fear tangled tongue.\"*\n\nDescribing fear can get very rote and cliched. This is a truly wonderful bit of imagery that conveys a familiar feeling in a fresh way. It grabs the reader and puts him or her right in your shoes; she or he knows exactly how you feel.\n\nThat said, just want to add I lost my maternal grandfather just over 10 years ago and still cry sometimes. He was a better \"father\" to me than my own dad, supporting me emotionally in all my endeavors until the week his health declined and, during a trip to the hospital while my actual father was visiting, my granddad passed away. I will always wish that on that day I'd been with the man who showed me what a father should be, and not with the emotionally and physically abusive dad that, after my parents' inevitable divorce, the courts had granted only minimal visitation rights to because of what a schmuck he was and is.\n\nYou are so lucky to know with such certainty that your grandfathers are still watching over you."}, {"id": "dfdnj0t", "author": "flcwerings", "body": "stories like these make me so sad to have a broken family. im so happy you have two amazing grandpas who will always love you and care for you! youre very lucky."}, {"id": "dfdm67b", "author": "zada16", "body": "It went from well skittish to uniquely heartwarming, and glad that they are watching over you."}, {"id": "dfe4kuz", "author": "SonsOfDarkTower", "body": "I'm 31, and my last grandparent, my paternal grandfather, literally passed away yesterday morning at 91, so this really got to me. Awesome."}, {"id": "dfdkxn4", "author": "padmasundari", "body": "I have to say, I really do love your stories. I'm glad your grandpas are looking out for you. I like to think mine do the same for me, I hear Grandad sometimes saying his funny little phrases at appropriate moments and I like to think it's him letting me know he hasn't forgotten us,rather than just my memory filling in for him now he's not here to do it himself."}, {"id": "dfdm5k5", "author": "SaucyWolf", "body": "This has been my favorite read in a long time. Put a smile on my face. :)"}, {"id": "dfdqgxy", "author": "Omnipotent_Manimal", "body": "Uncontrollable chills throughout my entire body. Insane experience.  Thanks for sharing. "}, {"id": "dfe1cn1", "author": "interes_ted", "body": "Yeah, Real shock there at first Get Out. The warmth of bears voice suddenly flipping into angry serious growl."}, {"id": "dfdkyze", "author": "Draconis117", "body": "This was great. Now I want a bear that threatens people!"}, {"id": "dfdkr9m", "author": "zafirah15", "body": "Who put these years on my face?"}, {"id": "dfdne9b", "author": "Frostypancake", "body": "Sounds like you your grandpa's are still watching over you."}, {"id": "dfdrm0r", "author": "fullofbones", "body": "It was all set up by your parents as a ruse to get you to finally show the bears a little respect. "}, {"id": "dfdnucb", "author": "whataboutelevensies", "body": "I think this is one of my favorite stories. Thank you for sharing, and thank you Grandpa and Grandpop :) "}, {"id": "dfdppic", "author": "Sangrona", "body": "Dearest OP, Such a well written posting. It was scary and heartwarming. How do you it? That last line got me. I teared up after I read it."}, {"id": "dfgz9mt", "author": "The-Morningstar", "body": "That was truly a rollercoaster ride. Sentient toys are so scary, and dead loved ones looking out for you is so dang heartwarming! I did a little bit of a Face Journey at work"}, {"id": "dfdtdrb", "author": "lamisleandra", "body": "I wish I could upvote u twice "}, {"id": "dfe4s3o", "author": "Zacher8", "body": "I expected two more bears to arrive in the mail, with her parents voices. "}, {"id": "dfeaa7c", "author": "Shaolinblood", "body": "wow.. i would have just cried on both bears for like 30 minutes just thanking them before calling the cops!"}, {"id": "dfegdci", "author": "angiegirl25", "body": "I think this has easily become one of my no sleep favorites. "}, {"id": "dfgkgja", "author": "Corinnium", "body": "What the fuuck, I've never gotten chills like that before! I'm so glad that Fran and Jock turned out to just be protecting you."}, {"id": "dfy21wu", "author": "6eoff", "body": "Super scary during the \"Get out\" and \"I see you\" part but great twist. I'm sure I wasn't the only one expecting a tale of vengeful, abandoned toys/spirits."}, {"id": "dfdo1st", "author": "otherlingoddone", "body": "You sound like you have such a nice family"}, {"id": "dfdoof6", "author": "NookFin", "body": "My heart is fluttering. Two guardian angels, how sweet"}, {"id": "dfdy72k", "author": "Lemonta-rt", "body": "Damn I cried!"}, {"id": "dfe02vb", "author": "haha_ur_own3", "body": "Today, I'm glad your grandfathers are looking out for you! you re very lucky."}, {"id": "dfe1kmm", "author": "luckEnumberthirteen", "body": "Onions..."}, {"id": "dgaw058", "author": "HaveSomeRekage", "body": "/r/WholesomeNoSleep ?"}, {"id": "dfdi0ru", "author": "A10A10A10", "body": "Really really enjoyed this.  Well done."}, {"id": "dfdzeu7", "author": "tomoyopop", "body": "This made me tear up. :'("}, {"id": "dfe2p02", "author": "mopsarethebomb", "body": "This made me happy in my heart, even though I'm crying because I miss my own great grandfather. Great story."}, {"id": "dfe40s3", "author": "Mmhmmyeahright", "body": "I got chills all over, but not eerie chills. I've also got a lump in my throat, and it must me getting dusty in here because my eyes are watering.\nThe grandpas showed you they love you for real that night <3\nI'm glad that you weren't hurt. I'm even more pleased you took your grandpa bears home with you <3"}, {"id": "dfe5r6p", "author": "Rushsupertramp", "body": "An unexpected ending but I really like it!"}, {"id": "dfereby", "author": "HopelesslyLibra", "body": "jesus even the stories here are getting wholesome. I love it!\n\nTeddy bears: the protectors of children, no matter the age!"}, {"id": "dffbdeh", "author": "sucikitty", "body": "This is so sweet. I appreciate my talking teddy bear more now. "}, {"id": "dfg3q6d", "author": "lesmisarahbles", "body": "Aww man I'm crying"}, {"id": "dfsf8xv", "author": "Dinxton", "body": "r/goodsleep :)"}, {"id": "dki6hhc", "author": "janinso", "body": "First I was like \"holy shit!\" but then I was like \"aww... holy shit...\""}, {"id": "dfdh7dd", "author": "SantGamer", "body": "[They'll do that.](https://www.reddit.com/r/nosleep/comments/5934h4/buildabear/)"}, {"id": "dfdorbx", "author": "perfectway76", "body": "Amazing experience!! Thanks for sharing"}, {"id": "dfdpjpz", "author": "howaboutnothanksdude", "body": "Awww the beat ending"}, {"id": "dfdt0qx", "author": "ihearttoxie", "body": "Really loved this"}, {"id": "dfdt8qu", "author": "StarBirb", "body": "This is really beautiful and I feel kinda dumb but I cried over it. This may be my favorite thing I've ever read on reddit.  Thanks for sharing this with us all. "}, {"id": "dfdtag6", "author": "flannelpugs", "body": "This is adorable and reminds me of the creepy yet heart-warming stories on [Beyond Belief](https://en.wikipedia.org/wiki/Beyond_Belief:_Fact_or_Fiction) sometimes.\n\nI almost stopped reading when the bears started talking, but I scrolled down, saw the comments, and knew this wouldn't keep me up at night."}, {"id": "dfduwz3", "author": "DatNomen", "body": "I rolled my eyes at the first 'get out.' Can safely say I'm glad I read till the end though. Gj OP."}, {"id": "dfdvwho", "author": "Lacygreen", "body": "Tears. Touched."}, {"id": "dfdwujf", "author": "flosiraptor", "body": "This was both adorable and terrifying. "}, {"id": "dfdwy63", "author": "Taadaaaaa", "body": "This was needed. Thank you. Ifeel so good."}, {"id": "dfdx53b", "author": "Metal_Dinosaur", "body": "No sleep? This is cute. Thanks grandpa!"}, {"id": "dfdxwop", "author": "Baheyeldinnassar", "body": "You're lucky to have such grandfathers that look after you beyond the grave"}, {"id": "dfe57w1", "author": "my-little-tardis", "body": "Goosebumps!! You're so lucky to have protectors with you. "}, {"id": "dfe8o8s", "author": "Vagrom", "body": "Great! I got goosebumps reading!"}, {"id": "dfei6lq", "author": "M0n5tr0", "body": "Fantastic"}, {"id": "dff8gkf", "author": "eves13", "body": "As a person raised by her grandparents, I am reassured that I have someone looking out for me. I miss you, Grandpa ♡"}, {"id": "dffm0r2", "author": "pickledbeard", "body": "I loved this. And I was actually scared when the bears were yelling get out. It made me think of my Papa and PawPaw."}, {"id": "dfgy6pi", "author": "TheFuturist47", "body": "My grandfather just died a few weeks ago and this made me fucking cry. "}, {"id": "dfdxkxw", "author": "CurvyPenguin21", "body": "oh this gave me goosebumps "}, {"id": "dfe1e9s", "author": "Mavyn77", "body": "Grumpy bears , I imagine\n them like two Clint eastwoods from El torino"}, {"id": "dfe1x6w", "author": "duckscoot", "body": "When they were saying \"get out\" were they talking to the intruder? "}, {"id": "dfegjg4", "author": "convergence_limit", "body": "That scared the poop outta me"}, {"id": "dfegt5p", "author": "whittery27", "body": "I absolutely love this! Makes me miss my grandpa so much!! "}, {"id": "dfeyaeb", "author": "DarkGurl80", "body": "Made me cry. Damn you!"}, {"id": "dfezo8p", "author": "CheckyourRX", "body": "That was amazing and im crying and i love it so much! Awww T.T"}, {"id": "dff367r", "author": "chocorade", "body": "This is really heartwarming. I teared up a little bit, as I didn't have very loving grandparents at all."}, {"id": "dff40o5", "author": "President-of-Reddit", "body": "This made me really sad.  Human beings have a 100% mortality rate,  at some point the things we leave behind for our children and grand children will fade, but there will always be echos of our love for them."}, {"id": "dfgiqy6", "author": "crrrazycatlady", "body": "This gave me goosebumps. Every time I reread from the \"Get out\" part, the hair on my arms, legs and neck kept standing up. One of the best I've read here in nosleep."}, {"id": "dfhk7bi", "author": "Innsmouth_Resident", "body": "Man. I got major goosebumps."}, {"id": "dg6r2gv", "author": "chewflockabaccaflame", "body": "I'm not one to get sentimental with things I read online, but this legitimately almost made me cry. I was raised by a single Dad and we have an amazing father - daughter relationship, when the bears were protecting Sadie I automatically thought of him because I can 100% imagine my Dad's ghost doing some shit like that. Very sweet story. "}, {"id": "dgcc12v", "author": "HaughtySpirit", "body": "Wholesome nosleep"}, {"id": "dgkarkh", "author": "suspiciousbutton", "body": "Think this NoSleep will let me sleep comfortably for a while "}, {"id": "dgl6m1y", "author": "specifyjudgement", "body": "Was wondering why this post had 10.5k upvotes, now I get it. :)"}, {"id": "di6zpia", "author": "memekayla", "body": "Wholesome nosleep :)"}, {"id": "djleg0m", "author": "RollstuhlFahrer", "body": "This is one of my favorite Storys in nosleep. Awesome written and a beautiful story :) I love it!"}, {"id": "dfe0rjn", "author": "Liftuntunza", "body": "Love alot of nosleeps stories, hardly comment. Yours was truly amazing. Loved it. Threw me off completely there 3/4 of the way through. Though i am half in the bag and it took me ten minutes to write this.... fucking loved it"}, {"id": "dfdsugl", "author": "thyunveiling", "body": "For a moment I thought I was in /r/paranormal\n"}, {"id": "dfdudnv", "author": "totallykyle2", "body": "It has exactly 2017 likes right now. And im not breaking the combo"}, {"id": "dfdzjcu", "author": "Odins_Fleshlight", "body": "Muh plums are in muh belly"}, {"id": "dfelo2e", "author": "Karangok", "body": "Very well written! Serious gave me chills which doesn't often happen. "}, {"id": "dfilkpn", "author": "peter_poiuyt", "body": "Awww"}, {"id": "dg5es34", "author": "catteallinna", "body": "Best nosleep I've read in a while. A long while."}, {"id": "djz8xsu", "author": "Artoru", "body": "That first \"get out\" caught me completely off guard\n\nNice work OP"}, {"id": "dk3vz59", "author": "LittleMissMayI", "body": "First of all, I would like to thank you OP, for this is the best story I've read in quite a while. I loved it."}, {"id": "dlbnw42", "author": "Soupicide360", "body": "This is so nice, it belongs in r/wholesomenosleep"}, {"id": "dfeytoe", "author": "KCMommy", "body": "PeePaws FTW!"}, {"id": "dfipcbs", "author": "CorporateSlave47", "body": "One of the best stories I've read here in a long time. Take them back with you OP. "}, {"id": "dfirpky", "author": "octopusfreak", "body": "That was so nice to read. My grandpa passed away a couple of years ago and I'd like to think he watches out for me still like Fran and Jock."}, {"id": "dfju2p1", "author": "meowz89", "body": "I'm glad you had two guardians with you. My maternal grandmother passed away 7 years ago and although I don't have anything left from her, I like to think she's my guardian and voice of reason sometimes. "}, {"id": "dfkx8mh", "author": "ephryene", "body": "This is ridiculously wholesome. I always loved my stuffed animals."}, {"id": "dfn10m1", "author": "TheMysticAvenger", "body": "At first I thought they were telling her to get out coz some other entity/person was in the house with ill intentions. But this is good too. So happy now. 😄"}, {"id": "dfnigm4", "author": "MrPopo72", "body": "Holy shit I got chills from this. Definitely in my top 3 on nosleep. You told your story so well."}, {"id": "dft3vow", "author": "musicissweeter", "body": "I'm all warm and fuzzy and teary-eyed now...and i remember my grandparents, all of them watching over me from up there,I'm sure. Thank you."}, {"id": "dfut508", "author": "SecretGeek97", "body": "I was honestly so scared when they said \"Get out\". I was startled and my heart had a hard beat. But then it became something really beautiful. "}, {"id": "dfwg7yy", "author": "JOHNNNNNNNAY", "body": "This gave me serious uncontrollable chills at every \"get out\". Truly revolutionary! Ive never had a story affect me like this!"}, {"id": "dfx5n78", "author": "Discgolfin247", "body": "I absolutely love this!"}, {"id": "dfxyvef", "author": "jemmeow", "body": "I miss my grandfathers. Goddamn.  "}, {"id": "dfyyoxb", "author": "Scully__", "body": "I'm not crying, you're crying.  Seriously tho, I'm glad they caught the fucker, Sadie, well done to Fran and Jock :)"}, {"id": "dg31eju", "author": "JayTrim", "body": "This was great, and at the same time warming.\n\nI remember feeling the same sensation albeit not in the same cirucumstance when my Great-Grandma passed away. I remember visiting her house after the funeral and instead of feeling nervous (very old and crickety house), I felt warm and safe. I'd like to say our loved ones are watching us."}, {"id": "dg3x8vm", "author": "tristafiona", "body": "I've read all your stuff, and this is my favorite. Excellent story  =)\n"}, {"id": "dg41d6d", "author": "Kerticus", "body": "My goose bumps' still won't go down... Lucky to have a \"guardian\" of some sort. "}, {"id": "dg4iqku", "author": "BackfrommaDead", "body": "you guys are all suckers for any story where something supernatural protects a young person, like srsly"}, {"id": "dg5ejyd", "author": "carlog234", "body": "I could see this being made into one of those \"Are you afraid of the dark?\" Episodes haha"}, {"id": "dg79t80", "author": "nothingmore19", "body": "You make me miss my grandpa so much❤"}, {"id": "dg9nypl", "author": "throwawayplsremember", "body": "r/wholesomehorror"}, {"id": "dgaxciw", "author": "JTBowling", "body": "This one actually made me happy :)"}, {"id": "dgdn1n7", "author": "dot_comma", "body": "Wow, this... is just so heart-warming. I loved it, dearly."}, {"id": "dgdwhkw", "author": "watashinomori", "body": "You gave me the chills with this heartwarming story."}, {"id": "dginyve", "author": "WhackOnWaxOff", "body": "This was a fantastic read! I'm happy to know that you (and your bears) are safe and sound."}, {"id": "dgix2wy", "author": "threeofbirds121", "body": "Totally in the hospital after surgery reading this and crying. That ending! "}, {"id": "dgn9bvq", "author": "oooshyguy", "body": "LOL I would've ran too I can't even blame you "}, {"id": "dgt0uv1", "author": "Ayyyy_lmao_bruh_fam", "body": "ered"}, {"id": "dgup7a1", "author": "antiquat3d", "body": "This made me cry. I love it so much"}, {"id": "dhdz2b5", "author": "Rqns982", "body": "Unexpectedly heartwarming, love this"}, {"id": "dhi4dfm", "author": "Sceptical_Tech", "body": "I'm an absolute sobbing mess after reading this, thank you for the very wholesome story."}, {"id": "dhyqte2", "author": "DarnThoseOranges", "body": "This is so.. sweet. I have teddy bears that similarly keep my anxiety away (minus the talking). I am glad you are safe."}, {"id": "di5560c", "author": "ViZuche", "body": "Woah. \"Get out\" was like a punch to my gut. But ur story made me suddenly ache for my grandma.. wish I would have thought to record her voice.. I miss her so much.. She had pancreatic cancer that made her last days so full of horror, I actually prayed and cried and prayed for her to pass on. And the next day she did. I sometimes wonder if it was coincidence.. but I had never prayed for something so bad.. the more older I get, more I miss her.. especially when things get bad.. then I just imagine her stroking my hair like she used to.. hell I started crying just writing this.. sorry for the long post.. you re lucky to have two loving grandpa guardians.. "}, {"id": "did9jau", "author": "britthunk", "body": "This is easily one of the best stories I've read. This is the first time a story has ever given me chills. Almost teared up at the end. Excellent story!"}, {"id": "didkcg3", "author": "Choji-San", "body": "First story with a happy ending making the fact that I'm in the same position as her a bit more comforting"}, {"id": "dijvgns", "author": "NoviceApproach", "body": "One of the best stories I have read on here in a VERY long time"}, {"id": "djfkhbn", "author": "69jesus420", "body": "wow. i love this"}, {"id": "djp1yyb", "author": "RedShirtBrowncoat", "body": "/r/wholesomenosleep"}, {"id": "dkbdnh2", "author": "MrStealYourPost", "body": "Ughhhhhh this one else git the me haha whew"}, {"id": "dkmm42a", "author": "uncle_vatred", "body": "This is decently written but it boggles my mind that this is one of the highest rated posts of all time in this sub "}, {"id": "dkz41af", "author": "cloudy-star", "body": "I got goosebumps oh my god"}, {"id": "dl565lb", "author": "matisseblue", "body": "You should submit this to r/wholesomenosleep! "}, {"id": "dl777tc", "author": "DrDragonQueen", "body": "IM NOT CRYING YOURE CRYING! "}, {"id": "dle5hz8", "author": "AsianBarMitzvah", "body": "This is my fav no sleep story! Thank you for sharing "}, {"id": "dligzzx", "author": "1573594268", "body": "Excellent story. Excellent writing skills. Superb. "}, {"id": "dlshsxj", "author": "ennusi", "body": "I legit teared up at that last line."}, {"id": "dltixbq", "author": "IReallyMyName", "body": "r/wholesomenosleep"}, {"id": "dm6es6h", "author": "TeHamilton", "body": "Lucky you had your grandparents to protect you!"}, {"id": "dmdequf", "author": "guy_fawkes9301", "body": "r/wholesomenosleep"}, {"id": "dmq0sh4", "author": "Pandoric_", "body": "What a rollercoaster of emotion, well written!"}, {"id": "dn54njo", "author": "kbsb0830", "body": "I cried. Damn this should be on /r/wholesomenosleep\nWhat a great story. I really felt like you weren't appreciating those gifts as much as you should. I'm glad you do now. "}]}