{"id": "6imkuw", "title": "The Grim Reaper's scythe isn't to harvest you. It's to protect you from something on your journey.", "url": "https://www.reddit.com/r/nosleep/comments/6imkuw/the_grim_reapers_scythe_isnt_to_harvest_you_its/", "subreddit": "nosleep", "author": "TobiasWade", "text": "There is no fear as potent as the fear of the unknown. No monstrous visage discovered yet has been as terrifying as the infinite potential for horror which exists before the mask is removed. \n\nThat is why we humans, in our naive misunderstanding of the universal order, are gripped by the mortal fear of death. We think it the final frontier - the greatest imaginable unknown from whose penumbral shores no traveler may return. And so we cling desperately onto even the most dreary and anguished lives, suffering any known evil over our release into the beyond. \n\nBut death is not to be feared, because death is very well understood. We have witnessed it, caused it, measured and recorded it to the last dying spasm of neuronal flickering. Even as I lay dying, it seemed silly to me that I should be afraid of the emptiness which reason promised to expect. \n\nWhile I was alive I wouldn't experience death, so there was no reason to be afraid now. When I was dead, I wouldn't be capable of experiencing anything, so fear still had no cause. That thought brought me great comfort as I felt the last erratic struggle from my heart against the inevitable conclusion I approached. It wasn't until I was finally drifting off to sleep that a final intrusive doubt bubbled in my brain:\n\n*What if it isn't death which is to be feared? What if it is what lies beyond?*\n\nAnd so troubled did I slip beyond mortal understanding, stepping into a world as far forsaken by reason as I was now from life. I was still in the hospital room, but the bustle of nurses and the beeping machines lost their opacity as though I was mired in swiftly descending dusk. It seemed as though every sound was an echo of what it once was; every sight a reflection. With each passing moment, the world was becoming less real...\n\nBut all that sight and sound - all that being - it wasn't simply disappearing. It was *transforming* into a figure beside me. The less real my room became, the more real the figure was, until presently it existed in such sharp actuality that nothing beside it seemed real at all. \n\nHis cloak was black. Not the *color* black, but its essence. It was as though seeing a tiger after a lifetime of looking at a child's crude drawing and thinking that's all a tiger was. Reality flowed around his scythe like a brush through water colors, and I could see each elementary particle and time itself sunder across its blade. \n\nSurely this, I thought. This is why we were taught without words to fear death. I clutched at my hospital blanket to cower from the intensity of the Reaper's presence, but the once soft cotton now flowed like translucent mist through my hands. I knew in that moment that nothing could hide me from the specter's grasp, for he was the only real thing in this world. \n\n**You're late.**\n\nThey weren't words. My head ached from the strain of this knowledge as my lateness was burned into my awareness, imparted like an inescapable law of physics as unequivocal as gravity. \n\n**We don't have time for the usual speech. Hurry now.**\n\nI felt myself swept up around him like dirt in a hurricane. Before I knew what was happening, we were outside the hospital, moving at such a frenzied pace that the world around me blurred into a dizzying tunnel of flashing light. \n\n**If you're lucky, IT will have gotten bored of waiting for you.**\n\nI had too many questions, all fighting for attention in the forefront of my brain without any making their way out. \n\n**You're quiet. I admire that. Usually people ask too much.**\n\n\"What's the point?\" I asked. My voice felt flat and dead compared to his overwhelming substance. \"How can I try to comprehend something so beyond mortal knowledge?\"\n\n**You can't. But it's still human nature to ask.**\n\nWe weren't slowing. If anything, our pace was increasing. I wasn't running, or flying, or anything of that nature. It was more like the rest of the world was moving around us while we stood still. A vague darkness and a heavy damp smell made me guess that we'd gone underground, but I couldn't say for sure. \n\n\"One question then,\" I asked. \"What else is here besides you?\" \n\n**And that is why questions are pointless. Death is not a place, or a person. It's all there is.**\n\nTroubling thought, but made more so by the growing howl which began reverberating the rocks around me. We still seemed to be descending into the Earth, and the air was growing warmer and denser now. The sound continued to mount as though the world itself was suffering. \n\n\"Then what is IT?\"\n\n**What I'm here to protect you from.**\n\nThe rocks split from a flash of his scythe, and the ground opened further into a sprawling cavern dominated by a subterranean lake. \n\n\"But I thought you said you were all there is.\"\n\n**No, I said Death was all there is.**\n\nWe weren't moving any longer. Light glinted off the scythe from some unseen source and streamed into the lake like a tributary. Once inside, the light didn't reflect or dissipate, but swirled and danced like luminescent oil. \n\n\"I thought you were Death.\"\n\n**Death is not a person.**\n\nThe light was taking a life of its own inside the water. The still surface began to churn with the enigmatic energy. It took my scattered mind a long while to realize that *I* was the energy flowing into the lake. I still felt tangled up with the figure, but we now existed as a beam of light boiling into the water. \n\nI knew I wouldn't understand, but that didn't stop me from feeling frustrated. If Death is all there is, then what is IT? What was waiting for me? The water pressed in around me and I couldn't speak, although I could still draw breath somehow. \n\n**IT is here.**\n\nSomething was in the water around me. Hands grabbed me by the legs and began dragging me downward. I was amazed to even discover I had limbs again. They felt so alien to me that it was almost as though this body was not my own. Light flashed from the scythe - then again. The hands let go, and the howling rose once more. The Reaper was fighting something, although I couldn't make any sense of the battle except for the madness of thrashing water.\n\nThe howling Earth reached its crescendo, and the *screams* made the water around me convulse and contract like living fluid. Had the Reaper cut it? Was I safe? I began to explore my new body in the water, but just when I thought I was beginning to gain control the hands clutched me once more. I lurched downward, struggling in vain against their implacable grip. \n\n\"What is here?\" I tried to shout against the suffocating liquid. \"What is happening?\" \n\nBut I couldn't sense the Reaper's presence any longer. The heat was unbearable, but the cold depths the hands were dragging me toward was even worse. I became aware of a blinding light at the bottom of the lake, and though I struggled, the hands dragged me inexorably onward. \n\n**I'm sorry. I couldn't fight IT off.** It seemed to be coming from so far away now. **We will try again next time.** \n\nThe pressure - the heat - the noise - the hands dragging me into the blinding light. I closed my eyes and screamed. I was free from the water now, but I just kept screaming. I couldn't bear to look at IT - whatever had stolen me. Whatever was Death but wasn't - whatever even the Reaper could not defeat. \n\nThen words spoke. Real, human words from a real human mouth. My senses were so distraught that I couldn't make sense of them, but I'm guessing they were something like: \n\n\"Congratulations! He's a healthy baby boy.\" \n\nMost people can't remember the day they die, or the day they were born. I happen to remember both, and I know that [they are the same](http://www.facebook.com/sirtobiaswade). ", "comments": [{"id": "dj8ymis", "author": "cmd102", "body": "This is a reminder from the mods to *please* read our commenting rules before commenting on any posts here. Comments **must** be in character, and you are not allowed to debunk or criticize the post. \n\n\nRemember, everything on /r/nosleep is real."}, {"id": "dj84rgt", "author": "TheMaskedKid", "body": "I kept reading \"IT\" as \"I.T.\" instead of the word, so the entire time I thought the afterlife had a technical support department."}, {"id": "dj7hvor", "author": "k4Anarky", "body": "I think IT is Life, the monster that keeps swallowing people whole on the way to the afterlife and send them back to the cycle of suffering so it can feed on."}, {"id": "dj7g548", "author": "middleman619", "body": "But where do you go if he fights it off?"}, {"id": "dj7fyfl", "author": "Kellymargaret", "body": "That was amazingly deep, kind of beautiful and frightening all at once!"}, {"id": "dj7l40x", "author": "bLzPutozof", "body": "who else figured that what the narrator was talkin about the hands the lake the light underneath.... it was essencially and quite literally Life?"}, {"id": "dj82u6z", "author": "richard_999", "body": "Can I use this for a dungeons and dragons game?"}, {"id": "dj7obdk", "author": "VIKactual27", "body": "That was incredible. The way we view the reaper is all wrong"}, {"id": "dj7hzcr", "author": "idontlikevegetable", "body": "Did not expect the ending . Beautiful writing indeed."}, {"id": "dj7qllj", "author": "warui-hime", "body": "I'm amazed. This was one of the best things I've ever read. "}, {"id": "dj7ghi8", "author": "TheRealFangs", "body": "Wow that was one of the best stories I've read on here, great job man!"}, {"id": "dj7p59g", "author": "boultos", "body": "Damn I really liked that.  Though I kind of foresaw a different ending as I was reading through where he was revived by doctors into his original body rather than being born anew into a different body."}, {"id": "dj7im7y", "author": "Ikhaho", "body": "That was unexpected. But this would mean that you will be able to remember your past lifes. Interesting to think about it. "}, {"id": "dj7uvw7", "author": "Gameshurtmymind", "body": "RIP Terry Pratchett..."}, {"id": "dj8cbdp", "author": "SleeplessWitch", "body": "This spoke so deeply to my witchy witchy heart."}, {"id": "dj7ncby", "author": "anRwhal", "body": "That's some Buddhist shit. You failed to reach nirvana."}, {"id": "dj7letv", "author": "Soulful-Sorrow", "body": "Very well written! Kept me engaged the whole time and gave me plenty to think about."}, {"id": "dj8echx", "author": "ZellyPatel", "body": "We all float down here"}, {"id": "dj8iwq5", "author": "LogicalComa", "body": "The Egg by Andy Weir is one of the most thought provoking reads I've had in a while. Here's the link.\nhttp://www.galactanet.com/oneoff/theegg_mod.html"}, {"id": "dj7i84s", "author": "D3DS3C2017", "body": "I have found my new favorite subreddit."}, {"id": "dj7wwmg", "author": "xmunkyx", "body": "Very well written! Love it. Next time he takes you, fight tooth and nail against IT! "}, {"id": "dj7zpdj", "author": "kyusiwanderkid", "body": "Great story! I thought the lake was representative of the womb. Like it was ambiotic fluid and him feeling his limbs again were him forming his limbs as a baby.\n\nSuperb storytelling!"}, {"id": "dj7tv1t", "author": "Shaadowmaaster", "body": "I cannot not read IT as an acronym... "}, {"id": "dj8dfqn", "author": "emilou27", "body": " Holy cow this story was a refreshing change of pace! "}, {"id": "dj8npso", "author": "JammyB93", "body": "What a twist!! \n\nAmazing OP.. Amazing!"}, {"id": "dj7ibrd", "author": "TimeOnceLost", "body": "The Reaper:\n\nThe beat of the heart a motion uncontrolled.\n\nUntil the day the Reaper grabs hold.\n\nA menace He is too souls world round.\n\nIn and out without so much a sound. \n\nHave we considered him to be lost?\n\nDoes He not pay the ultimate cost?\n\nAn eternity collecting the soon forgotten. \n\nTo take them to their final destination.\n\nImagine His face as they fade away.\n\nKnowing He'll never see His day. \n\nFor fear and death escapes this host.\n\nIt's the Reaper that suffers from death the Most.\n\nWhile you and I will surly die. \n\nSoon to look Him in the eye.\n\nRemember, fear is His identity.\n\nAs scary as it may seem.\n\nMisery is His destiny...\n\n                                        -Billy J.\n"}, {"id": "dj88fyt", "author": "kakes_411", "body": "Amazing as always! Your description of death is phenomenal. "}, {"id": "dj89z9b", "author": "Jackanatic", "body": "Fantastic passage. Now I want to read the rest of the story. "}, {"id": "dj8en7w", "author": "blahblahblah_shutup", "body": "I am curious, are you by any chance a DM?"}, {"id": "dj91s7p", "author": "Alic3_in_zombi3land", "body": "Logic would say the reaper feels \"what's dead should stay dead\" so of course he would view this as a threat, after all He collects souls. Reincarnation would be deaths, (grim reaper, reaper.. whatever you want to call it) mortal enemy. So by \"protecting you\" he's actually trying to keep your soul. Keep your dead, so he isn't protecting you, he's trying to keep you."}, {"id": "djyhg39", "author": "vtsingaras", "body": "This reaper reminds me of Discworld's Death."}, {"id": "dj8gxvr", "author": "Darksoldierr", "body": "So, how to explain that the number of people in the world are growing exponentially, can a single soul be torn to pieces and return to life as multiple lives?"}, {"id": "dj8msg7", "author": "naivivamme", "body": "Fucking amazing. "}, {"id": "dj8nodn", "author": "TheScythe65", "body": "I can vouch for this"}, {"id": "dj8rxyb", "author": "FallenEmperorPenguin", "body": "I have often thought that once you die, your soul is reborn into that of a new baby. Reading this has been most enjoyable and makes me glad I'm not the only one that has thought that death and life are one."}, {"id": "dj8xe4d", "author": "theonly1theymake5", "body": "That was good,but it's too early for me to think this deep.lol"}, {"id": "dj91ls5", "author": "WohopLag", "body": "To protect you from the evil nefarious GLUTEN *muahahaha*"}, {"id": "dj9p5i5", "author": "kingDAVIDv2", "body": "Mission failed: we'll try again next time. "}, {"id": "dj9ruws", "author": "spiderfalls", "body": "The story was fantastic Tobias.  But this has been the first time ever that I read each and every comment; riveting!  Thanks you everyone.  That was amazing!"}, {"id": "dja78hl", "author": "Secret_Pedophile", "body": "One of the best stories I've ever read on here."}, {"id": "djit6wn", "author": "badwolfinthetardiss", "body": "Honestly, the comments are just as intriguing as the story. I love you, strange strangers. "}, {"id": "djluwgw", "author": "roadkill22ful", "body": "Holy fuck you're a good writer."}, {"id": "djqrrnx", "author": "blowmie", "body": "This is sworn of genius and you have made the world worth a little something extra by adding it. Thank you over and over!"}, {"id": "dk8bzmx", "author": "Citrus210", "body": "For some reason, i keep picturing an epic fight between two lvl 99 monsters in the style of Gandalf VS The Balrog: the Grim Reaper: HP: 12435 MP745 Def: 746 MaDef: 480Atk 846 Mtk 324 and IT:HP 845800 Atk999 MP9999 Mtk 643 defense 227 MaDef:999 with the reaper repeatedly spamming Curaja until his mp ran out.Sometimes you win, sometimes you lose in a fight like that."}, {"id": "dkwm6bw", "author": "KoruTsuki", "body": "Heh. I'm late"}, {"id": "dj7jo53", "author": "Grim_Reaper_O7", "body": "YOU HAVE CALLED ME. YOU ARE ALL NEXT."}, {"id": "dj7vkmz", "author": "DoLeo360", "body": "I really liked this, as someone who doesn't really get the love for the theory of resurrection and whatnot. I want to stay myself until I am nothing, not to come back and go through with it again. \n\nLet's hope the Reaper has been training."}, {"id": "dj7z55j", "author": "GhostRunner8", "body": "Cool story"}, {"id": "dj817rx", "author": "Neurophobik", "body": "Amazing! My parents said I spoke about being a dog before a child. I mean I was like 5-6!"}, {"id": "dj81wu4", "author": "2bdiva", "body": "For I sec I thought this was TIL"}, {"id": "dj8391y", "author": "acolledge", "body": "Beautifully, beautifully written. A joy to read."}, {"id": "dj85wnv", "author": "_Han_Shot_First", "body": "\"You must come with me, little ones, for I am the Grim Reaper\""}, {"id": "dj86q3h", "author": "Expertinclimax", "body": "When everyone dies they are reborn again. When everyone died they were reborn again. When everyone will die they will be reborn again. Everybody everything every creature, this is not your first or second life. Life is an endless cycle to which time and space are the only elements."}, {"id": "dj894ed", "author": "clemsonwebdesign", "body": "Love it. Very well written."}, {"id": "dj8cbeg", "author": "sleepy_tech", "body": "Religious books like Koran tell us that this life is temporary and fake, what lies hereafter is the real life. So maybe death is helping you to get to the real life. Maybe that's its job. "}, {"id": "dj8fh7y", "author": "pvriss", "body": "Your writing is *hauntingly* beautiful"}, {"id": "dj8hl3r", "author": "Ch0mp0nThat", "body": "Sounds like your brain sent you on one helluva DMT trip."}, {"id": "dj8mrer", "author": "wishtobefree", "body": "I am back to nosleep after a while and I am so glad that I did,  that too with your post "}, {"id": "dj8pc3x", "author": "WiredPilot", "body": "Been hanging out around Dimitri?"}, {"id": "dj8pdi2", "author": "Woodxwisdom", "body": "This is special in so many ways"}, {"id": "dj8swb5", "author": "A_Sly_Fox", "body": "Your writing is beautiful, so descriptive and immersing. \nThis all leaves me wondering - if you were conscious (or is it better described as aware?) after you had died, then perhaps death isn't the 'end' we think it is... "}, {"id": "dj8y2zv", "author": "Aussiewolf82", "body": "The demiurges archons pulled you back into the physical... Realise you're part of godhead and they have no power."}, {"id": "dj91pzv", "author": "Stonekilled", "body": "Wow, just...wow. Bravo, friend...have an upvote"}, {"id": "dj9cuax", "author": "janetogo445", "body": "Whoa. You just made me readjust my whole perspective of life. \n\nI read twice. The first time around I kept thinking IT was \"IT\" from Stephen King. "}, {"id": "djam6mm", "author": "bimmerbaby", "body": "Mind = Blown "}, {"id": "djb9dqp", "author": "TheCrystalGem", "body": "Wow, I really didn't expect that ending. That was really good, definitely one of the best stories I've read on here in a while."}, {"id": "djbqqdm", "author": "sashamg", "body": "This was beautiful. "}, {"id": "djbtuwc", "author": "TheGreatBeest", "body": "You should read the book Scythe by Neal Schusterman, I think you'd like it :)"}, {"id": "djbybki", "author": "glitter_vomit", "body": "This was so. good... Compared to what's been on here lately it was a breath of fresh air. Interesting idea &beautifully written. "}, {"id": "djfkwjx", "author": "Zarkrez", "body": "This is an awesome story."}, {"id": "djn0ar1", "author": "InDenialRedditor", "body": "Haven't been to this sub in a while. Searched top of the week. This was top. I've been slightly going through that weird 'what have I done in life that's worthy' / 'I'm alone and my parents are old and the only thing I have to fear is death'  somehow your story gave me so much hope in life. You literally have given me hope in not fearing death and fearing the worst and embracing it for what it is. I don't know what life has planned for me, but this, this was just inspirational and a great motivation to not take something for what I was brought up to learn. There will always be hope. Thank you."}, {"id": "dju30b0", "author": "AlvinGT3RS", "body": "This title reminds me of a nosleep last year "}, {"id": "dk6f2x8", "author": "SpanishDuke", "body": ">While I was alive I wouldn't experience death, so there was no reason to be afraid now. When I was dead, I wouldn't be capable of experiencing anything, so fear still had no cause. \n\nI see someone read Epicurus."}, {"id": "dk85c2w", "author": "Nikolaievitch", "body": "Now that's crazy but it's EXACTLY what I believe, but instead of Grimm Reaper I believe yourself are going to fight \"death\", and you'll get a little time wondering around nowhere until rebirth.   "}, {"id": "dkvlxfc", "author": "khomatech", "body": "Hahahahahaha"}, {"id": "dlpucmt", "author": "AngusDale_", "body": "How many years ago were you reborn? "}, {"id": "dmuoskn", "author": "Waylander37", "body": "Wow! That is absolutely fantastic. You really have a gift with words my friend. Your writing grabbed me within the first few lines. Please make more stories! :)"}, {"id": "dn4a675", "author": "LadyAna", "body": "Excellent! Very, very cool!"}, {"id": "doksgrr", "author": "Crafty_Chica", "body": "J...Just amazing! Gives you something to ruminate on. "}, {"id": "dpaq8b0", "author": "theLazyMeater", "body": "If the reaper loses the tug of war battle then we get reincarnated as humans on earth again? I guess in a poetic way, there is a hell."}, {"id": "dqflab9", "author": "jugofpcp", "body": "Ah, samsara. So simple to escape, and yet still, very few lifetimes succeed."}, {"id": "dqowq3r", "author": "YasuoAndGenji", "body": "A baby is being born the same time a man is murdered the beginning and end"}, {"id": "dj80zgq", "author": "Beastman2017", "body": "Death isn't to be feared. When our physical bodies die,our spirits/souls move through a dimensional barrier to different plane of reality. I dreamt once that I had died. I was able to look down at a frail figure without emotion or remorse. I moved through a kind of light tunnel. I seemed to speed through but there wasn't any sensation of speed. I emerged in a park,sitting on the stump of a huge tree. There were people around me greeting me with joy. It was explained to me that this was just a sort of way station. Souls came here to be acclimated to their new existence. Every so often, the population would thin to one person as the others moved on. This one remaining person would become the official greeter for the next batch. I was chosen to be the next greeter. I asked how I would know when someone was coming through. He smiled and said I would know. And he was right. There was a feeling in the air of expectation and that tree trunk was glowing. And the cycle began again."}]}