{"id": "7asz8x", "title": "Has anyone heard of the Left/Right Game? (Part 1)", "url": "https://www.reddit.com/r/nosleep/comments/7asz8x/has_anyone_heard_of_the_leftright_game_part_1/", "subreddit": "nosleep", "author": "NeonTempo", "text": "A few points before we start. \n\nFirstly, I am not the protagonist of this story. I just went to university with her, and though she went on to become a professional writer, I most certainly did not. She'll be taking over from me further down but, until then, please forgive my slightly awkward delivery while I give you guys the necessary context. \n\nSecondly, I don't know what you will make of the following events, and I'm sure many of you might consider it all some sort of hoax. I wasn't present for any of what transpired in Phoenix, Arizona but I can vouch for the person who wrote the following logs. She is not, and has never been, a fantasist.\n\nOk so I once knew a girl called Alice Sharma. She was an undergrad at Edinburgh Uni the same time I was. My educational poison was History, a degree which has greatly benefited my career as a bicycle repairman. Alice Sharma studied journalism, though perhaps \"studied\" isn't the word. It's not an exaggeration to say that she lived and breathed the subject. Editor-in-chief of the campus paper, recognisable voice of student radio. She was frustratingly tunnel visioned, and she was a journalist in her own right before anyone gave her a professional shot. \n\nWe met in student halls and became friends almost immediately. A meandering waster trying to stay off his parent's farm and an intrepid, ambitious reporter may not seem the most obvious pairing, but I learned not to question it. She was inspiring, and smart and she proofread all my essays. I’m not too sure what she saw in me.\n\nWe were eventually flatmates down in London where she chased her dream and I chased my tail. She got a few jobs here and there, but nothing befitting of her skills. After months of fruitless internships and rejections, Alice called a flat meeting, telling us that she was moving to America, accepting a position chasing stories for National Public Radio. The job had come out of the blue, the result of a hail mary application she thought had been dismissed out of hand. We threw her a bittersweet going away party and put the room up for rent.\n\nThat party was the last time I saw Alice Sharma. She dropped out of contact a few months after her departure. Complete radio silence. I assumed she was just busy so I carried on with my small but happy life, and waited for her to pop up on television with some important words below her name; Chief Correspondent, Senior Analyst… something like that.\n\nThe radio silence was broken last week, and, for reasons you’ll glean further down, I’m less happy about it than I would’ve thought.\n\nArriving home from work I found a lone email in my otherwise bare inbox. An email that would later be described as \"suspicious\" by my tech literate friends. Despite being born in the early 1990's I didn't own a computer until uni, and I've missed several important lessons in the world of cyberspace. Lessons like \"Don't call it Cyberspace\" of course and more importantly, \"Don't open emails with no text, no subject and no sender's address.\"\n\nI realise most of you would have deleted this anonymous, blank email immediately, my friends certainly would have, but beyond my basic ignorance about online safety, something further compelled me to open it. The only thing of substance in the entire message was a zipped folder, labeled:\n\nLeft.Right.AS\n\nI don't have to explain what I was hoping those final initials stood for.\n\nOpening the zipped folder I found myself staring at a stack of text files. Each one titled with a date, continuing sequentially from the very earliest file \"07-02-2017\". (To any Americans in the room this is the 7th of February).\n\nI’ve since read the files a few times, and shown them to some friends. They don't know what to make of it either, but they certainly aren't as concerned as me. They think Alice is just in a creative writing phase and, if I didn't know her, I’d have to agree. But the thing is, I do know her. Alice Sharma only cares about the truth and if that's the case with these files, insane as it may sound, then it’s very possible my friend has documented her own disappearance.\n\nThe people who suggested this forum said you discuss strange occurrences etc. If you guys have come across anything to do with the below, or know any of the people involved, then please send any information my way. \n\nHas anyone here heard of the Left/Right Game?\n\n[Part 2](https://redd.it/7bkk41)\n\n[Part 3](https://redd.it/7cf4h8)\n\n[Part 4](https://redd.it/7dmuvp)\n\n[Part 5](https://redd.it/7fdu9c)\n\n[Part 6](https://redd.it/7h9jzb)\n\n[Part 7](https://redd.it/7jabqd)\n\n[Part 8](https://redd.it/7loh1l)\n\n[Part 9](https://redd.it/7q3x6e)\n\n[Part 10](https://redd.it/7uyiss)\n\n***\nThe Left/Right Game\n[DRAFT 1]\n07/02/2017\n\nThey say great stories happen to those who can tell them. Robert J. Guthard is an exception to that rule. As I sit at his table, sip his coffee and listen to him recount the past 65 years it sounds like he's reading off a shopping list. Every event, his first job, his second wedding, his third divorce, none of them receive more than one or two sentences. Rob plows through the years, the curt, dispassionate curator of his own personal history. Yet the story itself is so fascinating, so rich with moments and so wildly meandering that it somehow stands on its own merits. \n\nIt's a great story, no matter how you tell it.\n\nBy the time Rob was 21, he'd gotten married, had a son, worked as a farmer, a mover, a boat engineer, and grown estranged from his spouse... Here's him talking about that.\n\n**ROB:** Course my wife started to get dissatisfied, I was away a while.\n\n**AS:** For work?\n\n**ROB:**Vietnam.\n\n**AS:** You were in Vietnam? How was that for you?\n\n**ROB:** I ain't never been back since.\n\nThat was everything he had to say concerning his first divorce, and the entire Vietnam war.\n\nRob had four marriages after that, and even more professions. After the war he worked with a firm of private detectives, got shot at once by the mob, then he became a courier, which is how a poor boy from Alabama got to see the world.\n\n**ROB:** I been to most of the continents with that job. I been to India. You from India?\n\n**AS:** My mum and dad are from India yeah.\n\n**ROB:** See I could tell.\n\nHe'd been arrested once in Singapore, after one of his packages had been found to be full of white powder. He spent three days locked up before someone got around to checking the substance. It was chalk. \n\nA friend he made during his brief custody, Hiroji Sato, invited Rob to stay with him in Japan. Just getting over the breakup of his third marriage, Rob took the offer. He stayed in Japan for another 5 years.\n\n**ROB:** The Japanese are good people. Good manners. But they got all these urban legends and ghost stories that Hiroji was crazy for, spent all his free time chasing them down. Like, you heard of Jorogumo?\n\n**AS:** I don't think so\"\n\n**ROB:** Well she's this spider lady lives in the Joro Falls round Izu. Meant to be real pretty but real dangerous. Hiroji took us out there to get a picture of her.\n\n**AS:** Did you ever meet Jorogumo?\n\n**ROB** Nah she didn't show. None of them did. I didn't believe at all until we went to Aokigahara\n\nAokigahara, affectionately titled the Suicide Forest. The next stop on Rob's adventure. It's an area of woodland at the base of Mount Fuji, a notorious hotspot for young people looking to take their own lives. Hiroji, Rob's ghost obsessed jailmate turned best friend, took him to Aokigahara to chase \"yurei\" the ghosts of the forest.\n\n**AS:** Did you find anything? In Aokigahara?\n\n**ROB:** Well I ain't gonna ask you to believe me. But I was a PI. Professional cynic. Even I can't deny there was a spirit in those woods.\n\nFrom that moment on, Rob's sentences start getting longer. A childlike excitement creeps into his voice. I get the distinct feeling we're moving beyond background, beyond Rob Guthard's old life, and towards his new one. The one he wants to talk about. The one that led him to contact the show.\n\n**ROB:** It walked up to me through the trees. Looked like static you see on a TV screen but it had a human shape almost.\n\n**AS:** Almost?\n\n**ROB:** It was missing an arm. It reached out to me but I bolted outta that forest so fast. Hiroji never saw it, holds it against me to this day.\n\nHiroji had good reason to be annoyed. Rob says that Mr Sato had been going to the forest 2-3 times per year for three decades. To have a rookie come along and claim to have seen a yurei on his first trip? I'd be more than a little cranky.\n\nBut Rob didn't stay a rookie for long. In fact, it was in those woods that he discovered his current passion. The supernatural, or more accurately, the documentation and investigation of urban legends. Legends like Bloody Mary, the Jersey Devil, Sasquatch. Rob has looked into them all.\n\n**ROB:** I figured if one was true then who knows how many others could be.\n\n**AS:** How many have you proven so far?\n\n**ROB:** Since Aokigahara? Ain't none of em had any proof to em. Except for one. That's why I called you guys up.\n\nAt this point, Rob can’t hope to repress his smile.\n\nThe Left/Right game appeared on a paranormal message board in June 2016. Only a few people frequently visited the forum and, of these regulars, only Rob took an interest in the post.\n\n**ROB:** The whole thing had a level of detail you don't see in other stories.\n\n**AS:** What details grabbed your interest?\n\n**ROB:** Logs. High quality pictures. The guy documented everything, said he wasn't gonna play the game anymore. I think he wanted somebody to keep investigating.\n\n**AS:** And you were that somebody.\n\n**ROB:** That's right. I set about trying to verify his information right away.\n\n**AS:** And how did it go?\n\n**ROB:** Well... It didn't take long to realise the Left/Right Game is the real thing.\n\nThe rules of the Left/Right game are simple. Get in your car and take a drive. Take a left, then the next possible road on the right, then the next possible left. Repeat the process ad infinitum, until you wind up somewhere... new. The rules are easy to understand, but Rob says their not so easy to follow.\n\n**ROB:** There ain't all that many roads where you can turn left and right and left and right and keep going. Most of the time you find yourself at a dead end or needing to turn in the wrong direction. Phoenix is built on a grid system so you can keep going left and right as long as you need to.\n\n**AS:** Did you move to Phoenix for the Left/Right game?\n\n**ROB:** That's right.\n\nI try not to seem incredulous. Selling your house in another state, packing up and moving your whole life to Phoenix, Arizona just to play a game you saw on the internet? It seems like insanity. Rob smiles as he reads my expression. I can clearly read his expression too. \"You'll see.\" It says. \"Just wait.\"\n\nI wouldn't have to wait long. Included within the 9 page submission Rob sent our show, was a long list of suggested items the chosen reporter should bring with them. Clothes for three days, a pocket knife, matches, bandages. There were also a set of qualifications the reporter should have. The ability to drive, basic vehicle maintenance and its human equivalent... first aid training. He didn't just want to talk about the Left/Right Game. He wanted to take one of us along.\n\nRob leaves a short while later to embark on a few errands, \"Prepping the Run\", as he calls it. He shows me to the guest room and we part ways, on good terms but very much aware of the other's poorly veiled opinions. He knew I saw him as a charming obsessive, chasing after a fairy tale. He saw me as a naive cynic, on the cusp of a new world. All I could think as I heard the front door close is that by tomorrow afternoon, one of us would be right.\n\nMore after this.\n\nWhen I wake up the next morning, Rob is in my room, holding a tray which he'd knocked on the bottom of to rouse me. I don't manage to record the start of our conversation.\n\n**ROB:** - I got bananas, strawberries, chocolate syrup. We got some more downstairs but I wanted you to wake up to something good. We won't be eatin' this stuff on the road.\"\n\nRob has made me waffles. He sets them down on the night stand and talks through the coming day as I eat. I'll admit it feels a little uncomfortable, waking up in a stranger's home to find said stranger already standing over me, but I quickly move past it. I tell myself that he’s an older man, accustomed to living alone in his own house, not usually having to think about boundaries. Anyway, he certainly knows his way around a waffle iron.\n\n**ROB:** We hit the road at 9. I wanted to give you time to get ready before everyone shows up.\n\n**AS:** There are other people coming?\n\n**ROB:** We got a 5 car convoy on the road today. They'll be here in an hour.\n\nThis is the first I’ve heard of a convoy, and to be honest I’m surprised. The game is Rob's obsession, and I’m here at his request. The idea that anyone else would have an interest in today's drive is a little perplexing.\n\nHalf an hour later, sated, showered and dressed in the \"functional clothing\" Rob had so painstakingly outlined, I take my pack out to the porch. Rob’s already there, waiting for his associates to show up.\n\n**AS:** I thought you'd be conducting a few more errands.\n\n**ROB:** If you ain't prepared by the morning of, you ain't prepared.\n\n**AS:** Hah ok I guess that's fair. Oh, Rob is the garage locked? The inside door won't budge and I wanted to mic up the car.\n\n**ROB:** Yeah it's locked up I'll open it for ya.\n\n**AS:** Thank you.\n\n**ROB:** In fact it's about time I wheeled her out. Fair warning Ms Sharma, she's a thing of beauty.\n\nTo Rob Guthard, beauty took the form of a dark green Jeep Wrangler. Rob climbs in and lets it roll out of the garage, where it dominates every inch of driveway. The car is large; four doors with a roof enclosing the entire compartment. It’s also been modified extensively, yet another example of Rob's dedication to the game.\n\n**ROB:** What're you thinking?\n\n**AS:** I think you're two caterpillar treads short of driving a tank.\n\n**ROB:** Hah yeah I fixed her up good. I put the winch in, heavy duty tires, the light rig on top is LED's. They'll make midnight look like noon but they don't use hardly any power.\n\n**AS:** Aren't Jeeps open top usually?\n\n**ROB:** Not all. This is the Unlimited. I like to have a covered car when I head on the road.\n\nI climb in and stow my pack. Rob had removed the back seats to afford more storage space. The place is packed to the brim. Jerry cans of gasoline, barrels of water, rope, snacks and his own neatly packed set of clothes.\n\nI wonder if the rest of our convoy would take the game so seriously.\n\n**ROB:** We got Apollo coming up in 10 minutes. No one else has given me a time. I sent the schedule weeks ago, this always happens.\n\n**AS:** His name's Apollo?\n\n**ROB:** That's his call sign. Apollo Creed I think he said.\n\n**AS:** Why are you using call signs?\n\n**ROB:** Did I not tell you? Oh yeah we're gonna use call signs on the road, keep communication clear.\n\n**AS:** What's your callsign?\n\n**ROB:** Ferryman.\n\n**AS:** ... What's my call sign?\n\n**ROB:** I thought about it. I was thinking London, you're from London right?\n\n**AS:** I'm from Bristol.\n\n**ROB:** Bristol? That’s fine I guess.\n\nIt’s less than ten minutes before Apollo turns the corner. Rob jumps out of his chair and paces briskly over to the edge of his property, as his first guest pulls up and steps onto the sidewalk.\n\nApollo vaguely resembles his namesake, dark skinned, tall and noticeably well built, though it’s clear he couldn’t be less of a fighter. This Apollo Creed is all smiles and seems to have a penchant for laughing at his own jokes.\n\n**AS:** How far have you come?\n\n**APOLLO:** I've come out of Chicago. Took three days hard driving.\n\n**AS:** And you know Rob from the forums?\n\n**APOLLO:** Everybody knows Rob, Rob's the god! Ahaha\n\nRob walks over to Apollo's car, gesturing him over to talk shop. Rob’s clearly impressed with Apollo's choice of vehicle, a blue Range Rover packed to the ceiling with kit. I was more impressed with Rob himself. Somehow this 65 year old farmer's son had become respected in a vast online community. My dad is Rob’s age and he's just discovered copy and paste.\n\nThe rest don't take long to arrive. Two Minnesotan librarians, also around Rob's age, pull up in a grey Ford Focus. They’re brother and sister, and they've shared ghost hunting as a hobby their entire lives. I find it hard to suppress a smile when they meekly introduce themselves as Bonnie and Clyde.\n\n**CLYDE:** We would have gotten here sooner we had to drop by to get some blankets. Pleasure to meet you ma'am.\n\n**AS:** Pleasure to meet you too.\n\n**CLYDE:** Would you be the journalist?\n\n**AS:** That's right.\n\n**CLYDE:** You used to write for the town paper didn't you?\n\nHe's talking to his sister there, she nods. Clyde is clearly the spokesperson for the pair, yet they both seem incredibly shy. Whether they admire the famous outlaws, or just the name, it's pretty clear they couldn't be more different from the real thing.\n\nNext to show up are Lilith and Eve, English Lit students at New York University and proprietors of the YouTube channel Paranormicon. Unlike Bonnie and Clyde, Lilith and Eve have no issue holding a conversation. As soon as they learn who I am, and what I do for a living, they attempt to conscript me for an expedition to Roswell.\n\n**LILITH:** We have a friend there, he's been seeing some-\n\n**EVE:** -He's a seismologist\n\n**LILITH:** Yeah and he's been recording readings over the years that show subterranean movement. Predictable movement.\n\n**EVE:** We're going to see him in July, but we could work it around you if you're free.\n\n**AS:** I'll have to check my schedule\n\n**EVE:** OK cool let me give you my email...\n\nThey quickly hurry off to film an intro for their latest video, featuring a quick interview with Rob, who seems pretty welcoming of the attention.\n\nThe last two cars arrive within a few seconds of each other. A lithe, strong willed older lady who goes by Bluejay and a younger man going by the callsign “Ace”. Bluejay has arrived in a grey Ford Explorer. Ace, much to Rob's annoyance, has arrived in a Porsche.\n\n**ROB:** Did you think that's gonna help on the road? I didn't write that-\n\n**ACE:** It's my car. What am I meant to do,? It's my car.\n\n**ROB:** You didn't read my itinerary, you got nothing packed in there.\n\n**ACE:** I did read it sir OK? Calm down. I have a bag, I won't ask you for anything.\n\n**ROB:** Well I know that's true.\n\nAce and Rob were off to a bad start. Ace takes a phone call, and despite my best efforts to get an interview with Bluejay, she doesn't seem interested in talking to a journalist.\n\nWith five cars, and seven travellers waiting for a green light, Rob hands out radios and charging packs, then launches into a quick safety briefing. Wear seatbelts. Stay in position. Communicate clearly and often. It’s at this moment I start to feel a little dismay. I like Rob, and clearly so does everyone else. He'd convinced all of them to drive across the country to join in with his game. I start to worry what will happen in the likely event that the whole thing isn’t real. Would Rob lose the respect of his peers? Would he accept failure when it comes? After seeing the effort he’s put into these runs, the next few hours have the potential to be wildly uncomfortable.\n\nWith a smile and a few encouraging words, Rob ends his briefing and beckons me over to the Wrangler. I clamber inside and make myself as comfortable as possible.\n\n**ROB:** You ready for this Bristol?\n\n**AS:** I'm ready.\n\n**ROB:** Ok then let's hit the road.\n\nThe Wrangler pulls out of the driveway, and the convoy follows in order of arrival. Apollo, Bonnie & Clyde, Lilith & Eve, Bluejay and Ace keep a steady pace behind us as we come up to the first corner.\n\nRob slowly and deliberately turns left, checking on the others in his rear view mirror. He looks back to the road as Ace’s Porsche completes the first turn of the game. Shortly afterwards, Apollo checks in on the CB radio.\n\n**APOLLO:** This is Apollo for Ferryman. How many to more go Rob? ahahaha\n\n**ROB:** Hah as many as it takes.\n\nI can tell Rob wanted the to reserve the radio for something other than Apollo's quips. But he seems to like Apollo enough to let it slide. I'm not sure Ace would have received the same treatment. We take the next right, then another left. Now safely assured that everyone's following correctly, Rob speaks my thoughts aloud.\n\n**ROB:** You're wondering the same thing Apollo is.\n\n**AS:** What do you mean?\n\n**ROB:** You're wondering how many turns we're gonna take before we hit some wall or something. Before you find out this is all just a story.\n\n**AS:** Does that disappoint you?\n\n**ROB:** I'd be disappointed if you weren't thinking something like it. But now we're on the road I gotta say something and you gotta listen to it.\n\n**AS:** OK...\n\n**ROB:** We're coming up to a tunnel soon. Any time before we reach it you can get out, walk in any direction you like, and you won’t be in the game no more. Once we go through, you gotta retrace the route we took to get yourself back out that tunnel. That's when you’re home. And you gotta convince someone to take you back in a car coz I ain't ferrying you back 20 minutes in. You got till the tunnel to skip out on this, understand?\n\n**AS:** I understand. Though I have to say I'm getting little nervous.\n\n**ROB:** Ain't nothing wrong with a little nervous.\n\nWe've taken 23 turns by this point. Already I feel like we're traversing the city pretty effectively. Rob's heavily modified Wrangler solicits a few impressed glances from passersby, as well as several honks of respect from other Jeep drivers. Other than those few moments, everything seems completely indistinguishable from a regular morning drive. I even start to worry if there’ll be anything at all for this story. “Reporter Takes Drive With Interesting Man” isn’t exactly Pulitzer worthy.\n\nTurn 33 leads us onto a short, unassuming street. A row of small businesses in a quiet Phoenician neighbourhood; liquor, second hand clothing, tools and, at the end of the street, a little shop selling antique mirrors. Ten or so people shuffle along the sidewalk, smiling, talking, planning their weekends. The only lone person is a young woman in a grey coat..\n\nI briefly glimpse her at the end of the street, standing on our next corner, the back of her coat reflected in fifty old mirrors. Even from a distance I can see that she’s sullen, wide eyed and nervous. She shifts constantly on her feet, tugging at the button of her coat.\n\nI look away to write some notes as we roll down the street. When I look up again, the woman is standing by my window, staring right at me. She’s smiling, a wide, unfaltering grin that seems almost offensive in its complete insincerity.\n\n**GREYWOMAN:** Lambs at the gate. Hoping for something better than clover when all they find are things worse than slaughter.\n\n**AS:** Rob what's happening?\n\n**ROB:** Ignore her.\n\n**GREYWOMAN:** He wanted to leave me so I cut him out. The lake was hungry it drank the wound clean.\n\n**AS:** Miss, are you alright?\n\nThe smile vanishes, it snaps from her face and suddenly, the woman is furious.\n\n**GREYWOMAN:** What do you think you're doing?! Have you gone mad?!\n\nI reflexively press myself back in my chair as the woman, wild eyed and gaunt, slams her fists against my window, with every intent of breaking through.\n\n**GREYWOMAN:** Would you dance down the lion’s tongue? It will shred you, you whore! It will shred you down to your sins! You fucking bastard!\n\nRob puts his foot down, and the Wrangler rolls defiantly away from the woman. As we turn the corner I watch her as she wretches, her every movement cradled in abject hysteria. She yells despairingly at the rest of the convoy, bursting into tears when the last car passes her by. \n\nAs she shrinks into the rear view mirror, I see her turn to a large mirror on the side of the shop, which the owner is in the process of polishing. I watch as she walks up to it, and with a convulsant scream, slams her head into the glass.\n\nThe mirror cracks around her forehead, the owner jumps back in shock, and as the woman pulls her head from the mirror's surface, the fractured spider’s web is dripping red. It all happens in a split second, and she quickly swerves from my view as we take the next left.\n\n**AS:** Rob, what was that?\n\n**ROB:** She's there sometimes.\n\n**AS:** On that street?\n\n**ROB:** On the 34th turn.\n\n**AS:** Who is she?\n\n**ROB:** I don't know. She's never acted out that much before though. Must be a special trip.\n\nI find Rob's lack of concern a little unpleasant, and his implication that this woman's ravings were the symptom of an internet game leaves me more than a little perturbed. As I see it, there are a few explanations for what just happened, and none of them lead to a comforting conclusion.\n\nIf we had just encountered a bonafide crazy person, then one could argue that Rob is just seeing what he wants to see. Maybe he'd bought into the game’s story so much that every strange but explainable occurrence would be rationalised as the next step in his favourite paranormal narrative.\n\nAlternatively, the woman could have been an actor, a more elaborate theory sure, but not unheard of. People have lied to the show before and Rob was receiving a tonne of publicity for this attempt from Lilith, Eve and I. I admit, Rob didn't seem like a liar, but good liars never do.\n\nThere is a third alternative however. An alternative which, if you put logic aside, explains the all troubling little details that I couldn't help but notice. Because as strange as the grey woman was, isn't it stranger that no one on the street would react? I couldn't recall a single glance in her direction by anybody on the sidewalk. Perhaps that theory falls apart when you consider the shock on the mirror seller's face but, when I think about it, he only reacted once the mirror shattered, and even then, I feel like his attention was on the mirror itself.\n\nThe radio crackles.\n\n**LILITH:** Lillith to Bristol. Sara... Eve got that on camera! Do you have audio?\n\n**AS:** I think it picked her up.\n\n**LILITH:** My god that was so weird. Can you send us the file when we stop? Can you ask Ferryman when we're stopping?\n\n**AS:** When's our stopping point?\n\n**ROB:** For them, in about 30 minutes. For you? Well, you tell me.\n\nRob turns off a busy street just before a large intersection, onto a much quieter stretch of two lane road. Ahead of us the road slopes downward, leading into an underpass, which disappears into darkness.\n\nWe'd arrived at the tunnel.\n\n**AS:** What is this supposed to pass under?\n\n**ROB:** Ain't supposed to pass under anything, it's just there.\n\n**AS:** And if we weren't playing the game?\n\n**ROB:** Then it won't show. The question is, are you playing the game or not?\n\nRob turns to me. It’s the first time he’s taken his eyes off the road since we started. He pulls the car to a slow stop at the mouth of the tunnel.\n\n**ROB:** You get out now you can go wherever you wanna go, but through there you'll need a car to get yourself home and, like I said, mine ain't turnin round for a long while. You understand?\n\nIt’s a dramatic statement, but unsettlingly, it doesn’t feel like he’s attempting to dramatise. It feels like I’m having something genuinely asked of me. Am I ready for what’s to come? Do I accept the risks involved? Do I consent to be taken down this road, and the next road, and the next? Am I prepared to see this game through, real or otherwise, to its end?\n\n**AS:** What are you waiting for?\n\nRob smiles, and turns back to the road. He picks up the CB radio holds down the button on the side. The microphone crackles.\n\n**ROB:** This is Ferryman to all cars. Anyone want to step out then pull to the side now. Otherwise, stay in formation and have some supplies at hand. We got a long ways to go.\n\nMuch like the game I’m so tentatively playing, my view of Robert J. Guthard seems to change direction frequently. I’d heard all about his life, but I’m sure that I know him. I like the guy, but I’m not certain that I trust him. And though I admire his dedication to the Left/Right Game, I’m not sure I’ll like where it might lead us. Yet as he takes us into the tunnel, his face vanishing and reappearing under the dim sodium lights, I can that tell he expects this trip to be a major step in his already impressive story, and this time, for better or for worse, I’m along for the ride.", "comments": [{"id": "dpcj883", "author": "NoSleepAutoBot", "body": "It looks like there may be more to this story. Click [here](https://www.reddit.com/message/compose?to=RemindMeBot&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fnosleep%2Fcomments%2F7asz8x%2Fhas_anyone_heard_of_the_leftright_game_part_1%2F%5D%0A%0ANOTE%3A+Don%27t+forget+to+add+the+time+options+after+the+command+such+as+%271+Day%27+or+%2748+hours%27.+This+defaults+to+1+day.%0A%0ARemindMe%21&subject=Reminder) to get a reminder to check back later."}, {"id": "dpd1xfk", "author": "la-llama", "body": ">My educational poison was History, a degree which has greatly benefited my career as a bicycle repairman.\n\nI can identify with this sentiment."}, {"id": "dpcx6l7", "author": "SoleilTheGreat", "body": "I feel like 24 hours is entirely too much to ask of anybody to wait! \nOn another note, WOW!!"}, {"id": "dpd1lhx", "author": "killmonday", "body": "Oh *man* I'm buying in--this is the most excited I've been about a story since Infected Town"}, {"id": "dpcniaj", "author": "Natezorblack", "body": "I am absolutely riveted. The writing is top notch, and I am utterly fascinated."}, {"id": "dpd60ki", "author": "HunterUrban2", "body": "As much as I want to know what happens next, I also want OP to stop writing here and go take this to a movie studio. It's so vivid, the writing is top notch, I don't think I've ever been so excited for a Part 2 on nosleep before!"}, {"id": "dpd1jh9", "author": "Camohunter0330", "body": "Great stuff. 2 things though.\n\nA jeep wrangler and wrangler unlimited both can take the tops off.  And jeep owners wave at each other, they don't honk.   The wave is sacred.\n\nCan't wait for part 2!"}, {"id": "dpds0h4", "author": "Roodyrooster", "body": "i hope the story ends by none of them going into the tunnel and all getting together for laughs over  fajitas at Chili's. "}, {"id": "dpcqeu8", "author": "dothackslash", "body": "This is good"}, {"id": "dpcyzar", "author": "SignificantSampleX", "body": "I'm on the absolute edge of my seat over here. This is the most addictive thing I've read in a good long while."}, {"id": "dpd6m9j", "author": "OMMad", "body": "Great, now I have to wait 24 hours (at least) for the next part. Between this and the 70's Lab series, it feels like all I do is try and fill empty time between /r/nosleep series posts."}, {"id": "dpdwzn7", "author": "suspiciousdave", "body": "I watched a horror movie called \"As above so below.\"\n\nThis is giving me the exact same vibes. I hate scary movies but that one was unique, a journey into something dark and evil. It's the very same, and I want to see where this goes..\n\nAlso, make this a movie. Lol"}, {"id": "dpqo0jb", "author": "dharmarox", "body": "Late to the party. Gotta say that for some reason, I have seen the title and have consistently been scrolling past it for over a week. So glad I stopped this time and that I don't have to wait days for the next installments.  "}, {"id": "dpctvwq", "author": "sleeping4life", "body": "This piqued my interest."}, {"id": "dpdagtm", "author": "AdamTheHobbit", "body": "Everything about this is amazing... expect for the fact that paranormicon isn’t a real YouTube channel"}, {"id": "dpcuftn", "author": "lemonadefire", "body": "Wry well written, maybe robs luring people :0 Keep it up bud!"}, {"id": "dpd2e2g", "author": "Rangermatthias", "body": "Okay, so, of you follow the rules won't it just be the same every time? Couldnt I map the route out on Google map?"}, {"id": "dpd2m8k", "author": "gypsylight", "body": "Oh wow this is one of the most gripping things I've come across on nosleep. Update!"}, {"id": "dpcuak1", "author": "nyarlethulhu", "body": "This is amazing, I can't wait for part 2! "}, {"id": "dpdfc2t", "author": "SgtSassy510", "body": "Salt Lake city is a grid city too. Actually most of the Wasatch front is. And we have a few Jeep clubs. Not saying you have to have a Jeep to play but maybe some have heard of it. This really unnerved me and it's not scary yet. I can't wait for more!"}, {"id": "dpdaxop", "author": "--Kayla", "body": "Tbh the most unsettling part so far is that I’m a history major right now..."}, {"id": "dphc3p1", "author": "browngirls", "body": "OP PLS"}, {"id": "drf64mo", "author": "Brutishcard", "body": "This is one of the all time no sleep greats, if you are considering reading but put off by the length, just read. "}, {"id": "dpd1djw", "author": "XFadedFoil", "body": "Please link part two in this thread when it's out, OP!"}, {"id": "dpgceto", "author": "DLenshire85", "body": "This is the first time I check multiple times a day to see if there are any updates. So good! "}, {"id": "dqq6bpk", "author": "imjustagirl66", "body": "I’m so glad I just found this now that six parts are available. I don’t know that I would’ve been able to handle the suspense."}, {"id": "dpd5kol", "author": "Gorey58", "body": "Oh, this is great - can't wait for more. I'm guessing that Eve and Lilith stop playing soon? I wonder why??"}, {"id": "dpdagcg", "author": "Manoosh_KingKapiko", "body": "I imagined Rob as Robert DeNiro the whole time"}, {"id": "dpczsvo", "author": "colorvdope_", "body": "I NEEEEEED THE NEXT PART OF THIS? obsessed"}, {"id": "dpd7wcu", "author": "ManolinaCoralina", "body": "I am already obsessed with this series. The writing is amazing, and the story is absolutely gripping!"}, {"id": "dpdic5m", "author": "GirrafePimp", "body": "I’m excited to hear what’s under the tunnel"}, {"id": "dpfx4ei", "author": "laurenhayden1", "body": "I need part 2! I've been very patient. But I'm getting desperate :'("}, {"id": "drbb3dp", "author": "MyLaundryStinks", "body": "1) This feels like a Road Trip version of No End House (ahem, Syfy/Channel Zero take note please). I like it.\n\n2) In my head, Rob is played by Michael Rooker."}, {"id": "dvttpgf", "author": "ffd8d1", "body": "Just saw this on my dash again and just wanted to say to anyone looking, PLEASE keep reading this story! I binged it all in one night like a good book. Don’t stop reading! This whole story is fuckin phenomenal!"}, {"id": "dpcpxnw", "author": "senoritasodium", "body": "Amazing. I can't wait for the next part."}, {"id": "dpczftk", "author": "BenJaquenhoft", "body": "More please."}, {"id": "dpd2qko", "author": "squishysplits", "body": "Agreeing with everyone else here I really loved this one. Can’t wait for Part 2!"}, {"id": "dpd4u1m", "author": "ryba11s", "body": "Loving the Gonzo journalism. Thanks OP. "}, {"id": "dpd5w37", "author": "nomoresweetdreams666", "body": "Im so hooked. Please tell us more... I hope the game is real.. or else .. he would just be a murderer luring people to come with him to desolated places just to be killed.  "}, {"id": "dpd87yq", "author": "KabeeCarby", "body": "This is written incredibly well and I couldn’t stop reading. I’m super pumped for part 2 😁"}, {"id": "dpd8oo8", "author": "artillerychelle", "body": "Love this, can't wait for the next part!"}, {"id": "dpdf6w5", "author": "arachnoking", "body": "I'm worried for Alice. Are there any more logs? "}, {"id": "dq80rpb", "author": "QuothTheRaven_", "body": "First rule of Cyberspace....Don’t call it Cyberspace "}, {"id": "ds34i56", "author": "musicissweeter", "body": "I'd like to try this out sometime...but...so much gas!"}, {"id": "dtpxxvi", "author": "peacelovestreetart", "body": "Wow. I'm so glad I just stumbled upon the story now. I don't have to wait 24 hours in between each part. Thank God! I can't wait to read the rest"}, {"id": "dplw7u1", "author": "18005467777", "body": "So good!!! But\n\n>The car is large; four doors with a roof enclosing the entire compartment.\n\nSo like.. any vehicle then. Too funny"}, {"id": "dpcqce1", "author": "QuoteTh3Raven", "body": "I can not wait for more!"}, {"id": "dpcw7vv", "author": "Iwishicouldsaveuall", "body": "I cant wait to read what happens.  Great story!!"}, {"id": "dpd1e52", "author": "Justiceth", "body": "This is very well written. I can't wait to read part two :)"}, {"id": "dpd45pv", "author": "rosethorn3", "body": "I’m actually really excited for part 2 can’t wait for that update "}, {"id": "dpd47t3", "author": "LatentCriminal", "body": "I’m in awe of this amazing tale, can’t wait for the next part!"}, {"id": "dpd4nxp", "author": "sidrat_10", "body": "I'm hooked! Can't wait for more! "}, {"id": "dpd5156", "author": "MonkeyBrainss", "body": "Nice!"}, {"id": "dpd5yig", "author": "Jerome3000", "body": "I want to know what comes next. Please? "}, {"id": "dpdeex7", "author": "Ozy-dontmind-diass", "body": "Really into this can't wait to hear the next part."}, {"id": "dpdgrcw", "author": "zlooch", "body": "Wow.  I don't know if this post is really that good,  or if it's just my frame of mind ATM,  but I was so utterly engrossed and focused on this.  That's amazing. "}, {"id": "dpdjrsj", "author": "MalTheLucario", "body": "I might have to play this game myself sometime "}, {"id": "dpeeej2", "author": "Scully__", "body": "Please update! "}, {"id": "dpes7z6", "author": "ArdenWolfe", "body": "This is it lads. I've been reading nosleep for a long time, and this is the best story I have ever read on here."}, {"id": "dpewgku", "author": "ashbertollini", "body": "Eagerly awaiting pt.2!"}, {"id": "dpex5vi", "author": "Jessinadressy", "body": "I can't wait to read the rest of this story!! "}, {"id": "dpezn1p", "author": "hereneverthere", "body": "I cannot wait for part 2! "}, {"id": "dpg485d", "author": "suicidalpenguin99", "body": "Where part 2 at? "}, {"id": "dpihudn", "author": "Gootruck69", "body": "Need to know more"}, {"id": "dpytnwy", "author": "muse122987", "body": "Part IV, wheeeeeeere are you????"}, {"id": "dqphpxq", "author": "Supercow987YT", "body": "If he was 21 when the Vietnam War started then he would be 73, not 65"}, {"id": "dr6z9mg", "author": "Martin7431", "body": "i refuse to believe we only started hearing about this a month ago"}, {"id": "du68rpy", "author": "tcleveland313", "body": "I have always never been a big reader, but I noticed the upvotes and figured I would give it a try for a change. The decision to read this story, and the grip that it put me in as I went through the different posts have shown me a new found love. What an amazing piece by the OP! Thank you! "}, {"id": "dpde083", "author": "Nebelherrin", "body": " I'm so excited!"}, {"id": "dpdehss", "author": "SweetSue67", "body": "This has me reelin'. I am so ready for more. Please don't make me wait. I'll just die, my death will be on your hands."}, {"id": "dpdih07", "author": "miltonwadd", "body": "I smell another /r/nosleep epic! "}, {"id": "dpdiqda", "author": "bigtitbritt", "body": "Need more!"}, {"id": "dpdj454", "author": "Skydog-13", "body": "I'm hooked "}, {"id": "dpdmkme", "author": "Captain_Strelnikov", "body": "Following"}, {"id": "dpdrr8q", "author": "tribehaspoken", "body": "At first i mistook the “along” in the last sentence for \"alone\" . And then I check again and find out my mistake. Mildly interesting if all others besides Rob &AS decided to quit lol, really good writing and I cannot wait for part2."}, {"id": "dpdrvjm", "author": "gypsygirl83", "body": "Absolutely an amazing read!"}, {"id": "dpecqqc", "author": "kiradax", "body": "wow, this is amazing! also hello from a fellow edinburgh student, im in moray house"}, {"id": "dper0lu", "author": "enjoyablehat", "body": "Man... this is going places"}, {"id": "dpet8bi", "author": "Corey307", "body": "Need to know more"}, {"id": "dpetf1w", "author": "Stormageddon252", "body": "OMG, this story was so captivating! I can't wait to see what happens next. It's one of the best series on nosleep, hands down!"}, {"id": "dpga6de", "author": "InvincibleSummer1066", "body": "I can barely wait for part 2. "}, {"id": "dpger9y", "author": "ephryene", "body": "I'm hooked."}, {"id": "dpgkh2i", "author": "catseeable", "body": "Really want to read the second part!"}, {"id": "dpj4e8y", "author": "Alic3_in_zombi3land", "body": "I love this. So interesting"}, {"id": "dpkgrg6", "author": "Chrysmiau", "body": "So good.. A+++ I am fucking psyched that there's a part two. Which I'm going to read. Right now."}, {"id": "dpq44kz", "author": "SickSapochnik", "body": "I'm not able to find paranormicon channel on YouTube 😛"}, {"id": "dq8114g", "author": "QuothTheRaven_", "body": "As an American when I read this I was all like , “awww snap  dog....July 2nd , a day after my bday , it’s like I’m living this stor.... God damn it Europe ” ."}, {"id": "dqcvffx", "author": "fully_aware", "body": "So far, I love everything about this. Seriously. I'm already invested in where it's taking us. I need more!"}, {"id": "dqevym0", "author": "Cyanises", "body": "Can I get the link for the website rob was using? "}, {"id": "dqg75te", "author": "RogueTaxidermist", "body": "One thing - \n\n>I’d heard all about his life, but I’m sure that I know him\n\nshould be \"I'm not sure that....\"\n\n"}, {"id": "dqqhx1i", "author": "iiPaix", "body": "Doot"}, {"id": "drovnty", "author": "dannyb21892", "body": "Spoilers in comments below this one, do not scroll down unless you've read all parts."}, {"id": "dsfsdac", "author": "GanjaHaze", "body": "Big up Bristol."}, {"id": "dt3e46n", "author": "Country-Strong994", "body": "As a Jeep owner, the Jeep talk made me hurt inside"}, {"id": "durm2rf", "author": "oddhope", "body": "> Somehow this 65 year old farmer's son had become respected in a vast online community. My dad is Rob’s age and he's just discovered copy and paste.\n\nThis reminds me of my uncle, who's in his 70's and not only knows what Etsy is, he buys stuff off of it."}, {"id": "duzrbuj", "author": "BewareOfBibz", "body": "A little confused... is the draft apart of the story? Or is it an interview "}, {"id": "dwt3fys", "author": "134340Goat", "body": ">and though she went on to become a professional writer, I most certainly did not. She'll be taking over from me further down\n\nStill waiting to see that"}, {"id": "dxqyp7z", "author": "KillingMyself-Softly", "body": "This is the best story I've ever read on here (admittingly I haven't read that much on here, but I've read a bit more on the CreepyPasta wiki).  I really hope it gets picked up for Channel Zero."}, {"id": "dxuk7th", "author": "madcre", "body": "spooky "}, {"id": "dy2j7yc", "author": "_Clint_Westwood_", "body": "CAN’T. STOP. READING."}, {"id": "dy3zkuz", "author": "JTD121", "body": "Curious if there is a link to the original poster of the Left/Right game that Rob is using as a 'guide'?"}, {"id": "dpe2giz", "author": "NiceWorkMcGarnigle", "body": "The first story I’ve read in a while for which I am dying to hear more.\n\nCompletely excellent."}, {"id": "dpdnseq", "author": "NopityNopeNopeNah", "body": "I could see this as a comic book; probably featured as a short story in Sandman; the art would be perfect for it, and it’s a rather Gaimanesque story. But that’s just my opinion. Anyway, I loved it!"}, {"id": "dpzq40k", "author": "prkrrlz", "body": "I'm getting that nervous, yet excited feeling in my stomach reading this. Well done, OP! Time for more!"}, {"id": "dq07jhn", "author": "YxDOxUx3X515t", "body": "Mkay, attention grabbed. "}, {"id": "drjtas3", "author": "yikdan", "body": "big up bris "}, {"id": "dsudt57", "author": "decoygay", "body": " 6.      "}, {"id": "dtt0p15", "author": "ArdentRaven", "body": "Fantastically written! I would read it as if I was hearing it on an NPR show and it worked so well. \nGreat work! I'll be binging this series all night "}, {"id": "dqeorya", "author": "Fhostetera", "body": "RIP Apollo!\nThe guy who cracks jokes no matter what situation. "}, {"id": "dx11qme", "author": "Mr_Piggens", "body": ">Japanese suicide forest\n\"I think we just found a dead body.\""}, {"id": "dx3rsfg", "author": "sirzigmeister", "body": " Aaaq"}, {"id": "dx3rsnt", "author": "sirzigmeister", "body": "cqdxac"}, {"id": "dx3rstr", "author": "sirzigmeister", "body": "wdv"}]}