{"id": "7xhpsm", "title": "The Monster Under your Bed isn't Always there to Scare You", "url": "https://www.reddit.com/r/nosleep/comments/7xhpsm/the_monster_under_your_bed_isnt_always_there_to/", "subreddit": "nosleep", "author": "lifeisstrangemetoo", "text": "I was lying alone in my room when I heard the voice, deep and crackly, coming from beneath my bed.\n\n“Hey,” the voice called out.\n\nI told myself I was just imagining it. \n\n“Hey kid,” the voice repeated.\n\nI drew my knees up to my chest and ducked my head under the blanket, trying to shut out the voice and the cold wind that drifted in through the window, ruffling the curtains.\n\n“Who are you?” I asked.\n\n“I’m the monster underneath your bed,” the voice replied.\n\n“You mean you’re real?” I asked. \n\n“What do you mean?” the monster said. “Of course I’m real.”\n\n“Do you have a name?” I asked.\n\n“Of course I have a name.”\n\n“Oh... well what is it?”\n\n“Frank.”\n\n“Frank?”\n\n“Yeah,” the monster said. “Is there something wrong with that?”\n\n“No. I mean, I don’t know,” I said. “It’s just not very monster-ly.”\n\n“Well my parents didn’t want me to be a monster.”\n\n“Really? What did they want you to be?”\n\n“A dentist.”\n\n“That’s funny,” I said. I could feel myself beginning to smile.\n\n“What do your parents want you to be?” it asked.\n\n“I don’t know.... Hey Frank?”\n\n“Yeah?”\n\n“Aren’t you gonna... like... scare me or something?”\n\n“What? Why would I do that?”\n\n“Well, you’re a monster, aren’t you?”\n\n“Well, yeah, of course I am, but that doesn’t mean that I scare little kids.”\n\n“But I thought that was your job.”\n\n“It is my job to scare people,” he replied. “But only bad people.”\n\n“Am I a bad person?” I asked.\n\n“No,” he said, “but you’re not the one I’m here to scare.”\n\n“Who are you here to scare?” I asked.\n\n“The man inside your closet.” \n\nThe skin on my arms goosefleshed up. I wanted to ask him what he meant, but I fell silent as I heard a rustling coming from the closet. The door creaked open, and I could hear soft footsteps padding towards me across the bedroom floor. I didn’t dare peek out of the blanket. The footsteps stopped, and I could hear heavy breathing next to me. I squeezed my eyes tight.\n\nThe warm sanctuary of the blanket disappeared as it was yanked off me.\n\nI hugged my arms around my knees and prepared for the worst. A scream shattered the night air, followed by the sound of breaking glass. I opened my eyes a crack to see a knife lying on the carpet next to my bed, blade glinting in the moonlight.\n\nMy parents rushed into the room and asked me what had happened, but I didn’t know what to say, only that someone had been hiding in my closet and they’d jumped out the window. \n\nMy parents called 911, and the police came right away. They picked up a man called Gary Thompson sprinting through the streets a couple blocks away. He was covered in blood and broken glass. They found Gary’s car abandoned on our property, and inside they found duct tape, knives, barbiturates and a video camera. \n\nFrom what I heard Gary’s lawyer employed an insanity defense, and Gary is currently incarcerated in a state mental facility for the criminally insane. \n\nI never heard from Frank the monster again, but the officer who arrested Gary told me that he sleeps on the floor of the facility.\n\nHe tells the doctors that he’s terrified of Frank, the monster under his bed.\n\n[x](http://davidmaloneystories.com)", "comments": [{"id": "du8e0r4", "author": "2BrkOnThru", "body": "I think Frank should sleep on the bed and make Gary sleep on the floor."}, {"id": "du8cg6t", "author": "janusgang", "body": "I like these nosleep posts that make me warm and fuzzy inside"}, {"id": "du8o4ok", "author": "Theblackcrown95", "body": "Anyone else picturing Frank as danny devito? Because id feel pretty safe if he was protecting me. \n\nEdit: Autocorrect does not want me spelling that man's name correctly. "}, {"id": "du8edx2", "author": "watermelon_sim", "body": "Lol my bed just consists of a mattress without a frame, so unless if Frank comes to my house and wanna be paper thin 💁"}, {"id": "du8kpsk", "author": "MimickingApple", "body": "Well, Frank isn't a dentist like his parents wanted him to but he sure is a fucking hero."}, {"id": "du8e87r", "author": "gallito_bomba", "body": "It would make a perfect ending at well if you had stopped at \"the man inside your closet\". Gave me goosebumps reading that, I didnt see that coming at all."}, {"id": "du8e4su", "author": "BlueIceShards", "body": "Aw this one was cute and creepy. I like it :)"}, {"id": "du8h4a0", "author": "YesFrankIsMyName", "body": "Reading all these comments put a smile on my face."}, {"id": "du8ejls", "author": "drewdrawsstuff", "body": "I wish I'd had a Frank when I was a kid. "}, {"id": "du8qd76", "author": "SweatyVaginas", "body": "Does anyone remember that really wholesome nosleep about a monster that his under this girls bed. And he wasn't there to scare her he was there to protect her. And it talks about if they go into the light they burst into a bunch of dust particles. At the end the monster saved her from her dad who tries to molest her and it like almost made everyone who read it cry. I really want to find it cause it was so good. "}, {"id": "du8h5ij", "author": "ReturnOfDaBabyKilla", "body": "The new papa Franku"}, {"id": "du8k0j6", "author": "orangecrustygoop", "body": "reminds me of the writingprompt of the monsters under the bed who save a kidnapped girl, that was a great read. anyone have the link? "}, {"id": "du9gwxi", "author": "MorganHazelwood", "body": "You'd think Gary is just closer to Frank when he sleeps on the floor..."}, {"id": "duijlha", "author": "HlBlSCUS", "body": "Does anyone else feel like they’ve read this exact story before?"}, {"id": "dukwv9o", "author": "Nikolaievitch", "body": ">“Who are you here to scare?” I asked.\n>\n>“The man inside your closet.” \n\nThis gave me chills"}, {"id": "du8o6a9", "author": "Manch94", "body": "I pictured Frank looking and sounding just like the hormone monster from Big Mouth. "}, {"id": "du8o6a6", "author": "Sp00kyD0gg0", "body": "Frank is actually just Batman"}, {"id": "duadv6j", "author": "Mavyn77", "body": "Monsters inc. : Avenger Frank"}, {"id": "due8fl3", "author": "lasergirl84", "body": "Anyone imagined Frank to be one of the monsters in Monsters Inc? "}, {"id": "du8nr1h", "author": "Jamesyboy31", "body": "My girlfriend has a kind of Frank.  She used to be scared by the demon, but now it ends up protecting her in her dreams and she is calmed by it."}, {"id": "du9n2ul", "author": "MozartTheCat", "body": "This title reminded me of one of my favorite nosleep stories, that I've been wanting to find again for a while but I can't remember the name.  Maybe someone will know what I'm talking about.\n\nIt's about how there is this massive hole that appears under beds at random intervals.  The girl is playing hide and seek and hiding under her bed when the hole appears and she falls in, and there's various other kids down there, and the hole is slowly digesting them.  After the other kids get fully digested, the girl decides she's going to climb out, but as soon as she gets to the top and reaches out, she grabs the hand of the kid sleeping in his bed and he screams and drops her back into the hole"}, {"id": "dua4hxc", "author": "Moldytomatoe", "body": "When I was a kid I had an irrational fear of something under my bed. But I convinced myself that nothing bad had happened to me yet so he must be a good guy and isn’t out to get me. I would tend to talk to him at night. Speak about the events of that day. It set my mind at ease. A warm comfort. I always thought there was a much more fearful monster out there that the creature under my bed was protecting me from. I miss those days when I felt like someone was listening."}, {"id": "duatu2c", "author": "instaperil", "body": "So good going for warm and fuzzy but when Frank said the bad guy in your closet I had a pit in my stomach."}, {"id": "du8fwm5", "author": "Spoodymen", "body": "Is it wrong that I read the monster's lines in Tim Curry's IT voice?"}, {"id": "du8j09h", "author": "asuliberty", "body": "Good guy frank giving extreme ptsd to a pedofile. What a nice monster!"}, {"id": "du99b1d", "author": "absolutemonsterxx", "body": "Reminds me of Monster's Inc"}, {"id": "dx7z9kb", "author": "Alan_Goodtime1111", "body": "Frank is love,Frank is life."}, {"id": "du8jwd6", "author": "Flameslickmelv", "body": "I was expecting a dark twist that would make me not go to sleep"}, {"id": "du8k4lk", "author": "_soopremegirl", "body": "Very good frank! "}, {"id": "du8m0ko", "author": "JonasSimbacca", "body": "Sometimes it's just Howie Mandel in monster makeup."}, {"id": "du8m0u5", "author": "Nonsensor", "body": "Thanks for another one, Lifeisstrangemetoo!"}, {"id": "du8qyo5", "author": "_Pebcak_", "body": "All the feels :)  Well done, Frank!  And glad you're okay, OP."}, {"id": "du8wnav", "author": "UserOfNameMe", "body": " Didn't expect the guy in the closet. Thanks for sharing your story. "}, {"id": "du94tp3", "author": "ichinnyace", "body": "So you're telling me the punisher saved you? Frank Castle???"}, {"id": "du94vkm", "author": "Chitownsly", "body": "Hush little baby, don't say a word\n\n And never mind that noise you heard\n\n It's just the beasts under your bed\n\n In your closet, in your head\n\n\n"}, {"id": "du976c8", "author": "Myrania", "body": "Anyone else think of Frank from Donnie Darko?"}, {"id": "dua1a5w", "author": "_danm_", "body": "This story doesn’t really need the its second half."}, {"id": "dutugvl", "author": "junkun", "body": "some people get guardian angels.\n\nthis kid gets a guardian monster.\n\nwho'da thunk it?"}, {"id": "dvd8z90", "author": "nativekitten", "body": "Loved this one so much I read it out loud to my fiancé - who’s not a fan really of horror, but wholesome? Definitely yes. I definitely got chills when frank mentions he’s only here to scare the man (actual monster) in the closet ahhhhhhh fantastic. We all need a good Frank the “monster.”"}, {"id": "du8f50b", "author": "primalpalate", "body": "/r/wholesomenosleep"}, {"id": "du8kg9u", "author": "Coachskau", "body": "I've seen stories like this so many times, and I love all of them. Sympathetic monsters are one of my favorite things."}, {"id": "du987d0", "author": "trollfacebomb", "body": "r/IcanSleepNow"}, {"id": "du8ixyc", "author": "samuraijackprince", "body": "Yesssss, Frank. Good Frank. Top monster."}, {"id": "du8ljvw", "author": "joetophat", "body": "That was very thoughtful of Frank letting him know about the man in the closet."}, {"id": "du8r6al", "author": "Grosgos", "body": "Holly cow I literally got goosebumps when he said \"the man in the closed\" nice story :)"}, {"id": "du8zp9b", "author": "FreexBrennen", "body": "I read franks part in Korgs voice lol "}, {"id": "du9z8ze", "author": "Gaiametris", "body": "Jokes on you, my mattress is on the floor"}, {"id": "dua5k8t", "author": "VirtuosoX", "body": "Aww man I hope Frank becomes this kids guardian monster or something this is sooo sweeeeeet."}, {"id": "dua60g5", "author": "smemmy", "body": "this would work so well as a short film! take my upvote! "}, {"id": "dua6f2w", "author": "lordofslam", "body": "By far one of my favorite stories that I've ever read. Unbelievably wholesome. Thank you for making my morning better"}, {"id": "dua6ien", "author": "great-mann", "body": "Gary didn't pay the troll toll."}, {"id": "dub7qkp", "author": "Pomqueen", "body": " Anyone else think dentists are way scarier monsters? "}, {"id": "dubr41p", "author": "meowz89", "body": "Am I the only one who had Maurice (Hormone Monster - Big Mouth) voice Frank while reading this?"}, {"id": "ducqtqv", "author": "lenerz", "body": "So basically the man in your closet was also Frank!? He did his best to fight his bad side by inventing Frank.. That's so wholesome, I hope they give him a blanket."}, {"id": "duxg9xh", "author": "kwarren918", "body": "This monster gets a big thumbs up from me. My under the bed monster was a dick. "}, {"id": "du9gklx", "author": "Frosty015", "body": "r/sympatheticmonsters"}, {"id": "dubnjvu", "author": "Meg1776", "body": "I scrolled to the comments first, before I even read the first line, just to see if this ended up being a r/Wholesomenosleep type of story, haha. "}, {"id": "du8k5od", "author": "rainydaystories", "body": "Aww this was so sweet. "}, {"id": "du8q0m5", "author": "creepypgirl79", "body": "I love every story you write. You have such an amazing way of writing. Loved it!! Thank you"}, {"id": "du8q7s2", "author": "BugsyLakes", "body": "This was great! I thought it was going to be similar to the grim reaper incident, but it threw me for a pleasent surprise! I am glad things worked out."}, {"id": "du8qjyf", "author": "OnI_BArIX", "body": "I think this is now my favorite nosleep story"}, {"id": "du8qycf", "author": "xathirea", "body": "This was actually really touching. "}, {"id": "du8rz8p", "author": "SpinelessLaugh", "body": "I imagine Frank speaking with a mobster accent and it's great."}, {"id": "du8t3hu", "author": "MJGOO", "body": "Good guy Frank :D "}, {"id": "du8vqy1", "author": "A_Level_2", "body": "Turns out the monster in the closet was just a plague carrying mouse "}, {"id": "du8w9c5", "author": "Mercutio33333", "body": "What if there was a story that was basically Spawn except instead of demons and hellspawn it's monsters that hide under the bed and instead of the redeemer and the angels it's teddy bears? Then there's a monster that wants to protect children but he's misunderstood and teddy bears keep kicking his ass and there's some kind of monster overlord that sending monsters to keep him in line, too. "}, {"id": "du8xbu4", "author": "Mr_Prismatic", "body": "Dude, I love good monsters <3"}, {"id": "du8zakm", "author": "deskfan720", "body": "Am I the only one reading the monsters voice as if it's Steve Buscemi? "}, {"id": "du911k2", "author": "Evilcutedog45", "body": "I normally find myself rolling my eyes whenever there’s a nosleep post that makes it to All, but this was a fun read.  "}, {"id": "du9341f", "author": "Falchion_Alpha", "body": "Would have thought with the dentist bit Frank would've busted Gary's teeth in."}, {"id": "du96aco", "author": "999laluna", "body": "Aww Frank is awesome 😊😊"}, {"id": "du972ca", "author": "Metronoid", "body": "I want a Frank in my life!"}, {"id": "du99cj5", "author": "Gravyboat78", "body": "Ok, you win."}, {"id": "du9cff9", "author": "OnceUponARabbit", "body": "Is this the pig story guy? If so I’m already sold."}, {"id": "du9dh2i", "author": "AutismCricket", "body": "Sounds like \"little monsters\" used to love that film as a kid"}, {"id": "du9dmds", "author": "Wanderer_Dreamer", "body": "This is an almost wholesome creepypasta."}, {"id": "du9fbct", "author": "weirdjess77", "body": "This was really comforting"}, {"id": "du9fx88", "author": "Tangerkin", "body": "i thought of frank castle when reading this"}, {"id": "du9fza2", "author": "meeka524", "body": "You get’em Frank!!!!"}, {"id": "du9gsr9", "author": "thecupcakebandit", "body": "Love this. Bravo. The world needs a lot more Franks. "}, {"id": "du9ppwv", "author": "ladyhallow", "body": "Short and perfect, fun for the whole family."}, {"id": "du9t14l", "author": "mmmmpisghetti", "body": "This was fantastic! "}, {"id": "du9te8i", "author": "TypingMakesMeMoist", "body": "I need me a Frank in my life. "}, {"id": "du9uftb", "author": "Captainkanuckles", "body": "I know people say this a lot but I would love a shirt or film out of this. Kinda light hearted but scary. I read the monster’s lines in the voice of Frank Costello "}, {"id": "du9vnsy", "author": "pineapplecurl", "body": "I loved this."}, {"id": "du9wjxx", "author": "witchyknight", "body": "This is amazing I love it! Great story "}, {"id": "du9x7hl", "author": "NotATuring", "body": "This was quite effective at eliciting an emotion from me."}, {"id": "du9x7lb", "author": "KurageSama", "body": "That twist wasn’t good hat I was expecting. Nice story!"}, {"id": "du9xvbe", "author": "panda0112", "body": "In my head the voice of the monster was the same voice of the Hormone Monster in Big Mouth. "}, {"id": "du9xx2j", "author": "the-nameless-002", "body": "Wow .. short simple and brilliant. Deserves upvotes and next episodes "}, {"id": "du9y338", "author": "vasinsavin", "body": "Frank's a good dude. "}, {"id": "dua0gxy", "author": "Eponarose", "body": "The world needs more monsters named Frank! Well done Frank!"}, {"id": "dua23mt", "author": "BluePikaa", "body": "I like these no sleep posts xD they makes a good story "}, {"id": "dua24ia", "author": "Danger_17", "body": "Excellent!!"}, {"id": "dua3uba", "author": "natbratc", "body": "Yeet yeet "}, {"id": "dua5icu", "author": "Saito197", "body": "Somehow this is the cutest nosleep post I've ever read."}, {"id": "dua723y", "author": "electricMe", "body": "that sweet story filled my heart with song!!🎵 Too bad I'm tone deaf!! Maybe Frankie can sing?? 🎶"}, {"id": "dub192w", "author": "ExpandTheScope", "body": "Fascinating. It was awfully considerate of Frank to warn you that there'd be some action soon, so you'd be scared as little as possible."}, {"id": "duf8lks", "author": "whatisinthedark", "body": "This kind of reminded me of the book 'I Need My Monster', by Amanda Noll."}, {"id": "dv8mke4", "author": "TenShiventy", "body": "That was fucking awesome."}, {"id": "dwvo20r", "author": "The_Sleer_", "body": "Oh man I love this"}, {"id": "dztsmt4", "author": "SpeakMyName", "body": "Frank sounds awesome!"}, {"id": "e0utiqq", "author": "ichbinnotspeakgerman", "body": "r/ sort of wholesome nosleep"}, {"id": "e1z2vqh", "author": "-Ryu-", "body": "frank 4 prez"}, {"id": "dums1ya", "author": "mayomayo24", "body": "I don’t get it :("}, {"id": "du8ze5s", "author": "Doivid_Magnum", "body": "Who else pictured Frank as a transparent tall and thin Asian man with a bowl cut and Danny DeVito's voice"}]}