{"id": "83vwgw", "title": "Letter from the girl who watched you grow up", "url": "https://www.reddit.com/r/nosleep/comments/83vwgw/letter_from_the_girl_who_watched_you_grow_up/", "subreddit": "nosleep", "author": "MTLStoriesPaty", "text": "Hi,\n\nThe first time I saw you, I was surprised I could see you. You had a small turtle in your hands. You kept calling it Michaelangelo, which I assumed was a nod to the Ninja Turtles. You tossed your long, brown hair behind your back and knelt down to place the turtle on the ground. You were excited to see it wobbling on the grass. It reminded me of my cat and how I used to play with him when I was your age.\n\nI witnessed your entire childhood from my small *window*. Your first ride on a bicycle. Your first day of school. Your first real friend Brenda. Your first day of middle school and the cute uniform you got to wear. The time you won the science fair and you brought home a trophy shaped like a cell. You were such a happy girl.\n\nI saw you grow older. Your body changing. You grew taller, your body slimmer, your face as beautiful as ever. I witnessed as others started to notice you in a different way. The stares from the jealous girls. The googly eyes from the young boys. As all this happened before my eyes, I noticed myself changing too. I got older. I got weaker. I got disillusioned . Bruised. I lost my will to escape my painful life. All I had was this *window* to your life to keep me going.  I lived my days through yours. Watching you was enough entertainment for me. You couldn’t know the different ways you saved me from bad thoughts, bad days and all the pain I had been suffering from.\n\nI saw the day that handsome young man came to pick you up in a red convertible. Your mother wasn’t happy about it, but she knew she had no choice. You had to start spreading your wings at some point. You left in a gorgeous floral dress that matched the summer’s flowers. You came back late that night. You had a stuffed bear and some leftover cotton candy. I imagined you had gone to the fair. I imagined all the rides you must have gone on. All the fun that must have been for you. I was so happy that you had enjoyed your first date. And then came the magical kiss. He leaned in, blushing, and kissed you. Your cheeks were so red that I instantly knew I had witnessed your first kiss. I closed my eyes, imagining what that must have felt like. For *one* second, I imagined it had been me wearing that dress, smiling so big, with butterflies in my belly and a kiss on my lips. But I was happy for you. \n\nI wanted to thank you for allowing me to live again. For allowing me to dream again. I wanted to thank you, but just couldn’t bring myself to you. I couldn’t go talk to you. I didn’t know how. If only you knew about my *window*.\n\nAnd then, one day, I heard him talking about you. The man I live with. He noticed you. I heard him complaining about how pretty girls like you shouldn’t show off their legs like that. The moment he mentioned your legs, I knew it was over. I knew you would become his next trophy. I had to keep you away from him. This was my chance to thank you. I couldn’t let you turn into me.\n\nI had been lucky. I don’t know why he liked me this much. Most other girls came and went, never to return. And yet, amidst all the years, he always kept me down here. I think it’s because he saw that I still had a light in me. Because I had *you*. All the other girls died long before he killed them. I could tell that they were already dead in their eyes long before he viciously murdered them in front of me, showing off his skill.\n\nBut not me. You kept me going. I had my little *window*. A little crack high up on the wall of this basement I call home. He didn’t like that he couldn’t break me down. He didn’t know about the little crack. So he kept me to see how long I could stay like this. It is a sick game... that I’ve been winning thanks to you.\n\nBut then... he noticed you. And I knew, I knew what fate awaited you if he laid his monstrous hands on you. Whatever strength I have left, I’ve collected it and prepared myself to finally do something about it.\n\nI want to thank you. Because if you’re reading this letter, it means I did it. I gathered my courage, packed it neatly into action, and went through with my plan to escape once and for all. I will make him believe I’ve died. I don’t know if it’ll work. But if it does, he will reach to pick me up. I’ll immediately kick him as hard as I can where it’ll hurt the most. *As hard as I can*. I will then steal his keys and run as fast as I can and drop this letter off in your mailbox. I have a feeling he will chase me and get a hold of me eventually because I am weak... I’m very weak. Battered. There is barely a human left in this body of mine. But if that is the case, I’ve been prepared to leave this world for a long time. I doubt anyone will hear or see me. This street is so desolate. You’re the only life here it seems sometimes. But so long as you get this letter, I know that I did my part and that you’ll be safe. \n\nMonsters are real. This one is named Ryan Morehouse. He is your front door neighbor. I have been kept captive in his basement for a very long time. I’ve lost track of the years but I believe I must be in my late twenties by now. I was fifteen when he first brought me here. My parents must have looked for me. Please don’t tell them about me. I don’t want them to know about the tortures he put me through. I don’t want them to see me broken down this way. I just want you to report him to the police. His evil nature and depraved mind can only be stopped if he is caught behind bars. \n\nThey will find bodies dangling in the walls of the basement. I’ve learned to live with  the smell by now but they will notice it the second they step down here. There are a lot of young girls in the walls of my room down here. Tell them to treat them delicately. They were good girls. They’ve been my companions. My friends. \n\nMost of all, I want to thank you. You’re the only thing that kept me going. You were my light. And now, I’m escaping thanks to you. Escaping this awful room. Escaping this awful life. Even if it means I finally get to die.\n\nWith love,\n\nThe girl who watched you grow up\n\n——————————-\n\nWe found this letter in our mailbox. After contacting the police, they entered the home of our neighbor across the street. Over a span of five days, they found a total of fifteen bodies hidden in different parts of his house. He had plans to kidnap our daughter, but thanks to this mysterious stranger, his plan was intercepted. We still have not found the girl who wrote this. We like to think she made it out alive, but, sadly, it isn’t likely as Ryan Morehouse is also missing. We don’t even know her name. But we did find the little crack in the wall, the one where she saw my daughter grow up from. \n\n[Part 2](https://www.reddit.com/r/nosleep/comments/9djazj/letter_from_the_girl_who_watched_you_grow_up_part/?st=JLQORSH8&sh=eb0a14d0)", "comments": [{"id": "dvlovib", "author": "MistsOfDis-Ill-usion", "body": "What the fuck, there's a war on drugs but where is the declared war on sex slaves "}, {"id": "dvkyyqo", "author": "fifthrobin", "body": "She was a very brave soul to do this to save your daughter."}, {"id": "dvlc2dy", "author": "probablynotben", "body": "oh no who put these tears in my eyes"}, {"id": "dvl63i8", "author": "mylouie", "body": "A sad, but good, ending"}, {"id": "dvl9yo5", "author": "whiskyydickk", "body": "Wow...this is the first one I've actually teared up at. Hoky crap"}, {"id": "dvkvzeh", "author": "Anticlimactic__", "body": "Oh, wow... Her sacrifice saved your daughter, even though she couldn't have saved the other girls from that monster."}, {"id": "dvlwllo", "author": "smolpotatoes", "body": "Jesus Christ. That's my neighbor's name. I kid you not. And he has always weirded me out. \n\nEdit: I've called the cops before for unrelated reasons. His dad who owns the house he lives in came over and interrogated me the next day. "}, {"id": "dvlaj80", "author": "TesseractMagician", "body": "This was an unexpected tear jerker. Bless her heart."}, {"id": "dvlh1tn", "author": "captainford80", "body": "Take your upvote \nSlow clap "}, {"id": "dvm1sdf", "author": "jojosweets", "body": "\"Tell them to treat them delicately, they've been my companions, my friends\" .... My heart broke and the tears fell. Such a brave girl!"}, {"id": "dvlcjmk", "author": "coolmoonn", "body": "it makes my heart happy and sad to read stories like this. sad for the situation the girl was in, but happy for your daughter and that the girl did this to save her."}, {"id": "dvl88uc", "author": "RoseDaCake", "body": "I felt shivers. ;-; "}, {"id": "dvlrkwk", "author": "machsh", "body": "Who the f is cutting onions? "}, {"id": "dvl8pn1", "author": "Tamalene", "body": "I felt numb for about five seconds after reading this, then all the feels!"}, {"id": "dvlo0gu", "author": "RazzyCharm", "body": "I never thought I would cry from reading something in this subreddit..."}, {"id": "dvlacpl", "author": "ransomnoteface", "body": "Thank God she was able to put the letter in your mailbox and that you believed it enough. What's an\"front door neighbor\"?"}, {"id": "dvld5c8", "author": "amandalmighty", "body": "What if Ryan Morehouse has a multiple personality disorder and the author of the letter is one of their* personas?\n\nEdit: pronoun "}, {"id": "dvle02x", "author": "C1rculatum", "body": "If I could, I’d give gold."}, {"id": "dvli0ok", "author": "kittykat1510", "body": "Awesome story!\n"}, {"id": "dwn7jnq", "author": "unnamed_kinsman", "body": "And that girl was Albert Einstein."}, {"id": "dvlikq1", "author": "LandofLincolnLawyer", "body": "Nice! (In an encouraging sense of the word..not in how Mr. Morehouse treats his guests)."}, {"id": "dvlki8j", "author": "LiterallyChar", "body": "Im so speechless, thank you for sharing OP"}, {"id": "dvlpmqt", "author": "aroomwithnomoose", "body": "I really enjoyed this post. The opening especially is quite moving."}, {"id": "dvlogf0", "author": "JustReadinSubReddits", "body": "This made me cry."}, {"id": "dvlt5vv", "author": "Babies_and_Danes", "body": " Does anyone know why I got a notification that this story was posted? "}, {"id": "dvm96g5", "author": "RabbitPatronus", "body": "oh my heart. Wherever the girl are, I hope she's okay. May God bless her. This is so sad. :'("}, {"id": "dwaw7wg", "author": "jjjkong", "body": "Holy shit is this good.\n\n\nI started out thinking the girl is some sort of psychopath or even ghost that is gonna drain the life of ops daughter.\n\n\nThats a very good twist. "}, {"id": "dvledlg", "author": "JackTheBadWolf", "body": "666th updoot"}, {"id": "dvlkk7r", "author": "monavic0829", "body": "Wow, this was amazing. It was a heartbreaking, incredible read. "}, {"id": "dvlp0kj", "author": "orangutantan", "body": "This is such an amazing read, well done."}, {"id": "dvlff1v", "author": "falconkitty", "body": "Amazing. What a beautiful sad story."}, {"id": "dvlnkdm", "author": "avocadochick", "body": "This was an amazing read. Thank you. "}, {"id": "dvlvb25", "author": "minjjangxx", "body": "Aww... I hope she has found peace somewhere..."}, {"id": "dvm891q", "author": "TheRealPainsaw", "body": "Not me, the first turtle i caught was named Blastoise. \n\nGood writing though, sarcasm aside."}, {"id": "dvm91wc", "author": "Str4wBerries", "body": "I thought that it would end up that she was looking at her own past self through a photo album, and she wanted to warn the girl not to marry an abusive husband up until the murder and basement were mentioned, great ending."}, {"id": "dvnr9ht", "author": "Djeddozo", "body": "I get the most shivers as i'm trying to imagine at which point in my life she could've been kidnapped. Like, I was maybe around five years old, playing in the garden when somewhere in the States this girl got kidnapped. Then I imagine all the things i've been through in those years, whereas she only saw vicous murders and nothing more than a basement. Definitely a /r/nosleep :(\n"}, {"id": "dwb28gu", "author": "lucids95", "body": "The greatest kind of sacrifice. Such a brave and amazing soul. I hope she is out there somewhere living."}, {"id": "dwu9s05", "author": "Stealthmonkey59", "body": "This made my girlfriend cry"}, {"id": "dwzztif", "author": "rangemuldee", "body": "There should be a separate subreddit for these stories.\n\nI honestly don't see why one as happy as this is on something called no sleep."}, {"id": "dvljrhq", "author": "Pm-ur-butt", "body": "Make this a move. It's written perfectly and will serve well as a \"In a Galaxy far away\" type opening/narrative. Cut - to the beginning of your your story. The tension will reset and rebuild throughout the film. "}, {"id": "dvln77x", "author": "hauteguillotine", "body": "Great job!"}, {"id": "dvlr40l", "author": "someplasticks", "body": "Wow not at all what I was expecting."}, {"id": "dvlu6qq", "author": "CosmicLightning", "body": "Almost crapped my pants thinking it was about me til I learned it wasn't...phew"}, {"id": "dvm5yso", "author": "YOUNG_G0D", "body": "\nWow...this actually occurred? Man, we have some really twisted people out here. Crazy how different people’s mindset can be. And he probably felt justified in keeping those women down there for some reason"}, {"id": "dvsc9wq", "author": "frozen_neko", "body": "I hope she made it. Hope that monster get put behind bars. It so heartbreaking to read this😫😫"}, {"id": "dwixd21", "author": "NILCLMS", "body": "Man I'm positive this story will make a good movie"}, {"id": "dvljwn7", "author": "Timetofly123", "body": "Christ"}, {"id": "dvlv8nt", "author": "titch_bits69", "body": "I thought it was gonna be a really creepy old man but I was shocked in a kinda good way because it didn’t go as most scary stories go. Still so sad almost made me cry. "}, {"id": "dvlxovu", "author": "tomoyopop", "body": "This would make a beautiful film. "}, {"id": "dvm0mmf", "author": "Lacygreen", "body": "Anyone else think it was a tree the first half?"}, {"id": "dvm1wew", "author": "arrozquartz", "body": "My heart aches reading this. So incredibly sad."}, {"id": "dvm2oii", "author": "Illmatic_one", "body": "No thanks she already hit me up on Facebook to let me know she doing way better than me"}, {"id": "dvm3rac", "author": "TwixelTixel", "body": "This..."}, {"id": "dvmchu5", "author": "kbsb0830", "body": "I really want to cry now. :("}, {"id": "dvnev6s", "author": "haterwsky", "body": "I went on nosleep to fall asleep. How dumb am I?"}, {"id": "dvsb0mw", "author": "BabySnakesYo", "body": "I read the first paragraph and I'm really fucked up now. I had a little read eared slider turtle named Michelangelo and I have long brown hair. I am a guy but it's just insane how closely related the introduction was to me. My eyes watered  "}, {"id": "dvxi633", "author": "marygracesmaya", "body": "I thought I was here to make myself not sleep but right now you made me cry so I guess I'm gonna go to sleep with tears in my eyes. Here's your upvote."}, {"id": "dw5ur72", "author": "MixTapeHolocaust", "body": "This is so beautiful, if you ever find her, please make sure she knows that we’re all thankful of her sacrifice for your daughter. "}, {"id": "dw5xla9", "author": "Manch94", "body": "NoSleep varies. Most of the time it’s something absolutely terrifying that deprived me of sleep. But sometimes it’s something heartbreaking that keeps me up at night. Kinda like that story here where a little girl with Down’s syndrome was liked behind a wall because her preacher/pedophile father was ashamed of her. She was only remembered by her brother who became a bitter old man because he didn’t help her. So gut wrenching. "}, {"id": "dxnr1y5", "author": "ImThatMelanin", "body": "I’m not even gone lie I fucking cried..."}, {"id": "dxrmjow", "author": "sparkle_in_the_dark", "body": "This made me cry. A lot."}, {"id": "dyot95m", "author": "that_one_bruh", "body": "You have a knack for creating unique ways for telling stories. Keep it up!"}, {"id": "e0gr3rq", "author": "yuklz", "body": "Omg I cried reading this because this is a sad reality. I've seen countless documentaries of poor girls picked up as kids and put through all kinds of horrors imaginable, some even developing Stockholm syndrome.\n\nAnd then there are the serial killers. I've read many books as a part of my psychology major and this set up is so common you won't believe it. The worst I've read was the girl in the coffin under the bed.\n\nSometimes when I have nothing to ask for while praying,I pray that anybody anywhere who's being enslaved, please let them escape :("}, {"id": "e1rc5zs", "author": "scarstarify", "body": "It’s not a “crack in the wall,” it’s a /window/ :-("}, {"id": "dvlfd44", "author": "Ajfelis", "body": "This deserves all the gold, so emotional ;;"}, {"id": "dvltb34", "author": "RedProtoman", "body": "Heart thumper right here"}, {"id": "dvlz73s", "author": "Wajirock", "body": "When did this happen and is there anything that can be done to help catch Ryan Morehouse"}, {"id": "dvlz9tp", "author": "potternerd89", "body": "Stop it. You’re crying. "}, {"id": "dvm04vd", "author": "Alienela", "body": "I love this story 💗 "}, {"id": "dvm493h", "author": "natsu98k", "body": "Nice."}, {"id": "dvm5h6p", "author": "kichapi", "body": "I love her bravery, but still keep your eyes out for the guy! Do not put her brave final act in vain! "}, {"id": "dvm6vkw", "author": "TristyThrowaway", "body": "How'd she hear the turtles name from there"}, {"id": "dvma08r", "author": "AstroxPhysicsxGirl", "body": "This made me tear up.  I hope she makes it."}, {"id": "dvmacoa", "author": "whaaaaaaatisthis", "body": "Silly me thought this was a very unusual unsentletters post until I got to the end. "}, {"id": "dvmfnfj", "author": "23answers", "body": "Gave me chills. Beautiful but sad."}, {"id": "dvmjpid", "author": "sassypixelgirl", "body": "My heart weeps omg :("}, {"id": "dvms9it", "author": "bdpeezy", "body": "This actually really got me"}, {"id": "dvmsert", "author": "Alic3_in_zombi3land", "body": "This gave me chills and reminds me of the book \"living dead girl\" . Stores like these  make my feels happens and let me know I have  empathy.... damnit"}, {"id": "dvntgje", "author": "jflo_flosquared", "body": "I loved this story! It made my chest tight because that's a real horror and I've seen how manipulative people can be. I'm so happy she had the crack "}, {"id": "dvo2c7k", "author": "ykclby", "body": "The last sentence made me teared up.."}, {"id": "dvqcij0", "author": "MistahTree", "body": "/u/misustree"}, {"id": "dvr94ir", "author": "Knelie", "body": "This is amazing. Talk about selflessness. This warmed my heart... sacrificing herself for your daughter. "}, {"id": "dvss85p", "author": "pe4cebeuponyou", "body": "I hope she made it out or at the very least, finally earned her long-awaited rest. I hope Ryan didn't get to her and isn't torturing her. "}, {"id": "dvxgwxo", "author": "Podzilla07", "body": "Incredible."}, {"id": "dw0goy2", "author": "General_Zarroff", "body": "Wait is this true ??? Holly crap\n\n\nEdit:Nvm damn this was awesome "}, {"id": "dw5or2a", "author": "waterbury01", "body": "For the first time since being here, I was actually very moved. "}, {"id": "dws76wa", "author": "OhNoImAnOreo", "body": "Remind me!"}, {"id": "dz0d9h1", "author": "Blarrgatron", "body": "Please. I must have a sequel. I need closure. "}, {"id": "dzinqmh", "author": "AFKosrs", "body": "HOLY SHIT"}, {"id": "e04fsqo", "author": "5hrs4hrs3hrs2hrs1mor", "body": "I want to say thank you to the Redditor, whose username I don’t know, for sharing this link with me.  <3 You were right. "}, {"id": "e0erpld", "author": "Cahpoewn", "body": "This girl is incredibly strong\\-minded and loving,  and she is the type of people that have the light that could restore faith in humanity."}, {"id": "e130q7o", "author": "tinason3", "body": "My god that was beautiful\n"}, {"id": "e148kq7", "author": "iDirtyDianaX", "body": "I just got, like, 5 consecutive waves of goosebumps. Love this story. Terrifying and heartwarming."}, {"id": "e3umnm6", "author": "PleaseLeave980", "body": "I guessed it was someone who was either a kidnapped person, or a person who is planning to kidnap someone as soon as she mentioned the “*window*”, but damn is that a good story still."}, {"id": "dvll088", "author": "ArcticWaffle357", "body": "Mom?"}, {"id": "dvosp84", "author": "fakemuseum", "body": "How could she see everything? Every moments of your life, that’s a bit off."}, {"id": "dvlc8do", "author": "Forester-lol", "body": "I will definitely ponder over this while in my bed... why could Ryan not escape earlier? how did Ryan not notice a stranger going past and scream for help?\nHowever this is an amazing story and made my morning. Thank you."}, {"id": "dvmzgm5", "author": "-VelvetBat-", "body": "Do we know why certain words are italicized? Are we missing something? "}, {"id": "e427af5", "author": "MrWillje", "body": "I thought that after the end of the letter, it would shift to the perspective of the daughter, reading the letter while chained up to the wall of the basement\n "}, {"id": "e5is2sh", "author": "GhstLvr13", "body": "This was really amazing!! "}, {"id": "e5j14m2", "author": "KiwiJackie", "body": "This thoroughly creeped me out near the beginning because as a little girl, I had long brown hair and my first friend's name was Brenda."}, {"id": "e5kj2u3", "author": "M_L_G_Doge", "body": "HA JOKES ON YOU I HAVE BLACK HAIR"}, {"id": "dvmbwn9", "author": "Legacy_Ranga", "body": "15 when she was first raped? thats fxckkedddd"}, {"id": "dvmw6fh", "author": "Tynack", "body": "Why do people comment as if it's a real story? Is that to make it seem scarier? It's really cringe"}, {"id": "dvm9nt8", "author": "Janp8", "body": "r/wholesomenosleep"}, {"id": "dvm9xey", "author": "MaraInTheSky", "body": "r/WholesomeNosleep"}, {"id": "dvqv43b", "author": "secrestmr87", "body": " front door neighbor’s? Never had a front door neighbor, just a next door neighbor"}, {"id": "dvmdevt", "author": "skarnska83", "body": "Wait. If the watcher girl died in her struggle with Ryan (as was assumed in the story)... Then who put her letter in the mailbox? "}, {"id": "dvmdj3l", "author": "Number1HandsyBoy", "body": "weird"}]}