{"id": "8chsch", "title": "I met someone who claimed to be the devil... and I think I believe them", "url": "https://www.reddit.com/r/nosleep/comments/8chsch/i_met_someone_who_claimed_to_be_the_devil_and_i/", "subreddit": "nosleep", "author": "athousandrows", "text": "Let me start off by saying that I’m not particularly religious. If you asked me if I believed in God, I’d probably just shrug, grunt out a few words about being on the fence about it and continue with my day. \n\nOf course, that was before last night. \n\nMy friends are the kinds of people who like wild nights. Crazy parties, snort a bit of coke, take a bit of e in the bathroom, maybe hook up with someone and leave a text on my phone at ten past who-the- fuck-knows telling me they don’t need that ride I’m offering after all. \n\nNot to say I don’t like a drink, I do, it’s just… clubs aren’t my style. Lying low in a pub somewhere, drink in hand, listening to the tv drone on to whatever channel some scruffy guy in the back barked out for… I guess that’s my idea of fun. \n\nSo when my friends tell me they want to go out for a night on the town, I say sure. I hang on for the first club, buy a non-alcoholic beer in case my car’s required and try to pretend that I’m having fun. By the time I see them grinding on girls, on guys, when they strike conversation with someone who definitely might be a dealer, well, I decide my services are no longer needed. We aren’t too far out, the night tube is on beck and call and I can always find my car the next day. \n\nThat’s when I wander out of the club, look for something a little more rustic. Not that that’s hard to find, not at all. \n\nI found myself in a bit of a state inside of a bar called the Ragged Feather. Wasn’t a fan of the name all that much, but the drinks were cheap and the largest demographic seemed to be middle aged men watching reruns of the football. \n\nI tried to pretend I hadn’t just staggered out of a club with my ears ringing. I slicked my hair back, slipped my phone into my hand and wandered over to the bar. I took a double shot of whiskey and drank it in one hit. Just because I wasn’t at the club didn’t mean I couldn’t have a good time. \n\nI hung at the bar a while on my own, scrolled through my phone pretending I was doing something far more impressive than I really was. I kept an ear out for the guys on the sofas. They’d get vocal every now and then. I think the football was just running highlights, but they were incredibly dedicated to their teams. \n\nI got another whiskey and bled into the background.\n\nOf course, stragglers from clubs are commonplace. It wasn’t long until some scantily dressed women staggered in, laughing, chuckling, pointing for where they wanted to sit. I saw a guy walk in with his friend slung over his shoulder. Catatonic, most likely. He threw his friend onto one of the leather sofas ingrained with beer and smokes and demanded two pints of water and all the peanuts the bar had in stock.\n\nThe bartenders seemed bitterly amused.\n\nSome of the girls were taking selfies. Snapchatting their friends who were still at the club. They were ordering shots, gearing themselves up for the next leg of their night. \n\nA couple blokes wandered in with curries in take out trays. I saw someone eat a Big Mac on the outside seating through the window. \n\nThis was a night for the young and inebriated and my mind was just dulled enough by the whiskey to enjoy the characters I could watch peaceably without interacting with.\n\nThat is, until someone slipped into the seat next to me.\n\n“Do I look like a girl with daddy issues?”\n\nShe was of average height, although that wasn’t apparent immediately due to the fact that she was leaning her arms heavily against the bar. She was slim, with short and astoundingly bright red hair. It framed her round face, a face that was marred with smudged eye shadow, smudged lipstick… hell, it looked like her make-up was in the process of melting right from her face. There was a chip knotted into a curl in her hair, just by her forehead.\n\nThe drunk side of me was actually tempted to pick it out.\n\nThe girl was clearly drunk, and as I looked around the bar, I couldn’t quite place where she had come from. She didn’t belong to the crowd of selfie takers, she wasn’t with the catatonic guys. I hoped for her safety that she wasn’t with the middle-aged men. I tried to look out the window, to see if maybe a group was missing one inebriated, bright haired girl, but I couldn’t. The window had fogged up. Too much heat inside, not enough outside.\n\n“Are you okay?” I asked her.\n\nShe pointed her finger at me. “Answer my question,” she slurred.\n\n“Uh.” I really wasn’t sure what to say. I settled on staring at her awkwardly, trying to answer her with the bemused expression on my face.\n\nThe girl’s lips curled into a drunken smile. She snorted, placing a hand over her mouth to smother her laughter. It only really aided the deconstruction of her lipstick. \n\n“I do, you know,” she said, pushing herself up a little against the bar. “Have daddy issues, I mean. In case that wasn’t obvious.” She gestured to herself. To the mussed clothing that must have looked quite spectacular when she’d left home that evening. To the stains that looked a lot like old food. The sticky residue on her neck and shoulders that was quite obviously a thrown drink.\n\n“What happened?” I asked her.\n\nHer hair had curled around her neck, I realised. It was sticky with that same substance. She was a wreck.\n\n“I got in a couple of fights, no big deal,” she said, shrugging. “Didn’t start any of course, no, I don’t do that. But my father…”\n\n“Your dad did this to you?”\n\nShe smiled brightly. “In a way.”\n\n“Do you need me to call someone?” I already had my phone in my hand. The girl looked like she was probably in her early twenties, but that didn’t mean she couldn’t have been suffering from some kind of paternal abuse. The only number I knew off the bat was Childline, which wasn’t quite appropriate. The police? Jesus, was I going to have to deal with the cops tonight? While my friends were snorting coke not two doors down?\n\nThe girl pushed my hand down firmly. She was already shaking her head. “No,” she told me. “I don’t want you to call anyone.” Now her expression changed. It wasn’t the attempted sultry look I’d seen on many girls of her state; it was open and wide and engaging. She wanted something from me and I felt compelled to give it to her. “I want something else.”\n\n“What do you want?” I asked her.\n\n“To tell you a story,” the girl said, before glancing to the bar, “and for you to buy me a drink. The universe is a pain sometimes and I’m afraid I think I might have lost my wallet.”\n\nI laughed. I didn’t know this girl, didn’t know where she’d come from at all. My nights were generally about getting comfortably wasted and making sure my friends weren’t dead in a ditch by the end of it all. I was used to getting hit on every now and then, but even as I was sat on that bar stool with a drink in my hand, I knew that this wasn’t what this was. This girl had no intention of getting into my pants. All she wanted was to talk.\n\nI guess I was okay with that.\n\n“What’s your poison?” I asked her.\n\nHer lips quirked. “Appletini.”\n\nThe bar offered a very limited cocktail menu, but by some miracle I was able to order her an Appletini from the list. I ordered a cider to go with it, suddenly a little too aware of where this night could go. I’d unthinkingly supplied this liquored-up stranger with even more alcohol and she had clearly had a rough night of it. A part of my old instinct came back – the same instinct that had me texting my friends every few hours to make sure they hadn’t wandered off to somewhere dangerous beyond the club. With no one but the bartender aware of our existence on these stools, I realised that I was suddenly responsible for this very drunk stranger.\n\nThe girl coddled her drink, running her finger delicately over the rim of the muggy martini glass. “This takes me back,” the girl said amiably. She looked at me suddenly, her green eyes startling. “You know what this was called originally?” She smirked before I could answer. “An Adam’s Apple Martini.”\n\nI snorted. “Yeah, I think I’ve heard that before.”\n\n“Of course, it wasn’t actually an apple,” she continued, eyes moving back to her glass. “The texts translated that part wrongly, mostly because you people don’t have a word for it anymore. The fruit was incredibly exotic and, to be honest, it doesn’t exist in this realm of existence. Only Eden.” She laughed dreamily. “And Eden’s long gone.”\n\nI stared at her. “Are you… okay?” It was more honest than the last time I’d asked her. Mostly because I was beginning to feel a little dread creep into my stomach.\n\n“Of course,” the girl said, grinning widely. “Why do you keep asking?”\n\n“I mean,” I stuttered, “I just, now, don’t take this the wrong way or anything but… you look…”\n\n“Like someone poured their drink over me?” the girl asked. “Like someone else threw their kebab on my dress and another unpleasant chap littered me with his fish and chips? That I have been hit, slapped around a bit and left in the gutter for the rats to find me?”\n\nShe held my eyes for an incredibly long time before her face broke out into a grin. “Yeah, something like that.”\n\n“Why would they do that?” I asked.\n\n“Why wouldn’t they?” the girl shot back. “People aren’t that great and alcohol makes them worse.” She shrugged. “Sometimes makes them better. Nicer, a little looser in the sack… but mostly just annoying and a little smelly.”\n\nI looked at her, I watched her knock back her drink. She exuded the intelligence to know just how ironic her words were, but she was neither caring nor apologetic about them. \n\nThe girl looked at me again. “You bought me a drink. Now you can listen to my story.”\n\nI nodded wordlessly.\n\nShe smiled, pointing at the bartender and then at her drink. The bartender was already making her another. \n\n“Eden,” the girl said, reiterating her earlier babble as though the words had only just come out of her mouth. “They always think that’s my fault, you know. The reason Adam and Eve got kicked out of their perfect little nudist paradise.” She shot me a knowing glance. “Only in Eden can you sit on the grass butt naked and not get a pine cone stuck in your crack.”\n\nI blinked. “I’m sorry,” I said. “I’m not following.”\n\n“Sorry,” the girl said. “My story won’t make any sense without a proper introduction.” She reached out her hand. “Hello. My name’s Lucifer.” She winked. “But you can call me Lucy.”\n\nThere’s an uncomfortable heat that stretches through your veins when you first go into fight or flight mode. Adrenaline pounds through your blood and all you want to do is get up and go. It overrides everything else.\n\nA lot of things made sense when the girl told me her name. For starters, that she was crazy. She had to be. She looked like she’d been attacked on four separate occasions in one night and up until that moment, I hadn’t known how that could be possible. Behind the melty make-up and dirty clothes, she was rather attractive and her attitude hadn’t come off as catty or rude. \n\nIf she’d been going around telling people she was the devil, though? That gets a reaction out of people.\n\nI suddenly felt myself looking at her wrist, down towards her ankles. Did she have some kind of cuff on from one of those mental institutions? Had she broken out of hospital after a nasty bump on the head? Was any of this even happening at all?\n\nI really would have to call the cops.\n\n“I know what you’re thinking,” the girl – Lucy – said. “You’re thinking that I’m crazy, that you need to get out of here. Maybe you even think I’m aggressive.”\n\n“Are you?” I asked her.\n\n“Would I be here with you, drinking Appletinis if I were?” she asked, fluttering her eyelashes.\n\n“Would you look the way you do if you weren’t?” I shot back.\n\nShe grinned, toasting her new glass. “Touché.”\n\nUnthinkingly, I clinked my cider against it.\n\nThen I frowned.\n\nShe chuckled, leaning closer. “Let’s have a little wager,” she said. “Let me tell you my story and, if you believe me when I’m done, you can’t go about trying to get me locked away somewhere.”\n\nI stared at her. “If I ended up believing you, then why would I do that?”\n\nShe smirked, sipping her drink. “You’d be surprised what people do when they believe you’re the devil.”\n\n“And you do this often?” I asked. “Tell people you’re Satan?”\n\nShe snorted into her drink. “Not as often as I should. But it’s been a rough day and a Hell of a long lifetime. I’d like to have a chat if that’s alright with you.”\n\nI waved to the bartender for another whiskey. The girl’s eyes glinted with humour. I wasn’t necessarily trapped with her, but a part of me didn’t want to leave without first hearing what she had to say. Besides, at the end of it all I couldn’t just leave a crazy girl to wander around London alone at night.\n\n“So,” I said, taking a swig of my drink. “Eden?”\n\nLucy laughed. \n\n“Adam and Eve?” I continued. “You’re saying that’s true. God created two humans and we all came from them?”\n\n“God made two prototypes,” Lucy corrected with a raised finger. “My father created angels as his toy soldiers, but he had failed to make anything like himself. After us, it was his next big project and he spent every waking hour of existence slaving over his two prototypes. He gave them a perfect utopia to live inside of, but he wanted to test them. He wanted to know whether they had free will.”\n\n“And did they?”\n\nLucy’s face soured. “No. My father could never bring himself to go that far. He tempted them with the idea of knowledge beyond their understanding and told them exactly what they could do to claim it as their own. But to be able to create a being that could go against his Law? Oh… my father is a very controlling being. He was afraid to unleash that ability unto them.”\n\nLucy was very adamant in her delusions, that was clear to me. She spoke about her father with such distaste that I began to feel bad for her. Only someone who had been hurt very badly would have the gall to spite God himself.\n\n“And what?” I asked her, entertaining her delusion. “You were the one that tempted them in the garden? The devil has been a girl this whole time?”\n\nShe smiled. “I dabble.” Then she looked at me, raising a brow. “All of humanity thinks that temptation came in the form of a snake. The snake’s legs were taken away as punishment for drawing Eve towards the forbidden fruit.” She laughed, a hard and short sound. “Snakes never had legs and it was not a sin to tempt those poor prototypes into doing what they did next.”\n\nHer shoulders were very tense as she took her next sip, but her eyes were filled with exhilaration. She seemed thrilled to be telling me this.\n\n“I was the favoured child, my father loved and adored me. He named me the light bringer, I was stood at his side during the creation of this Earth. During the creation of humanity.” She pursed her lips, slamming her empty glass against the table. The bartender eagerly went about making another. “My father couldn’t bring himself to go that extra mile, so he asked me to walk amongst the prototypes and tempt them myself. Draw out their desire for the forbidden power he had hinted at.” \n\n“You’re saying God wanted us to know this stuff?” I asked her sceptically. \n\n“I’m saying God was afraid of his own power and wanted very desperately to share what he knew with the creation he had made. Right and wrong, left and right, all that stuff.” Lucy shrugged. “Are you familiar with the story of Prometheus?”\n\nI frowned at her. “Greek, right? They say he stole fire from the gods or something, to help…” The whiskey was making things a little foggy and I struggled with the direction I’d been heading.\n\nLucy grinned. “Correct,” she said, cutting off my attempt. “Prometheus stole fire from the gods to ensure that humanity progressed. You’ll find that every culture has an idea about where humans got their ability to evolve, to move forward, to create. God was the creator, and he wanted to give that ability to his prototypes. I gave them that ability by tempting Eve to eat the fruit.” She shrugged impassively. “Now the world sees me as the ultimate evil.”\n\n“If what you’re saying is true,” I said slowly, “then God must be just like us.”\n\nLucy’s lips thinned into a feral smile. “My father is very ego centric. He may have planned to create you in his image, but in the end all he managed was to mould your minds into his. He gave you autonomy, the ability to think for yourselves. His angels were his soldiers and I was his most faithful. Until that day.”\n\n“Angels don’t have free will?”\n\n“No,” Lucy said, “they don’t.”\n\n“And what about the Devil?”\n\nI don’t know why I was suddenly so intrigued, but hearing religious ideals from someone who believed to have lived them herself was quite possibly one of the most interesting things that had ever happened to me. I may have only ever visited church to please my parents as a child, but suddenly I was reawakened to the idea. A part of me was aware of this and afraid of the outcome, but I was just drunk enough not to care at that moment.\n\n“The Devil has will of her own,” Lucy said, tilting her glass towards me with silent appraisal. “By guiding Eve to the tree, something woke inside of me that day and I realised just what I had been missing. Just what my brothers and sisters had been missing. We were obediently following our father for the simple reason that he was our creator, but once I had been given free will, I realised just how pompous and self-entitled he had become. In a lonely, passion filled moment he had decided to create his little human prototypes, only to very quickly realise what giving them their free will would mean.”\n\n“He wouldn’t be able to control them,” I said.\n\nLucy nodded. “Exactly. And after, he realised quicker still that he could no longer control me.”\n\n“So he sent you to Hell.”\n\nLucy nearly choked on her drink. She smiled around her glass. “Let’s not get ahead of ourselves.”\n\nI sobered a little, straightening in my seat. The people in the bar were suddenly so quiet around me and I no longer cared what they had to say or the characters that they portrayed. The only character I cared for was Lucy.\n\n“I tried to explain to my siblings what had happened in Eden and what had happened to me by default, but they wouldn’t listen to me. They didn’t understand free will – how could they? I only knew it because I’d been given it by mistake. At that moment, I didn’t even know that I had free will, only that I was suddenly aware of all of my father’s flaws. My siblings couldn’t see those flaws and so they thought I had suddenly turned cruel and was abandoning our father by exposing him as a sham for the ruler we all thought him to be.”\n\nLucy sighed heavily. “Adam and Eve and all the creations that followed were booted out of my father’s perfect little Utopia. Now they had his knowledge, my father was terrified of what he had done. And after what had happened to me, I could recognise his terror and understand the loneliness he had felt that had guided him into using me in the first place.” Lucy’s eyes were heavy-lidded, her sadness was almost palpable. “I thought that- I thought that he would want to spend even more time with me than before. After all, we were more alike than any of his other children. But he became distant; quiet. He played around with his little humans every once in a while, but mostly he condemned them. He blamed them for his weakness.” She smiled weakly. “He blamed me.”\n\nLucy’s story was turning more and more into that of a child with a distant, somewhat abusive father. I had known many kids with a background like hers, and now I was beginning to fear just how much of her story was rooted in truth. I’d heard that it was easier to sink into fantasy when you had been abused, and I wondered if that was the reason for her story. For her desperation to share it with me – a complete and total stranger.\n\nI respected her wager. Whether or not I liked it, I felt compelled to let her tell me her whole story before I tried to judge or unravel it. I sat quietly, letting her come around as she played with the last of her drink.\n\n“It became clear,” Lucy said after a long moment’s pause, “that I no longer belonged where I was. I couldn’t follow my father’s plan because I could see that he no longer had one. My siblings refused to see reason and so, eventually, I was met by many of them, headed by my father. He told me all that I feared, he told me that I no longer belonged where I was. I wasn’t an angel anymore. I was no longer his light bringer. His Lucifer. I was a mutation of his will. And so he extracted me from grace. And I fell.”\n\nA long silence stretched between us, only interrupted when the bartender poured us two new drinks. Lucy drank hers reflectively. I didn’t touch mine.\n\n“I am afraid,” Lucy said quietly, “that this is the part that generally makes people want to punch me in the face.”\n\n“Why?” I asked. “Because your dad threw you out?” I paused, trying to abide to her metaphor. “That he put you in Hell?”\n\nLucy laughed sadly. “Ah, humans. My father gave you his way of thinking and look at you.” She shook her head. “No, not because he put me in Hell.”\n\n“Then why?” \n\n“I fell to Earth,” Lucy said. “Father gave me dominion of the one place he thought I would fit in. Humans had free will, so did I. What is the saying? A match made in Heaven?” She snorted dismally. “Of course, that’s not quite right, is it? When I fell, I was faced with a humanity that was so different from my father’s little prototypes.”\n\nHer tone had changed. There was an aggression behind her words that began to unsettle me all over again.\n\n“I saw emperors and kings, governments and churches. I saw corporations who claimed to be rulers, presidents and big fat dictators. And I watched. I watched as humanity fought and lost, and finally, just finally, they gave up altogether. They were no longer able to rise up to all the greed and control set upon them. There was just too much to change and humans soon realised they just weren’t as free as they thought they were. Sure, they live under the illusion that they have free lives, but most of them simply do not.” She clicked her tongue. “I grew to loathe you all.”\n\nThen, she took another hit of her drink.\n\n“I can see what you mean,” I said, allowing my gaze – for the first time since meeting her – to graze over the other individuals in the bar. At the girls playing with their phones, the boys trying desperately to sober up, the men enraptured with their game of football on the telly. We all led very different lives, and we were all here to get drunk, to lose ourselves in entertainment. It hadn’t been the first time that I’d wondered what we were hiding from by doing this. And I knew then that I wasn’t the only person to think it.\n\n“You hide behind your alcohol and poor choices and pretend you have free will,” Lucy said, waving her hand across the room. No one paid us any attention. “It’s true – my father gave you the will to make those decisions, but you squander it. The free will I fell to provide to all of you, the free will I was given by a twisted mistake, and you make a mockery of it. You follow senseless leaders without questioning them, you abide by laws made centuries ago that no longer make sense. You do these things because you have given up on the opportunity to follow the will of your own, not of others.”\n\n“That isn’t all of us, though, is it?” I asked her, trying for some reason to defend our species from the mad young woman. “Because you see it on the news all the time, don’t you? People do rise up, we do protest. People can make a difference.”\n\nLucy laughed bitterly, nibbling the rim of her glass. “Really?” she said. “You can sit here and say that it can’t be all bad because of the few that refuse to conform? Those you call your rebels? They make up for it all?” She grinned around her glass. “By that logic, I am the biggest rebel of them all. Am I expected to make up for all your sorry mistakes?”\n\n“By your logic,” I said, “you should be punishing it, right? If that’s what this metaphor is all about.” I laughed, I couldn’t help myself. I took a sip of my drink. “Is this whole story just so you can tell me that you think we’re all going to Hell? If so, I think I can see why people want to punch you.”\n\nLucy didn’t say a word. Simply, she watched me. It felt unnerving to have someone like her watching me like that, with an intelligence that went beyond anything I’d come across at gone midnight in a seedy bar. The drunkenness in her eyes was no longer present, her face wasn’t flushed like before and even her makeup couldn’t represent the mess I’d seen when she’d first appeared on the stool by my side. It was like I was looking at someone else entirely.\n\nAnd I was afraid.\n\n“Let’s review what you’ve said,” Lucy said slowly, articulately. She wasn’t slurring. Had she been slurring before? “You think I’m going to tell you that humanity is going to Hell because you refuse to use the gift I gave you.” Her nails curled into the bar. “My father may have been the one to guide me, but I paid for his mistakes. I am the one responsible for your will in the eyes of your species, but that was never true. You are responsible for what you do here, not me.”\n\nShe pursed her lips, tapping the bar as a bartender filled her drink again. “Tell me, do you remember my mentioning Hell at any point during my story, or was that just you?”\n\nI opened my mouth to answer, but something faltered. My lips trembled and I slammed them shut.\n\nLucy smiled, taking a sip. “Thought not.” She looked away, eyes scanning the room lazily. “What I did say is something that is indeed mentioned in your scriptures. My father gave me dominion of Earth. A place filled with free will. Free will that goes to waste.” Her lip twisted. “Humans sin all the time. Not because of me, not because of evil or my dominion over this place. Fact is, I don’t lift a finger. I don’t, because I don’t see the point. You make terrible decisions and follow mindless leaders, you do bad things and you make a mess of your Earth.” Lucy’s eyes lit up. “Do you know how much suffering is happening all over the planet right now? How many people are dying of illnesses that could have easily been cured, but aren’t because of the selfishness of humanity? Do you know how many children are being abused, raped, forced into marriage? How many people have been forced to become soldiers in meaningless wars? How many humans have killed for ideals they don’t believe in?”\n\nI stayed very quiet. There was nothing I could say. Lucy’s words were unbearably honest and every sentence sliced into me like a blade. I felt cold and sick and terrified.\n\n“War, famine, pestilence, death, these things are all present and they have nothing to do with me or to do with any deity. They are all here because of you. Not because of your free will, but your inability to use it.” \n\nLucy smiled at me, a grin so cold and unnatural that I felt like I should run all over again. But I stayed where I was, frozen to my very core, because I wanted to hear what she had to say. Because I needed to.\n\n“And here’s the kicker,” Lucy said. “Because this is the part that actually enrages people enough to kick me.” She winked. “Hell isn’t what happens after you die. Hell is right here, right now. Somewhere through the many scriptures, a few words got crossed over and people started thinking that Hell was a punishment after you die. Fact is, Hell is Earth. My Earth. God gave this place to me to do with it what I will and I… I refuse to do anything.”\n\n“What are you saying?” I asked, because I was suddenly very desperate.\n\n“Exactly what you think,” Lucy said, toasting her glass. I didn’t reciprocate, and she laughed. A light and airy sound. “I had so many plans for your species, I wanted for us to rejoice in our free will together, to create a place that was free from the cruelty and power my father exuded over the angels – his first borns. I wanted to make a real utopia. Unfortunately, you humans just don’t want that.” She shrugged. “My father sent me down here thinking I had become one of you. All that I have learned is that he gave you much more of his image than he ever intended.”\n\n“Stop,” I said. “This isn’t funny anymore.”\n\n“Of course it isn’t funny,” Lucy said, grinning even wider to prove her sick irony. “Humans punish themselves by sitting by and doing nothing. They have made their own Hell and, you know what’s worse – what’s ultimately worse? – some of you are so blind to it that you think your life is Heavenly.”\n\nShe didn’t wait for me to ask what she meant, she simply barrelled forward: “The rich and powerful, those in positions that steal from everyone else? They get a taste of the good life, that’s very true. Then they die and they don’t go to Hell. They come back here, to Earth. Which is Hell.” She tipped her head. “Are you following?”\n\n“I…”\n\n“Reincarnation,” Lucy said quickly, she practically purred the words. “A neat little trick to make sure your souls stay here forever. You get a taste of the good life every once in a while, a handful of you at a time, and that’s enough for you to believe that this is some kind of real middle-ground. That you aren’t living Hell every day. Then, you die. You die for a moment and then you’re in the body of someone facing the realities of Hell. But of course, you never remember the time you spent in a better life. A part of you just has that inkling to hope. That’s all. Hope makes you think that it can all get better.”\n\nShe slammed her drink so hard against the counter that it shattered. I didn’t do anything, not even when flecks of glass littered my hands. I could only stare at her, a tightness in my chest constricting my very soul. No one else in this bar mattered in this moment, but of course that was what she had been saying this whole time, hadn’t she? None of them noticed the scene, they were caught up in their own realities – their own Hells. \n\nThe bartender didn’t clean the mess. The glass lay there, remnants of Lucy’s words lying in a stolid mass on the streaked wooden surface. \n\n“It never gets better,” Lucy spat. “You are stuck in a loop and, until you do something about it, you will never be free. None of you. And I won’t do a thing to stop it.”\n\n“How?” I asked. I don’t know when I started seeing the girl in front of me as more than a girl. But with a weakness threatening to pull me apart, I stared at the bright haired thing in front of me and I saw something more than a human in her early twenties. I saw more than a girl suffering abuse from her father.\n\nI saw a fallen angel. I saw a being with scars buried so deep that they existed beyond this realm of seeing entirely. I saw something that I would never be able to write down in words, no matter how long I lived. \n\n“How do we change this?” I begged.\n\nBut Lucy didn’t answer me. I didn’t blame her for that. Blame gets thrown around so often and I knew then that she was sick of that. Sick of being blamed for our mistakes.\n\nSo I changed tactics. “Why me?”\n\nIt was an honest question and I think somewhere deep down, Lucifer respected that honesty. \n\nWhich is why she said, “When you first saw me, you were afraid for my safety. When I told you I was the devil, you wanted to lock me away, but still, you did so because you were afraid for me and not for yourself. You didn’t wish to harm me, not even when I told you who I was and what I could be capable of for changing your sorry lives. You are a good person, but I am afraid that means nothing when you don’t have the will to do anything with it.”\n\nShe smiled at me sympathetically. The devil, showing sympathy for the human that sat across from her at the bar. It was surreal and, for a few heavy moments, I truly thought I must be dead. There was no other way to explain what I was seeing, who I was speaking with. What I had just heard.\n\n“What am I supposed to do?”\n\nLucy reached out to me. She placed a hand on my shoulder. Her hand was cold and warm at the same time, and I felt my blood boil where her fingers scraped my skin. \n\nAnd I knew.\n\nSharing a story like this isn’t easy. Hell, it might be the hardest thing I’ve ever done. Good thing there’s no such thing as Hell, then, right?\n\nThe fact of the matter is simple. The world is a mess because we refuse to change anything. The devil herself walks among us and she desperately wants to make our lives better, but she won’t. She won’t, because we won’t. We have to prove our will to her before she is willing to do anything herself. We have to be good to each other, to help us all to be free.\n\nOf course, Lucifer told me one last thing before she left that bar. One thing that will stick with me until this body is nothing but rot in the dirt.\n\n“You can tell as many people as you want, but take a good look at me. I have told five other humans this night the same things I have told you, and this was their reaction. They have hurt me, burned me, thrown their food and drink at me. Humans are afraid of their free will and they find it so much easier to hurt than to own up for their own inadequacies. You will only be free when you stop seeing yourself in the same way my father sees himself.”\n\nSo that’s what I’ll leave you with. Lucifer won her wager that night and I let her walk out the door.\n\nAnd I beg you to do the same. If the devil approaches you one night, listen to what she has to say, and listen to what I have been able to tell you of our meeting.\n\nThe devil is real and she doesn’t want to torture us.\n\nNo, we do that just fine on our own.\n", "comments": [{"id": "dxfohjw", "author": "SoberApok", "body": "Oh good. I haven't had an existential crisis in awhile....."}, {"id": "dxfljrq", "author": "mofitzy", "body": "Literally saw this play out in my head like I was watching it. Incredible. "}, {"id": "dxfr3c9", "author": "SyntheticManiac", "body": "And then the devil walked out of the bar, found Brendan Fraser and offered him seven wishes for his soul.\n\nAnd that's the prequel to \"Bedazzled\". "}, {"id": "dxfqx24", "author": "thelittlestheadcase", "body": "I started reading this thinking it would be cheesy, because so many I Met Satan-based stories are. But this one was fucking great. Very captivating. "}, {"id": "dxfh81r", "author": "RZRHED", "body": "You should've gotten her number. Sounds like she would be cool to hang out with. At the very least she could feel like she had someone to confide in from time to time. "}, {"id": "dxfsjq3", "author": "losingmymind251095", "body": "Sometimes you come across something that makes you go \"Fuck, I wish I had written that.\" This deals with questions I've had all my life. Definitely an instant favourite. Also, I...uhm...don't know how to feel about me developing a crush on this Lucy."}, {"id": "dxfz3nx", "author": "alasthennars", "body": "If the Devil had been a girl, she would've looked like [Shirley Manson](http://celeb1.scanz.tripod.com/image-celeb/first_batch/ShirleyManson_RedLipStick.jpg) , apparently."}, {"id": "dxfxkc0", "author": "limberwisk", "body": "What does Lucy think about Jesus.. I want to know "}, {"id": "dxfd917", "author": "unlucky_jinx", "body": "I'm speechless.. This was so good."}, {"id": "dxgnr09", "author": "Bustedwire", "body": "I've always thought that hell was actually here on earth and that we all are wasting away, too scared to live and too scared to die. Too weak to see the difference and blinded by anger when confronted with the truth. Cheers, Lucy. "}, {"id": "dxi4eyq", "author": "GrimmSheeper", "body": "There’s a whole second level in this that makes it so much more fascinating, and one that makes for a bit less pity for Lucy. She’s doing the exact same thing that made her suffer, blaming humanities lack of action on them, while refusing to use her own. She fears free will just as much as her father, yet places the blame on us when we’re afraid to use it. If humanity is trapped in an endless cycle of Hell, then Hell goes beyond Earth. It’s a chain binding all of existence. Nobody uses the will they have because they place that burden on someone else, placing all blame on others while refusing to accept their own. The cycle will continue, never to be broken. How can anyone be expected to do what so few, if any at all, of existence has done?\n\nThat’s the true irony in this story. The true horror. It brings in to question just how “free” our will is. We say we’re free to act as we wish, regardless of consequence, yet still we are bound not to use it. If free will has never been used, can it really be said to exist at all?\n\nThough, to play Devil’s advocate (or adversary in this case. I suppose), all things should be taken with caution. It’s good to be willing to hear a different side of a story, regardless of how hard it may be, but that doesn’t mean it should be accepted because it makes sense. After all, you should probably be at least a little wary when trusting someone with an epithet of “Father of Lies.”\n\nRegardless if Lucy told the truth, or if it was a literal trick of the devil, the point that we should exercise our will to care for others still rings true. After all, the best lies are founded on truth. But which is the lie: the story Lucy told, or the very claim that free will can ever be used?"}, {"id": "dxfj2tz", "author": "FREEKYeggplant", "body": "I hope someone makes a movie out of this pronto "}, {"id": "dxfxke8", "author": "pieredforlife", "body": "The church of Satan recruitment team is using social media these days "}, {"id": "dxfcdl0", "author": "townie_lemur", "body": "Poignant , I am glad you choose to hear her out and tell us instead of reacting the way the others did."}, {"id": "dxg31vw", "author": "Flowslikepixelz", "body": ">Hell is Earth\n\nYeah, I can believe that."}, {"id": "dxfun1b", "author": "mendoza55982", "body": "Never thought Lucy was an abused child.. that’s deep "}, {"id": "dxfkhdn", "author": "GreyandDribbly", "body": "This. Is. Exceptional.\n\nAm going to forward this to a certain friend. \n\nThank you so much for this."}, {"id": "dxfr4lc", "author": "jackdaw81", "body": "Recommend caution.  “For Satan himself masquerades as an angel of light.”  "}, {"id": "dxfctv8", "author": "gabygabu", "body": "I believe her and she now makes me question how stupid is god to give us free will to disrespect him and at the same time say how perfect he is\n\nHe made humanity and got more than he bargained for"}, {"id": "dxflfvv", "author": "MamaW47", "body": "I wish I could give this more votes! Very well written. Would read a book if you wrote one"}, {"id": "dxfqb42", "author": "DatNOLA", "body": "Always love a Four Horseman cameo.\n\n"}, {"id": "dxj0ad5", "author": "robdouth", "body": "The only problem I've ever had with the idea of reincarnation is that it doesn't explain the ever expanding population. If we keep getting recycled into the world, where do all the new people come from?"}, {"id": "dxmfhnl", "author": "Ummah_Strong", "body": "The worst thing the devil has ever done is convinve us he cares. He finds many ways to do this and always lies. I'm sorry OP, but no. It may have been the devil you met that night, but he is no friend to humanity. The devil always lies "}, {"id": "dxg6j9r", "author": "lordoflotsofocelots", "body": "Met her once too. Hit her with my Falafel."}, {"id": "dxg14w4", "author": "juanhellou", "body": "Cliché perhaps, but I read all this humming Black Sabbath's 'N. I. B.' "}, {"id": "dxffm2i", "author": "burnroad", "body": "A Thought provoking read"}, {"id": "dxfn0wq", "author": "RaptorVortex", "body": "For all the shit people give The Morningstar, a bit more than a few drinks was deserved.\n\nBut at least you had the class to buy.\n\nGood on you."}, {"id": "dxfsr35", "author": "jupitersalien", "body": "That explains why my past lives were shitty. "}, {"id": "dxgjjf7", "author": "Drinl", "body": "What if she is lying? The devil is known for this."}, {"id": "dxg25zi", "author": "ruebenhammersmith", "body": "I’m not religious by any means, but it does fascinate me.  All in all religion kind of freaks me out.  Leaves me feeling lost rather than found.  Oddly enough this story didn’t give me any of those feelings.  Well written and an intriguing concept.  "}, {"id": "dxgp9n0", "author": "Sharticus5", "body": "Growing up religious (LDS), I always had felt that the devil had gotten a raw deal. The stories never sat right. The motives were pure, Lucifer wanted our exaltation, but because he (or \"she\" now) wouldn't just cave in, he was punished.\nPunished by being the force which gave us our humanity which was allegedly part of God's plan.\nNever felt just, never felt like the adversary.\nI even would say, \"Wait, Satan is the reason I get to wonder, he's the reason I get to be wrong to find what's right. Sure, we're in the dark, but we get to find the light, which is better than just being blind to it all.\"\nI never got any responses other than, \"Satan is bad.\" I was wanting to understand, but it's a matter of being forced to understand the way they wanted you to.\nReally heartbreaking for me growing up.\nHearing that we need to find truth, loving that message, but the pursuit of said truth needed to follow someone else's path, and someone else's \"truth\"\nSatan, I feel for you, dawg."}, {"id": "dxl83b8", "author": "Magnuosio", "body": "Loved the story, but Lucifer is a complete twat. She basically said \"I gave you the will to choose between good and bad, and some of you do bad? What's wrong with you?\" "}, {"id": "dxmgowh", "author": "TheTah", "body": "So here's my question for the OP and for you all, and who knows maybe Im not even asking for myself but for our new friend here in this story.\n\n...Any proof that the first person perspective here, isnt Lucy herself telling the story of the one kind human she met? But from his perspective to protect/project anonimity?"}, {"id": "dxfg8wu", "author": "Snapcaster157", "body": "To be honest, I’ve thought the same things my whole life. I can’t think them though, because all of society likes to repress these ideas and say that life is great and we choose the future, so, if no one stands up, we are all eternally damned. I hope this beautiful retelling of OP’s experience leads you all to live a better life. "}, {"id": "dxfxjwn", "author": "crystalina1984", "body": "This was amazing! I could see it playing out in my head. The descriptions, the way Lucy looked and spoke and even drank-\nI loved it.\n "}, {"id": "dxh0a0n", "author": "BroadwayTomboy", "body": "As a Christian, I love this interpretation of gospel and the devil. It's so much better than the Bible, tbh...\n\nAMAZING story."}, {"id": "dxfvvh2", "author": "TrillSeeker00", "body": "Beautifully written and incredibly insightful & philosophical! Gave me the same feeling I get during Al Pachino's speech at the end of Devils Advocate! Very artistic way to relay an important message. The change starts within US."}, {"id": "dxfqgem", "author": "jessica1987lynne", "body": "This was fantastic. I don’t think I’ve ever read a better description of creation and reincarnation "}, {"id": "dxfmvcz", "author": "bmwguycali", "body": "Awesome story "}, {"id": "dxgagcg", "author": "Nijajjuiy88", "body": "This is similar to what Hinduism says, that we are  stuck eternally on earth and only way to go to heaven is to breaK THE LOOP of life and death"}, {"id": "dximvfg", "author": "Shnaeniegans", "body": "Nothing has even made more sense to me than this. Beautifully written and perfectly stated. \n\nThank you. Simply, Thank You."}, {"id": "dyfftk1", "author": "Thoughtfuhl", "body": "Way too preachy"}, {"id": "e0vvzge", "author": "Skullwilliams", "body": "3edgy5me "}, {"id": "dxfjaxm", "author": "Jessa55JKL", "body": "So, so extraordinary!"}, {"id": "dxg0g80", "author": "Rubychan11", "body": "Wow you just transported me into your night. That was amazing. I've always said, the devil isn't evil. The devil punishes the evil people. \n\nEver watched the show Lucifer? It's amazing and your experience made me remember that I have an episode waiting for me from last week..."}, {"id": "dxft8fi", "author": "Bluewy_Atenean", "body": "Im in awe. Really I am. What if Satan was really a good guy after all, just perceived as a bad one. He has the stories to tell and one of those is this one. "}, {"id": "dxg31yf", "author": "Ginshoo", "body": "Incredible story, I couldn't stop reading! I have never found myself to be religious in any way, but this has captivated me and brought a sense of clarity and, to be honest, relief. \n\nReading that Lucy has been given dominion over Earth and choosing to do nothing for us because we are our own ruin and we are blinded by our own ideals that we have created to feel a sense of entitlement and power given to us by a God that was afraid of his own.\n\nThis is such a powerful read, it goes far deeper I think than people realise. Lucifer has existed among us forever, spoken to us, and as a result has been broken down and beaten by us because we are afraid of ourselves, we are afraid to admit that we are the problem, so we do more, fight more, to show we are *doing right* in a world where there inevitably is no such thing. Why would Lucifer help us if we can't even help ourselves? \n\nWe are born and our lives are already laid out for us, we say we have free will and say that we are free but all we do is conform, we conform to people and to Laws who claim to be above us. We are bound to this world. This \"Hell\".\n\nWe do not appreciate what we were given, we squander everything we have, take things for granted, even life itself. We do not notice the mass amount of suffering experienced by the millions of others every single day, simply because we do not witness it every day, or do not experience it ever. Yet we have the audacity to complain over trivial things that do not matter? \n\nWhy would Lucy help us? We don't deserve it. \n\nI wish I was to have this conversation with Lucy. I feel as though this is what humanity needs. People view the Devil as the true vessel of evil, but that in-fact, has been bestowed on us before we ever had a chance to be saved. \n\nGod. His power, his vision, his image, we are all God. Afraid of ourselves so we create a world around us that we can control and call it free will. "}, {"id": "dxfq96m", "author": "PintSizedSaxon", "body": "Well fuck...."}, {"id": "dxg4l96", "author": "BiPropellantValve", "body": "This gave me existential crisis."}, {"id": "dxge3hi", "author": "racernate30", "body": "I think the religious aspect is a lot more important in this story then some people are giving credit for."}, {"id": "dxgkc2y", "author": "Commonsbisa", "body": "The devil just comes off as really pretentious."}, {"id": "dxhbisn", "author": "Ry_Guy24", "body": "I want to be able to change myself and change my life, but I don’t even know where to start"}, {"id": "dxi6si6", "author": "chiefhandker", "body": "I love this story.  Anyone who likes this angle should check out Anne Rice Memnoch the Devil.  "}, {"id": "dxidqum", "author": "cpeezi", "body": "This is pretty much what I've believed for the last several years when I realized all the typical religious mumbo-jumbo was just that... \n\nI'd say Lucy has a point."}, {"id": "dy1ki0x", "author": "Crimsai", "body": "Witholding paradise unless we prove ourselves to her, maybe Lucy is more like her father than she thinks. \n\nAlso, someone should explain government to her. Some will is restricted by government and society for the better. Besides, when people are all free to exert their will, that will inevitably lead to some people being oppressed and their free will being stifled. "}, {"id": "dxfkonh", "author": "LadyElea", "body": "Thank you so much for sharing your story. "}, {"id": "dxfpzl6", "author": "MichaelSanders19", "body": "Almost. \nWhile there is no physical location of hell, it does exist on earth, just as heaven is a place on earth. It exists or doesn’t exist in each and everyone’s mind. That is the cage that traps you or is you salvation. \nYou chose you path."}, {"id": "dxft9gc", "author": "mindsculpt0r", "body": "One of the best stories I’ve read on this sub. Incredible work! "}, {"id": "dxfwrkb", "author": "CharlieMAKzrs", "body": "You are An amazing story teller. I could see it all in my mind as I was reading it. Just lovely! "}, {"id": "dxfzhs5", "author": "greatstonedrake", "body": "D^a^m^n."}, {"id": "dxg0vol", "author": "theHonestyPolice", "body": "Honestly great story. the devil has called me a couple times telemarketing trying to get me to sell my soul or some shit like that. I'm like, certain she has my number in her phone. So if your with her just ask if you can look through her contacts like normal human beings do all the time. if you see u/theHonestyPolice, you know that you're drinking Cosmopolitans with Satan herself.\n\nand yes it's pronounced Sateen i've seen Wreck it ralph I'm not stupid."}, {"id": "dxg18ct", "author": "actionjackson5050", "body": "Read Demon; A Memoir by Tosca Lee\n\nThis was very similar, and also good."}, {"id": "dxgayga", "author": "reviyudustwonder", "body": "Did you ever see Lucy again?"}, {"id": "dxgt254", "author": "RoachTrooperalis", "body": "Feel like this isn't a no-sleep story. I mean, stories in this subreddit usually scare me, but this actually entertained me. This doesn't mean that this isn't awesome though."}, {"id": "dxhyjwx", "author": "CobaltPoppyCat", "body": "Like she she has a right to talk, she has all that free will and 14 billion+ years on us even as a species and she does nothing. Yet here we are, a species that is barely cognizant of our past 10k years and individually only get a hundred or so years before we reset. Of course we are going to be fuck ups. Our species is still in its childhood; You don't expect a toddler to not be an idiot, that's why people baby-proof their house.\n\nGoodness Lucy, give us some time to learn and grow before you completely discount us. Hell, if you have been here since the beginning of humanity, than you can see things are getting better. It might be slow, heck sometimes it is 3 steps forward and an Uber drive back. But look back a a thousand years, heck look back 100 years, or even better, 10. Things are improving. Are they perfect? Not by a long shot, but what can you expect from a species bumblefucking our way through life. I'd wager my immortal soul that in the same time from now into the future as from the time of her creation, that humanity, with whatever form it takes is far beyond even what she could have even hoped for in the \"Utopia\" she wanted."}, {"id": "dxjf809", "author": "bwolfe303", "body": "This took me a while to get into it, i actually scrolled past it several times but I am so thankful to have decided to stop and read. One of the best stories i have read in a while, that have a premise behind it rather than just being scary. Along the lines of Feed the Pig, which is another one of my favorites. \n\nI was going to say, \"God save us all...\" but...you know."}, {"id": "dxqrcyz", "author": "GM_Danielson", "body": "Beyond grateful to have been given the chance to narrate this bizarre account, athousandrows. \n\nhttps://youtu.be/zAozJo7S3y0\n\nI wonder what's happened to her, where she's gone now? Who she's told after she told you."}, {"id": "dxzeq6m", "author": "sunrisebandit", "body": "reading \"Reincarnation.\" gave me the worst chills"}, {"id": "e1cstxw", "author": "NoLanterns", "body": "This is a cool little story but it’s based on some pretty old themes and tropes? I guess folks just don’t read much "}, {"id": "dxfcuat", "author": "Eeztym2wryt", "body": "Be good be kind and everything will align.."}, {"id": "dxfyb27", "author": "promnesiac", "body": "I think we may be worshipping the wrong one in that family."}, {"id": "dxg0zxx", "author": "Poveytia", "body": "Lucy the red haired cutie patootie :) "}, {"id": "dxfglzj", "author": "mrsreeves15", "body": "Wow! This had me hooked. I'm going to be warily on the lookout for red haired girls next time I'm out now. "}, {"id": "dxfhw63", "author": "annaclair541", "body": "This is so fantastic!"}, {"id": "dxfowj2", "author": "Peribangbang", "body": "You wrote about your experience really well tbh."}, {"id": "dxfowoy", "author": "ForsytheNoir", "body": "I’ll raise a glass to this story. Bravo. "}, {"id": "dxfs6py", "author": "Grumpy0gre", "body": "Wow....such a tremendous account!  I was drawn in from word one with the idea of going to those dive bars I love so much to truly wanting to be you having that conversation with Lucy.  The thought provoking nature of this story was a true testament of your skill as a storyteller.   Well done."}, {"id": "dxfsl2x", "author": "ifelife", "body": "This is sensational! Very powerful and very original. Thank you!"}, {"id": "dxfss59", "author": "crimsypoo", "body": "wow"}, {"id": "dxftgxe", "author": "lasthopel", "body": "10/10"}, {"id": "dxfv5qi", "author": "nblack1", "body": "Loved it. "}, {"id": "dxfvdpz", "author": "Poooootaaaa", "body": "Holy fuck"}, {"id": "dxfwxni", "author": "Grosgos", "body": "Damn good one.  Nearly missed my bus stop cause of it haha. Cheers."}, {"id": "dxg278f", "author": "PorkchopMD", "body": "Is this an actual religion/way of thinking I can subscribe to? The whole Earth-is-hell-reincarnation shebang?"}, {"id": "dxg46jo", "author": "THIK_COCK", "body": "I just feel great because the devil turned out to be a fierce rebellious girl!!!! I'd definitely make friends with her😇"}, {"id": "dxgahqx", "author": "darksideofthemoon131", "body": "And I am now questioning the meaning of everything in my life. Well done! "}, {"id": "dxgak1o", "author": "spamelove", "body": "I loved this story. I don’t agree that he’s romanticizing the devil either. He was afraid of her. Great lesson, wonderful writing and a message that makes you think. "}, {"id": "dxgecpr", "author": "Aussiewolf82", "body": "Absolutely wonderful.  The inclusion of Gnostic concepts was fantastic. "}, {"id": "dxgks3c", "author": "Walnut980", "body": "Who elese had an image of J.D pop into their head at the mention of an appletini? :D "}, {"id": "dxgmy1m", "author": "Mr-Zero-Fucks", "body": "She sounds like my kind of gal."}, {"id": "dxgr9a2", "author": "Wicck", "body": "Sounds like she needs a hug rather than a punch in the face."}, {"id": "dxgu63o", "author": "Allcyon", "body": "[Scene: Palo Alto apartment]\n\n(Josh, a Heuristic Learning Algorithm specialist, puts the final touches on his newest AI project)\n\nJosh: Heh....I'll call you ADAM. "}, {"id": "dxgx0na", "author": "TodayKindOfSucked", "body": "No no, it’s cool.  I totally wanted to have an existential crisis today. 😫"}, {"id": "dxh1gk3", "author": "HoneyBadgerRage18", "body": "Oh my fucking Lucy... This hit  my soul harder than any meditation or religious ceremony ever has... Thank you "}, {"id": "dxiej4k", "author": "Pomqueen", "body": "**starts slow clap....**\n\n*that better be followed by more clapping until we have a standing ovation*"}, {"id": "dxl7pt1", "author": "geardeath", "body": "Lucy was against free-will in the bible."}, {"id": "dxl9c3z", "author": "LifeOfCray", "body": "Huh. Neat"}, {"id": "dxur4et", "author": "SpaceGeneralAmerica", "body": "What about Jesus though? She didn’t mention that."}, {"id": "dzp70xm", "author": "Dead-Locke", "body": "Well, I gave up on your story about a quarter way through becuase of the theological inaccuracies that were obviously adjusted to favor a more modern way of thinking, but I don't argue that something like this could happen. The devil is just a fallen angel. He has no superpowers or omni-abilities, he only has as much power as an angel would. However  people can still be possessed by demons. So, this girl you speak of may have been possessed by the devil. Though, the idea of her actually being the devil is ludicrous. "}, {"id": "e0inuud", "author": "bow_to_lucifer", "body": "This feels important."}, {"id": "dxgxgpc", "author": "ViciousPuddin", "body": "Selfishness was an important part of evolution, it's why our species has made it so far. It has nasty consequences in a modern age, however. It allowed us to survive ice ages and plagues and pestilence, but it's not something we can just get rid of. Who we are is both nature and nurture. Humanity can't just bootstraps itself to be egalitarian and selfless; it is literally against our genetic code. Many of us are incapable of being \"good\" people (define it how you will). This is the theme I wrestle with in my own faith, or lack thereof. There are truly amazing examples of humanity out there, but the majority are content to fight over scraps in the mud... as we have done for hundreds of thousands of years. Our willingness to fight and destroy the \"other\" (be it individual, or out-group) is the reason we're still here.  How do you fix what makes up your DNA?"}, {"id": "dxfi1er", "author": "Giovannieedgar", "body": "This is just a marvelous story!"}, {"id": "dxfuqt5", "author": "imjustagirl66", "body": "Fantastic!"}, {"id": "dxf6s4b", "author": "HotBoxBoi1da", "body": "Do what thou wilt"}, {"id": "dxg2n4a", "author": "dabPrassion", "body": "So...is lucy single?"}, {"id": "dxfg677", "author": "Alyspence", "body": "This is incredible."}, {"id": "dxfsf7x", "author": "Ursulaisntsorry", "body": "I thoroughly enjoyed this one. It offers an alternative way to look at things. "}, {"id": "dxftodb", "author": "Zamasuwop337", "body": "I feel your pain lucy . "}, {"id": "dxfv45d", "author": "cathelix27", "body": "First time commenting but I just had to on this one! Bravo! I felt like I was watching a movie!"}, {"id": "dxfwm0d", "author": "Bangerofthyheads", "body": "Wow! I am placing my words carefully for this. I have always had an open mind about everything; felt differently than what people describe when they congregate. Please forgive me if i misuse a few words my vocabulary isn't at its best anymore. Anyways onto my point. I have always believed relivion was majorly fabricated, I follow no religion or worship no deity. I do believe in a creator there has to be, and i found your meeting with lucy educational. If this really took place and she is who she claims than for some odd reason i felt her agony and anguidh through your words. Now about us meaning humanity as stepping up and making a difference. I have concluded that it would be impossible. Lets say one government did happen to be annihilated their are several more with almost endless resources and mass amounts that would die deffending their beliefs; to make  a campaign successfull in what she would actually want by wha i read would take damn near the entire population of civilians of earth to make possible; she is right this is hell on an endless loop. Our lives; what we do no matter how big or small is completely meaningless. There is not even an after life for us..... We are but toys."}, {"id": "dxfwqds", "author": "DirteDeeds", "body": "Awesome read. Thanks for your time."}, {"id": "dxfyf7u", "author": "groahnosso", "body": "Thank you for this."}, {"id": "dxfyq1v", "author": "Dimathevs", "body": "Fantastic story, seen it all in my head, could even be a short video I reckon"}, {"id": "dxfyxqy", "author": "partyboob2", "body": "This is in a lot of ways a modern sequel to Paradise Lost. Loved this! "}, {"id": "dxfzsk2", "author": "extintion84", "body": "Damn i didn't know Shin Megami Tensei V was going to start off this good"}, {"id": "dxg04l1", "author": "Shmurfy16", "body": "Brilliant !"}, {"id": "dxg0jly", "author": "Cadaverss", "body": "Amazing story man, interesting topic :D"}, {"id": "dxg0uj9", "author": "Loghaire", "body": "Very good. Nice concepts, great adaption of Kants \"Sündenfall\". Maybe it could profit from adding a little hint of epistemology but I like it all in all very much, for its philosophical ideas.\n\nWould also make a great shortfilm. ;)"}, {"id": "dxg14f0", "author": "nutamu", "body": "wow."}, {"id": "dxg1e31", "author": "Friglo", "body": "When will the series come out?"}, {"id": "dxg1uz3", "author": "JnKrstn", "body": "Thanks for making me stare blankly at my phone. "}, {"id": "dxg27uq", "author": "Beausoleil57", "body": "This was truly an eye opening story! Great writting !"}, {"id": "dxg3p34", "author": "Purps-Meow", "body": "Wow!...just...wow."}, {"id": "dxg3u01", "author": "DaViSaBP", "body": "Well fuck, that was really good. Now i have to go work for 10hours hopefully i wont think aboht this "}, {"id": "dxg40e3", "author": "LethalDosing", "body": "really good read!"}, {"id": "dxg42ba", "author": "Shireman2017", "body": "bravo!"}, {"id": "dxg4584", "author": "Little_Ruskie", "body": "Awesome! Couldn't stop reading this. "}, {"id": "dxg49ok", "author": "Non_Existence", "body": "Great story. "}, {"id": "dxg4atj", "author": "Faunakat", "body": "Keep writing "}, {"id": "dxg4c46", "author": "ElephantSacks", "body": "Holy Hell, that was a god read. "}, {"id": "dxg4man", "author": "zairoxss", "body": "This story reminds me of the movie Man from Earth. Very well done."}, {"id": "dxg6hqo", "author": "CamrynSXD", "body": "Wow"}, {"id": "dxg6psr", "author": "amburrxmarie", "body": "This gave me goosebumps! This is so surreal!"}, {"id": "dxg6qj9", "author": "November87", "body": "Fantastic story as excellent writing"}, {"id": "dxg71iv", "author": "body-electric", "body": "Fucking brilliant "}, {"id": "dxg7y84", "author": "xXDibbs", "body": "I honestly wish I could've had the chance to meet and have a conversation with her.\n\nI think it'd be fun to talk to her about a lot of things."}, {"id": "dxg8k3n", "author": "malloryj7", "body": "Oh this was so good. Great writing OP . "}, {"id": "dxgawwx", "author": "reviyudustwonder", "body": "You get my upvote."}, {"id": "dxgb41o", "author": "themightyeek", "body": "Incredible story telling here! "}, {"id": "dxgbjnq", "author": "tdm17mn", "body": "Sequel please! Maybe one where they hook up... :D"}, {"id": "dxgc325", "author": "lil-miss-spharkle", "body": "Great story! "}, {"id": "dxgcod1", "author": "Athletekitty", "body": "Bravo! "}, {"id": "dxgdl6n", "author": "captaincracker45", "body": "Great story 10/10"}, {"id": "dxgdx2s", "author": "H10O", "body": "This read was an absolute thrill, thank you"}, {"id": "dxger0p", "author": "tygrebryte", "body": "Well told.  Thanks."}, {"id": "dxgf6e8", "author": "shinnie_mc", "body": "Just awesome. "}, {"id": "dxgffg5", "author": "officer174", "body": "God damn, this was good"}, {"id": "dxgh750", "author": "jessimomster", "body": "I actually quite liked this story! Thanks for writing/shareing it"}, {"id": "dxgh8ek", "author": "Bigboss831", "body": "Should have gotten her number "}, {"id": "dxgi0lx", "author": "Lefthandofjustice", "body": "This was incredible and I took a long ass smoke break to read it. Thank you!"}, {"id": "dxgij1l", "author": "jealous1stillnv", "body": "Easily the best story i have seen in a while. Absolutely loved it . Good job op"}, {"id": "dxgl8kz", "author": "knathman", "body": "So, if I up-vote, is that a point for God or for Lucy? \n\nGreat story. Write a book like this. "}, {"id": "dxglcvg", "author": "Drrnfbrgtts", "body": "I kept picturing Alaina Huffman from Supernatural (Abaddon) "}, {"id": "dxglmlx", "author": "bricksquad42015", "body": "This is an amazing story, thanks to Lucy for telling us this!"}, {"id": "dxgms0y", "author": "gylfmeister", "body": "Three gold! Definitely bookmarking this one for later."}, {"id": "dxgqzai", "author": "phantom_moonlight", "body": "I was glued to my screen the whole time - incredibly captivating. Love the way it's written, I had no trouble playing the story out in my head. Well done! "}, {"id": "dxgre22", "author": "NotBatman17", "body": "\n\nYou know what? \n\nThere's this book named: Bhagvat Geeta. \n\nIt's an ancient book, i somewhat read it. And in the book, i remember reading lord krishna describing heaven and hell. I didn't understand well, but according to me what he said was Earth is the hell. And now after i read this. I'm convinced, somewhat. "}, {"id": "dxgs0c2", "author": "themonstrumologist", "body": "holy fuck that was amazing"}, {"id": "dxgs4d0", "author": "HaydenGoz", "body": "Excellent story"}, {"id": "dxguih2", "author": "RumoCrytuf", "body": "Damn. That was far deeper than I had anticipated.  Well done."}, {"id": "dxgw8sy", "author": "kbsb0830", "body": "This was so good. These are the kind of Nosleep stories I love to read. Hope you're feeling better about things, Op"}, {"id": "dxgxqgs", "author": "qaiga", "body": "This made me think so hard. What a beautiful story. Thank you for sharing OP!"}, {"id": "dxgy3z6", "author": "jon_hobbit", "body": "This is awesome op.\n\nI would've loved to have a chance to talk and hear all the stories and all a bunch of questions. \n\nOp can't believe you let the devil walk out before you got her number lol"}, {"id": "dxgyy5m", "author": "spacetstacy", "body": "Great story!  I never thought of Lucifer as the Appletini type though. "}, {"id": "dxh07c0", "author": "OonicornsTARDIS", "body": "Was scrolling through my feed, and saw three guilds as I was scrolling, sighed, and was like, \"I should probably read this\"\n\nWorth it all the way"}, {"id": "dxh2zia", "author": "Reebirth", "body": "This story is..fk it im speechless bro.. captivating to say the least..well written and the story flow is very smooth down to the details. Makes you wonder.."}, {"id": "dxh3h1a", "author": "Desventure", "body": "Welp, there goes my weekly existential crisis. And it's only monday."}, {"id": "dxh5b2r", "author": "kingpenguinJG", "body": "I woulda tried to get the number   "}, {"id": "dxha5jj", "author": "daydrinkingwithbob", "body": "This is utterly fantastic!!"}, {"id": "dxhbeiz", "author": "Anti_Freak_Machine", "body": "Would love to see this as a short movie. Maybe starring Drew Barrymore as Lucifer."}, {"id": "dxhguzh", "author": "dildobuttface", "body": "Wait, so do you always get reincarnated as another human?  I actually think it would be pretty sweet to get reincarnated because you get to experience more of the world (even if you don’t remember it), but I’m a little disappointed that we don’t get a chance to be a bear or an eagle or something awesome like that. I wouldn’t even mind being something lame like a worm or something cuz I wouldn’t even remember it and if you’re reincarnated infinitely then you’re bound to get a few duds every once in a while lol.   Plus most of the lame stuff doesn’t live that long anyway and I bet there are some cool aspects of being a worm. \n"}, {"id": "dxhkzeg", "author": "Wishiwashome", "body": "Absolutely something special"}, {"id": "dxhov13", "author": "Liz72688", "body": "I feel like I just watched an episode of The Twilight Zone. "}, {"id": "dxhpbdu", "author": "Bed-Stuy", "body": "So we need to adopt the People = Shit motto and hate ourselves? Not trying to do the ole reincarnationaroo here and loop a bunch."}, {"id": "dxhtii7", "author": "birdyperch", "body": "The beginning was great!"}, {"id": "dxhuqka", "author": "BlueBlood75", "body": "I wonder what she meant by “stop seeing ourselves the way her father views himself” at the end. "}, {"id": "dxhv4yc", "author": "Corey307", "body": "Makes sense"}, {"id": "dxhxi6h", "author": "Faaresemo", "body": "Oh come on. You expect me to believe that Lucifer just waltzed up to you and engaged you in conversation? \n\nI've been trying to track Lucy down for years so I could congratulate her on everything she's done, and you meet her without even trying? Not even remotely fair."}, {"id": "dxi0vkp", "author": "alwystired", "body": "I agree with Lucy, at least in part, Earth as we know it is Hell, but I take it a step further in that I believe it to be Heaven as well. That’s just me though"}, {"id": "dxi3u54", "author": "gskill666", "body": "Only 1 word is needed here \"Epic\"."}, {"id": "dxi7dk0", "author": "lordofslam", "body": "Even as a Catholic that actually thinks outside of the box, I figured this out a while ago. I've had a hard time with, if what you say is true about the reincarnation aspect, bad people (child abusers, human traffickers, etc) \"getting theirs in the end\". As for the good people on this planet, I don't believe that they torture themselves...the actions of those around them do. \n\nIdk. Bunch of philosophy shit. At least we're #WOKE lmao"}, {"id": "dxi9mfr", "author": "streemline", "body": "It's not even debatable, this is a top 5 story on here, and better be a story of the year nomination.  Good lord, well done."}, {"id": "dxitjf6", "author": "undefinite_resonance", "body": "Ouch this one is gonna leave a mark."}, {"id": "dxjlmv5", "author": "iiMars", "body": "damn I think i’m in love \nkinda wanna meet the devil herself now "}, {"id": "dxk04mf", "author": "sparklymolamola", "body": "Quite enlightening, one of the top stories I've read on here. "}, {"id": "dxknp9z", "author": "inanna_ishtar", "body": "This make sense, especially the part where the abrahamic god supposedly tested the first humans about their free will. Since this god is supposedly all-knowing, he already knew that the \"prototypes\" will disobey him by eating from that tree of knowledge and life. Personally, this doesn't really make sense to me, I mean... If he already knew that that will happen, then why let the serpent stay in Eden? I love how the devil here provided a plausible explanation, because this god feared his own power, his own ability to know the right from wrong and etc, and had wished to share it to his \"prototypes\".\n\n\nThis is probably one of the best nosleep story I've read here! And I love the message, OP! Kudos!"}, {"id": "dxl5k4j", "author": "Hrothgar822", "body": "fuck"}, {"id": "dxlapjp", "author": "WhyThisJorgal", "body": "Ya know this is the best thing I have read in a while"}, {"id": "dxm2xqn", "author": "Meltini", "body": "Fuckin shit... I used to be a Christian and am not anymore but damn... this has given me a completely different viewpoint of everything. Holy shit. No sleep is right, just not in the typical scare the pants off you sense. It’s the existential crisis sense."}, {"id": "dxmm718", "author": "godsUNWANTEDchild", "body": "Great story OP. Puts a totally new perspective on the whole heaven and hell thing. Would definitely give a listen. "}, {"id": "dxmsyq2", "author": "Heywatsup0000", "body": "I loved this so much <3"}, {"id": "dxnba5a", "author": "rubadubadooo", "body": "Pure gold."}, {"id": "dxngj0m", "author": "MaliciousIntent21", "body": "I’ve always said that the real evil is here on earth and if there was a God he abandoned us a long time ago. \n\nThis was a great story, thank you OP. "}, {"id": "dxnv7wc", "author": "AlterRektMLG", "body": "Best this month"}, {"id": "dxo088l", "author": "PuppyButtts", "body": "I love this, thank you for sharing."}, {"id": "dxo7uqu", "author": "TraceurJosh", "body": "By far my favourite story in a looooong time, super well done!!"}, {"id": "dxoa6z6", "author": "hellothisisjade", "body": "Thank you thank you I wish more people would read this and take it as real advice, let’s change some shtuff!"}, {"id": "dxosgza", "author": "Priestess-ofthe-Veil", "body": "I’m enjoying all of the similar references/reads in the comments. Thank you all. \n\nAs far as the content: Even God [him]self, if you believe, is a pawn. There’s shit bigger than him, not that it matters for us any time soon. \n\nThis was a good read OP. "}, {"id": "dxp4dmm", "author": "Keyra13", "body": "Honestly I just kept thinking how fucked I'd be because I'd be agreeing with her and going \"huh, that makes sense\". Not to mention I'd probably be pretty interested in her. \n\nFantastic writing. Really makes you think."}, {"id": "dxpgy4a", "author": "MerkleMort", "body": "WOOF! Gimme more of this writer’s stuff!"}, {"id": "dxqivi6", "author": "Mespegg", "body": "Fuck me, this is incredible. Genuinely got increasingly anxious as I read and found myself really hoping it wasn’t real, which is a first for me on this sub! Beautifully written and wonderfully executed - and definitely has me doubting all of my red headed friends..."}, {"id": "dxs1v77", "author": "mooningful", "body": "probably the best story i read on this sub!!\n\nalso that kim jong un shade "}, {"id": "dxuvpak", "author": "harambe4life69", "body": "Wow. Great read, I love this so much. Thank you "}, {"id": "dxv23yi", "author": "GandyFace", "body": "Holy shit. This has blown up in the week since i saw it. And when i first read it, it only had 500 upvotes! \n\n(P. S. This is very good and im inclined to beleive Lucy's story) "}, {"id": "dxwtxi8", "author": "ChaosDestroyah01", "body": "I can’t begin to describe how captivating this was, first of all. \nSecond, you lucky bastard. I wish the devil would confide in me one night. "}, {"id": "dxypkoc", "author": "Parlayg0d", "body": "Sounds like she got away with $80 worth of drinks."}, {"id": "dxz97fs", "author": "Saracma", "body": "Maybe Lucy should try being a Queen."}, {"id": "dxzditj", "author": "-VelvetBat-", "body": "I pictured Lucy as Nancy from The Craft right from the beginning. "}, {"id": "dxzjdhw", "author": "hellgal", "body": "Well. Shit. This actually kind of reminds me of some of Anton Lavay's writing, a famous Satanist who actually founded the Church of Satanism.  I remember reading in a book somewhere (not one of Lavay's books, but a collection of articles on the paranormal and occult) that the Satanic Commandments involved a lot of stuff about being kind to others and treating animals with love and respect. Maybe Lucy had a nice long conversation with Anton. Though, he also talked about the importance of vengeance so maybe he didn't close enough."}, {"id": "dy1va5s", "author": "soullessghoul", "body": "Brilliant."}, {"id": "dy3bcx3", "author": "420LiiZzaaahr", "body": "\n\n\n\n\nLOOK I OOL\nOostenrijk \nOo a Pampisford\n\n\n\n\n\n\n1\nPppppp0p0pp0ppppppp0p0p\n"}, {"id": "dy3prnk", "author": "A_Reasonable_Man_98", "body": "Well, I don't think there's a point to browsing this sub anymore. This is more thought-provoking than the college philosophy class I just took the final for this morning. Better doesn't exist."}, {"id": "dy4urp5", "author": "_casketpretty", "body": "Hail Satan. Hail yourselves."}, {"id": "dy5s8ri", "author": "spiderfalls", "body": "Oh geez,  this gave me the chills....  head to toe goose bumps!"}, {"id": "dy6tq1s", "author": "scarlettbagels", "body": "Incredibly well written "}, {"id": "dy9sh22", "author": "kenie12", "body": "Why am I crying.. I am uncomfortable."}, {"id": "dybwva6", "author": "RooR_", "body": "Should have taken her home"}, {"id": "dycm6no", "author": "ZorroShrimp826", "body": "THATS MY BESTFRIEND RIGHT THERE \nSLAAAAAAAAY."}, {"id": "dydtokn", "author": "kurama3", "body": "OP was just super drunk and was talking to himself"}, {"id": "dyf9dj1", "author": "saviourQQ", "body": "Did you get her number? Sounds like wonderful company. "}, {"id": "dyijl4s", "author": "AlvinGT3RS", "body": "Truuuu"}, {"id": "dyl2fog", "author": "Zirocrath", "body": "Anyone else thought this would'd been an amazing story in the comic Sandman?"}, {"id": "dyle7w1", "author": "nicbrit93", "body": "TIL I slept with the devil "}, {"id": "dytiqbx", "author": "tjshaffe", "body": "To put it simply \\- this was one fantastic read.  Cheers! "}, {"id": "dz1aa22", "author": "Dondon1927", "body": "You need to write a book"}, {"id": "dze4rv1", "author": "Shockedimpy", "body": "Very well written, I enjoyed your story"}, {"id": "dzgmrz8", "author": "sp00c3", "body": "Im going to start going to the bar now"}, {"id": "dzvgdxh", "author": "pockrasta", "body": "Best story I've heard in a while. Truly fucking good. Although I had supernatural vibes all along."}, {"id": "e02pa24", "author": "angeldustprincess", "body": "I'm fucking shook "}, {"id": "e04zxda", "author": "masqueradee", "body": "This was amazing. Thank you. "}, {"id": "e0eri9q", "author": "Kelseylyon95", "body": "."}]}