{"id": "8kalgj", "title": "I found an extremely bizarre internet survey", "url": "https://www.reddit.com/r/nosleep/comments/8kalgj/i_found_an_extremely_bizarre_internet_survey/", "subreddit": "nosleep", "author": "Mr_Outlaw_", "text": "Nobody knows what rock bottom truly is until they've hit it. \n\nBeing abruptly fired from a job you've worked at for the past ten years, and then catching your girl cheating on you with your replacement really makes a man think. \n\nHell, *my student loans aren't even paid off yet*.\n\nWhat a shitshow this life is. \n\nAfter a rather boozy night that consisted of sending out about four dozen resumes and horrendously written cover letters, I passed out. \n\nWhen I woke up the next morning, I decided to at least *try* and make some money at home while waiting for an interview. \n\nAt that moment, I thought that the best way to go about it was completing those internet surveys that yielded 5 dollar subway gift cards and other shit like that after about an hour of answering questions. I mean, I didn't have any other marketable skills that could've yielded immediate income. \n\nIt was either that or wasting the day away playing computer games. At least I wouldn't have to pay for food. \n\nI did these surveys for about 5 hours before nearly passing out. It was way more excruciating then I'd originally anticipated. At the end of those 5 hours, I'd accumulated about $45 in cash and gift cards. \n\n$9 an hour. Not like I was making much more than that before. I was about to close my laptop up for the day and head to a bar in an attempt drown out my melancholy when I first saw it. \n\nIt shouldn't even have been noticeable... but for one reason or another, it was. At the bottom corner of the website that I was on, existed a tiny, singular advertisement. Maybe it was the simplicity that got me. Plain black letters in a tacky font that read \"Surveys for cash\" overlapped a completely white background. \n\nAt least they were direct with the message. *One more couldn't hurt*, I thought. Might as well scrape together a little bit more booze money before heading out.  \n\nI sat back down, clicked on the picture link and prepared myself to grind through some more painstaking inquires. The first few questions were simple enough. I guess they weren't really questions, but more data collection. My name, age and occupation. I thought it was kind of weird that they also asked my height and weight, but it wasn't unheard of. \n\nThe first **real** question was a different story though. I must have stared at it, eyes wide and mouth agape, for god knows how long. \n\n*What the actual hell?*\n\nIn plain English, this is what popped up on my screen: \"How strong is your urge to currently look behind you?\" \n\nThere were five options below, ranging from \"Not at all\" to \"overwhelming\". \n\nThere was no feasible reason why I should've been afraid at that moment. *But I was*. I tightened my breathing, trying to make out any subtle noises behind me. There were none. After maybe about five minutes, I worked up the courage to look. There was nothing. I sighed in relief and scoffed at myself at the same time. \n\nThis must have been some kind of joke. However, I decided to entertain it, answering \"neutral\" and clicking onto the next question. This is what it read: \"Why would you look behind you?\" \n\nI smirked. *Funny*, before simply typing in a \"I don't know\" in the response box and once again clicking next. This was the 3rd question: \"You're on a plane. Apart from you, there is only one other passenger, who is sitting somewhere behind you. At some point, you get up to go to the washroom, and find that the man is gone. You check to see if he is in the only bathroom on the plane, but he isn't. What do you do?\"\n\nAgain, I must have stupidly stared at it for nearly ten minutes. Was this some kind of obscure personality test? I mean, it must have been, right? *Right?* \n\nI put the same answer that I used for the last question: \"I don't know.\" It was true. I didn't know. How was I *supposed to* answer this shit? \n\nI click next again, now more intrigued than anything. The 4th question went like this: \"You wake up in woods unfamiliar to you. It's nighttime, and the moonlight provides you with only slight visibility. About thirty feet away from you, there is a small, dimly illuminated cabin. The door is open, and a smiling woman is motioning for you to come in. Do you go? Explain why.\" \n\nThis question wasn't necessarily weirder than the last one, so my conjecture that this was some kind of odd personality test was still feasible. I actually make an attempt to answer this one, something along the lines of going into the cabin because there's simply nowhere else to go. \n\nOnce again, I click next. Probably shouldn't have. \n\nThe questions started getting *fucked up*. They weren't too gory or explicit, not anything like that. They were just stranger. Weirder. More psychologically disturbing. If you're wondering why the hell I kept going, I can't really give you an explicit answer to that. I just felt like I *had to*. It was an esoteric, creeping sensation that I can't quite explain away. But I could never shake it. So I just went on. \n\nSome of the questions that stood out were:\n\n\"Suppose that you wake up one night to find an elevator in your house. During every midnight after that, it opens up for five minutes, revealing an exact copy of yourself that gets progressively more injured as time goes on. Do you keep living like this? Or do you enter the elevator once and end it all?\"\n\nAnd:\n\n\"You're in a hotel room but are awoken by a rapid knocking at your window. You peek through the blinds, seeing what appears to be a man missing both his eyes. He puts his mouth to the glass and tells you to kill the woman in the bathroom immediately. Do you listen to him?\" \n\nThis was one of my least favorites:\n\n\"You are watching home videos with your mother. One of the tapes include footage of her being murdered by a masked intruder. Your mother simply laughs at this footage without saying anything. In your opinion, is this a cause for concern?\" \n\nIn addition to this insanity-inducing shit, there were some rather disconcerting events happening in *real life* as well. I received a knock at the door about thirty minutes in. I looked through my peephole to find a guy standing there, frantically shaking his head and mouthing \"no\" while making direct eye contact with me. He looked terrified. Obviously, I didn't open up. \n\nI received about ten phone calls from somebody named \"the auditor\" on my caller ID. They left a message every time, but each one was just a recording that consisted of somebody saying numbers through heavy static. Actually, it sounded more like *screaming* now that I think about it.\n\nAbout an hour into this thing, and I was on the verge of a mental breakdown. I was petrified of looking behind me, even though there was no indication that anything should've been there. I heard some soft scratching coming from my vent at one point, so I moved my couch over it. \n\nEventually, I reached what appeared to be the end of the survey. However, it wasn't a question. It was simply a statement. \n\n\"Don't let them in. They're not to be trusted.\" \n\nAlmost as if it were on cue, I heard more knocking at my door about five seconds after reading this. As slowly and silently as I could, I moved over and looked through the peephole once again. It was a different person than the one I'd seen earlier. She was a woman, looking to be in her mid twenties. She was wearing a thick blazer, despite it being around 90 Fahrenheit outside. She was also wearing sunglasses, so I could never really tell where she was actually looking. She eventually took a piece of paper out of her pocket and slipped it under the door. \n\nI look down and read it. \n\n\"It's lying. Leave your apartment immediately.\" \n\nIt's been about half an hour since. I can't bring myself to look at the computer screen nor at the woman outside. She's still there. I can see the shadows of her feet from underneath my door. I heard my bedroom window open a few minutes ago, but I've since jammed the door shut with a chair. I can hear some kind of distorted muttering coming from behind it now. \n\nMaybe rock bottom wasn't so bad. \n\n*But what the fuck am I supposed to do here?* ", "comments": [{"id": "dz669q6", "author": "podcon", "body": "I don't know."}, {"id": "dz6b7by", "author": "falconinthedive", "body": "Did they give you a referral link? I could use some extra cash."}, {"id": "dz6b7qr", "author": "AutumnMDove", "body": "That's a tough one to answer. I wouldn't trust opening the door to a complete stranger, and I also wouldn't trust staying in my place if I was hearing or seeing a bunch of weird stuff. Is there a friend that you can call or text and ask them to come over? Otherwise, I have absolutely no clue as to what you should do. I'm sorry that I'm not of much help to you. Please keep us posted so that we know you're alright."}, {"id": "dz66whr", "author": "diacritcal_ly", "body": "The first question was enough to send me chills... And I'm reading it in my well lit room 🙃"}, {"id": "dz6hvp0", "author": "Sahris", "body": "9 dollars an hour doing surveys is the most unbelievable part. "}, {"id": "dz6gjv8", "author": "ToxicVigil", "body": "Well, I mean. The survey doesn’t say “Don’t talk to them”, only “don’t let them in”. Maybe ask her a couple questions, see what she says."}, {"id": "dz66hjf", "author": "Clarkinator69", "body": "Welp, I regret reading this at 1 AM. Dammit man, don't torment me with your situation. Good luck man, don't have any actual advice on what you should do."}, {"id": "dz66ae2", "author": "MrsMarik", "body": "That was intense."}, {"id": "dz67kgw", "author": "Jalen2612", "body": "I'd love to see a story about that elevator question. Sounds cool"}, {"id": "dz66g5f", "author": "GreyishBlue", "body": "Would you like to continue on to the next question?"}, {"id": "dz6e0i8", "author": "Interteen", "body": "Maybe the point of the survey is to make sure you stay inside and go insane and these people have survived that and are actually trying to help you, it explains why that guy was mouthing \"no\". He was telling you to stop the survey so you wouldn't listen to it."}, {"id": "dz6b7o9", "author": "randomfaerie", "body": "How much did they pay you to do this survey?"}, {"id": "dz6oh3o", "author": "Motohead1738", "body": "The real question is ***how much in subway gift cards did it give you?***"}, {"id": "dz67p4f", "author": "Redstonespock", "body": "Don’t trust anyone; get a knife and run to the closest hospital or police station, or really anywhere with a bunch of people."}, {"id": "dz6gws6", "author": "OmManiMantra", "body": "Well, shit, OP. It looks like you failed the Voight-Kampff test, and now they’re testing you further. The noises on your phone, the scratching in the vent, the woman with thick clothing, etc., all of it has been set up in such a way to disturb your programming or provoke a certain reaction based on your implanted memories. I would suggest acting as human as you can in this scenario: don’t let anyone in."}, {"id": "dz6awzl", "author": "SpongegirlCS", "body": "Open the door and throw your computer at the woman and run!"}, {"id": "dz6bzst", "author": "butterdaisies", "body": "This reminds me of the “I heard it too” story"}, {"id": "dz6by2j", "author": "KingdomOfPurpleKush", "body": "I have a feeling the \"people\" attempting to contact you aren't entirely human. I would stay put until sunrise. If they're still there, they likely are just people... but that doesn't mean they're guaranteed to treat you well."}, {"id": "dz6heyk", "author": "AdjustedMold97", "body": "“Don’t let them in, they are not to be trusted.” Sounds like the title of something from /r/surrealmemes"}, {"id": "dz6gzl3", "author": "golden_xxd", "body": "I’m in America, we have guns. Shoot the laptop, shoot the vent, shoot her through the door, maybe shoot yourself!"}, {"id": "dz6sapv", "author": "nazderovya", "body": "I’d recommend looking behind yourself immediately. I just did and there’s a cat sitting there staring at me. I don’t have a cat. "}, {"id": "dz789oa", "author": "Maigerz", "body": "45$ in one day doing surveys is the most mysterious part of this story. If you survive this you gotta spill what survey sites you're using."}, {"id": "dz6avr8", "author": "Jamaican_Dynamite", "body": "I need a part 2."}, {"id": "dz6haju", "author": "rouetter1", "body": "Send the survey link to your cheating ex. Hope there's a part 2"}, {"id": "dz6c5s9", "author": "Deadbreeze", "body": "Call the police. They surely can be trusted. Have them escort you out of the house and check the bathroom. This is some SCARY shit even for /r/nosleep. Wish I had some better advice."}, {"id": "dz6lpj2", "author": "Seascourge", "body": "This is some SCP-001 shit\n\nNope the fuck out of there"}, {"id": "dz7gsft", "author": "DarkSIDEofMEDICINE", "body": "Step one... Get naked. No one wants to fight the naked guy. "}, {"id": "dz686cn", "author": "Firebrand777", "body": "Wow - that was terrifying! Please update "}, {"id": "dz6pfgf", "author": "koala-balla", "body": "I'm so sorry for your situation OP, but it makes an amazing story. It's a welcome change of pace from spiders laying eggs on/in people or skinwalkers. These situations where you don't know what you would do and feel like you're damned either way scare me beyond belief. They're so unprecedented and there really does not seem to be a correct course of action. I love that. Thanks for sharing. "}, {"id": "dz6atu6", "author": "Ashizard1", "body": "God dammit man! Call the police! There are people in your house! "}, {"id": "dz7fbrt", "author": "jtjmorris", "body": "This needs to be a 'Choose Your Own Adventure' book because I want to know how each scenario ends!! "}, {"id": "dz6ijm7", "author": "Doubterino", "body": "Did you get paid though?"}, {"id": "dz6ak3v", "author": "magiccaster619", "body": "Those internet stories are the best."}, {"id": "dz6aqoi", "author": "slut4pancakes", "body": "i got the chills"}, {"id": "dz6aynf", "author": "kadenjahusk", "body": "Phenomenal. Well done."}, {"id": "dz6bj7i", "author": "MamaDragonfly19720", "body": "This is incredibly good! I am creeped out but laughed out loud, literally on several occasions as you are articulate in describing your emotions and reactions to a comedic point. I love it! "}, {"id": "dz68hxf", "author": "DangerousAndStubborn", "body": "Truly distributing"}, {"id": "dz6cdqh", "author": "kungfuryking", "body": "call police, if someones broken into ur room and u've barried it with a chair, scatter random shit on the floor that'll mess up their footing if they get through. aka an obstacle course of random stuff. \nSaw some said get a knife, useful if u know how to use it. better to get projectiles weapons or a bunch of crap u can throw aka wrap up forks, spoons, butter knives etc in a tea towl they get  closish throw it holding onto one edge so it slingshots it, then pick up chair use it to pin then against wall or escape while throwing other projectiles, plates, pans etc. keep the knives for if they have one too. also stash a small sheafed one at the side of ur sock, ether in ur shoe or not. \nu have means to communicate with both sides. write notes with the chick, and to the questionaire dude. ether way seems outsides fucked, random person shows up.shaking head saying no and random phone calls could b a result of those who opened the door seeing as its easier to trust something physically in front of u eg the woman oppose to someone typing on the screen in what ever location.\n\nedit: put salt around windows and doors. and keep some in ur pocket as well as something iron. Just cause. Weird shit. Better safe then sorry.lol"}, {"id": "dz6c75o", "author": "Roboticized", "body": "Don't trust either. Try to leave your apartment in some kind of alternative way. Perhaps a window if possible."}, {"id": "dz6c9vq", "author": "Near_Death_Defier", "body": "Nope nope nope no more kinky surveys..."}, {"id": "dz6fy46", "author": "Jintess", "body": "Sounds to me like you encountered a bitter writer from the \"Choose your own Adventure\" series.\n\nYou should have answered \"I turn to page 27\", \"I turned to 123\" and \"I knew that the man to look out for, the one with gray hair would be the one holding a gray rabbit.  I then chose the door to my left.\"\n\nOr just look at it as a chess game. You good at chess?"}, {"id": "dz8c2nk", "author": "wasiflu", "body": " Nice one mate. It looks like it's spreading.  \n\n[https://www.reddit.com/r/WritingPrompts/comments/8ki4fl/wp\\_an\\_elevator\\_suddenly\\_appears\\_in\\_your\\_one\\_story/](https://www.reddit.com/r/WritingPrompts/comments/8ki4fl/wp_an_elevator_suddenly_appears_in_your_one_story/) "}, {"id": "e0h7sjv", "author": "cracklin_oats", "body": "You have to be as weird or weirder then the survey. Get naked and crouch into a backwards crab walk. Then hobble out towards the woman like the girl from the exorcist, calmly saying “I don’t know,” with your eyes rolled back into your head. \n\nThis will be more bizarre then anything from the survey and will scare away the baddies. \n\nOnce you’ve scared them away, get dressed and go to the bar as planned! \n\nRinse and repeat if necessary."}, {"id": "dz6bijy", "author": "peaceful_goose", "body": "Why didn’t you call the police?"}, {"id": "dz6ch6z", "author": "Thtguy1289_NY", "body": "You gotta do a part two man"}, {"id": "dz6cl87", "author": "wickedmoonchild", "body": "Could you climb out of a window? Tbh, I would just run to a bar with lots of people and not leave with anyone. Maybe crash with a buddy?"}, {"id": "dz6ionj", "author": "Hook_me_up", "body": "do the naked man. if you got to go down, might as well do it big time"}, {"id": "dz6twra", "author": "FrangarOtFlectar", "body": "They are ALL lying.\n\nI'd wait to the dawn, with some weapon in yr hand \\(a knife, a bar\\).\n\nKeep on, mate. It's only time."}, {"id": "dz75fg5", "author": "kkarloff", "body": "MTurk is getting wild "}, {"id": "dz7yke0", "author": "EyesoftheObsidian", "body": "We preserved the ancient rituals to observe tradition, but man built new ways. And we took them. Online rites caught new sacrifices to our gods, and called different followers over to our side. \nAnd it seems we are not the only ones summoning that which lies beyond."}, {"id": "dzbus7w", "author": "susieq2277", "body": "Middle of the night, dark room and I am freaked out!!! I'm trying not to be so loud calling for my kitty lol"}, {"id": "dzmtoye", "author": "Paanmasala", "body": "OP, order a pizza to your house and while the lady in the jacket is busy eating the delivery guy's heart, make a run for it. "}, {"id": "dzsip3f", "author": "SaintT0ad", "body": "> Hell, my student loans aren't even paid off yet.\n\n\nWait, how low are your student loans that you have hopes of paying them off someday??"}, {"id": "e0jcw6e", "author": "sashilu", "body": "Start doing a silly dance. Or a penguin walk. Imagine getting murdered while you're doing that. At the very least, it'll diffuse the tension "}, {"id": "dz66vmz", "author": "Jonny_Boy_HS", "body": "Freaking awesome and terrifying...grab a knife and run to the nearest police department."}, {"id": "dz6pswp", "author": "My_Ex_Got_Fat", "body": "Delete facebook, hit the gym, become a lawyer."}, {"id": "dz6q6hh", "author": "NoOneReadsMyUsername", "body": "As someone who works in Marketing Research, most of the time surveys are targeted towards a certain sample. It looks like whoever dreamed up that nightmare fuel was in search of someone just like you for their study."}, {"id": "dz6cq7s", "author": "streemline", "body": "Chills... hope there's more"}, {"id": "dz6dj4j", "author": "SlavioAraragi", "body": "Open the door. What else you can lose? Open the door and ask the woman \\o/ If you'll survive, tell us what happened!"}, {"id": "dz6eqkd", "author": "TheoWren", "body": "Call the cops.  Call somebody you know."}, {"id": "dz6ew67", "author": "kbsb0830", "body": "Leave. Obviously, something in the house is trying to hurt you. Have you tried 911?"}, {"id": "dz6f5xv", "author": "Riku4441", "body": "One of the better stories on here. "}, {"id": "dz6l211", "author": "SnowMercy", "body": "This dude is either dead or on his way to winning a Bram Stoker Award. \n\nEither way it's outta our hands. "}, {"id": "dz6llph", "author": "s8nb8cn", "body": "WHY IS THIS NOT A SERIES AHHH"}, {"id": "dz6luht", "author": "yellowdogparty", "body": "This could make an interesting short film."}, {"id": "dz6non5", "author": "franigoose", "body": "Yikes, good one"}, {"id": "dz6nz86", "author": "cakes42", "body": "Well.. this is why I keep a 1911 by my side."}, {"id": "dz6oacj", "author": "action_jim", "body": "Well how much did you get paid?"}, {"id": "dz6pknx", "author": "thefinalep", "body": "Please update us. The person at your door probably targeted you for the survey, so stay inside for now. Find something to protect yourself with and keep your back against the wall. Whatever you do DON'T look behind you."}, {"id": "dz6qtcr", "author": "Razerblaze007", "body": "read it as \"extremely bizarre blizzard internet survey\"\ni been playing OW too much"}, {"id": "dz6sg8a", "author": "IDrawRandomActs", "body": "Hey you should really just check out /r/beermoney or /r/HITSworthturkingfor or something if you're still alive."}, {"id": "dz6w75e", "author": "HeadScrewedOnWrong", "body": "Answer another survey and make money"}, {"id": "dz6zkg0", "author": "goldarks", "body": "I read this at bed with the lights closed. The first question made me get up from bed to turn on the lights. Didn't expect the story to be this unnerving."}, {"id": "dz7g6sq", "author": "creepygirl420", "body": "Damn you really fucked up. What if your computer has a virus or something now?? "}, {"id": "dz7nhmr", "author": "TheDeadBacon", "body": "Reading this and hearing just a slight noise from somewhere I can’t see is making me reconsider if reading stuff on here when I’m unable to sleep is the healthiest of habits"}, {"id": "dz7wj79", "author": "chucklesbtoken2", "body": "Im scared to do or not do anything right now. \n\n...we need more blankets and less blankets"}, {"id": "dz7xzmj", "author": "guy6061", "body": "Let both of them in at the same time and watch them duke it out."}, {"id": "dz7yznb", "author": "soverignkikikakes", "body": "I hope one of them paid you"}, {"id": "dz88fsm", "author": "Some_Random_Canadian", "body": "They're likely both a part of the same entity, and the choice you make will be inconsequential. Simply another answer to a more \"involved\" question. "}, {"id": "dz9s63a", "author": "tsuyaha", "body": "Holy crap OP, it's 1 am and I'm reading this in my room alone and now I'm super paranoid.  This gave me chills.  Good job and good luck."}, {"id": "dzacdyw", "author": "LocalApocalypse", "body": "Flip a coin and pray."}, {"id": "dzapd7l", "author": "Legelid1", "body": "Holy lord, this captivated me. Good job man. "}, {"id": "dzxjvkb", "author": "godspeed25", "body": "For fucks sake the hotel housekeeping rang the doorbell as soon as i finished reading this"}, {"id": "e2tjyzt", "author": "kekimdead", "body": "You got a gun? A knife? Defend yourself man."}, {"id": "e8kozoq", "author": "-Ryu-", "body": "i would say trust the computer. while yes some of the questions were pretty fucking weird, it feels like they're just looking for people to recruit. "}, {"id": "dzmzvpv", "author": "xRobert1016x", "body": "/r/tittydrop"}, {"id": "dz6od8d", "author": "cornbredrooster", "body": "What in the actual fuck... This feels like it should be part of r/writingprompts..."}, {"id": "dz66g3o", "author": "lucasramosp", "body": "Stop thinking so much, just kill the woman at the bathroom NOW!!!\n\nBefore she gets to you."}, {"id": "dz66j7a", "author": "iHeartCandicePatton", "body": "You started applying for jobs the same night? Ever heard of relaxing bud?"}, {"id": "dz6bcmj", "author": "Whizzie17", "body": "My advice:\nUnblock the Vent, and if somebody tries coming in, grab the nearest weapon, and try to knock them out.\nThrow the body outside, and block the window again.\nGet in the Vent, and try to lure whoever is outside of your room into the Vent.\nOnce they get in there, block the Vent again, and carefully open the door with a weapon ready.\nIf there is somebody outside, try your damn hardest to knock them out, or get back in your room and block the door again.\nIf there isn't anybody there, run through the door, and leap out of a window, then try to run away.\nIf there was a person outside your room, and you hid in your room again..\n\nThen you're screwed."}, {"id": "dz6budl", "author": "Inevitableq", "body": "Hmm"}, {"id": "dz6cfhp", "author": "Andrju9", "body": "Interesting story"}, {"id": "dz6d3oq", "author": "Loyfe_", "body": "I love stories like this, gives me the chills especially when it's late at night."}, {"id": "dz6dgj7", "author": "mrcanard", "body": "You responded to, \"Surveys for cash\". So find out how to get paid. "}, {"id": "dz6djez", "author": "Prince_pepe", "body": "Go to the kitchen, arm your self with a knife, if you have access to  broom or mop make a spear, head for the door and GTFO."}, {"id": "dz6exux", "author": "ryanlak1234", "body": "Am I the only one who's hiding in the comment section?"}, {"id": "dz6jfqz", "author": "balexo09", "body": "Fantastic "}, {"id": "dz6jt8m", "author": "doKtor_SpoOky", "body": "Go have a beer. I'd leave seeing as uninvited people have entered your home through your bedroom window. I'd get out. "}, {"id": "dz6kpp0", "author": "zeeeeeeeeemu", "body": "Call the police"}, {"id": "dz6kt74", "author": "vikegirl", "body": "Damn dude. I think we are gonna need a part 2 to this just to see what you decided to do, lol. And thanks a lot for making me paranoid. Now I keep looking behind me and expecting a guy with no eyes to be there."}, {"id": "dz6kwfj", "author": "joelles26", "body": "Wow very nicely written"}, {"id": "dz6l83u", "author": "normysWH", "body": "Give the laptop to the women outside "}, {"id": "dz6lqdi", "author": "everymonthnewaccount", "body": ">After maybe about five minutes, I worked up the courage to look.\n\nFIVE minutes? Damn dude, you scare easily. "}, {"id": "dz6lu48", "author": "randomstupidnanasnme", "body": "Neutral"}, {"id": "dz6mmf8", "author": "SupremeMemeCreamTeam", "body": "First off, get a weapon, especially if there's something in your bedroom, secondly, listen to everybody else and get someone over to you, hopefully to scare off the stranger so you can leave safely."}, {"id": "dz6mzg5", "author": "Mypoorfeet", "body": "Maybe u just need sleep? Put down that brownie and sleep....."}, {"id": "dz6n37f", "author": "12345thrw", "body": "If I were you I would leave"}, {"id": "dz6qwa9", "author": "TheOneTrueClyte", "body": "I suggest a few things, considering she isn't speaking and the thing in your room, I suggest if shes close enough slamming the door into her or tricking her, before getting the hell out if you have a vehicle."}, {"id": "dz6rp9e", "author": "KabeeCarby", "body": "More please! 😁"}, {"id": "dz6un94", "author": "xRyozuo", "body": "This sub is the best when you get engrossed in the story without knowing what sub you're on"}, {"id": "dz6urnf", "author": "CakeMagic", "body": "If i was in the situation, I'd stay in my room and perhaps slip a note back and ask why I should leave. What's inside the room shouldn't pose any threat. \n\nMore importantly, did you get the money from the survey?"}, {"id": "dz6wahx", "author": "biotox1n", "body": "What do you have to live for? You haven't hit bottom yet or you'd be ready for anything. It's only when you have nothing left you're free to do anything. I hit bottom once and though I've been climbing since I still can't see the light"}, {"id": "dz6wm61", "author": "Santapappa", "body": "Damn. I usually don't find the stories here that creepy but this was actually scary. Good job."}, {"id": "dz6wz8d", "author": "TheSneakyTurtle225", "body": "Part 2! Please!"}, {"id": "dz6x7jb", "author": "chewbubbIegumkickass", "body": "This wigged me out. I'm sitting with my back against a wall, and I still had the urge to look behind me."}, {"id": "dz6x91j", "author": "ethanlan", "body": "Fucking call the police jesus man.\n\nAlthough its probably to late now."}, {"id": "dz6xtfm", "author": "super_glue_", "body": "Call the police."}, {"id": "dz6yzhv", "author": "GilloGillo", "body": "If that is actually true it is probably a survey set up by the secret service to find people who could work for them..."}, {"id": "dz6zs9x", "author": "jthm1978", "body": "Personally, I'd open the door with my gun trained on the woman, ready to blast her at the first sign of something hinky.. If a .45 won't put her down, I'm probably screwed anyway, and at least I may get some answers before the end\n\nIf you don't own a gun, I would suggest a knife or blunt instrument. You gotta figure out what's going on somehow, and that seems like as good an option as any"}, {"id": "dz718go", "author": "AnimeDreama", "body": "*Get the FUCK out of there right now."}, {"id": "dz73wn3", "author": "DarthGiorgi", "body": "Introduce them to your \"little friend\". Whichever you have."}, {"id": "dz74dtm", "author": "chiefyuls", "body": "ALWAYS READ THE PRIVACY POLICY"}, {"id": "dz75ce1", "author": "eViLegion", "body": "As creepy as this is, I still find it less unnerving than being approached in the street by an optimistic looking person wielding a clipboard."}, {"id": "dz77zp1", "author": "btcftw1", "body": "This is bloody brilliant! Chills for days man\n\n"}, {"id": "dz7b29w", "author": "MCBYT", "body": "Stay inside. It's the old switcharoo, both are the same group/person and they are trying to persuade you outside by making you distrust the survey."}, {"id": "dz7b73s", "author": "aseret1961", "body": "It’s 3:34pm for me and I’m having a blast reading y’alls comments!😂😂😂 Keep ‘me coming! No, really, you guys are making my day!"}, {"id": "dz7bqp1", "author": "idontEATmyownshit", "body": "Call the fuckin police that's what I'd do. Also grab the nearest weapon and prepare to beat the shit out of whatever's behind your bedroom door"}, {"id": "dz7btks", "author": "alesci89", "body": "This is a great story! really get my heart pumping and my bum clenching"}, {"id": "dz7ea0k", "author": "LunarBahamut", "body": "Call the cops, call family and friends, ask the woman through your door who she is and how she knows the survey is lying. Come on dude you can at least try out some stuff."}, {"id": "dz7ewj6", "author": "popkornking", "body": "Honestly I would listen to the survey. What's the worst that could happen if you don't leave? As for the people outside how did they know where to find you and if they wanted you to come out why is one of them in your room now? The survey site honestly seems like the more trustworthy source IMO."}, {"id": "dz7fbs2", "author": "fiveminutedoctor", "body": "I thought I was on r/tooafraidtoask for some reason. I just read this whole fucking thing thinking it was real and someone was afraid to ask what to do next. You would not believe the sigh of relief I had when I realized I was on r/nosleep. Jesus. And I'm listening to some spacey avant-garde jazz and that certainly didn't help with the situation. "}, {"id": "dz7g1l6", "author": "Wikkerwoman11", "body": "How much did you get paid for this shit?"}, {"id": "dz7gco5", "author": "Bufonite", "body": "If they get inside, can you leave me your subway giftcards in your will? Thanks pal"}, {"id": "dz7gds3", "author": "MadMagnum69", "body": "I need to stop reading nosleep at night"}, {"id": "dz7glwe", "author": "mcsoups", "body": " Those questions are the exact thing I would ask my friends to weird  them out. Really creative. "}, {"id": "dz7h2y3", "author": "Gspecht0", "body": "If the woman is still outside your door just push her aside and go out drinking as planned. This is no joke, exactly what I would do"}, {"id": "dz7h75s", "author": "thundercool", "body": "You slide a piece of paper back under the door that asks for her name, age, occupation, height, and weight.\n\nThen, you make their game your game."}, {"id": "dz7istq", "author": "LiarFires", "body": "Haven't read such a creepy story in a LONG time. Stay safe."}, {"id": "dz7iyia", "author": "Passoa26", "body": "But did you get paid?"}, {"id": "dz7jbko", "author": "MattDLR", "body": "This would actually make a decent creepy video game."}, {"id": "dz7jvog", "author": "winchester9191", "body": "Oh please write a part 2! I need to know what's happening!!! "}, {"id": "dz7kh7y", "author": "Electricspiral", "body": "I wonder if the survey was put out by an entity attempting to induce fear to feed on? It's not an obvious connection, but think about it- most of the answers you told us you gave were really indecisive. Now you have been forced to make a decision directly concerning your safety. You're presumably freaked out and trying to make a decision, which the entity knows you are going to stress out about."}, {"id": "dz7oda8", "author": "Aqyntic", "body": "Look. Behind. You. OP. Their making you not look behind you so they can snatch you without you noticing them. "}, {"id": "dz7ov8a", "author": "WaxToest", "body": "Jeez you're already going through enough and you don't need this shit. I hope you get through this OP."}, {"id": "dz7phbc", "author": "Redstonespock", "body": "Most people have a kitchen knife, but most don’t have a gun. If you have a shotgun though, that is define you important."}, {"id": "dz7r7bd", "author": "dulcetdecorum", "body": "Oh man, this scares the shit out of me. OP seems to be habiting a realm of existence similar to the one that the main character in \"1408\" temporarily inhabits (the numbers screamed through static clinched it for me). \n\nThat character needed to set himself on fire to figure out what was real. Let's it doesn't come to that. Best of luck , OP. "}, {"id": "dz7w5ld", "author": "Chikenwangman", "body": "OP UPDATEEE"}, {"id": "dz7w7e3", "author": "winchester9191", "body": "Wow. A whole new level of fuckery. I would skip the country. "}, {"id": "dz7wext", "author": "Twohip4school", "body": "Always a great read when the outlaw comes to town, cheers!"}, {"id": "dz810zl", "author": "hollyfosho", "body": "Could you possibly communicate with the woman? Write her a note back?"}, {"id": "dz88hkk", "author": "KiraKiralina", "body": "Call an ambulance. Tell them you're experiencing a psychotic break and then start telling the truth."}, {"id": "dz88hzj", "author": "aga080", "body": "Kill Bill. "}, {"id": "dz8bdrv", "author": "DrCreepenVanPasta", "body": "What disturbs me so much is that none of this makes any sense at all."}, {"id": "dz8c8qc", "author": "Heavenli", "body": "Wish I could find a survey like that. Nothing scares me,ever, but I reckon this would."}, {"id": "dz8eb8g", "author": "RoasterHD", "body": "i really hope you make a part 2! :D"}, {"id": "dz8o1sp", "author": "TheHighblood_HS", "body": "Man that’s a pretty spooky situation! I hope you update us if you don’t get killed, or worse!"}, {"id": "dz905dk", "author": "piromin", "body": "The test is still going on... only... it's real now."}, {"id": "dz958e4", "author": "harryagamez", "body": "This is a perfect example of psychological terror. It's not gory, nor diabolical. It's just... Fucked up, weird, creepy. Congratulations."}, {"id": "dzbilgw", "author": "Joohyunnie", "body": "Ask the lady is she likes raison or chocolate chip cookies. If she chooses raisin, RUNNNNN"}, {"id": "dzchmy6", "author": "Smith12456389", "body": "I have a sudden urge to turn around"}, {"id": "dzd8148", "author": "corazontex", "body": "This...is what I come to nosleep for. Thanks!"}, {"id": "dzdcb24", "author": "slukenz", "body": "Welp, deleting my Amazon Turk account now"}, {"id": "dzdge0g", "author": "Number1HandsyBoy", "body": "bash your neighbors wall in and telll him youre scared"}, {"id": "dzdk4yq", "author": "cooleug", "body": "The elevator thing, I could’ve sworn I saw that exactly question somewhere on reddit recently. Anybody else saw it?\n\nEdit: Oh wait it was on r/WritingPrompts"}, {"id": "dzfaco1", "author": "hellgal", "body": "Jump out the nearest window that isn't the bedroom one. You might die, but at least you won't have to deal with whatever's breaking in through your room or the strange woman outside the door. "}, {"id": "dzfzyy7", "author": "NoobPolan", "body": "Get your Freedom Dispenser™ and pour it on 'em"}, {"id": "dzgc0cv", "author": "RosyGoldfish037", "body": "this needs a part 2"}, {"id": "dziqxao", "author": "WonTon4MyTaunTaun", "body": "Have a snack."}, {"id": "dzmtlsm", "author": "Paanmasala", "body": "Well, I'm never clicking on ads again. \n"}, {"id": "dzpbgv6", "author": "saviourQQ", "body": "Did it say at any point how much you’d get paid for this one?"}, {"id": "dzqc7x5", "author": "rave_kate", "body": "Returning to this sub after almost 2 years. Had to log in to comment thanks for ruining my night. "}, {"id": "dzsqauc", "author": "emilymarie0528", "body": "I really need to know what happened OP!"}, {"id": "dztj0q9", "author": "TaponAccount111", "body": "Put on some porn, take of your pants and get to stroking. Once you're close enough to climax, which at this point would take shorter or longer depending on your preference, remove all barricades and open the doors. See what happens.\n\nAlso it would also be a good idea to live stream your situation, and invite some people to watch. And no, not watch you jack off you sicko, watch what happens next."}, {"id": "dzupbcs", "author": "Dylan_CreatesMemes", "body": "I would listen to the quizz. All that stuff at the end is just another question on the quiz so  i would just stay in the room as my guess is leaving will result in something far worse than whatevers inside. Plus maybe hes just there to give you your guiz money"}, {"id": "dzwskc0", "author": "Notafraidofnotin", "body": "Do you have any windows in your living room that open on the opposite side as your front door? And do you have any neighbors close by? If so, I would suggest making a run for it out of the window, get the fuck out of there and away from that shit asap. "}, {"id": "e01zyel", "author": "shamwow007", "body": "Call Sam and Dean."}, {"id": "e03jdwk", "author": "lsdventures", "body": "I'm gonna leave, those people wouldn't of shown up unless you took the survey. Idk kinda like a matrix situation they survey triggered them being able to find you and they want to save you from the people that wrote the survey. "}, {"id": "e0aobv7", "author": "BelieveInTheWeird", "body": "The scenarios that he gave you, I really want you to turn those into full stories! Especially the airplane one! They’d be amazing "}, {"id": "e0c7rri", "author": "PamperedGhoul614", "body": "Leave... I would totally leave pick yout poison. Rambo you're way through it! "}, {"id": "e0cgcov", "author": "PacificOW", "body": "Excellent writing. Take my upvote."}, {"id": "e0fb98z", "author": "Heathersgospel", "body": "Brb salting the doors and windows\nAlso where’s my dog"}, {"id": "e0jcpy8", "author": "sashilu", "body": "Just watch the Stress Relief episode of The Office. It'll relieve your stress/distract you or at least you'll have a laugh before or while getting murdered."}, {"id": "e0rholq", "author": "Kalayug27", "body": "Watch memes"}, {"id": "e1faf1q", "author": "heldc", "body": "Did you get the cash, tho? "}, {"id": "e1isy9j", "author": "guymayer", "body": "Loaded gun, holy water, etc."}, {"id": "e1mvn57", "author": "red_herrings", "body": "This is the actual definition of a stress dream."}, {"id": "e2jdrzk", "author": "PM_ME_YOUR_PAWG_BUTT", "body": "OP, YOU SHOULD CALL THE POLICE!  Okay, so I know I'm over a month late, but still.  If you've an intruder in your bedroom, that's fair reason to ring the cops to your aid.  They'll also probably be able to help you with the woman outside your front door."}, {"id": "e4qp9dw", "author": "Shuraragi-san", "body": "yo i need some closure, more parts need to follow this"}, {"id": "e4wgcpf", "author": "AndieFerrer", "body": "Monarch project. The goverment is trying to see if you react "}, {"id": "e6qgmpf", "author": "WHIRR_", "body": "Call the police?"}, {"id": "e7jen9q", "author": "ParanoidChicken", "body": "This is legitimately terrifying."}, {"id": "e89c378", "author": "theriaigne", "body": "Honestly thank god I live in the south because I’d got straight John McClane on all their asses"}, {"id": "e89eave", "author": "elblackroute", "body": "You can say thats how psychologists check if you have lied on their survey. :D\nOne advise - take a knife for defence, call someone for help and tell us what happend.\nConclusion - do surveys from authorised sites. "}, {"id": "e9b3u3h", "author": "Smith12456389", "body": "just dont look behind you fam"}]}