{"id": "8oueb7", "title": "I work security at Disney World... well, I mean I did.", "url": "https://www.reddit.com/r/nosleep/comments/8oueb7/i_work_security_at_disney_world_well_i_mean_i_did/", "subreddit": "nosleep", "author": "disneysecurity", "text": "I work in security at Disney World, the happiest place on Earth. Typically, I wouldn’t say where I work as obviously there are some pretty strict rules about things employees can put online, but I just don’t think I can tell this properly without that context. And, honestly, I think this may be it for me anyway with this job. I just can’t see myself working here any longer now. \n\nI’ve been with the company for 23 years. The first 20 years I worked in the parks – nabbing shoplifters and rounding up people who were drinking too much for the heat. Occasionally there’d be a fight to break up, but people usually kept it pretty mild. \n\nThe heat and walking was getting too much for me the last few years so I asked to be transferred somewhere with a/c and the company moved me to one of their resorts. While the working conditions were 110&#37; better as far as climate and comfort go, the guest issues were trickier \\- mainly domestics. I guess the expensive and stress of vacation got to a lot of people and I’d be called by neighboring rooms because some mom and dad were yelling at each other. I’d try to suggest they take a nap or go do separate activities for a bit and that would usually calm them down.\n\nBut none of that is what I’m here for. I’ve got to get this out while I have time.\n\nThree days ago I got a call from management. Apparently a couple of days before that, housekeeping had went into a room that should’ve been turned over that day (turned over is when one guest leaves by about 11:00 a.m. and the next guest checks in around 3:00 p.m.) and all of the guests’ items were still in the room. Housekeeping made a note of it and moved on, but during the next two days when they entered the room, everything was still there and untouched.\n\nI went to check it out and sure enough there was an empty room full of luggage, clothes, snacks, some toys, everything a family would need for vacation. The manager had already looked up the previous reservation and it was for a family – dad, mom, two little kids. I tried to call the phone numbers they had given but all I got was voice mail. We were a bit stumped so I made the call that housekeeper could clean the room and take the family’s personal items to be held until we got in contact with someone.\n\nI went digging into the reservation more. The family had arrived five days before housekeeping discovered all of their stuff.  I found that the family had paid a parking fee and their vehicle description was listed. A quick walk of the parking lots and I had easily located their vehicle. So that ruled out a car accident or them deciding to just leave all their stuff behind. \n\nNext, I saw that they had bought a dining plan. This is when a guest prepays for all of their food. They’re given a certain number of “credits” to use for meals. This family had only used 3 credits and the last one was two days after they checked in. It appeared that the day they arrived, they got here late and probably just stayed on the resort. The next day they used 2 credits at Epcot. The second park day they used just 1 credit at Magic Kingdom and it was at breakfast time. \n\nNow at Disney we have something called Magic Bands. Magic Bands are worn by the guests and act as a room key, park ticket, credit card, dining reservation payment, fastpass (a system used to bypass lines), and more. It took some work, but I was finally able to look up this family’s fastpass history. The day they went to Magic Kingdom, they had breakfast at a restaurant in the park, rode a couple of rides, and then rode their last ride, It’s a Small World around 11:00 a.m. Then nothing.\n\nFinally, it was time to bring in someone else on this. I called an old co\\-worker at Magic Kingdom and asked him to pull security footage for It’s a Small World at the time they rode it and I made my way over there. When I got there, my friend was very confused, almost distraught, looking. He showed me what he found. There’s usually a camera in the direction of where rides load and unload. The footage showed them scanning their bands to use fastpasses for the ride and boarding the ride. The footage from the exit of the ride just showed the other people in their car exiting. They weren’t there.\n\nOf course we thought the worse, maybe one of the kids had fallen out and mom and dad and the other kid got off in the middle of the ride to help and they all got injured or killed or stuck in machinery somewhere. So we shut down the ride. Middle of the damn day. Turned off that ear worm music and turned up the lights. Me and my buddy walked that ride three times before we called in help. Eventually there was close to ten cast members searching, and we didn’t find shit except for three cell phones and a hat.\n\nI was right stumped. I've kept digging the past couple of days, and I’m not sure who to tell what I found next to. I’ve called the police and I suppose they’re on the way, but the company has a way of covering up things like this and I decided I can’t live with myself if I don’t put out some type of warning.\n\nI kept digging into their reservation over the last couple of days and today I noticed they had purchased memory maker. There are photographers all over the parks and cameras in a lot of the rides and, with memory maker, the photos are all free. They automatically get added to a guest’s Disney account when the system knows their picture has been taken. And the system always knows. Everyone’s whereabouts are always known with the Magic Bands.\n\nWell, I opened up their memory maker photo album and, I swear, there’s 732 pictures. The first 30 or so are pretty normal. Epcot, a few rides, in front of the castle. But the rest. The rest are all in It’s a Small World. The rides only take one picture per go around. So it appears as though this family has ridden this ride over 700 times. The first picture was pretty normal. Everyone looked happy, it was busy day and a full car of guests.  The next one is rough to look at. The car is empty except for this little family and they look so darn confused. The next 10\\-15 I can see dad getting angry, yelling. Mom is holding onto those two kids like her life depends on it and you can see the kids getting increasingly upset, crying. And it goes on, and on, and on. After 50 or so it looks like they’re trying to get out. In one the dad is missing. In another they’re all gone.  Maybe like they’ve bailed early in the ride and tried to walk out, but in the very next one, they’re all right back in that damn car. After around 450 or so, I only see the mom and kids. It’s just when I look closely I can see dad, maybe just his body now, slumped down in one of the other seats. Since about 675, there’s just mom and one kid. Another body in another seat.  The mom and kid aren’t moving anymore. I think them two are still alive, just damn near catatonic. Looking straight ahead, pale.  \n\nAnd, y’all, I swear on my fucking life, the dolls are moving or something. In some of these pictures I can tell they aren’t where they should be. I even saw one with a doll in the car with this family.\n\nI can’t look anymore or I’m going to lose my lunch. I closed the album. It’s file sized has increased since I closed it. God, are there new pictures being added? \n\nI see on security cameras that the local PD just arrived so they’ll take over soon. I wish I knew what the fuck is going on, but I also wish this damn thing had never landed in my lap. I don’t think I’ll be able to update this. After I talk to the police, I think I’m going to walk out of here and never come back. I just wanted to get this out there, before Disney feeds the media some bullshit cover up as to why a whole family vanished. They didn’t vanish. I know where they are.", "comments": [{"id": "e07158n", "author": "Dpeezy09", "body": "Ex-cast member here. I knew right when you said small world that shit was going to go sideways fast.\n\nI. Do. Not. Fuck. With. Small world. "}, {"id": "e06cm9r", "author": "MutantTailThing", "body": "I always suspected Mr. Bones Wild Ride was based on Disney"}, {"id": "e06k6y1", "author": "amantheman", "body": "Why would you use a fast pass on small world"}, {"id": "e06nop4", "author": "gypster85", "body": "700 Photos \\* 14 minute ride duration = 9800 minutes, or 163 hours, or 6 days, 19 hours.\n\nThat poor family."}, {"id": "e06enjj", "author": "Chanel1202", "body": "Something about the description of them in the end looking catatonic made me think it would be awesome if they were turning into dolls on the ride and every time they went through the ride they became a little less human and a little more doll-like. \n\nNot sure if that’s what is going on, but what a creepy story!"}, {"id": "e06ldas", "author": "BlueRoundies", "body": "What in the goddamn fuck did I just read??"}, {"id": "e06xe1z", "author": "wandwish", "body": "This story was so well done I'm now scared to go on small world. I work the circus attractions at wdw now, and in my training we were told the dolls hair on small world actually grows and they get haircuts about once a month. They say it's just the humidity making the hair grow and the entire wigs are replaced eventually but you never know... "}, {"id": "e06fhuk", "author": "ethiczz", "body": "This is \"The strangest security tape I've ever seen\" next level cryptic-type shit.\nCreeps me right the fuck out, excellent stuff.\nWaiting for an update for sure!"}, {"id": "e06p2ij", "author": "pedroisaro", "body": "I work for Disney and this totally freaked me the fuck out "}, {"id": "e0687d0", "author": "TheBakercist", "body": "Well.  Go for the Dole Whip, stay for the...\n\nHappily ever after?"}, {"id": "e06wuw3", "author": "logan96", "body": "I have been on small world at WDW with the lights up and the sound off. It is creepy as hell. The hydraulics running the dolls don't stop. They just keep moving in silence, except for the clacking of the geese's beaks."}, {"id": "e06asq7", "author": "DutchMedium013", "body": "ahh wtf this gave me sooo many chills! One of my worst fear is being trapped on that ride!"}, {"id": "e06yrq3", "author": "Brock_Music", "body": "One time, my family decided to go to Disneyland, with one of the nights being the 4th of July. We decided to ride Pirates of the Caribbean, back in the days before the Disney film adaptation was implemented on the ride. Well, turns out that a couple of the boats were experiencing mechanical issues I suppose. \n\nMy family's boat got stuck for 15 to 20 minutes at the boat and fort cannon fight. You know, with the water spraying at you to simulate cannonballs  falling short of their targets. \n\nWe also were stuck in the town scene for around the same time limit, and a couple times afterward for shorter increments. To this day we joke about the dialogue, such as \"Oh Carlos, don't be chicken!\", as well as the song, because we heard it repeated so many times. \n\nOh and we missed seeing the special 4th of July fireworks. But we heard them.\n\nI believe Disney may have comped the trip, but we still joke about going on Pirates. We seldom do. Even when my siblings and I are with friends.\n\nAnyway that's my ride story, thanks for reading. And remember, Dead Men sometimes DO tell tales. "}, {"id": "e06d95a", "author": "psiaudork", "body": "Give us an update when you find out more, man! "}, {"id": "e06dhrc", "author": "Avanaar", "body": "Welp, I'm never going on THAT ride again. "}, {"id": "e06s4qv", "author": "thedude054", "body": "Would never believe anyone used a fast pass for Its a Small World."}, {"id": "e06ig3d", "author": "shibaaffy", "body": "*Makes mental note to NOT go on the Small World ride when I go to Disneyland/World for my 1st time "}, {"id": "e06zzlm", "author": "Pr1ncessLe1a996", "body": "For me the best part (or should I say worst) about reading this is that I’m currently at Disney in my hotel room. "}, {"id": "e06hone", "author": "tawannupinw", "body": "If I remember correctly, there is another story similar to this but told from the perspective of a teen couple that were on the ride but escaped just in time. Is it connected? It’s pretty old and told from a different user though."}, {"id": "e06ecyd", "author": "Bodean9599", "body": "Ok....not the first time I've read a story about that ride!! Sure hope you get a chance to update OP!"}, {"id": "e06hmss", "author": "Ucill", "body": "I HATE IT'S A SMALL WORLD. Sorry for yelling. "}, {"id": "e07z9p5", "author": "zachjaggers1", "body": "As good as a story this is, it's kind of hilarious that every Disney nosleep/creepy pasta is all about something weird happening on the it's a small world ride lol."}, {"id": "e06yesp", "author": "ActualPaperweight", "body": "Why did I read this at 1am???"}, {"id": "e06qhth", "author": "chesterlife", "body": "Man...I wanna see the photos of this so badly. That just sounds so crazy and intriguing at the same time"}, {"id": "e06z4xz", "author": "AlwaysIvan", "body": "How do you think Disney is so successful? It takes sacrifices...human soul sacrifices :o"}, {"id": "e06rj8a", "author": "helperwolf", "body": "Hehe, good one. But really they'd have you taken away from a case like that the instant you asked about it. It'd definitely have raised some red flags if a rogue security member started accessing things unrelated to their active position. The underground operatives would popped out of their camera room and and hauled you backstage in cuffs before you could say \"Disney\"... There's a reason why you never hear about shootings that may or may not have happened at the D..."}, {"id": "e06t6vg", "author": "einnasb29", "body": "I knew I hated Its a Small World for a reason. Creepy af. "}, {"id": "e06h9tb", "author": "xTkAx", "body": "Are you implying that somehow they might be in another parallel universe where there is only this ride, and it happens to be linked up to the camera system of this universe?"}, {"id": "e06yqf0", "author": "BahamutLithp", "body": "Being stuck on It's A Small World forever might be the literal worst fate possible."}, {"id": "e072ltc", "author": "UsuallyInappropriate", "body": "Tell us more Disney tales. Especially from within the resorts ( ͡° ͜ʖ ͡°)"}, {"id": "e079af1", "author": "HeroinTheMusical", "body": "I can definitely tell you really know Disney- I’m planning a trip right now and you have every detail on how the parks work down pat—right down to the new parking fees and dining plans, calling it a resort and not a hotel! Bravo! I always knew it’s a small world had something ominous about it....."}, {"id": "e06t47o", "author": "Lacygreen", "body": "So what happened with your lunch?"}, {"id": "e06yvk3", "author": "Seventhson77", "body": "As a kid we got stuck on Its a Small World for an hour.  Eventually got up and waded out of the ride. \n\nThis hits too close to home. "}, {"id": "e06rpph", "author": "spaceraycharles", "body": "This might be relevant: \n\nhttp://www.scp-wiki.net/scp-1733"}, {"id": "e06g38a", "author": "pikka_boo", "body": "I always knew there was something sinister behind that ride."}, {"id": "e06piyo", "author": "yoooitsjoee", "body": "I'm never going to Disney world fuck this"}, {"id": "e075e6x", "author": "livewomanmode", "body": "My uncle used to work at Disney he said kids would be disguised and kidnapped frequently and Disney would always cover it up.  That place is spooky "}, {"id": "e07097a", "author": "Kimbo128", "body": "Does anyone recall the recent story on here about the college intern and how they were like, trying to create the \"perfect\" characters out of people? Can anyone find it? I tried and failed, Haha. Tyia"}, {"id": "e06lely", "author": "Wicck", "body": "You have no idea how glad I am that I loathe that ride. "}, {"id": "e06qn2d", "author": "Hamsangwich730", "body": "As a kid I used to be scared crapless of it's a small world, I would cry and scream every time I was on it. This just brought back all of my fears regarding that ride."}, {"id": "e06yit9", "author": "dperlove83", "body": "I think I could handle the starvation, thirst, and feknt row tickets to my family's death, but listening to Its a Small World After All for six days would put me over the edge"}, {"id": "e07tu1d", "author": "justcallmenemo", "body": "Well known fact that the dolls in It's A Small World come to life and eat the passengers in the last car of the night."}, {"id": "e085kvk", "author": "VLHolt", "body": "It might not be so sinister. Could be the three year old demanding to stay and the family agreed just to keep the peace. "}, {"id": "e078okj", "author": "Cat_Butt_Face", "body": "Going to Disney next month, will avoid said ride like the plague."}, {"id": "e07yhrn", "author": "DomJurumela", "body": "Upadates please!"}, {"id": "e08b7cc", "author": "NotDaBiscuit", "body": "Story got drastically creepier once I saw a video of a first person view of the ride "}, {"id": "e0ebztd", "author": "lunalrn", "body": "I'm not going to lie, this story has been haunting me ever since I read it at the airport, I never went on it's a small world when I was there and now I don't think I ever will."}, {"id": "e06qkbf", "author": "SheWhoCreates", "body": "DAMN....this was CAPTIVATING!!! I don't know what to make of it, like, is that ride haunted? I mean, that was so creepy and weird to read about the family members trying to get out and the dad slumped  down, to them vanishing and then appearing again, and then just the mom and 1 kid, like, WHAT ON EARTH?! It's like the most \"innocent\" ride in the park lol, and it's apparently now the CREEPIEST LOL. I don't know what to think, especially with one of the dolls in the car!!! CREEEEPPPYYYY!!!!\n\nWhere are the family though? Because I'm so confused, especially with their pictures still being added, like....that's just bizarre O.O\n\nI honestly never liked that freakin ride, it's so boring, I'm so glad I never experienced a creepy ghost ride O.o\n\nTHANK YOU FOR SHARING YOUR STORY THOUGH!!!! :)"}, {"id": "e06lkfc", "author": "rbdoza", "body": "Please keep us updated"}, {"id": "e06tme2", "author": "princeofcrack", "body": "definitely no sleep tonight, going to Disney tomorrow );"}, {"id": "e0785xw", "author": "Guesswhoisit", "body": "Disney is scary already no need for a true story to come out "}, {"id": "e07j5he", "author": "JasonsStorm", "body": "How does one go on the ride continually and not get kicked off."}, {"id": "e09fj0w", "author": "Branovices", "body": "The real suffering comes from the guy they see on every loop that makes the joke, \"You folks again? Well, you know what they say... it's a small world after all!\" Then he laughs at his own joke, seemingly oblivious to their pain.\n\n\"Nice to meet you Dying, my name's Dan!\""}, {"id": "e23ot81", "author": "sgmusic2008", "body": "https://deadline.com/2018/07/disney-world-staffer-dies-at-resort-1202423359/"}, {"id": "e06v867", "author": "metallicmay", "body": "Update please!"}, {"id": "e06wzzb", "author": "Chuabacca000", "body": "This was insane to read since I got back from a trip to Disney just 2 hours ago"}, {"id": "e06xb7o", "author": "Orionishi", "body": "I swear I have read this before..."}, {"id": "e070bws", "author": "kirokhalil", "body": "fuck you man i won’t be able to sleep at all tonight "}, {"id": "e075swr", "author": "caitieboo1997", "body": "That ride scared the shit out of me as a kid. "}, {"id": "e07bfny", "author": "Machismo01", "body": "Wow. I guess the entrance to Tomorrowland broke down. "}, {"id": "e07jk2y", "author": "BaronRaichu", "body": "Jesus. I didn’t realize what sub I was on till almost the end. Thought I was on one of those normal work story threads. "}, {"id": "e07ovhm", "author": "8Bit_Guru", "body": "Funny.\n\nI feel catatonic after riding this ride once.  You'd probably see my corpse on the second go around."}, {"id": "e07zsgf", "author": "DocHolliday637", "body": "I think we need a update"}, {"id": "e086rtj", "author": "brkaras", "body": "I'm a season pass holder but I avoid that ride...shit is creepy"}, {"id": "e1t7f28", "author": "eighthchinese", "body": "Any updates yet?"}, {"id": "e06fsv5", "author": "Jenkins246", "body": "I was just there last week and fucking got sick on a Small World. Hats music just makes me nauseous "}, {"id": "e06rn07", "author": "NateParrott", "body": "Sounds just like that dude with the bomb in his IT closet.. it has a smelly smell... that’s smells, smelly. "}, {"id": "e0887yx", "author": "eelee23", "body": "I fucking knew I hated this ride for a reason. Just couldn’t pinpoint it when I was 7."}, {"id": "e0funlw", "author": "perplherpnderp", "body": "God I hate that ride. "}, {"id": "e13wz2b", "author": "_Bliss", "body": "Back in 2009 we got stuck on Thunder Mountain, it's like this speedy little train rollercoaster thats Gold Rush themed. Right before the main big hill there's this creepy dark tunnel with glowing bats and bugs on the walls and THAT is where our ride got stuck. On the steep incline, at night, with the creepy glowy critters. Another train came up behind us and after 15 minutes the Disney crew came and got us. We had to walk up some stairs in the pitch dark with linked arms basically.\n\nEdit: sorry this was at Disneyland not the World version."}, {"id": "e1pqrp8", "author": "ConnorHa11", "body": "I kept getting It's a Small World confused with It's a Gerbils World from Courage the Cowardly Dog "}, {"id": "e4yeybt", "author": "kiradax", "body": "Before you quit you should use your magic band to ride flight of passage in animal kingdom cause i s2g its the best thing ive ever done and youre getting it for free"}, {"id": "e06hc03", "author": "unfading89", "body": "I think you've stumbled across something much deeper than we all realise, please stay safe, sir."}, {"id": "e06tzg8", "author": "SkyShazad", "body": "So hang on guys they were stuck in the ride???? I need to know more you can't just end it there man "}, {"id": "e06v3ew", "author": "redprophet", "body": "I want to get off Mr. Bone's wild ride"}, {"id": "e06y96b", "author": "BreMingo", "body": "I was afraid something like this would happen to me when I rode this ride.. "}, {"id": "e06yomr", "author": "DryPersonality", "body": "Thanks, havn't had shivers like that in a while."}, {"id": "e070q49", "author": "MidnaNaito", "body": "I am never, ever riding It's A Small World again..."}, {"id": "e0727fi", "author": "geistcream", "body": "That’s awful. Jesus. Well, if you do leave and never go back, especially after working there 20 or so years, they’ll know somethings up. They’ll know you know too much and probably keep an eye on you. Because Disney is terrifying. "}, {"id": "e073aqn", "author": "weedpornography", "body": "How Escape From Tomorrow shouldve been, not that nonsensical crap."}, {"id": "e073vvx", "author": "Cylon_Toast", "body": "I always knew that ride was evil."}, {"id": "e073zqf", "author": "Grimfrost785", "body": "You lost your lunch, and the possessed dolls got theirs. "}, {"id": "e0764t4", "author": "ryan7627", "body": "I wish I could double up vote "}, {"id": "e07a3o6", "author": "socbrian", "body": "Nice try Comcast"}, {"id": "e07wpl1", "author": "Saroona1378", "body": "I'm lost and confused lol"}, {"id": "e0fezoh", "author": "JoanofArc5", "body": "As soon as I started reading I knew Small World was going to come up. Why is that ride so universally creepy?"}, {"id": "e1e9hif", "author": "LolaNightshade", "body": "> rounding up people who were drinking too much for the heat\n\nWhat did you mean by drinking? I’m pretty sure it isn’t allowed to drink alcoholic beverages at Disney, unless you’re talking about Epicot. "}, {"id": "e1snapd", "author": "InsanityPlays", "body": "they died and are trapped on the ride by themselves for eternity"}, {"id": "e1zko9u", "author": "darkstar842", "body": "You know, this makes the Small World clock boss in Epic Mickey make more sense. Just look at that thing's twisted face."}, {"id": "e2dzhkw", "author": "ErisDoe", "body": "Oh my goodness. This is one of the most horrifying things I have read. Even if the dolls did not come alive, can you imagine being stuck on that ride with the music over and over? Then they would get thirsty, and you know they'd have to try to drink that water. That awful water. And that is even without the dolls coming alive. Truly horrific. "}, {"id": "e2gruvy", "author": "DecisivelyArbitrary", "body": "Nah, come join me when it’s can. Stay safe....."}, {"id": "e3aj34t", "author": "bonzy-buddy", "body": "Congrats, you made it onto a Swedish podcast "}, {"id": "e3gr5mq", "author": "AnnieCrypt", "body": "Chills."}, {"id": "e49711k", "author": "Anxiousrabbit23", "body": "Small world doesn’t have a photo? Im very confused at the satire of this... "}, {"id": "e4mcblk", "author": "energizerbunnay", "body": "I’m pretty sure it’s a small world doesn’t have photos on the ride? I could be wrong, it’s been a few years since I’ve been to Disney World but I’m sure Disneyland doesn’t..."}, {"id": "e06bsfk", "author": "natsirtenal", "body": "Going there this weekend can't wait ... Definitely didn't think they were one of the scariest companies ever."}, {"id": "e06m9im", "author": "QuantumDisruption", "body": "Wow. Not what I expected at all. Chilling. "}, {"id": "e06qqni", "author": "tylerderped", "body": "Sounds like a human trafficking case..."}, {"id": "e06vp6n", "author": "lindsaybethhh", "body": "Hopefully none of them caught Cat Flu. I hear that was going around in Magic Kingdom a few years back (2013?), even resulted in a dad’s death. Pretty sure Small World is where he first started showing symptoms, too!"}, {"id": "e06gifs", "author": "itzsims", "body": "This creeps me out "}, {"id": "e06if6l", "author": "falloutboi66", "body": "Wow this one really got me going share some more of your experiences im actually really intrigued! "}, {"id": "e06is6p", "author": "oWallis", "body": "Well thank goodness I read this after I went to Disney for the first time a few months ago."}, {"id": "e06kxtx", "author": "alterego1104", "body": "This story creeps me out because both times I went to Disneyland my family made jokes about that it’s a small world ride and how this song gets stuck in your head and how it’s super creepy"}, {"id": "e06lt4o", "author": "cuckosei", "body": "Never been to Disney and this shit isn’t helping me book a trip anytime soon."}, {"id": "e06n649", "author": "phackdat", "body": "Wow!!! Crazy"}, {"id": "e06p79o", "author": "sadgirl45", "body": "So is he saying the dolls murdered the guests! "}, {"id": "e06ulvo", "author": "Shander1521", "body": "Creepy! I don't remember if I went on the it's a small word ride when my family went to Disney world but now I don't think I'll ever go on that ride if I go back."}, {"id": "e06w6uw", "author": "naturemamat", "body": "Ooooooo that last sentence though "}, {"id": "e06wanb", "author": "PlainsWalkerthe1st", "body": "I would have shit my pants unless I was listening to the kids aren't all right."}, {"id": "e06wb3c", "author": "foxymoron", "body": "OK goosebumps everywhere. How am I supposed to sleep tonight? "}, {"id": "e06zaem", "author": "Khuzdul1", "body": "I'm a little confused, maybe I missed something, I don't know but, you said you've checked the \"Its a Small World\" ride, even shut it off. But the family is still on the ride. Did I miss something?"}, {"id": "e0726bb", "author": "Saelyria", "body": "I’m terrified."}, {"id": "e072b0f", "author": "treeground_", "body": "Wow "}, {"id": "e072cba", "author": "UsuallyInappropriate", "body": "More, **more!**"}, {"id": "e072oqa", "author": "skyvanalen", "body": "I know you said you don't think you can give an update but I'm hoping for one nonetheless OP!"}, {"id": "e073bnz", "author": "AnActualGarnish", "body": "So an SCP?"}, {"id": "e073g20", "author": "Duck_it_hard", "body": "DUDE"}, {"id": "e073ui8", "author": "lil-willy99", "body": "Mate...best I’ve read on this sub"}, {"id": "e074j65", "author": "Suns-Of-Ain", "body": "That was creepy as fuck, 10/10"}, {"id": "e075f7d", "author": "BearsINCabins", "body": "I wish the aesthetics of the ride were explained a little bit more."}, {"id": "e075i78", "author": "Mclovin_888", "body": "Tell us WERE DID THEY GOO"}, {"id": "e075wqp", "author": "CharonDusk", "body": "Always knew that ride was cursed. We need to nuke it from orbit, it's the only way..."}, {"id": "e0767ea", "author": "seanpierceCEO", "body": "I knew Small World was evil...those dolls...something lives in them"}, {"id": "e076f5m", "author": "beholdthegoldengod", "body": "Before you leave _please_ add a photo!"}, {"id": "e0773nv", "author": "veryniiiice", "body": "About to board a plane to MCO....I know what ride I’m not riding tomorrow."}, {"id": "e07abee", "author": "hazaraMoghul", "body": "I dont know this sub. But this a good narrative. "}, {"id": "e07bzxb", "author": "lunalrn", "body": "My one time I went to Disney I didn’t go on Small World, and now I never will. "}, {"id": "e07c51i", "author": "Colinjames10", "body": "Awesome story, one of the best I’ve read in awhile. Got chills when you were going through the memory marker photos. Hope you can update!!"}, {"id": "e07d3ig", "author": "goku2572", "body": "Sounds like the book Kingdom Keepers where the rides comes to life at night and there is even a Small World part where the dolls come to life and attack kids and try to kill them. "}, {"id": "e07d7t5", "author": "oluuus", "body": "Great read!"}, {"id": "e07d8mf", "author": "sandal_god", "body": "Jesus, there's a really similar ride in a famous amusement park here in my country, and I'm due to take my cousin to that exact ride next week. Thanks OP, for making me letting my cousin down."}, {"id": "e07dvzb", "author": "streemline", "body": "Holy Shit"}, {"id": "e07euas", "author": "CometThomas", "body": "I didnt like that ride before reading this but now you can bet your ass ill never be riding it again..."}, {"id": "e07fuf0", "author": "ervapeanut", "body": "Always liked disney stories, but this one is the best"}, {"id": "e07i7yg", "author": "alc0", "body": "That sucks but it happens man.  Good luck.  "}, {"id": "e07ipjb", "author": "betafishmusic", "body": "My father hated small world so much, now I understand why."}, {"id": "e07joec", "author": "Olly230", "body": "Like that."}, {"id": "e07k3un", "author": "makeup4life", "body": "I don't see what the big deal is. Children are always encouraged to wish upon a star...."}, {"id": "e07m65l", "author": "btcftw1", "body": "Sounds just like that dude with the bomb in his IT closet.. it has a smelly smell... that’s smells, smelly.\n\n"}, {"id": "e07nhnm", "author": "duckduckpenguin92", "body": "I was just there 3 days ago, first trip to Disney ... I’m glad my group made it out. I wonder if this family was around in the ride then? So crazy, but we also had a 10 minute slow down and felt like my brain was going in circles. "}, {"id": "e07nybm", "author": "dinorawr93", "body": "Maybe this is why they're closing the ride."}, {"id": "e07ohsh", "author": "Cherokeejon", "body": "i got chills up my whole body multiple times while reading this. bravo. "}, {"id": "e07pw84", "author": "tylerderped", "body": "Username checks out. "}, {"id": "e07u0r4", "author": "Felwa_NH", "body": "i hate that ride i went there twice i swear the song stuck on my mind for a period of time -.-"}, {"id": "e07wdoh", "author": "Caathrok", "body": "Ya, uh. Always leave an anchor outside that ride. Someone that knows you should be coming out. We've seen people not come out. They should really burn that thing down. "}, {"id": "e07weyw", "author": "HeyItsMe104", "body": "I was just at Disney World not even 6 days ago... And we were at the animal kingdom it sounds like the same time the family was...and the last ride we went on was It's a Small World..."}, {"id": "e07x0um", "author": "kels2soccer", "body": "Reading the title, I figured I was in for a talesfromsecurity. About halfway through, I was thinking this would make a good nosleep and checked the sub. Poor family!"}, {"id": "e083q30", "author": "HawtPants420", "body": "Inquiring minds would love to hear an update because of course there is absolutely nothing to go off of online."}, {"id": "e084jh9", "author": "nullifiedfailure", "body": "first time i went on small world i had a panic attack and a deep unsettling feeling that i needed to Get. The. Fuck. Off. the ride eventually ended and i made it out, but i never fucked with that shit again. thanks for giving me yet another reason not to. "}, {"id": "e089to9", "author": "BeefyRatio", "body": "Keep us updated on this for sure!"}, {"id": "e08fl1c", "author": "theconceiver", "body": "Does this have something to do with the gangs that roam the park?"}, {"id": "e08o78r", "author": "TrippinSky", "body": "I suspect the dolls had something to do with the disappearance of that family.. those dolls give me the heebie jeebies. "}, {"id": "e08qp8n", "author": "sonosista", "body": "Well, its a small world afterall"}, {"id": "e095p2r", "author": "creepypgirl79", "body": "This scared the shit out of me. We are doi g Disney next year and it's my kids favorite ride. Fuck me. "}, {"id": "e095zax", "author": "Awake2dream", "body": "It is the ride that never ends\nIt goes on and on my friend\nSome people started riding it\nNot knowing what it was\nAnd they’ll continue riding it\nForever just because...\nIt is the ride that never ends\nIt goes on and on my friend\nSome people started riding it\nNot knowing what it was\nAnd they’ll continue riding it\nForever just because...\nIt is the ride that never ends\nIt goes on and on my friend\nSome people started riding it\nNot knowing what it was\nAnd they’ll continue riding it\nForever just because..."}, {"id": "e0ahf2s", "author": "Lurkingzombiex", "body": "I don't know whether to be impressed at this story, or scared shitless. In any case, Thanks."}, {"id": "e0avxka", "author": "Silentarian", "body": "Holy hell this was one of the best stories I’ve read on r/nosleep.  Excellently written!"}, {"id": "e0b14nx", "author": "GrimmSheeper", "body": "I’ve heard of Mr. Bones’ Wild Ride, but it seems like the family is on the small world Dolls’ Mild Ride!"}, {"id": "e0bfb5d", "author": "effybeanz", "body": "This sad truth "}, {"id": "e0d37qy", "author": "AmiIcepop", "body": "Never been to Disney anything but small world has always freaked me out since that Simpson episode where they drink the water.."}, {"id": "e0f9drq", "author": "meowmeowpaws", "body": "I have told everyone this story. Freaks me the hell out. "}, {"id": "e0g20mr", "author": "DerpyFish", "body": "Well this makes my irrational fear of that ride very damn rational now..."}, {"id": "e0gz5r3", "author": "mrmurdock722", "body": "Any other weird stories from your time there? Or maybe from some of your coworkers"}, {"id": "e0hjsr4", "author": "xandrajanette", "body": "I only went to disney once when i was younger- i was probably only 3 or 4 but my sister was 9 or 10. Well, we rode It's A Small World and i was terrified. I cried hysterically the entire time. My family still makes fun of me about it, wait til they get this in their inbox. I knew something wasnt right about that ride. N that was 25 years ago!"}, {"id": "e0pus9h", "author": "ElChisme", "body": "I just heard of a school district in Texas that while in the process of building a school, they found bodies in the ground. They hire an archeologist and come to find out the lands used to be a cemetery.  Now they are exhuming the bodies, one at a time and testing them, on-site, so as to identify them. Apparently, this happens way more often in Texas than other states. Wonder if Small World might have been built over a graveyard and the trapped, lost souls are taking their revenge. "}, {"id": "e0ueqza", "author": "Koteshima", "body": "Nope. Based on this story and the comments, I'll just leave the ride alone"}, {"id": "e0up5je", "author": "AlvinGT3RS", "body": "Op should have read all the Disney stories on here "}, {"id": "e0zm5ru", "author": "JayTrim", "body": "In the words of my great ancestors.\n\n\"EEEEVVVIIIILLLL!!!!\""}, {"id": "e119unl", "author": "Fofo336", "body": "Fuck that ride oh my god, fuck that and fuck animatronics and Fuck that song and fuck security cameras and FUCK, THAT, RIDE"}, {"id": "e5o0tf8", "author": "Evanakabevan", "body": "but where are they?"}, {"id": "e7mij19", "author": "Laazuli", "body": "This is quadruple creepy bc I’ve never been to any Disney ever but am an avid /nosleep browser and horror enthusiast (especially psychological terror) and have written some short stories in my day... I’ve actually had the idea of writing a story about people getting trapped on this ride forever from a first person perspective where the reader listens to the song while reading it... spoooooky "}, {"id": "e7ohdfk", "author": "JennBakesCakes", "body": "My family had a family trip to Disneyland after toon town opened. We went on Small World and it broke down about half way through, the music and boat had stopped but the puppets didn’t. My poor little sisters and I were terrified as we listened to the snap of their mouths and cranks of their gears. I haven’t taken my 4 year old on it despite being a former cast member who visits the parks 4+ times a year. This ride is like a horror movie waiting to happen."}, {"id": "e8mb5y8", "author": "sithdude24", "body": "Time loop."}]}