{"id": "8rz8wj", "title": "The Climb", "url": "https://www.reddit.com/r/nosleep/comments/8rz8wj/the_climb/", "subreddit": "nosleep", "author": "boredandpoor", "text": "“I want you to kill her,” the voice echoed. Low, monotonic, unwavering. \n\nIn front of me was my mother, crucified haphazardly upon a ramshackle wooden cross. Rivets were driven through each palm - with rope fastenings in place around her ankles and shoulders to keep her in position. \n\nHer eyes, red and cracked from exposure, pulled open by tape, to reveal pupils dilated with fear. \n\nHer mouth was sewn shut. Muffling her tired pleas.\n\n“This is hardly an existence,” the voice licked.\n\nI surveyed my surroundings. I was in a small, square room, with metal walls no larger than my studio apartment. The roof, however, was missing, replaced by an empty void that seemed to stretch endlessly into the darkness above.\n\nAbout five feet in front of me was my mother. Writhing weakly against her restraints. Five feet behind her, an impossibly tall ladder stretching into the abyss. \n\n“What are you waiting for? As if you care,” the voice prompted.\n\nWho was talking? Where was this voice coming from? Its warm presence swaddled me like a warm blanket.\n\nIn one swift surge, the gravity of the situation dawned on me. I didn’t know where I was. I didn’t like being lost. \n\nI felt the kick of adrenaline into my bloodstream. My heart, beating against my ribcage. My hands, clammy. I clenched them repeatedly. Open, closed. Open, closed. \n\nI needed to get out of here. \n\n“End her.”\n\nMy gaze dashed to my right hand side to find a surgical stand stocked full of pain-inflicting paraphernalia. \n\nA knife. A rope. A pistol. Razor blades, full needles, strange pills and powder. \n\nAn arsenal fit to maim, disfigure, destroy.\n\nI reached for the razor blade. I could cut the stitching on my mother’s mouth - garner some insight into what the fuck was going on. \n\nMy mother always knew what was going on. \n\nWith the razor blade in hand, I walked gingerly up to my mother - whose eyes lit up as I approached. \n\nAnd through all the pain, tears and stitches, as I drew closer, she smiled. \n\nI held up my left hand to coddle my mother’s face, with the razor blade still pinched in my right. \n\nAnd as she nuzzled her face into my palm, I cracked. I wept harder than I’d ever wept before. Full-bodied, wracking sobs crashed over me. \n\nBecause it didn’t matter how bad anything got. It didn’t matter how broken the situation, or how broken the person. \n\nMy mother was just happy I was there. \n\nI steadied myself and lifted up my right hand, trembling as I drew closer to her face - ready to pick away at the stitches to the best of my ability. \n\nThe first few snapped, then the next, until all the stitches had been split and I had liberated her mouth from its cage. \n\nI exhaled raggedly, leaning back to look deeply into my mother’s eyes. \n\n“M-Mum?”\n\nBut as tears fell down her cheeks, through her warm, loving smile, she uttered one word. \n\n“Climb.”\n\nI peered past her towards the ladder, then looked back towards her for reassurance. It took a slow, simple nod to realise that this was what I had to do. \n\nAnd as I walked slowly towards the ladder, she murmured one last thing. \n\n“I love you.”\n\n“I love you too, mum.”\n\nI never said that enough.\n\nThen, with razor blade still in hand, I climbed. I climbed with determination. I climbed for what seemed like hours. \n\nI climbed past broken rungs, and even when I was tired, I kept on climbing. \n\nI cried as I climbed, but I pushed through, with snot dribbling down my chin and tears clouding my vision. \n\nI reminisced as I climbed. I climbed through good memories, I climbed through bad memories. I climbed through the time when I had the flu and my mother came around to do my laundry, and I climbed through the time my girlfriend cheated on me. \n\nI climbed because I was sick of this dark room. I climbed to make my mother proud. \n\nAnd as I climbed, the darkness subsided, opening itself up to light. \n\nI could see the where the ladder ended now. I could see my way out. \n\nAs I placed my hand on the last rung of the ladder and pulled myself up over the edge, I was overcome by brightness. \n\nThe light subsided, and as I got my bearings, I found myself on my back in my bathtub, still clutching the razorblade. \n\nUrgent knocking on my bathroom door roused me from my daze.\n\n“Are you alright in there? Your sister called. We’re worried about you.”\n\nIt was my mother’s voice.\n\nI got up out of the bathtub, and placed the razorblade back on the shelf, walking towards the door. And as I flung it open, she looked at me. She looked at me and she knew. \n\nShe held me in her arms and we sobbed. \n\n“I wouldn’t know how to live without you,” she whimpered.\n\nMy climb had just begun.", "comments": [{"id": "e0v9oog", "author": "eexxppaatt", "body": "Well written, beautifully haunting, and frighteningly close to home to me. Good luck with the climb OP. It’s an ongoing hike. "}, {"id": "e0vwy2e", "author": "clouddevourer", "body": "It's so incredibly tough dealing with depression since my mom died, it seems like there's nobody left who really cares about me and sometimes I wonder what's the point of continuing to struggle. But your story reminded me of what my mom would want for me, so now I'm sad but also comforted, if that makes sense. Thank you."}, {"id": "e0vssnx", "author": "majorasmasquerade286", "body": "This is so real for me. Tried to end it and it didn't work. First person I saw afterwards was my mom and everything came flooding back. I never want to hurt my mom like that again. "}, {"id": "e0vrqhw", "author": "bitterjack", "body": "I can FEEL the spirits cutting onions around me. Truly spooky."}, {"id": "e0w21h7", "author": "lcl0706", "body": "As a mother, I would 100% absolutely without a question crucify myself to save my child’s life.  I would take on all the pain in the world if it meant my child could find their way back to the light. Very powerful stuff here OP.  Never stop climbing. "}, {"id": "e0vkslb", "author": "baduncle69", "body": "Chilling and inspiring. Keep on climbing. The only way out from the bottom is UP!"}, {"id": "e0vyfax", "author": "Skydog-13", "body": "This just made a situation that I'm in seem not as bad. Thank you, op, you may of just saved a life."}, {"id": "e0w77si", "author": "Xyjil", "body": "This actually made me tear up. I’m struggling with depression and suicidal thoughts for 7 years now. But I’m still here and I think I’ll stay for a while longer. It’s sad to see how many people here write that this story hit close to home. I hope all of you feel better someday. We can make it out of this hole."}, {"id": "e0wftgs", "author": "pijamas1", "body": "This hit me super hard.\n\nFor the past year or two I've been thinking of ending it. Even though my life would seem like it's going great, I only have one good reason to stick around. As strange as it might sound, I haven't done it because I have two cats who love me to bits and I love them more than myself. I can't just leave them like that. I guess it's good that they're here.\n\nStay strong, OP"}, {"id": "e0waadv", "author": "sainsa", "body": "This needs to go viral. When my depression was at its worst, I slept with a gun under my pillow - but I never took that last step. I'm my mother's only child. I couldn't do that to her. I couldn't let her see me like that.\n\nI am also friends with a woman who lost a daughter my age to suicide. Some of the parallels between her child and me are eerie. I wish her daughter could've climbed just a little higher."}, {"id": "e0vnybt", "author": "-VelvetBat-", "body": "My god, this is good."}, {"id": "e0vw0m9", "author": "FuriousResolve", "body": "What an eloquent story.  Beautiful piece of writing, with a message that resonates incredibly deep.  Top marks to OP, never stop climbing."}, {"id": "e0wcde3", "author": "g33kn1k", "body": "Every time someone asks about my [green ribbon tattoo](http://imgur.com/gallery/45eZiKs) and I tell them it's for mental health awareness and a reminder for me to always fight, they always come back with a story about people in their own lives who have suffered. It's sad that there is still so much stigma around mental illness when so many people suffer from it. Your story was amazing and I know it will help so many people to keep fighting."}, {"id": "e0vvv5m", "author": "maridaz3", "body": "This is written so beautifully and it's hauntingly inspiring as someone who is often suicidal. It would just be my daughter telling me to climb instead of my mother. I'm proud of you, OP. the climb is never easy. Just remember how much you love your mom and make sure you tell her. 💖"}, {"id": "e0woop5", "author": "ChloeMomo", "body": "This hit really close to home...mothers know. My mom came home hours early one day and said, \"I had this horrible feeling I wouldn't see you again if I didn't hurry home.\" She knew I was severely depressed, but she didn't know until years later that i was legitimately suicidal and about to attempt. She had no idea she actually did likely save my life.\n\nThank you, op. I'm going to give her a call ❤"}, {"id": "e0vyhzv", "author": "kgriffitts", "body": "This actually brought tears to my eyes, so incredibly beautiful and haunting. "}, {"id": "e0wxsqg", "author": "o_charlie_o", "body": "My mom killed her self in the bathtub a couple of years ago. This was an amazing story, it hit me close to home, hurt a little but I loved it and definitely saving it to reread. Thank you. "}, {"id": "e0wdosp", "author": "IamHowardMoxley", "body": "Climb on, until the darkness opens to light "}, {"id": "e0w02zi", "author": "Letmeout55", "body": "Incredible!!!! You stair-climbing, literary genius!! If I had gold, I'd give it to you. Thank you!!!"}, {"id": "e0w1n7t", "author": "Maxbeerbomb", "body": "Powerful and deceptively short for the emotional punch within. Keep on trucking and definitely keep on writing."}, {"id": "e0vr9hr", "author": "fancy_potato_611", "body": "The language is beautiful"}, {"id": "e0vz386", "author": "FadedPariah", "body": "This is beautiful. I am so thankful you made it out of the darkness OP. Not as thankful as your mother though."}, {"id": "e0w1ind", "author": "KJParker888", "body": "Amazing! Heart wrenching! Even if you've never been in that place, your writing made it painfully clear."}, {"id": "e0w9q60", "author": "Pteetsa", "body": "I never thought a post in nosleep would make me cry. Gosh, dude, that was purely fantastic! I'm trying to climb out of my depression too and it's a hard path but it's worth. Keep climbing, I believe in you and I hope to see more stories from you, your style is awesome! "}, {"id": "e0wu7wk", "author": "savingrose", "body": "The last line honestly made me cry. After dealing with suicide attempts and losing a close friend to the same, it definitely is a climb harder than any mountain. "}, {"id": "e0wo32i", "author": "kissyournervesgoodby", "body": "As someone who has dealt with losing someone to suicide, this hits close to my heart. \n\nThis was beautifully written."}, {"id": "e0wp0e2", "author": "Retry_password", "body": "It’s a struggle. But one that can be helped with others. My depression is always lighter when I have others around. \n\nWhoever reads this; Stay strong "}, {"id": "e0wt0yv", "author": "J-Bad", "body": "This made me cry. My late boyfriend was suicidal (though he didn’t die by suicide). Being with his mom after his death is just so hard. I know I’m in a lot of pain, but I couldn’t imagine what she’s going through. Very beautiful story."}, {"id": "e0xv4cn", "author": "polkachip", "body": "I just literally finished crying out for help, tear-stained and weary, to the night stars above (where my best friend who committed suicide promised I could always find him).  I have been having intense suicidal idealations today and plagued by a never-ending deeply rooted depression...tonight being particularly bad.  After I made my final desperate plea upwards, turning away from those silver,  glittery, heavenly orbs in the sky and closing my bedroom window, I  proceeded to direct my weary attention to Reddit's front page stories.  In approximately two minutes of just vague scrolling I came across this particular title and something inside me told me to read it.  I read the your story, OP, and the associated commentary, (which is apparently from other readers who are much like me). Thank you OP for delivering this powerful and unique story; its message to continue on and conquer, up and out of the darkness, was, indeed, exactly what this girl's shattered soul needed."}, {"id": "e0w5vzk", "author": "Shutupteri", "body": "Can’t express how absolutely amazing this was to read. Definitely a close to home story "}, {"id": "e0wkewm", "author": "livmaygray99", "body": "This is such a beautiful way of writing. I love it. I’d upvote 1000 times if I could "}, {"id": "e0xec3n", "author": "hellthaler", "body": "I lost my mama to suicide, and suffer depression myself. I’ve read this twice, and may read it over and over again for the rest of my life. Thank you for this very impressive and impressionable story. "}, {"id": "e0viljn", "author": "Fluffles0119", "body": "The day of reckoning is upon us"}, {"id": "e0vrrpm", "author": "SilasCrane", "body": "Simply beautiful. "}, {"id": "e0wqivz", "author": "graymanPRIME", "body": "There's always gonna be another mountain..."}, {"id": "e0wwxxw", "author": "eelisabethm", "body": "This made my heart ache. I relate. If anyone needs an ear or a shoulder, I'm here. Been fighting anxiety for as long as I can remember, and depression since college. Fuck the darkness. "}, {"id": "e0x369z", "author": "velasha", "body": "My mother and I don’t speak for various reasons. She wasn’t there when my climb started, or when I fell back to the bottom, bottle of pills in hand. I would love nothing more than to feel genuine motherly love, especially when the suicidal ideation dips into planning. \n\nThis story was absolutely beautiful, and I’m proud of you for making that climb. "}, {"id": "e0x5yml", "author": "fscottfitzgerld", "body": "The type of wholesome nosleeps like this hit me harder than I'd ever want to admit. Almost died late last year from my own attempt, doctors gave me a rough 5% chance of surviving, told my father to expect the worst. Spent a few days unconscious in the ICU when my heart made a surprising recovery, literally moments before they were gonna put me on life support. I tend not to put much thought into it, but it's stories like this that make me confront the weight of what I did."}, {"id": "e0w7zan", "author": "motherlings", "body": "Thank you "}, {"id": "e0w9sil", "author": "awritingraven", "body": "Damn it.  I didn’t wanna cry today."}, {"id": "e0wbrod", "author": "thateternalmoment", "body": "This is a beautiful story. Well done!"}, {"id": "e0wcels", "author": "arrr-chitect", "body": "I'm so sorry for your suffering. Thank you for bringing light in the midst of it. Your mom sounds wonderful. "}, {"id": "e0wi10w", "author": "enileclebasi", "body": "This is beautifully written the only downside here is it releases the ninja cutting onions"}, {"id": "e1afmf2", "author": "scarletbegonia28", "body": "This made me miss my mommy. I lost her suddenly a few years ago."}, {"id": "e0wf7ee", "author": "TermyYT", "body": "I'm speechless."}, {"id": "e0wig5o", "author": "hayrox24", "body": "Well done!"}, {"id": "e0wiwa1", "author": "shrecko28", "body": "So well written, and a beautiful story"}, {"id": "e0wjqbi", "author": "MolhCD", "body": "Thank you for this"}, {"id": "e0wksfx", "author": "KatMite36", "body": "Wow. I’m sure I’m mimicking others but that was beautiful. Truely. "}, {"id": "e0wlim6", "author": "creepypgirl79", "body": "Wow!!"}, {"id": "e0wlx9y", "author": "jenngofett", "body": "Wow.  Just wow.  Extremely well written.  Sending you all the love and light OP, climb on, you are so very strong."}, {"id": "e0wp11i", "author": "Aristalor", "body": "Damn"}, {"id": "e0wpt9j", "author": "lizajuse", "body": "This is hands down the closest this sub has ever hit to home for me. Got me right in the feels. Thanks for sharing man. It really is the longest journey. "}, {"id": "e0wqs30", "author": "destro225", "body": "This. Is. Fantastic."}, {"id": "e0wrpfu", "author": "CBSh61340", "body": "So the character passed out prior to going through with the act?"}, {"id": "e0wtb54", "author": "Axeloy", "body": "This was amazing."}, {"id": "e0wxseb", "author": "Amie80", "body": "Beautiful beautiful story. Wow breathtaking."}, {"id": "e0wyaik", "author": "Thataintright1", "body": "Wow this was powerful and beautifully written."}, {"id": "e0y89qe", "author": "green_emotions", "body": "I’m so sorry but can someone explain the deepness of this story? Like an analysis please. It seems like it has a really deep message"}, {"id": "e0yuc22", "author": "alouette1428", "body": "I know it’s been said a thousand times. But this affected me on so many levels. Thank you for sharing this, I think it’s more important to so many people than you may even realize "}, {"id": "e0vtlkd", "author": "dontlookbehindyou_", "body": "this gave me chills. beautiful."}, {"id": "e0w14u5", "author": "SterlingMidnight", "body": "I’m not crying, you’re crying "}, {"id": "e0w3a85", "author": "ChurchOfRallys", "body": "Good job. All I want to say "}, {"id": "e0w5xoe", "author": "slut4pancakes", "body": "this hit me so hard in a good way.. this is beautiful "}, {"id": "e0wd9wh", "author": "BenjiYokai", "body": "This story was so well written, I could visualize it. Very emotional and touching story. After all, when you've hit rock bottom, there is only one direction... Up!\n\n\\^\n\n|\n\n|\n\n|\n\n|"}, {"id": "e0we18j", "author": "murssi123", "body": "It was a good story well done who Sri Lanka story made touch me really touched me well done"}, {"id": "e0wj64f", "author": "Boxxalot88", "body": "Woah that hit me harder than I thought it would good job please right more"}, {"id": "e0x141h", "author": "oluuus", "body": "Great read!"}, {"id": "e0x2tre", "author": "fuck_you_get_pumped", "body": "i've been the protagonist before, more than once. this made me cry. beautiful. thank you. "}, {"id": "e0x6azr", "author": "meowmeowpaws", "body": "Very touching, OP. I’m so numb from everything that I couldn’t even feel it.\n“Kudos to those who see through sickness.” -Incubus"}, {"id": "e0xi2qm", "author": "LucasAlGhul", "body": "What a thrill..."}, {"id": "e107t9r", "author": "ocularOccultist", "body": "this... hits REALLY close to home\n\nthanks for sharing op"}, {"id": "e113ufq", "author": "thechakkaw", "body": "im actually laying down on my bed crying right now, thanks for this, for reminding me the love i have from my mom"}, {"id": "e1yo8er", "author": "Martingale_Coda", "body": "I was reading spookies, not saddies. Dont make me cry at work! Damn it."}, {"id": "e2k14q5", "author": "infamusfiend", "body": "This needs to be shared everywhere, wow....such a powerful message and well written."}, {"id": "e54yziw", "author": "Firefly_07", "body": "This made me sob uncontrollably.  I know that pain, all too well. I battle it every day right now. "}, {"id": "e5hzd46", "author": "puban", "body": "Fantastic writing.\nClimb on everybody <3"}, {"id": "e88nwdt", "author": "Tois4TheBois", "body": "I know this is 4 months old, but im crying in class rn"}, {"id": "e0vuefu", "author": "soggy-bandaid", "body": "you got it perfectly "}, {"id": "e0vuism", "author": "LeeshaG", "body": "Wow..... Just wow! "}, {"id": "e0w5n8y", "author": "proflupinx", "body": "Guys... as if I weren’t already dehydrated enough as is 😭😭😭"}, {"id": "e0w9pk7", "author": "semperfiction", "body": "Absolute interesting take on depression, and never stop climbing into the light"}, {"id": "e0w3ooq", "author": "nipples_brown_area", "body": "Whow!"}, {"id": "e0wvmqe", "author": "Incredulous_Donkey", "body": "You should post this on r/aww. I shed a tear; very touching"}, {"id": "e0x1z2c", "author": "Pumpkin_Escobar_", "body": "Beautiful"}, {"id": "e0x4avk", "author": "jegress", "body": "This was an emotional rollercoaster. So beautiful thank you "}, {"id": "e0x60zk", "author": "ngcriesalot", "body": "i thought about this story again last night before going to sleep and cried again. this is beautiful and so well-written"}, {"id": "e0x8e18", "author": "CCtenor", "body": "Holy hell, this was a great story."}, {"id": "e0x90e3", "author": "alfu30b", "body": "Great writing, great content. Huge respect to you, OP."}, {"id": "e0xi8bp", "author": "Aussiewolf82", "body": "Masterful writing OP. Keep climbing. "}, {"id": "e0ytp5k", "author": "Nacho_Cheesus_Christ", "body": "Fuck this just hit me like a truck"}, {"id": "e0z0u01", "author": "mycalvesthiccaf", "body": "Thanks op"}, {"id": "e0zf2j5", "author": "BrownMasterFlex", "body": "Incredible analogy. Really hit close to home. My mother is one of the reasons I'm still here. Hope OP keeps climbing. Hope everyone keeps climbing. Haunting yet inspiring. "}, {"id": "e0zhcnk", "author": "DaniePants", "body": "Oh Jesus. I have sons and you just captured my worst fear. This won’t leave me for a while. "}, {"id": "e13b0rw", "author": "Daytripper619", "body": "TBH, nosleep hasn't really been doing it for me lately, I was expecting another one to be indifferent toward.\n\nNope. Terrifying and hit home on multiple levels. Amazingly done."}, {"id": "e1tiswf", "author": "ChloroformScented", "body": "I think about ending it almost every day. Until the other day I asked what my mom's greatest fear was. She told me it was coming home and finding my body. \n\n\nI can't ever let her greatest fear come true."}, {"id": "e1toufk", "author": "Ironbark_", "body": "The void may look endless; but as someone who has made that climb with a noose still dangling around his neck, I promise you, there is light after the darkness.\n\nOne rung, one foot, one hand, one after the other.\n\n***You've got this.***"}, {"id": "e1v2j82", "author": "tired_commuter", "body": "Absolutely brilliant. "}, {"id": "e1x92x1", "author": "Lil_Mozart", "body": "This deserves 3 million gold"}, {"id": "e24klzq", "author": "competitivebunny", "body": "Man that's deep...this hit me so hard "}, {"id": "e2hntoj", "author": "vngrda", "body": "WOW"}, {"id": "e2mtrtz", "author": "spiderfalls", "body": "I am without words.  Thank you OP.  That was .....  I don't know.... everything at once."}, {"id": "e41e4nc", "author": "Prudencerufus", "body": "What a beautiful story. I truly hope you get the help you need. God bless "}, {"id": "e48zrre", "author": "DarthSariah", "body": "I don't think I've ever started crying so fast & so suddenly as I did when reading the second-to-last line"}, {"id": "e4h38hl", "author": "actullyalex", "body": "damn dude, thats a metaphor and a half for the pain your mother would experience if you went through with it. I'm glad you're okay."}, {"id": "e4sen68", "author": "mysweetandsourchild", "body": "(loud crying)"}, {"id": "e7jerw8", "author": "ParanoidChicken", "body": "Right in the feels."}, {"id": "e12ipmk", "author": "queenoflights", "body": "Thank you for sharing this.\n\nGoing to get a lil personal here... but as someone who has struggled with suicidal thoughts and lost my own mother to suicide last year... this hits hard. I would have done anything to save her. I wish she knew that.\n\nTo all readers: keep climbing. Please. Just keep going.\n\nSo much love for this lovely community."}, {"id": "e0x5b36", "author": "Drugpusher90", "body": "So chilling, so haunting.. beautiful. "}, {"id": "e0xjyud", "author": "uncivilizedchild", "body": "idk what this says about me but I keep imagining the razorblade as a box cutter :/"}, {"id": "e1eawz1", "author": "PantyGirlAurora", "body": "Holy shit,  this was excellent! Great writing and finally a different story structure,  love it. "}, {"id": "e1mfpaq", "author": "toxic_and_timeless", "body": "Oh my god, this is so beautiful. It made me cry. Thank you for writing this, OP. I’m still in tears, I think this will help a lot more people than you realize."}, {"id": "e1n0jb4", "author": "Kitsune_Kellz23", "body": "Welp. Thanks for the tears."}, {"id": "e1xjhgt", "author": "b3rn13br0", "body": "fuckk...this is good :("}, {"id": "e2hrtpe", "author": "vardavarr", "body": "I’m doing my best to keep from crying after reading this. Telling my mom I almost killed myself was one of the hardest things I’ve ever had to do in my entire life"}, {"id": "e46csik", "author": "rustled_orange", "body": "Unfortunately my mom will never understand that I'm not worth saving. I wish I could make her believe it, so she wouldn't hurt."}, {"id": "eacwwqq", "author": "bethchen444", "body": "I cried. "}, {"id": "easnkfx", "author": "Rainsandbows", "body": "What if the climb just keeps going and there's no energy left and you don't care anymore and everything just hurts because it's all too much? I think it's okay to give up. "}, {"id": "e10xjiu", "author": "Slonedurrsea", "body": "Reminds me of “Road To Nowhere” by Christopher Pike!! "}, {"id": "e10xylc", "author": "Hockataro", "body": "Damn. "}, {"id": "e195qbh", "author": "xanax_pineapple", "body": "This would be a good premise for an episode of Dragula. "}]}