{"id": "8w4gaz", "title": "My girlfriend talks in her sleep. She's been saying the most horrible things recently...", "url": "https://www.reddit.com/r/nosleep/comments/8w4gaz/my_girlfriend_talks_in_her_sleep_shes_been_saying/", "subreddit": "nosleep", "author": "RyanMatthews_", "text": "I’m infatuated with her. \n\nUtterly infatuated.  \n\nAnd it wasn’t at a healthy level.  Far from it.  I would think about her every moment she was away.  I would sometimes sit on my couch and just stare at my phone waiting for her to text.  I’d tell myself “Don’t contact her.  *Don't*.   It will come off as too strong.”  But then I’d still find myself clicking her name on my contact list before my inner voice would continue, “You don’t want her to know how desperately smitten you are with her.  It’s unattractive.  It will scare her off.  No, you must wait for her to call you this time.”\n\nBut it was excruciating and exhausting.  Almost unbearable.  I once heard that the ancient Greeks believed that falling madly and irrationally in love with somebody was a curse that you would wish upon your enemies.  I could never understand what they meant.  After all, isn’t falling head over heels in love the ultimate goal nowadays?  But now that it’s happened to me, I have to say… the ancient Greeks were right.  This is a curse.  I was barely in control of myself.  Almost as though my infatuation with her had… possessed me.\n\nThe two of us were sexually active together but still in the “dating” phase.  We were at that make or break era of a blossoming relationship where we’d either have “the talk” and formally be in a relationship or we’d start to slowly drift apart.  The latter of which I don’t think I’d be able to cope with.  Honestly, I wouldn’t be able to.  Almost everything about her captivated me.  The way she held her hand over her mouth when she laughed.  How she’d caress the pendant of her necklace when she was frightened.  How she’d twirl her hair in her finger when she was excited.   All of it.  Her smell.  Her smile.  Her eyes.  \n\nYeah, I know.  It probably makes you sick reading about it.  I feel the same way.  I was never the hopeless romantic type.  But now I can’t stop fantasizing about her.  I’d think about us doing the long three-hour hike up to that magnificent view from one of our first dates.  To that first kiss, as we overlooked the lights of the city.  But this time I’d get down on one knee, bring out the ring, and… well… you know what would happen next.  \n\nAlright, fine.  I’ll stop.  Yes, this is a girl I’d only been casually dating for a couple of months.  I shouldn’t be thinking about proposing yet.  I know that.  I'm just barely able to control myself any longer.  I feel as though I’m losing power over the decisions I make. \n\nAnd that brings me to why I’m here writing this out at the moment.  It started with the first real thing that troubled me about her. We’d never actually spent a night together.  No matter how late she was over, once either of us showed signs of being tired, she’d up and leave.  She wouldn’t leave awkwardly or in anger. Just a casual kiss good night, a smile, and a “call me soon”. \n\nIt was something I didn’t really even notice the first few times she did it.  But after almost 8 weeks of dating, it was becoming strange.  I’d have to ask her about it.\n\nIt took drinking almost an entire bottle of wine before I had the courage to do it.  She looked almost defeated when I asked and lowered her eyes in embarrassment.  “I knew this talk would come eventually,” She started.  She took in a deep breath with a long drawn out exhale.  “Recently….“  she paused again.  “I’ve started talking in my sleep.”  She shook her head in embarrassment.    “It’s called somniloquy, I looked it up.”  \n\nI shrugged and laughed out loud.  My demeanor seemed to say “That’s it?”\n\n“No, Stephen… listen” she said.  She wasn’t laughing.  “It’s bad.  It… It’s completely out of control.  It’s not just random words or gibberish.  No.  It’s horrible.  I say horrible disgusting things.”  She was starting to raise her voice, breath heavy,  and tear up.\n\nI approached her and held her.  I told her it couldn’t be that bad.  I told her to spend the night.  I told her she was probably exaggerating.  \n\nI was wrong.\n\nThat night she stayed at my house.  But she warned me of something before falling asleep.  “Whatever you do, don’t wake me up.  It makes me really scared and disoriented if that happens.  And don’t respond to me.  Just ignore it.”  I nodded and agreed.   “If it becomes too much,” she continued, “just leave the room and sleep on the couch.  I won’t mind.”\n\nI told her not to worry about it. I told her that it wouldn’t be a big deal.  I told her I wouldn’t leave to the couch.  I’d stay beside her in the bed.\n\nBut I was wrong.\n\nI couldn’t even last one night.\n\n***\n\nWe both fell asleep without incident.  I don’t know how many hours passed, but I woke up in the dark with the sensation that someone was watching me.  And then I remembered… *She* was with me.  She was actually spending the night.  I smiled.\n\nBut then I noticed the shadowy outline of her sitting up on the bed.  She was looking down at me.  Staring.  \n\nIt creeped me out.  I’ll admit it.  Her posture was entirely different.  It was as though it wasn’t even her at all.\n\nThen she spoke.\n\nIt wasn’t her voice that I heard.  It was much lower and gravelly.  Like something out of a horror movie.\n\n“*I’ll chew the skin from your bones.*”  She said.\n\nI froze. \n\nAt first, I just kept looking at her.  This was not at all what I expected.  I thought it would be more like the way Tourette’s is often portrayed.  Just random swearing and shouting.   I honestly thought to myself… what will I do if she attacks me right now?  What if she really does try to chew the skin from my bones?  \n\nBut then she just lied down and went back to sleep.\n\nI was creeped out.  I tried to lie back down and ignore her but struggled.  I couldn’t even close my eyes without thinking “Maybe she’s sitting up again and staring at me.”  And then one time I rolled over to look at her…and she *was*.\n\nHer face was pressed right towards mine.  Her breath was foul and rotted.  Something that was most certainly not normal for her.  She spoke again, in the same voice as before.\n\n“*If you don’t move to the couch, you’ll be dead by morning.*”\n\nThat did it for me.  I sat up in a moment and headed for the living room.\n\nShe made some sort of wheezing sound as I left.  I think it was supposed to be laughter.\n\nI was lying on the couch, but I wasn’t going to be able to fall back to sleep.  I was far too shaken.\n\nI was staring out towards the window, hoping to see the first few hints of the sun rising.\n\nAnd then I thought I heard something.  From the bedroom.\n\nI listened.\n\nAnd then I heard it again. \n\n“*Stephen.*”   It was that same low and gravelly voice. It sounded like a witch. \n\nI tried to just ignore it at first.  But then it continued. \n\n“*Stephen.*”  \n\nStill I said nothing.  \n\n“*I know you can hear me, Stephen.  You’re awake now.  Why don’t you come back into the bedroom?*”\n\nThe voice barely sounded human.  \n\n“*Or maybe you’d prefer if I come to **you**?*”\n\nI still didn’t say anything.  I was told not to.  But I listened.  If I heard her start walking towards the bedroom door, I’m not even joking, I would have run right out of the apartment. But she had asked me not to respond to her sleep talking.  So I didn’t.\n\nAnd then I heard her once more.\n\n“*Sorry if this spoils your plans.*”   She began laughing.  “*The two of you were supposed to walk that trail again.*” she started.  I wasn’t even remotely prepared for what she’d say next.\n\n “*You’d both be so tired when you’d reach the top.  You’d look over the city.  Then you’ll get on one knee, and bring out the ring.*”  She began laughing. \n\nAnd that’s when I realized this wasn’t just a problem with sleep talking.  It was something much more.  Something supernatural.  I had never told anybody about my proposal fantasy.  There was simply no way she could have known about any of it.\n\nThis was no longer about merely talking in ones’ sleep.  This was about possession. I can’t go back into the bedroom.  I have no idea what would happen if I did.  Instead, I’m going to wait it out, holding up in my living room until the sun rises.  I have a couple more hours yet.  I can hear her laughing occasionally in the bedroom. It’s still not her voice. Still that same low pitch cackle.\n\nBut as I sit on my couch writing this out, here’s what scares me the most…\n\nMaybe my infatuation and utter obsession with her wasn’t normal.  I said before that I felt like I was losing control of myself.  More so I believe than the typical falling in love story.  No.  I fear that the infatuation I felt was the entity slowly taking control of *me*.  Of it controlling my thoughts, fears, ambitions, and anxieties.  Maybe once I become completely absorbed, a transfer would occur, and she would be free of it. \n\nI know I should leave.  That I should open the front door, get in my car, and drive away from here.  But I can’t. I can’t leave her.  I’ve already lost control.\n\nI’m infatuated with her.\n\nUtterly infatuated.", "comments": [{"id": "e1ssepc", "author": "Nightmare_Pasta", "body": "you should've talked back ina creepier voice\n\n\"I will cook you alive and use your bones for my soup\""}, {"id": "e1sy5sc", "author": "Four-SidedTriangle", "body": "Nah man, go over to her, grab her firmly, and headbutt that shit right outa her"}, {"id": "e1syx44", "author": "LyriumDreams", "body": "Damn, that was creepy. So glad the only weird thing my husband's ever said in his sleep was \"fuck you, Batman, you owe me 20 bucks\". I wish you luck, OP."}, {"id": "e1ssrp8", "author": "Tyrianne", "body": "Of course I had to read this in bed with my boyfriend sleeping next to me, and OF COURSE he had to start making noises just as I finished the story. Thanks OP, no sleep for me tonight! "}, {"id": "e1sva7a", "author": "Erin_C_86", "body": "I wonder what happened to the last person who heard her talk in her sleep..."}, {"id": "e1srskf", "author": "balthazar_nor", "body": "Holy moly you get her to a priest right after the sunrises"}, {"id": "e1sw3y1", "author": "ryanjaywilson", "body": "You should record an audio of one of these episodes, then the next time she starts.. just put your phone on your pillow with the recording playing and let her fight it out with her demon from the night before.. could be interesting."}, {"id": "e1ss54s", "author": "AyDeek", "body": "My wife used to fall asleep on the couch and randomly start speaking in tongues. It only would last a few seconds, but would scare the shit out of me everytime. Once, I had to shake her to wake her up because it went on for longer than normal. I was always afraid to touch her when this happened because I was afraid of what 'her' response would be. She came right out of it and wondered what the hell happened and why I was so freaked out. It hasn't happened for awhile now, thank god."}, {"id": "e1sqhkh", "author": "msnrcn", "body": "Jesus Christ thats good. Man its 2pm in broad daylight on 4th of July and I'm in my kitchen completely absorbed by this.\n\nEdit: My highest rated comment at [666+]? Jeez."}, {"id": "e1sstla", "author": "Waltzeswithcats", "body": "Two words, sleep phones. I use them to listen to white noise and filter out my husbands snoring. If you can't hear her then problem solved. And you get normal non-possessed gf during the day. Everyone's happy "}, {"id": "e1suwe9", "author": "bronkomeister", "body": "Yep. Holy water. Garlic. Crosses. Restraints. Mouthwash. "}, {"id": "e1t96p2", "author": "SuzeV2", "body": "When my husband and I were younger he would talk in his sleep. It never bothered me until one night I awoke to find him with his head off the pillow and he looked right at me and said “He’s here”.   I said -terrified now- “who’s here?!”  He just repeated to me “He’s here.”   Then he rolls over and goes back to sleep!!!   I was terrified and listened closely to every sound waiting for something to come get me!!  It never did but that scared the shit outta me. Just like your situation is!  Get out now!"}, {"id": "e1sy2ru", "author": "BeautifulSparrow", "body": "You made my heart feel so weird. Usually reading stuff on here doesn't creep me out like that. "}, {"id": "e1t0z6i", "author": "Drwatson197", "body": "> “*Sorry if this spoils your plans.*”  \n\nThe hag is polite enough.. what were you scared of?"}, {"id": "e1t82e8", "author": "Snow344", "body": "This reminds me of an old trauma that I have.\nBasically I just woke up randomly in the night, and I saw a shadow looking straight at me. The room was dark and everything was quiet. I just woke up so I couldn't see what was it. I was frozen. My vision got a better and I saw a the eyes of it, then I suddenly screamed. Then the thing turned the light on: It was my mother... Lol. But it scared the shit out of me and I still think about it every time.\n\nEdit: Also my heart frozze in the skin part, I loved this story! You deserve that Gold."}, {"id": "e1sw6nl", "author": "Gates_Of_Dawn", "body": "**She’s lost control again**"}, {"id": "e1sntmx", "author": "dazria", "body": "This creeped me out mostly because I feel the same way towards my boyfriend.\n"}, {"id": "e1sr8ar", "author": "Snowtrudger", "body": "Nope nope nope.... or invest in ear plugs"}, {"id": "e1splj9", "author": "Jakzsta", "body": "What the fuuuck\n"}, {"id": "e1stjqj", "author": "Auntjemima1028", "body": "Christ! That was creepy. You need to find a priest for your girlfriend. Keep us posted please! We need to knowww what happens nexttttt"}, {"id": "e1sy5jc", "author": "Clarkinator69", "body": "Sometimes I read nosleep in bed at night. Thank God this one was broad daylight in the living room."}, {"id": "e1stjhm", "author": "Pixulate", "body": "Gave me the spooks man, i should really stop reading these stories.. ^^’’"}, {"id": "e1sp5by", "author": "EyesoftheObsidian", "body": "Per our reading we do not infer any deterioration on her body- infatuated as you are, you'd have noticed. If so, do not despair; if anything, this is a lowly spirit posing as a demon. Worst case scenario, a lowly demon, in any case.\n\nPowerful entities do not bother with things such as this.\n\nThis may not solve your problem, but alleviate your worry. "}, {"id": "e1tdv7c", "author": "prufrog", "body": "The question is......\n\n\n\n\n\n\n\n\n\nWhy is she calling you Stephen when you're a Ryan"}, {"id": "e1tbt30", "author": "Maximumwolf99", "body": "I'm on mobile, and the app shows you the picture for the sub at the top left. For whatever reason I thought this was r/dadjokes and saw that it had gold, so I thought it would be funny. I read the whole thing expecting a punch line. I was sadly mistaken "}, {"id": "e1t2sdx", "author": "Kalifreyja", "body": "Spitballing here, but what is her pendant exactly? Does she ever take it off? "}, {"id": "e1t3hty", "author": "benevolentpirate", "body": "It's been 5 hours! Updates??"}, {"id": "e1t7b03", "author": "triprw", "body": "I have never heard of this sub.   This made me an instant subscriber.  Gave me chills."}, {"id": "e1st121", "author": "Redditlust1", "body": "This was awesome! I really thought he was gonna slip and talk back, to her 😂 Kind of wish he did 😅"}, {"id": "e1sw19y", "author": "adulthoodlvl1", "body": "I was like \"this is like me and my ex\", until you both fell asleep. That shit made my skin crawl.. Daymn "}, {"id": "e1toekv", "author": "Branovices", "body": "Just act like you're really into it. \n\nTry to make the creepy sleep-thing uncomfortable. Maybe start masturbating when it's talking about eating your skin or whatever, while staring right at her."}, {"id": "e1sph7m", "author": "NutCrackerOS", "body": "Did you tell her about it?"}, {"id": "e1t0spj", "author": "garlictakeover", "body": "I would have ran the fuck out of the appartment the moment she said I will shew the skin off your bones. Fuck love,bitch, I am getting an exorcist! "}, {"id": "e1t6mzw", "author": "cairnschaos", "body": "I've seem something like this before. Girl named Faye visited Pikes Peak, Colorado. Some kind of spirit latched onto her, remained dormant for a while until the girl and her fiance returned to the mountain. Gotta say, I don't know all the details but these cases sound strikingly similar. Don't have much advice OP, all I can say is try and be cautious, try to resist this infatuation that's taken over you."}, {"id": "e1t9h72", "author": "Synovus", "body": "Fuck this shit, I'm at work alone till 1:00 am and I'm reading shit like this. I must have lost my damn mind. Great read though, if you ever make a continuation make sure to post it. Thanks for the post."}, {"id": "e1srpw9", "author": "mekulot", "body": "No sleep for me then."}, {"id": "e1t4hy2", "author": "PureKoolAid", "body": "How did she know that she had the problem in the first place?"}, {"id": "e1t6yx8", "author": "bimmerbloke", "body": "My friend Adam wants a part 2, if you aren't dead OP please consider."}, {"id": "e1u1v23", "author": "MadMike0351", "body": "It's good to see my ex has a new boyfriend!"}, {"id": "e1swx1v", "author": "graufather", "body": "Great story...If it’s true, just throw some holy water on her and see what happens"}, {"id": "e1sy6r3", "author": "damnenginegnomes", "body": "Fascinating read. "}, {"id": "e1t0968", "author": "Raineeacee", "body": "Christ on a bike. "}, {"id": "e1sypfj", "author": "Imnotcrazee420", "body": "I know personally how screaming and talking in your sleep can be to People. I have Sleep paralysis, and apparently night terrors frequently. I don't always remember them.  But I've woken my entire house up Screaming and yelling at the top of my lungs.  My girlfriend and roommates are like how can you stay asleep while doing that.  I remember my sleep paralysis more. Because I'm kinda awake but not, and can't move.  And a lot of that  is horrifying.  But in a way I kind of enjoy it alittle too.  I guess because it's interesting. Horrifying and yet not causing physical harm.  Great Story OP.  I loved it."}, {"id": "e1t2pg5", "author": "Edalestro", "body": "Please write a book. Please."}, {"id": "e1sw4s4", "author": "Iief", "body": "Holy shit man. That is insane. I empathise with being completely infatuated with a girl but have never had to deal with that sort of supernatural spook. Did she mention at all if she was working on the problem with a therapist? Or maybe  you need an exorcist..! Good luck my man. I'd be interested in knowing how this all works out."}, {"id": "e1sz03g", "author": "justawitch", "body": "Probably a possession. Honestly, they’re fairly simple to deal with. Try not to worry!"}, {"id": "e1t6jm9", "author": "artos0131", "body": "Your story is better than a coffee, I don't feel sleepy at all. Thanks OP."}, {"id": "e1t6kcl", "author": "Maxykilla", "body": "At first i thought this sub was for people to write stuff when they couldn't sleep. Night workers telling stories or something like that. I was in all seriousness freaked the f*** out. Even after checking the sub description i'm still uneasy"}, {"id": "e1t6yg0", "author": "FullOfQuestions99", "body": "Think girlfriend needs to stop thumbing through the Necronomicon before bed...."}, {"id": "e1tck39", "author": "LongLostJohn", "body": "Wow... I have few words to express how your story makes me feel. I lost someone because of something similar to this, and I still feel a bit like a coward for running away...\n\nJust hope you don't end up hearing voices afterwards..."}, {"id": "e1sx5p1", "author": "Creeping_dread", "body": "Kinky. "}, {"id": "e1t6af8", "author": "FallbrookRedhair", "body": "I watched The Exorcist series, s2, before reading this, and am now regretting my impulsive evening plans to indulge myself into some good ole horror.\n\nGreat story btw, and nice writing style."}, {"id": "e1tbqkb", "author": "Glorpflorp", "body": "Consistent tense would be dank."}, {"id": "e1uvuzq", "author": "AliensMakeMeHard", "body": "Shiiit, Better make that scary Bitch find a job too since she living there with y'all rent free and Fucking with people's rest. i don't know who you think you are but you Better take that Shit to night shift. "}, {"id": "e1ssqy0", "author": "tubbywubby2001", "body": "its just your girl sleeptalking. She didn't say \"i know about your proposal fantasy\". Heck, she might have her own proposal fantasy. "}, {"id": "e1sv01x", "author": "quinns33", "body": "Bro you need to get some Christian's round and g at them to pray over her, because this is clearly demonic. Only Jesus can defeat anything and everything because he is God. I hope this gets sorted bro good luck"}, {"id": "e1stxve", "author": "IWontProvideSources", "body": "Inb4 all the christians talking about demons\n\nProtip : It gets better when her anxiety goes down. Also maybe stop watching horrors and thrillers"}, {"id": "e1t68jn", "author": "YamahaRD350", "body": "what the fuckkk! anyway, fyi : \"I once heard that the ancient Greeks believed that falling madly and irrationally in love with somebody was a curse that you would wish upon your enemies. I could never understand what they meant. After all, isn’t falling head over heels in love the ultimate goal nowadays? But now that it’s happened to me, I have to say… the ancient Greeks were right. This is a curse. I was barely in control of myself. Almost as though my infatuation with her had… possessed me.\"     this is called r/limerence"}, {"id": "e1u1r6k", "author": "Sigma-42", "body": "I wonder who it was who originally informed her of her sleep-talking and how disturbing it was..."}, {"id": "e4t86oy", "author": "mmcfall434", "body": "Dont stick your dick in crazy..."}, {"id": "e1spbcd", "author": "grego303", "body": "Creepy indeed"}, {"id": "e1sr2xm", "author": "Danichick", "body": "Shittt"}, {"id": "e1st0dv", "author": "RedBoi2101", "body": "Lets get this woman an exorcism "}, {"id": "e1svkdl", "author": "x_Lele", "body": "Loved this but ngl, I giggled more than I should... my dad is called Stephen xD "}, {"id": "e1svoqv", "author": "pikachusbooty", "body": "So maybe this is why I haven’t spent the night with my guy yet. We’re in the same stages lol. "}, {"id": "e1t0cxx", "author": "sophless", "body": "That's amazing op, so so inclusive "}, {"id": "e1t1fgz", "author": "Chemicallyinsanebele", "body": "What she needs is holy vater."}, {"id": "e1t4f64", "author": "The_Confused_Indian", "body": "Wow!!\nWhat a way to start my day!!! \nAs if a sprained back and a sleepless night weren't blessings enough...\n\n\nBut seriously dude, I loved this so much. Kudos ❤🙂"}, {"id": "e1t69cx", "author": "Mortka", "body": "A girl I used to date had sleeping paralysis, and she would warn me every time we went to bed. Luckily she would never have it when we were sleeping together. \n\nAnyways, this shit is next level creepy and fucked. Good luck bro"}, {"id": "e1t82mc", "author": "fuckingusernamess", "body": "Well I'm sleeping with my back to the wall tonight."}, {"id": "e1t91t6", "author": "maikobaconeggs", "body": "Holy guacamole. What a great read."}, {"id": "e1tal4x", "author": "Fearcooker", "body": "This can be one of the best horror movies i just had in my mind. 9:29pm......"}, {"id": "e1tf5hl", "author": "DoomGuy66", "body": "I'm reading this at 1am sleeping next to my girlfriend.\nFuck me "}, {"id": "e1thb00", "author": "CesarMillan_Official", "body": "My wife talks in her sleep but she speaks Cantonese so I don't know what the hell she talks about."}, {"id": "e1tk20x", "author": "tribe171", "body": "Anyone else think the story is less creepy because of the supernatural element? I think it would be more unsettling if the voice was just an alternate ego. Then OP would have the conflict of trying to figure out who his girlfriend actually is. \n\nBut since it's a demon, all OP needs to do is shop around online for a good deal on an exorcist, drop her off at the Catholic church the next morning, and then pick her up in the afternoon fixed good as new."}, {"id": "e1tkjec", "author": "NotTheJediLuke", "body": "Don't push the demon away. Befriend it the poor thing it's probably lonely and has no one to talk to maybe try talking to it and getting to know it better."}, {"id": "e1utukd", "author": "woodlandolive", "body": "Holy shit. This was the first story I've read on here in a while that really scared me "}, {"id": "e1vf7ds", "author": "Dragon_Druid", "body": "Just reply:\n\n\"Bones don't have skin, you dumb demon bitch\""}, {"id": "e1wj3fr", "author": "tway2241", "body": ">Her face was pressed right towards mine. Her breath was foul and rotted. Something that was most certainly not normal for her.\n\nAppropriate response (I learned this from Reddit): \"Hey I'm bored let's go drink mouth wash\""}, {"id": "e1zukjy", "author": "rubiscoisrad", "body": "K, so I have a history of sleep-talking. \n\nThe other night I had a dream while my husband was awake reading beside me. I shouted \"TOYOTA\" so loud I woke myself up. \n\nI'm so glad that's all I do. "}, {"id": "e2cfje5", "author": "EtherWarrior", "body": "Dude, this is the best short horror story I've ever read. "}, {"id": "e2xksj6", "author": "noheadd", "body": "Be honest you went back in at sunrise for some of that morning good good"}, {"id": "e1sz4x8", "author": "KalenTamil", "body": "Oh god, this churned my stomache quite a bit. 😷"}, {"id": "e1szftk", "author": "DepthZero", "body": "I'm legitimatly scared.. that was amazing "}, {"id": "e1t0rmr", "author": "CuppyCakesLovey", "body": "Many many goosebumps. "}, {"id": "e1t1ys4", "author": "Chemicallyinsanebele", "body": "Pleaseeeee upload a part 2!!!"}, {"id": "e1t2h62", "author": "PastaMasta19", "body": "What the actual fuck"}, {"id": "e1t7pnh", "author": "jomamaq02", "body": "Exorcism?  Prozac at bedtime?  No spicy foods after 2:00 PM?"}, {"id": "e1t98pq", "author": "evilpenguin95", "body": "Holy freaking shit. What did I just read :o\n I would have ran away as far as I could.Man, this is super crazy.\nThank god I’m single haha jk. "}, {"id": "e1t9f37", "author": "iambpburke", "body": "OP needs to watch the Poltergasm episode of American Dad. Pretty sure that’s what is going on here. "}, {"id": "e1tbc87", "author": "MysticWitDaMelody", "body": "This is creepy as fuck. \n\nDemon possessed girls are the scariest. "}, {"id": "e1tbcno", "author": "Bamboozle4ever", "body": "Legitimately goosebumped."}, {"id": "e1tbfo1", "author": "imcesey", "body": "Your girl needs Jesus."}, {"id": "e1tcezk", "author": "etxgirl80", "body": "Crap, shouldn't have read this right now."}, {"id": "e1tdghh", "author": "Tonadas", "body": "Holy fuck. Yikes that was good. Jesus."}, {"id": "e1tdngx", "author": "Hereforpowerwashing", "body": "Very well done, OP. You're a talented writer. I got some chills."}, {"id": "e1te8qk", "author": "Petternackles", "body": "That...was...awesome. Captivated once again on Reddit at 1245 a.m. "}, {"id": "e1tedg1", "author": "SenpaiSwanky", "body": "gahdamn"}, {"id": "e1teph7", "author": "DonnaTX", "body": "💯"}, {"id": "e1tgutx", "author": "DixieNormous404", "body": "OP, the smell of rotten eggs is definitely an indication of something demonic. So creepy, I am glad you stayed true and didn't respond to the voice."}, {"id": "e1tkmuk", "author": "jbl0ggs", "body": "Hopefully the ring purchase is still within the return period "}, {"id": "e1tm4p3", "author": "jms07e", "body": "I’m never reading No Sleep while lying down before bed ever again. Holy shit this story was a little too good."}, {"id": "e1tmuw2", "author": "KodakKid3", "body": "why the fuck am I reading this in bed at 2 am"}, {"id": "e1tngjo", "author": "Legacy_Ranga", "body": "i once woke up to my neighbour screaming \"it's a boy, its a boy!\" thought she just had a baby because she was due any day so i go over to congratulate. nope, turns out her dog had a baby instead. "}, {"id": "e1tr73c", "author": "Wondrous_Fairy", "body": "Go back there, sleep with her and when she starts talking, propose to the other thing instead. "}, {"id": "e1tte1g", "author": "LiAlgo", "body": "sucks for you, demons! i don't have a girlfriend!"}, {"id": "e1tv9xr", "author": "oluuus", "body": "Great read! I've been thrilled the whole time!"}, {"id": "e1twncf", "author": "AliensMakeMeHard", "body": "Fart in her mouth next time...maybe a finger in her butt or put pop rocks in your mouth and eat her ass since she wants to be on some freaky Shit. "}, {"id": "e1tyj3t", "author": "Guardna", "body": "These are some great lengths she is prepared to go to make you break up with her guess a break up text its too harsh in her opinion"}, {"id": "e1tyqdt", "author": "Percybhowal", "body": "Son of an... Aphrodite?"}, {"id": "e1tyrj5", "author": "SilentLennie", "body": "Now that I think about it, I would have liked to see a photo of this woman to see what she looks like. :-)"}, {"id": "e1tz99f", "author": "ShivaChaos", "body": "this. is. fantastic. ok really bad for you. but really good."}, {"id": "e1u03pu", "author": "Itsyab0y", "body": "Sounds like a story but if true that’s creepy AF, my X used to talk in her sleep too but she would just repeat things she did during her day which is how I found out she was cheating on me."}, {"id": "e1u1xh5", "author": "tcbisthewaytobe", "body": "I apparently talk in my sleep too. Mostly unintelligible gibberish. Sometimes “contact left!” Probably from my years in he Army. Every now and then I’ll chant something like “no no no” or “not them”. Can mostly trace all this back to dreams about war when I’m stressed out or stop smoking weed. Very rarely I’ll respond to things going on like someone turning off a fan and me rolling over to say “turn that back on” or so I’m told."}, {"id": "e1u232n", "author": "cosmically_drizzy", "body": "I say you chew the skin off of **her** bones"}, {"id": "e1u2jux", "author": "_ragingpotato_", "body": "Need more of it.\n"}, {"id": "e1u51hd", "author": "redhead_hmmm", "body": "This is why I avoid this sub...but what are you going to do? I mean she's perfect, but maybe to perfect? She told you it was bad and maybe she doesn't even know she's possessed, but she tried to avoid sleeping with you. And I'm new to reddit. Isn't there a way to set up a remind to check back in? "}, {"id": "e1u5nhh", "author": "Neuroplastic_Grunt", "body": "More of this please! Nice work. "}, {"id": "e1u84iy", "author": "psgamemaster", "body": "🎶I hear the secrets that you keep, when you're talking in your sleep🎶"}, {"id": "e1u8ope", "author": "Kamihana", "body": "Holy shit.... \n\nI think I will appreciate my boyfriend's snore more now o-o .\n\nMildly traumatized by this... "}, {"id": "e1udw4t", "author": "lovetheearth", "body": "I believe that this story may be true.\n\nDemons enjoy to make you feel terrified. But this can turn into something good for you: what if this fear motivates you to seek faith?\n\nYou now know that 'supernatural entity' is a thing, it is actually real. If you didn't believe that before, now you're starting to!\n\nAnd if there's a supernatural reality, there is also God (don't want to debate this, just take it or leave it). If God is real, this event wasn't random at all, He allowed you to experience it with a certain purpose.\n\nWell, God certainly wants you to do this (to seek and strengthen your faith). In fact, certain difficult situations are only allowed by God in order to lead you exactly where you have to be - closer to Him.\n\nEdit: Oh, and if you are actually reading this answer, guess what? Not an accident either. God wants you to know this.\nAnd I'm not saying that this possession is meant to be only a tool for God's purposes. Of course not! When it's about God's wisdom and kindness, even something good may come out of distressing situations."}, {"id": "e1ug8ok", "author": "xheanorth", "body": "Never go full Boyle. "}, {"id": "e1ugblk", "author": "ShadowElite86", "body": "Stop with the constant lies. Please seek immediate help."}, {"id": "e1uyy4j", "author": "ouroboro76", "body": "Get a priest immediately, if you’re still alive."}, {"id": "e1uzk6x", "author": "winchester9191", "body": "Oh god, it's bloody hot and I covered myself with my duvet after reading this! "}, {"id": "e1wjrvt", "author": "WeirdRaccoon", "body": "This was one of those *really good* reads in this subreddit that gave me chills. \n\nI think the lore about demons is that they can at most give influence on the person but when the person opens up to it and \"invites it\" then it can act out at will and hurt others through the person. You may want to talk to her and ask if she got affiliated with such scenes, **take care OP**."}, {"id": "e1xfgor", "author": "dellboy177", "body": "Demon \"What're ya sellin'?\"\n\nStephen \"What're ya buyin'?!\""}, {"id": "e21ra9h", "author": "Light_yagami_2122", "body": "What if OP has schizophrenia? I'm late so this comment probably won't receive attention but maybe the girl isn't even real"}, {"id": "e2af8ew", "author": "pictairn", "body": "I thought you were just dating? Does she know you call her your girlfriend?"}, {"id": "e2tof9a", "author": "coconut_eater", "body": "Um. Is OP leaving after the hag told him to considered responding?"}, {"id": "e30xejj", "author": "AfterBuy", "body": "Oh fuck off. My name is Stephen. This isn't going to be fun"}, {"id": "e3cry5c", "author": "that-one-guy-youknow", "body": "This was terrifying, great job!  I got some adrenaline spikes when she was like “go to the couch or you’ll be dead by morning”\n\nThe only thing that sorta killed the mood for me was when you talked about how she’s “possessed.” It sounds a little forced. You should leave it to the reader the mystery of what’s happening, kinda a show don’t tell thing I suppose"}, {"id": "e4ecgup", "author": "Cementbutterfly", "body": "Really wish this was made into a series or something. Loved reading it. Creeped me right the fuck out."}, {"id": "e4qu9nk", "author": "xbad_wolfxi", "body": "Have her enroll in a sleep study where she can be monitored by professionals, maybe? I also feel like she's watching me right now and I'm legitimately terrified. Update us, okay? \n\nThe only intelligible thing he's ever said to me in his sleep was \"I love how you're always making the right call\" and I feel like that's the literal opposite of what's going on at your house and I'm sorry "}, {"id": "e4vy988", "author": "aloneinmysoul", "body": "Gotta try this one on my boyfriend. If he stays, then I’d be sure he is utterly infatuated with me..."}, {"id": "e8l2zz2", "author": "sithdude24", "body": "Look on the bright side! If it’s true, your next partner will be utterly infatuated with you."}, {"id": "e1t0b2u", "author": "smoresNporn", "body": "That was amazing well-written dude. If you write more, I'd definitely suggest submitting to horror literary magazines."}, {"id": "e1t8ssp", "author": "MrMara", "body": "Sometimes these stories are so good that I forget that they're not true. This is one of those stories. Bravo!"}, {"id": "e1szgo3", "author": "EmpressEgregious", "body": "Definitely do not stay in the room with her... Whatever is going on she already warned you what would happen. Don't be the dumb white guy in the horror movie that has to do the most obviously wrong thing. Then we wouldn't get to find out what happens lol.\n\nI have terrifying nightmares and talk or scream in my sleep. Sometimes I wake myself up hitting something on the bed or trying to rip or fold my phone in half because it's not a phone in my dream. But as far as I know I don't have a different voice or say anything too crazy. My breath probably stinks but that's a different issue 😂 In spite of that I have had several infatuated/obsessed boyfriends though so maybe I should record myself sleeping just to be safe."}, {"id": "e1t4c77", "author": "KJParker888", "body": "Hmmmm.... My boyfriend sometimes talks in his sleep, but I can't always understand what he's saying. Maybe it's better that way?"}, {"id": "e1t55ks", "author": "Pimpdesu", "body": "oh hell no its the middle of the night now im scared"}, {"id": "e1t91n2", "author": "imnowtotallyjudging", "body": "Don't get me wrong this creeped the shit out of me, I literally just went on youtube for some cheerful songs to cope with what my mind went through when reading this... LOL\n\nAlthough it might sound something paranormal, I couldn't help of thinking on a Folie à deux case, It still sounds really weird and creepy AF, but maybe finding a rational explanation can help to bring some piece of mind."}, {"id": "e1t91ro", "author": "Ashangu", "body": "I dont ever read these because I find them boring. But i read yours, so that's something lol."}, {"id": "e1tl64a", "author": "tonypale", "body": "I read though a shit ton of comments to see if anyone had asked what seemed to me to be the first and most obvious question, How did ‘girlfriend’ know she was saying horrible things in her sleep if she was asleep? Clearly, there was another sleep mate in the picture who informed her, don’t you think? Ryan/Stephen writes a compelling story and does it well. I suspect this is all it is? Reality?... I’m a bit skeptical. You?"}, {"id": "e1sznuf", "author": "Wdbohonn", "body": "Hm"}, {"id": "e1t23o0", "author": "bootyjuice89", "body": "Hey, I kinda want to make this into a short film. Would that be cool with you? This is a really good concept and I think It'd be dope."}, {"id": "e1t2ghe", "author": "hungerstrikecortana", "body": "This sent chills to my spine and it's only 8:54 am here. "}, {"id": "e1t36ch", "author": "k0skid", "body": "Ok read that in the dark...bad idea"}, {"id": "e1t3d84", "author": "SterryDan", "body": "I have a form of sleepwalking where I sit up and seem awake and can talk. I only look sleepy. I don't remember shit of it."}, {"id": "e1t3sk7", "author": "Grparet", "body": "OP-I love to be obsessed. However, it’s really important that you find some spirit guidance here if you are going to continue loving on her. If you can’t make it one night, you ain’t making a lifetime. Unless your life ends reallly soon. "}, {"id": "e1t4a6r", "author": "NormalDudeWalking", "body": "Oh man. That's a proper fright. I hope you make it safely through the night and have the energy to share another account of your experiences! "}, {"id": "e1t4gbv", "author": "poiuy5", "body": "Fucking excellent. "}, {"id": "e1t4pil", "author": "coniferstance", "body": "Damn, man. My boyfriend (seems) mad for me AND I sleep talk.\n\nNo but seriously, stay safe and I hope we get an update."}, {"id": "e1t4xw9", "author": "cubikolympic", "body": "You really need to get into conversation with her subconscious imagine how deep and weird it could get. Would love this! "}, {"id": "e1t5dk1", "author": "Sodium1111", "body": "\"And we went on to be happily married with 3 children\""}, {"id": "e1t5jsh", "author": "elushinz", "body": "Now if she said shit like “ talk to me, not the girl!”, time to get Kevin Bacon involved. "}, {"id": "e1t5l56", "author": "TheGuyAboveMeSucks", "body": "I swore this was a different sub when I started reading this. "}, {"id": "e1t5l9q", "author": "Ruckinhd", "body": "It is july 4th. Mid way through the neighbors fireworks. I am 30 and scared. Jesus christ OP. Good read. "}, {"id": "e1t5mbu", "author": "Buraot3D", "body": "Oh my god. It's 10AM here and now I'm afraid of even going to the bathroom, more so, talk to the girl that I am dating"}, {"id": "e1t72pd", "author": "Unclegreene", "body": "Bravo! Please remember this comment. If you write a book tell me I want a copy! Magnificent "}, {"id": "e1t7goy", "author": "zooropagirl7272", "body": "It’s 10:30 PM at night here, I’m in bed reading this. Always a bad idea to read nosleep in the evening. Legit freaked out, OP! I don’t even want to imagine how you feel! \n\nCall a priest immediately, please! "}, {"id": "e1t7ntz", "author": "Raesam", "body": "spooky!"}, {"id": "e1t8ph2", "author": "Bigjoemonger", "body": "The instant i read stephen i thought it was going to ve a reference to the cable guy."}, {"id": "e1t8zin", "author": "goatsanddragons", "body": "> “Or maybe you’d prefer if I come to *you*?”\n\nWell, atleast we know that was a bluff. Bad news is that it can read minds so you don't have much time to try out plans before the spirit tries something. I guess the best you can do are contacting somebody for an excorcism or a cleansing ritual."}, {"id": "e1ta4ez", "author": "sloppyjoseph3", "body": "Legitimately creepy, nice work man "}, {"id": "e1ta6pq", "author": "Droid3T", "body": "Bro go bang out some strange.  Best advice right there ignore the rest of these comments. "}, {"id": "e1taldi", "author": "cwittyprice", "body": "Update please. "}, {"id": "e1tawmk", "author": "ScarecrowTEP", "body": "Please tell me you're gonna tell us more."}, {"id": "e1tb6hg", "author": "Thomashus", "body": "Are you still alive, Stephen? Did she try eating you? "}, {"id": "e1tbcsp", "author": "troytorres", "body": "Time for you to have that talk now.  You could start off something like \"it's not you it's me\"....\"OK its fucking you alright!\""}, {"id": "e1tbhb3", "author": "jerseyojo", "body": "Fuck that I'll wake a bitch up and have her be scared and disoriented. Buy a super soaker and unleash from a distance. "}, {"id": "e1tbk5g", "author": "dreamofrose", "body": "edit: OP is no longer with us anymore "}, {"id": "e1tbnq1", "author": "jackmoopoo", "body": "I kinda want a part 2 but then that would ruin the atmosphere :("}, {"id": "e1tbpns", "author": "Yeera", "body": "I read the italics in Batman's voice"}, {"id": "e1tbs71", "author": "student-throwaway22", "body": "Ending seems like a cliffhanger. Was hoping for more but still a good story."}, {"id": "e1tbx9s", "author": "creepypgirl79", "body": "Just about to go to bed this was scary as shit. So your girls possessed.  And your under her control. Please update us asap"}, {"id": "e1tc9c8", "author": "Verkillyn", "body": "wait is this serious or am i missing something?  i fucking read this now at 1am.... wtf man?"}, {"id": "e1tclzf", "author": "schaferlite", "body": "My name is Stephen.  \n\n\nI didnt need to sleep tonight anyway :)"}, {"id": "e1tctd0", "author": "Moialminhas", "body": "Sometimes I sing while I'm sleeping, my husband gets really scared because it doesn't sound like me, he says I sound like a creepy kid from a horror movie just humming. "}, {"id": "e1tcz74", "author": "TotallyNotAliens", "body": "Read this at 10:19. It’s a good bedtime story probably helps that dreams don’t stay unless they are really fucky"}, {"id": "e1tdiq8", "author": "SFSally415", "body": "."}, {"id": "e1tdota", "author": "thelittlestheadcase", "body": "You should contact Felix. "}, {"id": "e1tdstj", "author": "prufrog", "body": "I think the only reason you'll be going to a church is to get an exorcism m8 forget infatuation dip this woman in holy water istg."}, {"id": "e1tdwlw", "author": "someguynamedjosh", "body": "This was great"}, {"id": "e1te17b", "author": "RUSHALISK", "body": "I can't tell if this is a story or if its real..."}, {"id": "e1tee9x", "author": "kimchita", "body": "I used to do that and scare the hell outta my mom. She used to call my brother to calm me down but I was sitting on the bed, open eyes smiling, making weird noises and laughing like twice a week. Creepy enough. "}, {"id": "e1tesk1", "author": "kemo77", "body": "Just take her to a priest (preferably a mature/ wise one), after explaining what happened to you. If it is supernatural, she will refuse going with you. "}, {"id": "e1teuok", "author": "TheEighthLord", "body": "I hate myself for not reading what this subreddit is about because I'm lying in bed with my girlfriend beside me, and from r/all I find myself reading a post about what I thought was someone who was so infatuated with their SO that their heart beat was keeping them up. \n\nNow my heart is beating really fast and I don't think I'm going to sleep."}, {"id": "e1tf118", "author": "Kawaiikittenofsatan", "body": "Omggg why did I read this as I’m trying to sleep?! IM SCARED. "}, {"id": "e1tf4q1", "author": "Tripleshotlatte", "body": "How rude! Making you sleep on the couch. ~~She~~It should be the one on the couch!"}, {"id": "e1tfgna", "author": "WonderfulNinja", "body": "Just get married, comes with a free exorcism.  "}, {"id": "e1tfpar", "author": "Calavan-Deck", "body": "Started reading, looked at the SO in bed and changed my mind. I'll be back in the morning I think "}, {"id": "e1tfu21", "author": "YonHye", "body": "Holy shit. I'm reading this in my bed alone, and I got chills. And now I'm super scared, even though I'm not sleeping with anybody"}, {"id": "e1tfx1a", "author": "liam_420_420", "body": "Bro you should have went and lot some stage in your room "}, {"id": "e1tfxry", "author": "mrcats1999", "body": "Sounds like you got this idea after watching a couple episodes of the exorcist or something lmfao, good read nonetheless "}, {"id": "e1tg277", "author": "TobarMan", "body": "Did you live?"}, {"id": "e1tg8r7", "author": "danniegrl22", "body": "That same morning, after being up the remaining of the night (with all the lights on minus the lights in the room), is to smudge the shit out of your house! Seriously, go down to the nearest yoga studio, you’re bound to find someone that does this. Sage, Pablo Santo, crystals, Holy water; the whole fucking thing! After that, Feng Shui your house, you seriously need to have as much positive flow in your home. It might seem a little over the top, but who gives a shit, do you really want your skin eaten off?!\n\nThen take that poor woman to see someone to get that demon out of her. \n\nI would have shit my pants and bed if my husband was doing that. "}, {"id": "e1tgbjl", "author": "GearSuper", "body": "Well.. shit.  Who cares about sleeping, right?"}, {"id": "e1tgcxg", "author": "YuckerMucker987", "body": "I read this whole thing thinking I was in r/relationships and was fucking shook by the end of it  "}, {"id": "e1tgd7j", "author": "Daninjaman", "body": " Who direc dis and who de stars?"}, {"id": "e1tgj3e", "author": "Kittykanoe", "body": "I hope this helps: I talk in my sleep, too, and it’s embarassing. Perhaps that’s why she was hesitant to stay with you. I can feel myself physically reach out sometimes. Like pointing, or calling someone to me. There is a term for someone that is in technical sleep “limbo.” Awake, aware, but not conscious. My dreams are usually a regurgitation of recent conversations, thoughts, interactions, things I read, and stuff I saw on tv. All nonsensical. It’s very disconcerting. Does your girl friend watch or read any fiction that would align with her actions during her disturbing dreams? The fact that she hid this from you shows that it bothers her, but she cares a lot for you. Hope this helps. Oh, if she says don’t wake her, don’t wake her. She’s being vulnerable to you."}]}