{"id": "8wu3y1", "title": "Something went wrong with my heart transplant", "url": "https://www.reddit.com/r/nosleep/comments/8wu3y1/something_went_wrong_with_my_heart_transplant/", "subreddit": "nosleep", "author": "KatrinCiernan", "text": "I’ve always had a weak heart.\n\nNot just physically, I’ve always been afraid of my own shadow. It was unsurprising when the doctors told me my heart murmur wasn’t just a heart murmur. A year of tests. A year of therapy, constant trips to the hospital and I was finally told that it had all been for nothing.\n\nMy poor weak heart wouldn’t last till Christmas. It’s a strange thing being told that you’re dying; I didn’t come to terms with it at first. I drank and I spent my money. I did reckless, stupid things because I was so damn scared.\n\nThen I got the news. That a young woman called Laura had been declared brain dead and that I, the lucky chosen one, would be getting a brand new heart a week later. I drove to the hospital slowly, carefully, and readied myself for the ordeal that was to come.\n\nAs I was laying in bed on the last night, the thought of Laura swirled around in my head and it wouldn’t leave me alone. It was like her name was in flashing lights every time I closed my eyes.\n\nIt was wrong, I know it was, but I had to see the woman who was giving me her heart. It didn’t feel right not to put a face to the one who was saving my life. I knew her name, I knew what ward she was staying on- I had overheard the two nurses discussing it. I wandered down the meandering hallways until I found what I was looking for, taking my time, making sure I didn’t miss any name. I guess I had time on my hands now.\n\nIn the second to last room, she lay in bed. A woman sat on the bed next to her, holding her hand, and my own weak heart stuttered.\n\n“Excuse me.” I had no idea what to say to her. “I’m Jenna. I’m the person… I’m having surgery tomorrow and..” What I assumed was Laura’s mother stood up and I could tell from the look in her eye that she knew who I was.\n\n“Thank you for visiting. I know it’s strange, but a part of her is going to be living on in you. I wanted to meet you.” I stood there, helpless and lost for words. Laura’s mother beckoned me over.\n\n“Please.” She said. “Don’t feel uncomfortable. Its what she would have wanted.” I sat on the chair next to Laura.\n\n“How did she-“ I broke off. It was too awful to ask. Laura’s mother gave me a thin smile.\n\n“She was a care worker. Looked after battered wives, abused women. Last month she met a guy and… Well. I suppose years of training can’t help you when you’re in love. She ignored the warning signs. And he killed her. She dedicated her life to those who needed her.” Laura’s mother looked down. I don’t know why I did it, but I reached over, and held Laura’s hand. I squeezed it.\n\n“I’m so sorry. I had a boyfriend once who… He was like that too. Someone like Laura convinced me to leave.” Laura’s mother gave me another half smile. I could see the tears in her eyes.\n\nThen Laura squeezed my hand. Tightly. She gripped me so hard that her fingernails dug into my skin. I recoiled, a look of horror on my face. Laura’s mother looked at me calmly.\n\n“She squeezes my hand sometimes as well. I think the Doctors called it muscle spasms. Either way. There’s none of Laura left in there anymore.” I looked at the small crescent moons that had just started to bleed on the palm of my hand.\n\nThe surgery went perfectly. I was wheeled to the recovery suite after it was over and done with, the raised wound on my chest covered by gauze. It was better if I didn’t see it, I thought. I didn’t need any more heart issues. I spent the first day doped up on the pain medication, eating only a little and sitting up maybe two times. It was a long process, they reassured me.\n\nLaura’s mother came to visit me the day before I was due to leave. Her calm demeanor hadn’t wavered but I could see that she was suffering. She looked ten years older, and her hands shook when she gave me a hug.\n\n“When are you going home?”\n\n“Tomorrow.” I told her. “Please, come visit whenever you want.” I started to jot down my address for her, when out of the corner of my eye, a flash of blonde disappeared through the doorway. The same brilliant blonde as Laura’s hair.\n\n“Ow!” I cried out suddenly. It felt like someone had sharply squeezed my hand so hard it had almost crushed the bones. Laura’s mother rushed to my side, a look of concern in her eyes.\n\n“What’s wrong? Is it your heart?” She stumbled over the last words, coming to terms with what she had said. I tried to reassure her and said I’d let the doctors know, and she left with a look of worry on her face.\n\nWhen I looked down, a new set of crescent fingernail marks were below the ones that Laura’s had made. Ten identical bleeding smiles.\n\nThe taxi ride home was short, and before I knew it I was back in my own flat. It felt strange to try and slot back into where I had left off, my life had been almost over the last time I had been here. I looked over the mess and the cardboard boxes, the remnants of one night where I had tearfully tried to pack and store my belongings so my parents wouldn’t have to do it when I died.\n\nLaura’s heart beat so strongly it felt like it would come out of my chest. It did this all the time, and I realized this was what a healthy heart must feel like. So why couldn’t I shake my feeling of unease?\n\nThat night, I had a dream.\n\nLaura was in her hospital bed, but her mother was gone. I could hear my heart, Laura’s heart, beating in my eardrums so loudly it was painful. I tried to cover them, but my hands were pinned to my sides. Some unexplainable force was moving me towards the motionless figure of Laura on the bed, her lips were blue and the window had come open, whipping her blonde hair around her face.\n\nI was almost on top of her when her eyes flew open.\n\nThey were milky white, the eyes of someone dead.\n\n“Get out.” She rasped, her voice guttural. I could hear the heartbeat faster and faster, drumming until I thought I couldn’t take it anymore.\n\nThen I woke up. The sound had been real. Laura’s heart was so loud it felt like it would rupture my eardrums and I screamed in agony, trying to cover my ears. It was useless, it was coming from some deep place inside me, I could feel it reverberating around the hollows of my chest.\n\nI stumbled out of bed, gasping for air, and tried to find my phone. I needed to call someone, anyone, an ambulance or my mom. Anyone that would pick up.\n\n“Get out.” It was a faint whisper over the hammering thumps of Laura’s heart, a low guttural voice that sounded like it had been made by an animal, and I crawled to the door, down the hallway, choking on my screams for help. My neighbor opened the door, his eyes as wide as saucers at the sight of me on the floor clutching my chest.\n\nHe drove me to hospital as I cried in the passenger seat of his car.\n\nAfter about fifty different checkups, the doctors told me that absolutely nothing was wrong with me. They told me my heart was regular, my blood pressure was normal, and that everything was going just swimmingly. I stood in the waiting area, wallowing in my shame and frustration.\n\nThat heart didn’t belong to me.\n\nMy phone buzzed on the counter, an unknown number. Great. That was all I needed, more unexplained, scary things like a stranger on the end of the phone. My voice sounded small on the line,\n\n“Hello?”\n\n“Good morning, this is the Thames Valley police, we’ve called to report an incident that occurred in your flat at around 1.30am today.” I felt a wave of embarrassment.\n\n“I’m so sorry, I recently had surgery and I wasn’t feeling well. I had to have my neighbor drive me to the hospital and I think I panicked a little in the hallway before I left.” There was a small silence on the other end of the phone.\n\n“I’m afraid this is something you might want to be sitting down for.” I felt Laura’s heart beats, strong and calm. “There was an incident of forced entry by Mr Samuel Matthews, according to our police records he’s your ex partner and you filed a restraining order against him in September 2017.” My blood ran cold.\n\n“I did.”\n\n“He’s in police custody. We found an automatic weapon on him and we believe he had the intent to harm you. We have an officer currently stationed at your flat who can fill you in depending on how long your hospital stay will be.”\n\nI thanked him and hung up the phone.\n\nFor a moment, I leant against the wall, the horror slowly spreading over me. If I had been in my flat ten minutes later he would have found me.\n\nLaura’s heartbeats filled my ears again but now they were gentle, calming. Her mother said she dedicated every part of her to helping those who needed it.\n\nI put both my hands on my chest, overwhelmed by my own gratitude, and listened to Laura.", "comments": [{"id": "e1ynz4j", "author": "ChidzHustle", "body": "Brilliant twist that Laura saying “get out” wasn’t like a “this is my heart not yours, go away” but a warning that her abusive ex was coming, it all ties in really nicely this is sweet lol!"}, {"id": "e1yqziy", "author": "saitouamaya", "body": "Whoa, that gave me chills. I'm a kidney transplant recipient of 11 years. I do often think about the person who had to die to give me her kidney. Whenever I first got my transplant, I wrote her family a letter thanking them and they wrote back. The letters are all filtered through the hospital and names white-outed, but I could still read her name. I looked her up online and she died in a car accident on her way to work at a hospital one morning. She was married and had three kids. Being a transplant patient is this weird juxtaposition of feeling both incredibly thankful and happy to have a functioning organ again, but also guilty and sad that someone else had to die. "}, {"id": "e1yjpkl", "author": "emilymarie0528", "body": "This was such a lovely story. I really didn't know where it was going to go, but I'm so happy with the ending. Maybe you should dedicate your life to mimic Laura's?"}, {"id": "e1ynsi3", "author": "HandsomeBagelBatch", "body": "First I was like \"Laura you shithead\" when she was clawing at her and then I was like \"oh shiiiit Laura you fucking rock\""}, {"id": "e1ygdrq", "author": "leeannsalas", "body": "Laura was a role model to be sure. Fantastic job!"}, {"id": "e1yydee", "author": "prginocx", "body": "My grandma got a heart from a young man killed in a car crash, he had filled out the donor card.    She lived another SIX YEARS, and yes we made those years count !!!   She got to see my daughter born, she got to see my son finish 3rd grade.     She taught me how to make pie dough so light, you have to bake it between two  metal pans, the one on top keeps it from floating right up off the pan.    then you hold it down with the filling...."}, {"id": "e1ymfbk", "author": "Jonathan_the_Nerd", "body": "> \"Get out.\"\n\nNow I see why."}, {"id": "e1yer82", "author": "Deshea420", "body": "Awwwww Laura is awesome "}, {"id": "e1yl3fj", "author": "trippy4pple", "body": "wow. gave me goosebumps reading this for some reason. nice job!"}, {"id": "e1yyz7k", "author": "Redstone_Potato", "body": "Shit, I 100% expected Laura to come back as a ghost and try to take back her heart/take over the narrator's body, and the story would just end with the narrator cutting out the heart because the torture was unbearable...\n\nAnd then I got hit with this fucking wall of wholesomeness. Good job, you've earned my upvote"}, {"id": "e1yoy9g", "author": "sppookypotpie", "body": "I got chills. I lost my phone and haven't been on reddit for weeks, and this was the first story I've read. Even the stories on top of all time didn't give me chills like this one. Amazing, well done."}, {"id": "e1ym2l3", "author": "vaib_25", "body": "Wow, it's so good, so well written, everything just lure me inside the story."}, {"id": "e1yvh4h", "author": "Happy_Fun_Balll", "body": "Wow, that was not where I’d thought this was going (when she initially squeezed your hand I thought mom was evil/not really her mom and harvesting her organs). But the best anecdotes I’ve read on here rarely go where I think they will. Glad you have a guardian angel (and her heart) to help you, hope that dickhead goes away for a long time. I’ve been in an abusive relationship, was injured twice before I left. I’ve also been scared enough to take out a restraining order on another ex who was emotionally manipulative and went unhinged. Your anecdote was the opposite of a trigger - it kind of made me feel safe. Glad you’re safe now."}, {"id": "e1ymjry", "author": "BLONDEBITCHH", "body": "I’m so happy to read something like this on this sub for once "}, {"id": "e1zbusz", "author": "Hot_Like_Wow", "body": "I am now terrified for my heart transplant. Luckily mine will probably be a pig heart, so haunted bacon here I come!"}, {"id": "e1z5kml", "author": "MrsECummings", "body": "This was fantastic!! As a previously abused woman,  my respect for what Laura did for you is incredible.  "}, {"id": "e1yohu8", "author": "JackStillAlive", "body": "Damn Id love to see this as a movie"}, {"id": "e1yq0fj", "author": "jessicadorable", "body": "She helped you escape the same fate <3 I wonder if she'll be with you forever now? "}, {"id": "e1z0nmq", "author": "Poiuytgfdsa", "body": "Oh my god the ending gave me chills, what a fantastic story. Beautifully written, easily my favorite story on this sub to date. Fantastic job OP."}, {"id": "e1yj7ct", "author": "Icy_princess", "body": "I love this💖💖💖"}, {"id": "e1yo2k0", "author": "TittyKittyKing", "body": "I had goosebumps after the ending! I am so glad you are safe "}, {"id": "e1yuo9k", "author": "RazamRM", "body": "This story was amazing! But what I don't get is why Jenna suddenly got more nail marks after the heart surgery? Was that Laura, and if so why did she do that?"}, {"id": "e1z2k70", "author": "balthazar_nor", "body": "Laura had a nice heart."}, {"id": "e1zcbci", "author": "thebluemorpha", "body": "The year before I met my husband, he had a full liver transplant. It's been12 years since then, and we keep a photo of his donor on our bedroom wall. "}, {"id": "e1yo8f9", "author": "bubblepencup", "body": "Something about this story is so calming"}, {"id": "e1yxy3n", "author": "pretty_chill26", "body": "I love reading the comments about leaving abusive relationships."}, {"id": "e1yxql5", "author": "Buttergenie", "body": "My name is Laura, so reading this was a trip and a half. What a fantastic story!"}, {"id": "e1yzpt1", "author": "SpicyBites", "body": "I got chills, I heard my own heart, and I was stunned when it came to the ending. "}, {"id": "e1yzrd9", "author": "ExplodingSofa", "body": "Gave me goosebumps! What a good story! "}, {"id": "e1z2epj", "author": "CharlieAndArtemis", "body": "My favorite stories are the ones that make my eyes well up at the end. Good job. :)"}, {"id": "e1znhun", "author": "screwingates", "body": "That was amazing...the twist was perfect....well done...trust your heart...Laura cares."}, {"id": "e1yro4a", "author": "centurii", "body": "At first I thought this was a metaphor of guilt. That it wasn’t a real being, but that even if you replace a physical heart you can’t change your mental heart, and that even though OP had a new strong heart, her mind was no different. Weak and guilty. But then the ending totally stomped all over my entire theory, but this was still an incredible piece of writing. Amazing."}, {"id": "e1yqxkh", "author": "Whatsthedealwithit11", "body": "Damn. What a twist!"}, {"id": "e1yqygx", "author": "Ripley-8", "body": "That was beautiful "}, {"id": "e1ytcsa", "author": "Nanobreak_", "body": "That's some hardcore wholesomeness right there"}, {"id": "e1yukw8", "author": "Simatras", "body": "That was beautiful!  Be I almost cried."}, {"id": "e1yw4zw", "author": "nazthegreat1", "body": "That was beautiful, and a really good twist at the end."}, {"id": "e1ywjno", "author": "Vitomikey", "body": "A healthy heart and a guardian angel. "}, {"id": "e1ywouu", "author": "FatAngryOrc", "body": "I'm not crying you're crying!"}, {"id": "e1yx2i2", "author": "fireinthemountains", "body": "You fucking made me cry you monster. "}, {"id": "e1yymj8", "author": "MaterialisticWorm", "body": "Oh my gosh I got shivers for a full five seconds this was amazingly creative!!!"}, {"id": "e1yzjym", "author": "earrlymorning", "body": "i’m so glad it ended the way it did "}, {"id": "e1z0ujp", "author": "andyru86", "body": "Wow, this story was powerful. I do believe that people can help others, even if they were on the other side. "}, {"id": "e1z4hm8", "author": "FillYourOwnBucket", "body": "Literal goosebumps after reading. "}, {"id": "e1z7cta", "author": "mochiiyo", "body": "This did not go the way I thought it would. Very surprisingly nice twist. I liked it."}, {"id": "e1zfahf", "author": "LiquifiedBakedGood", "body": "Fuckin Laura, absolute unit"}, {"id": "e1zt7xw", "author": "yuklz", "body": "I've got goosebumps.. she's doing good even after her death, what a beautiful person Laura was! You must thank her amazing mother! ❤️"}, {"id": "e20g21l", "author": "Hopipotamus", "body": "I was expecting Laura’s heart was malicious, which was expected, but making the heart benevolent made the story 10 times better"}, {"id": "e1yjjgx", "author": "essentiallycallista", "body": "Ima ducking cry...ima cry so so hard♡♡♡♡ "}, {"id": "e1ylo23", "author": "EscapedHypeBeasts", "body": "I felt like there is some untold story about why Laura prevented Jenna from giving her own mother her address "}, {"id": "e1yqkim", "author": "internetmantelet", "body": "Awwww!"}, {"id": "e1ysex9", "author": "kokism", "body": "Holy Shit this was amazing!"}, {"id": "e1ysgo4", "author": "Causonew", "body": "I really thought you were gonna fall in love with the man that tried to kill Laura haha at least it ended wholesome"}, {"id": "e1yugqk", "author": "DearRed14", "body": "This...this was a good story. Stressing and panic-inducing, even for someone lucky enough to have a healthy heart.\n\nWell done."}, {"id": "e1yvumk", "author": "7serpent", "body": "Your writing was enjoyable, thanks."}, {"id": "e1yy1z2", "author": "BjuiiBomb", "body": "This is a nice story it has a happy ending to it and it’s a unique thing that Laura turned out being good.\n\n"}, {"id": "e1yync1", "author": "Mr_TheGuy", "body": "Continuous goose bumps, absolutely amazing story and twist!"}, {"id": "e1yz3b4", "author": "casuallyobserve", "body": "This was an amazing story. Probably one of the best I’ve read on nosleep. "}, {"id": "e1yzxgc", "author": "mexicanwetback", "body": "Ohhhh! Awwww! I loved this! "}, {"id": "e1z4pe7", "author": "htimsmc369", "body": "I’m covered in chills! This is great. "}, {"id": "e1zmf2z", "author": "SyntheticManiac", "body": "Aww... all about that Wholesome NoSleep."}, {"id": "e1zn5kv", "author": "umagatanghaligabi", "body": "I knew something was up. Didn’t make sense for Laura to “haunt” someone when she was a saint when she was living. Love the story nonetheless!"}, {"id": "e1zq0um", "author": "1BlueWahoo", "body": "Oh my god. Love it! Reminds me about one of my favorite nosleep stories about Fran and Jock! "}, {"id": "e1zqmy6", "author": "hannah_without_sugar", "body": "I’ve had a rough day, and this just made me cry. Definitely a good reminder to all of us to help our fellow humans whenever we can and to support the victims of abuse. Thank you for sharing it. "}, {"id": "e20whxu", "author": "WhiskersCleveland", "body": "Holy shit that's weird. Thames Valley police cover the area I live in.. This made it creepier :("}, {"id": "e23thrx", "author": "InquisitiveK", "body": "Love the twist. Really beautiful ending. Gave me chills. Well done. "}, {"id": "e252dni", "author": "itsonlyAri", "body": "R/wholesomenosleep"}, {"id": "e2d8j1n", "author": "RosaliaFB", "body": "Thanks for sharing OP!  Best one I've read tonight!\n\nFor those who aren't Organ Donors, I feel obligated to share this, its a nifty way for you to save a life (or more) in the unfortunate circumstance that your own ends:\n\nhttps://www.dmv.org/organ-donor.php"}, {"id": "e2d8j5m", "author": "RosaliaFB", "body": "Thanks for sharing OP!  Best one I've read tonight!\n\nFor those who aren't Organ Donors, I feel obligated to share this, its a nifty way for you to save a life (or more) in the unfortunate circumstance that your own ends:\n\nhttps://www.dmv.org/organ-donor.php"}, {"id": "e2lldor", "author": "Reflonch", "body": "r/wholesomenosleep"}, {"id": "e2xhygh", "author": "LordAnon5703", "body": "Chekhovs boyfriend. "}, {"id": "e2zwz1t", "author": "JH1234567989", "body": "Best story I've come across on here - absolutely beautiful "}, {"id": "e31hrgm", "author": "smm523", "body": "I was hoping this would be the ending. What a sweet woman. R/wholesomenosleep"}, {"id": "e3l6son", "author": "Shpyder", "body": "From no sleep to semi wholesome "}, {"id": "e65q2gq", "author": "onewithbun", "body": "r/wholesomenosleep"}, {"id": "e7j23be", "author": "ParanoidChicken", "body": "Just amazing.  Well done."}, {"id": "eajwisr", "author": "omgwhathaha", "body": "WHOLESOME NOSLEEP "}, {"id": "eas21b7", "author": "bobshellby", "body": "I'm glad that it was a happy ending :)"}, {"id": "e2096io", "author": "MarcoH9903", "body": "Story is great but I’m left wondering what’s an “automatic weapon” if you mean fully automatic firearm you can’t get that high of a clearance if you have assault charges pressed against you"}, {"id": "e1yzxcz", "author": "catus_star", "body": "That was as sad as it was creepy."}, {"id": "e1ymo73", "author": "Shezni", "body": "Laura sounds like a total badass to have helped someone from beyond the grave. Good for her! "}, {"id": "e1ys1xc", "author": "jellybby101", "body": "Oh wow! Wasn't expecting that! Absolutely brilliant "}, {"id": "e1ysqxs", "author": "MsCourtneyOlivia", "body": "This was so good!!☺️☺️ + it wasn’t that scary, it was a mix of sadness and eerieness!"}, {"id": "e1yuu36", "author": "purpletokes", "body": "I thought this would end in Laura trying to take this girl over but it ended up being an amazing story. Good job OP. "}, {"id": "e1ywhnc", "author": "insert_creative_nick", "body": "Somehow reminds me of Tell Tale Heart, but a positive version.Thank you OP, very good!"}, {"id": "e1yy84f", "author": "bluecheese09", "body": "Amazing that she saved your life! Twice!"}, {"id": "e1z04fs", "author": "stesle", "body": "Sooooooo good!!!!"}, {"id": "e1z59ab", "author": "worstbehaviorrr", "body": "I absolutely adored the twist with this story. Thank you Laura!"}, {"id": "e1z5hy9", "author": "ShapeWords", "body": "Sounds like something went very right with your heart transplant."}, {"id": "e1z6ehj", "author": "Berenst_in", "body": "Wow. That was a beautifully unexpected surprise. I loved it. So well written. You are blessed to have Laura be a part of you. "}, {"id": "e1z8nrx", "author": "sxpxrbxrxd", "body": "Thank you for the beautiful story! x"}, {"id": "e1zbrmt", "author": "soggy-bandaid", "body": "oh this was so sweet"}, {"id": "e1zbu22", "author": "gypsygirl83", "body": "Really good , pulled me right in! Loved the ending!"}, {"id": "e1zdf2b", "author": "_Rayne_X", "body": "Perfect. That ending was perfect. "}, {"id": "e1zeakz", "author": "lcrysis_HR", "body": "Well written"}, {"id": "e1zg9xr", "author": "Noveos_Republic", "body": "Waaiiit I'm still a little confused about the gripping thing. Why did Laura hold the hand so hard?"}, {"id": "e1zgj9n", "author": "Trophonix", "body": "Wow... I love this story. So dang wholesome and beautiful! "}, {"id": "e1zgmwf", "author": "Endrawrz", "body": "This was so sweet!"}, {"id": "e1zm418", "author": "Symmiie", "body": "Something went perfect with your heart transplant "}, {"id": "e1zn72e", "author": "livmaygray99", "body": "This is awesome. Did you post in wholesomenosleep as well? I like that the ending was a heart warming one (no pun intended)"}, {"id": "e1zo9fb", "author": "Revelt", "body": "I really enjoyed this. Absolutely brilliant. "}, {"id": "e1zpu4q", "author": "pinot__n0ir", "body": "This is so lovely."}, {"id": "e1zszgy", "author": "ChickawawaBaby", "body": "Loved this story. Good ending."}, {"id": "e1zvzyi", "author": "candymn3", "body": "Wow your literature skills are great"}, {"id": "e208qn2", "author": "fliphat", "body": "Omg this is so wholesome I am going to cry "}, {"id": "e20d7u4", "author": "Scout_A1_26", "body": "Woah, I’m not sure wether to be scared or heart warmed (ayyy pun intended). Unexpectedly wholesome-ish at the end. Keep writing OP! You’ve got a really nice style and pacing that I fancy."}, {"id": "e210174", "author": "cosmos2002", "body": "Fran and Jock with a heart."}, {"id": "e214epb", "author": "KillrAceOSpades", "body": "Holy hell. This touches a part of me that I've shoved deep down inside. Beautiful writing. Keep up the good work."}, {"id": "e216105", "author": "undeadg45", "body": "amazing writing so good i thought there was so much more to read"}, {"id": "e21easv", "author": "its_willis", "body": "Laura was telling you to leave, she didn’t want you to succumb to the same fate that ended her life."}, {"id": "e21wmdk", "author": "OPTradesPlease", "body": "This was a fantastic read! Nice work."}, {"id": "e2287ee", "author": "TheyCallMe-Blue", "body": "This made me tear up, loved it. "}, {"id": "e22ma6b", "author": "jlval87", "body": "As someone that has suffered from WebMDing chest pains to give myself a full blown \"panic attacked induced\" heart attack, I truly feel your pain whenever even the doctor is telling you everything is going well. I'm glad it actually saved your life. "}, {"id": "e234kox", "author": "vampyreegg", "body": "Aww good ghostie!"}, {"id": "e24ruh9", "author": "feijis", "body": "Oh god, I cried. Fantastic story."}, {"id": "e287b7l", "author": "darkdaydream", "body": "Goosebumps!"}, {"id": "e28qm8j", "author": "Mordred1121", "body": "This is astonishingly beautiful, good job op"}, {"id": "e28xxbn", "author": "dot_comma", "body": "I thought this would go wrong, but it ended oh-so-well. Nice, good for you OP.\n\nKinda weird for the nail-marks though."}, {"id": "e29bl1b", "author": "hommequiestdecente", "body": "Holy shit."}, {"id": "e2b9f1j", "author": "alahra511", "body": "Thank you, i can now sleep"}, {"id": "e2gudv1", "author": "Pokage", "body": "Wow. Amazing! Gave me chills, this was very good"}, {"id": "e2oqu6f", "author": "Maxronal", "body": "Title should say \"went right\""}, {"id": "e2s8lv1", "author": "fantubular", "body": "Crazy good twist. Did the movie “get out” inspire you by any chance?\nLike how there was brain transplants in the film and such? \nRegardless though, great story I got chills. "}, {"id": "e2sgfzh", "author": "hungurty", "body": "Actually got goosebumps toward the end there. Good job. "}, {"id": "e2ztk7g", "author": "Lubochka", "body": "Great flow. Kept me captivated and hanging on to every word!"}, {"id": "e4sx5qc", "author": "ladyb07", "body": "This was really great "}, {"id": "e5qmsa6", "author": "rain3y_", "body": "The good guy version of The Tell-Tale Heart?! Love it! "}, {"id": "e5sbl0c", "author": "childofbridgetjones", "body": "Totally imagining this Laura to be Laura off this year's Love Island. Those acrylics could definitely cause some damage."}, {"id": "e5v9xua", "author": "golfulus_shampoo", "body": "Awww. That's awesome!  I got skin for my left thigh from someone!  It's not as gross as your story though cuz the skin came from my right thigh. "}, {"id": "e89p2nc", "author": "HelloThere-66-", "body": "This is one great"}, {"id": "e8avv79", "author": "ThrowawayDorkie", "body": "I have literal chills! This is beautiful! "}, {"id": "e8owpub", "author": "s1ic3", "body": "this is a r/Wholesomenosleep if i've ever read one - such a satisfying ending! thanks for this :)"}, {"id": "e99hh92", "author": "urgoodbutimcrowley1", "body": "THIS IS SO FANTASTIC"}, {"id": "e9cc12o", "author": "TubbyBub", "body": "This is really similar to the “Fran and jock” story!"}, {"id": "e9yjvsk", "author": "relentlyss", "body": "THIS WAS AMAZING "}, {"id": "ea29td9", "author": "leapylizard", "body": "Mad lad Laura "}, {"id": "ea7705y", "author": "JacLaw", "body": "Loved this. You have a guardian angel, always listen to her"}, {"id": "eanba1r", "author": "Dr_Burbeans", "body": "Simply great. "}, {"id": "ebhxjob", "author": "samgarrison", "body": "Laura protecting people, even from beyond. This was sweet not scary. "}, {"id": "ec6w5yy", "author": "oliviasuzanne9", "body": "This gives me chills."}, {"id": "ecjj84m", "author": "rottenyfg", "body": "The part about the crescent fingernails still bug me. But it happened when she was writing down her address! It's as if Laura is trying to make OP keep her address a secret so her ex couldn't come. What a wholesome story this turns out to be. Hope you have a great life OP!"}, {"id": "e1yrjh2", "author": "Rise_Of_War7", "body": "Wow, this is the kind of story this sub is made for. "}, {"id": "e1yvdwv", "author": "birdieboii69", "body": "Goosebumpssssss"}, {"id": "e1znsoe", "author": "Snugglebunnyzz", "body": "As a person with a weak heart. This terrified me and made me happy at the same time. Glad you are safe. Zipper club forever. 💗"}, {"id": "e36xbpb", "author": "Toxic13-1-23-7", "body": "this reminds me so much of the fran and jock story"}, {"id": "e4d571f", "author": "Stuartriddle12", "body": "Reminds me of the one with the teddies, i think it was called fran and jock "}, {"id": "ebnjmn3", "author": "Arbenison", "body": "This is good and nice and even scary, but not too scary."}, {"id": "ebwzovm", "author": "goushiquej", "body": "This is wholesome! r/wholesomenosleep"}, {"id": "ecfh29m", "author": "merrymarchofmonsters", "body": "r/wholesomenosleep"}, {"id": "e1ys15w", "author": "forest_cat_mum", "body": "Omg! 🖤 Laura saved you. This is beautiful."}, {"id": "e1znmet", "author": "Tokeapi", "body": "Hey great read! please keep on the stories i imagined an anime with this:)"}, {"id": "e1zomwv", "author": "R2bEEaton_", "body": "Such a good story that I forgot about the clickbaity title until I went out of the post to browse more NS."}, {"id": "e4i7imi", "author": "JYLeverette", "body": "This is Fran and Jock with a heart..."}, {"id": "e207pnm", "author": "Myamaranth", "body": "I feel like \"Her mother said she dedicated every part of her to helping those who needed it\" could be removed. It would still have the same effect."}]}