{"id": "8xol0s", "title": "I Answered a Spam Call", "url": "https://www.reddit.com/r/nosleep/comments/8xol0s/i_answered_a_spam_call/", "subreddit": "nosleep", "author": "FirstBreath1", "text": "\"**Hello, is this Mr. Henderson?**\"\n\nThere was no real reason for me to pick up the phone. The spam app on my cell called out the mystery number right away. But, hell, I thought. Fuck it. There was no one else left in life for me to talk to. Even a debt collector sounded good at the  moment.\n\nMy wife was murdered in 2015. There really isn’t an easy way to say that other than getting it out of the way early. It was a random robbery gone wrong. One rainy night, some sick tweaking fuck snuck into our house and shot her. \n\nThe suspect was caught, two days later, and sentenced to life in prison. He still sits there today. \n\nI have worked in web development ever since. The job is remote, and the field caters to my hermit-like behavior out here in the woods of northern New Jersey. The lack of drug testing is really just an added benefit. I was perfectly free to fuck up the remainder of my own life. \n\nI don't have any friends, anymore. Not really. Sometimes... I guess it is easy to look for companionship in all the wrong places. \n\n\"*Senior or junior?*\" I replied to the lady with a sigh before settling into the armchair in my office with a bottle of wine. It was raining that night. The wind whipped the old pine tree in our back yard so hard I thought it might topple. \n\n\"**Uhh... Senior,**\" said the pretty, calm voice on the other line. She sounded familiar, but I blamed that notion on the half empty bottle of wine. \n\n\"*Apologies, ma'am, but... Senior died six years ago.*\" I said, a little annoyed at the lack of record keeping at this place.\n\nShe paused.\n\n\"**Oh gosh... gosh that is not what we have here. I am so sorry, Sir. We were not aware. Please forgive the intrusion and assumption. Would you mind pausing while I check my records?**\"\n\nA filing cabinet clicked steadily in the background as static crinkled. My guess was that the woman held the receiver to her shoulder. I chuckled a bit at the lack of audio quality. \n\n\"*No, no, no that is okay, no problem at all. No worries. Why don't you start by telling me your name?*\" I asked, cursing myself for the hint of shameless flirting at the end. \n\nShe giggled. Something about that laugh was very familiar. \"**My name is Emily, and I work with his credit card company,**\" she said in a rehearsed tone. \"**Unfortunately, we cannot divulge which firm over the phone if you are not on the account... which uh... you just admitted yourself, of course...**\"\n\n\"*Okay.*”\n\n\"**I am guessing that you are Mr. Henderson's son**,\" she mumbled while audibly thumbing through papers.\n\n\"*Yes ma'am, that's right. But it's been years... I could not possibly be stuck with the old man’s debt, right?*\" I asked hopefully.\n\n\"**Well, let's check, shall we?**\" there was a panicked shuffling and opening of books in the background. \"**I am so sorry, Sir,**\" she replied with a regretful tone. \"**The rules are in one of those three-ring binders, and they are very difficult to find. Please hold for a moment.**\"\n\n\"*That's okay... did not know anybody still kept records that way... do I get an e-mail confirmation of this charge as well?*\" I asked.\n\n\"**Excuse me?**\"\n\n\"*Email... like... electronic mail. A confirmation of the charge?*\" I asked again, allowing my confusion to turn to frustration. What was this lady’s problem? \n\n\"**We don’t do that here... still a few years away from all those fancy features,**” she continued. “**But as you know, late payments are a pretty serious issue. They can even affect the credit score of an individual when a large amount has not been paid.**\"\n\n\"*Okay, okay, of course,*\" I said, genuinely starting to grow worried and a bit flustered. \"*What can I do?*\"\n\n\"**Is there a Mrs. Henderson in the household?**\" she asked quietly.\n\n\"*Mrs. Henderson died in ‘06,*”\n\n\"**What year did you say? Oh my gosh. That is so horrible. I really am batting one thousand today.**\"\n\nI gasped. That was it. *That phrase.* I don't know if it was the way she said it, or the fact that simply not that many people used that exact language. But as soon as she did... something clicked in my memory.\n\nMy wife worked for a credit card company, before we met. Her name was also Emily. The voice sounded like hers... but it was younger. More hopeful than I remembered. \n\n\"*What is your last name?*\" I asked. \n\nThe line was silent.\n\n\"*Look, look, I know that's a weird question. But please, I think we know each other.*”\n\n\"**I can't give that information out...**\" she started\n\n\"*Okay. Did you go to Jefferson Memorial High School?*\"\n\n\"**Yes...**\" she said, astonished. \"**How did you know that?**\"\n\nIt was impossible. Emily was dead. The voice on the phone barely even sounded like her. It was younger, happier, more optimistic. This type of dream was actually the type of thing that had kept me up a million sleepless nights in the past. And yet, I was awake. Could it be a coincidence? \n\n\"*Is your mother's name Eva?*\"\n\nThere was silence on the other end of the line. Then her mouse-like reply confirmed my suspicions.\n\n\"**Who is this?**\"\n\nI took a deep breath. Either I understood what was happening, or I lost my mind. Might as well enjoy the ride. “*This next question is going to sound strange. What is today's date?*\"\n\n\"**I am sorry, Sir... what..? One moment.**\" She paused and shuffled around some more papers. \n\n\"**Today's date is July 9th, 1999.**\"\n\nIt was impossible. Could it be the storm? The anniversary of her death?\n\n\"*Emily, listen to me.*\"\n\n\"**Okay, Sir, this conversation is getting a little strange... let's keep it to the payment plan...**\"\n\n\"*Listen to me very carefully.... One day.... one day you are going to meet a man. You are going to love him, Emily. And he will love you more than you ever know.*” I had to give her something to remember. “*On your first holiday together, he will buy you one gift for all twelve days of Christmas.*”\n\n\"**Sounds dreamy,**\" she replied with a laugh and a sigh. “**Are you one of those psychics?**\"\n\n\"*I am serious. You will marry this man, Emily. He will buy you the ring you always wanted. The ceremony will be In a beautiful one in your home town. Your entire family will be there, including Aunt Zelda and your grandma from Tennessee..*\"\n\n“**I like this fortune cookie,**” she said with dripping sarcasm. \n\n“*But two years later, on July 9th, 2015, you will be murdered in the home you share together.*”\n\nShe shifted the phone nervously.\n\n\"**So what do I do?**”\n\nFirst, I tried to tell her to avoid the house that day. To never date me, to stay away forever and find a better life somewhere else. But somewhere in the middle of my rant, the line disconnected to the tune of a blood curdling scream. I called back to find a non-working number. She never answered again.\n\nI fell asleep listening to the thunder rolling through the sky. The scream from that night repeated from time to time while flashes of her body on the floor occasionally invaded my mind. I never questioned the call. I never asked why. Maybe it was God; maybe it was just time. But yesterday morning, when I woke up...\n\nEmily was by my [side.](https://reddit.com/r/MattRichardsen)", "comments": [{"id": "e24usev", "author": "OmegaX123", "body": "*This action will have consequences*"}, {"id": "e24ly82", "author": "alldaybrahs", "body": "Are you a telemarketer trying to get us to answer the fucking phone call!!!???? It was an entertaining read though. "}, {"id": "e24m1p1", "author": "GoldySlumbers", "body": "If only.  All I got was a Nigerian Prince, and half a million pounds so..."}, {"id": "e24ijv7", "author": "maliawinters", "body": "r/wholesomenosleep"}, {"id": "e24oy41", "author": "narwhal_fanatic", "body": "Did you happen to have a phone connected to a microwave spinning in reverse above a 42 inch CRT?"}, {"id": "e24p6ss", "author": "SilverBadger90", "body": "I think this is the first story on this subreddit that I’ve read that actually has a happy/not creepy ending!"}, {"id": "e24lj7u", "author": "plzdontskinsuitme", "body": "Genre: creepily sweet. "}, {"id": "e250780", "author": "BiPropellantValve", "body": "Timeline has been majorly altered. Prepare to be attacked by aliens."}, {"id": "e24jcs6", "author": "Beatful_chaos", "body": "This was too sweet. I love it."}, {"id": "e24nta2", "author": "lordofshadows326", "body": "What have you done! Saving Emily could have had DISATEROUS cosequences on the timeline! \n\n\n\n\n\n\nAll joking aside, made me cry. Great work"}, {"id": "e259pao", "author": "Jonla29", "body": ">\"Hello, is this Mr. Henderson?\"\n\n\"This is Football, I'm coming home.\""}, {"id": "e24miaw", "author": "Lrhall94", "body": "What spam app do you use? Im having issues with spam calls itd be nice to have something like that"}, {"id": "e24uxuz", "author": "evilpinkmonkey", "body": "I didn't sign up for these feels."}, {"id": "e24wb92", "author": "hodgely", "body": "An upvote, for sentimentality.\n\nSometimes, one wants to believe that lost things may be found."}, {"id": "e25los9", "author": "Cata04", "body": "Wait, did you check if your credit score is fine though?"}, {"id": "e2xirph", "author": "abovebetweenbelow", "body": "Everyone's talking about how wholesome this is but what if the ending is implying that Emily was by his side as in the dead corpse of Emily, hence the blood curdling scream. "}, {"id": "e24xc9x", "author": "lenswipe", "body": "Reminds me of [this movie](https://www.imdb.com/title/tt0186151/)"}, {"id": "e24xhbm", "author": "Jroon561", "body": "You should probably ask Emily what happened the day before."}, {"id": "e24o1pk", "author": "Covered_1n_Bees", "body": "So weird that someone is cutting onions on this bus.  So wonderful that you had a chance to start over!"}, {"id": "e24hoa7", "author": "Diabolicus666", "body": "That kept me well entertained, thank you for sharing!"}, {"id": "e24hmho", "author": "NostrilNugget", "body": "Awesome!!!!!!"}, {"id": "e24zcki", "author": "ichbinnotspeakgerman", "body": "r/healthysleep"}, {"id": "e24i6k4", "author": "VagosAdis", "body": "Awww"}, {"id": "e24kcfe", "author": "agentrlce", "body": "N’AWW"}, {"id": "e256z6x", "author": "amyss", "body": "I seriously had tears...if I had a chance to make sure my oldest son didn’t die that night...how I wish these circumstances would happen "}, {"id": "e26p6sr", "author": "CycloCyanide", "body": "We demand more happy endings. This was brilliant. Thank you. I needed this. "}, {"id": "e24mehr", "author": "lordoflotsofocelots", "body": "\\*Sniff\\* Awww, that was \\*sniff\\* was wonderful. Thanks!"}, {"id": "e24tv0r", "author": "Rainbowallthewayy", "body": "Great story just one mistake. You first said she was murderd in 2012 but later you say she should be carefull in 2015 (because she will be murdered otherwise). "}, {"id": "e24x03e", "author": "chickadee04", "body": "Kind of similar to Stephen King’s short story “Sorry, Right Number”. Some important differences, but similar idea. "}, {"id": "e24nmz5", "author": "Six_Fate", "body": "Yes! Positive ending!"}, {"id": "e24q5z9", "author": "ChaChaCharms", "body": "So.. a part 2 coming? She go all commando on the robber?"}, {"id": "e24r8xe", "author": "MidgarSoldier", "body": "Wow mate, what a great story. I read it thinking it would be...like most of the others on this sub. It was surprisingly wonderfully different!  "}, {"id": "e24vrkt", "author": "reddrazz", "body": "All the feels."}, {"id": "e24vxpu", "author": "fliphat", "body": "This sub is too wholesome for me recently , where is the horror blood and gores "}, {"id": "e251f5c", "author": "420N1CKN4M3", "body": "I'm like really, really, really sure history is just gonna repeat itself and she's fucked either way.. You can't just escape death like that.\n\nI mean I hope she could indeed, but I feel like this is gonna get shitty.."}, {"id": "e2728aj", "author": "confused_ass_fucked", "body": "Dude I'm actually sobbing right now. \n\nBravo dude,bravo!!"}, {"id": "e27lo15", "author": "WhiskersCleveland", "body": "Nice try you pesky telemarketer, im not falling for your tricks to get me to answer the phone "}, {"id": "e281q1x", "author": "Spaffin", "body": "Why did the line disconnect with a bloodcurdling scream?"}, {"id": "e24w3tq", "author": "SilasCrane", "body": "Beautiful."}, {"id": "e25cr5p", "author": "deniedbyquick", "body": "Oh great. Now I want to answer a spam call hoping it’ll bring my ex back "}, {"id": "e25jy1u", "author": "Kahliden", "body": "**WE CAN MAKE AN SCP OUT OF THIS**"}, {"id": "e25ttai", "author": "huwiler", "body": "Wow.  As a web developer who works from home and who's wife past away of unnatural causes (just a few couple months ago), this story really hit me...  "}, {"id": "e3mu9to", "author": "SolidMiddle", "body": "Is there a link at the end of the story? It's showing one but I can't tap it."}, {"id": "e24oerv", "author": "Siliziumwesen", "body": "Ghoosebumps"}, {"id": "e24rhz4", "author": "icreatemyownhell", "body": "I'm not sure whether this is more sweet than creepy, but it is definitely well written."}, {"id": "e24umqn", "author": "Kamihana", "body": "Wow, that was so beautiful. So glad you got a chance to start over. "}, {"id": "e25obo4", "author": "DNAD51-", "body": "I thoroughly enjoyed this story. Reminds me of the movie Frequency "}, {"id": "e25xeib", "author": "venbrou", "body": "Wow... Just wow. Not only is this a far cry from the usual creepy vibe of this sub, but....   \n\nIt's a very rare treat for me to read a story that actually brings a tear to my eye."}, {"id": "e26npl0", "author": "Buzzard_1", "body": "I dont usually like happy endings but this definitely cheered me up after a bad day :) please make a part 2 if its alright"}, {"id": "e29z34a", "author": "Ousterthisworld", "body": "Wait so did she think Mrs. Henderson died in 1906? If the call is from 1999 why would she not catch you saying the woman died in ‘06? Watch out OP, seems too good to be true "}, {"id": "e2czcbi", "author": "juni0rbastard", "body": "By far the most beautifully weird nosleep story. "}, {"id": "e2d4b0z", "author": "GM_Danielson", "body": "**Grateful to have been able to narrate this story with FirstBreath's permission:**\n\nhttps://youtu.be/vrMrRC0NroA"}, {"id": "e3dxmur", "author": "Miss-Deed", "body": "Holy shit, that was incredibly wholesome."}, {"id": "e24qpcw", "author": "WishLab", "body": "Awww this is lovely. >*sigh*<"}, {"id": "e24wuow", "author": "Nemam11", "body": "Amazing. I got goose bumps so many times my shirt came out of my pants! I love your style! "}, {"id": "e24ylyb", "author": "BlackSanta25", "body": "Would've been a great Twilight Zone episode, well done!"}, {"id": "e252xbs", "author": "hungryforever007", "body": "I’m tearing up over this, thank you for this beautiful story! "}, {"id": "e254623", "author": "paxromana96", "body": "> when I woke up\n\nI thought this was \"no sleep\"?\n\nJust kidding. Great story, op! I didn't expect that ending."}, {"id": "e257mji", "author": "Scullvine", "body": "You are genuinely one of the best writers I've had the pleasure of reading from in a while. Imagery is my no. 1 when it comes to reading an account, story, or tale. I hope you enjoy your time with Emily, you have been given the second chance that most of us dream of."}, {"id": "e257n8e", "author": "themeloncholybee", "body": "Man . That made me cry. Like I don't even know why; I mean I do. It was happy. Good job op"}, {"id": "e258hi4", "author": "koodallas", "body": "This was actually a very nice/romantic story! But it still had a twist and was a bit creepy. Well done, OP!!!"}, {"id": "e25eett", "author": "techshaker", "body": "It was a beautiful and the ending was very nice. thank you I will have a good night of sleep. "}, {"id": "e25yg0c", "author": "MolhCD", "body": "It worked!! Did you tell her about the call?"}, {"id": "e25yom2", "author": "Kalayug27", "body": "Yes!!!!"}, {"id": "e25ysut", "author": "offensivebluntcunt", "body": "You... Damn. I'm happy for you. "}, {"id": "e25zftx", "author": "ShortchangeParamecia", "body": "This may be the first post I've seen on here that had a genuinely happy ending."}, {"id": "e26a4ap", "author": "IamHowardMoxley", "body": "Breaking a timeline will cause wonderful consequences. "}, {"id": "e27t4sc", "author": "hesobe", "body": "im crying "}, {"id": "e2oli8e", "author": "Maxronal", "body": "Oh wow, this was really unexpected, and happy."}, {"id": "e2v2c4a", "author": "AttackApacheHeli", "body": "Emily is away"}, {"id": "e24kz9g", "author": "pleaseshootmenow", "body": "I love this!!!"}, {"id": "e24l4ud", "author": "Mayushiush", "body": "I got chills all over me. Thank you!"}, {"id": "e24l6ui", "author": "tommyhawk979", "body": "This is beautiful."}, {"id": "e24ladv", "author": "randomname123u74", "body": "Im home alone so that made it creeper "}, {"id": "e24lsqm", "author": "sarcasmeow", "body": "This makes my heart weep out of happiness."}, {"id": "e24mvke", "author": "Wigez", "body": "Top story that mate. "}, {"id": "e24ngu0", "author": "sittingonthecanape", "body": "Wonderful"}, {"id": "e24q00x", "author": "AD270", "body": "Congrats man\n"}, {"id": "e24ql6u", "author": "Astrum1337", "body": "Tears dripping :'("}, {"id": "e24ro9l", "author": "xd_vee", "body": "that's awesome!"}, {"id": "e24rp72", "author": "Shebaker", "body": "Awe, this made my heart happy. "}, {"id": "e24segr", "author": "ItsVesper-time", "body": "This kind of feels like some really weird dream"}, {"id": "e24tbkg", "author": "noyenstefani", "body": "Beautiful story! "}, {"id": "e24wkev", "author": "Office_fan721", "body": "Ok as I was thinking of some clever and/or funny comment to make my phone started ringing with what I am almost certain is a spam call. EEP! Good story though. Left a little lump in my throat. "}, {"id": "e24wtsk", "author": "hanquartet", "body": "Holy. Fucking. Shit.\nI have never gotten bolder shivers down my spine over a nosleep before.\nOh my fucking God this was so good and wholesome!!!"}, {"id": "e24x7mk", "author": "-Teslacoils-", "body": "Happy endings!"}, {"id": "e24z823", "author": "FartNibba", "body": "I liked this one :)"}, {"id": "e251p6s", "author": "unirin", "body": "well that was nice."}, {"id": "e253vip", "author": "gravekeepersven", "body": "Shook!"}, {"id": "e254rmf", "author": "sassypixelgirl", "body": "I don't know why this made me cry, but it did T_T\n\nGreat job! T_T"}, {"id": "e254spo", "author": "Bellarinna69", "body": "Omg I loved this!!!!!!!! "}, {"id": "e2559kw", "author": "Fushigibama", "body": "This is the best story I have ever read. The ending  was so good"}, {"id": "e255z12", "author": "totsnotaserialkiller", "body": "I got legit goosebumps at the end of that. Talk about a perfect ending. "}, {"id": "e256h0s", "author": "toolate4redpill", "body": "Twist: They had a daughter named Emily................\n\nWait a minute............EWWWWWW"}, {"id": "e25707b", "author": "aphyrodite", "body": "Omg I’m touched, great job OP"}, {"id": "e257sup", "author": "overachiever285", "body": "July 9th is my anniversary. Thanks for that "}, {"id": "e2588yr", "author": "amazinghadenMM", "body": "Damn. That was good. The ending was amazing and wholesome. I was more of happy at the end rather than   Creeped out."}, {"id": "e258k1d", "author": "artdo", "body": "Okay this gave me actual chills. Great writing OP!"}, {"id": "e259ixc", "author": "billalhadian", "body": "The wholesomeness on this post is enough to melt my cold, dead heart, nice work my dude"}, {"id": "e259x7g", "author": "Heavenli", "body": "Oh I loved this "}, {"id": "e25aoj0", "author": "Spazthing", "body": "Part II is when Emily leans over and asks him to go check on their two year old twins sleeping in the next room......"}, {"id": "e25avak", "author": "AGStyles", "body": "Can I create a short film out of this?"}, {"id": "e25azat", "author": "Kekkler", "body": "As I'm reading this on my phone I got a spam call... maybe I should call back just for fun."}, {"id": "e25b7df", "author": "christinakitsune", "body": "This was actually really bittersweet and not scary at all actually. this was the best thing I've read all day"}, {"id": "e25blqz", "author": "kaorii90", "body": "Such a good read OP! I was on the edge of my seat waiting to see if she followed your advice."}, {"id": "e25bzd9", "author": "brighthotrain", "body": "Love this love you thank you bye"}, {"id": "e25cy6n", "author": "RazeSpear", "body": "A nosleep with a potentially happy ending? Assuming she's not a flesh-eating zombie, or a siren, or anything like that?"}, {"id": "e25djxf", "author": "RiboZurai", "body": "This genuinely put a smile on my face. What an unexpected ending."}, {"id": "e25eb0q", "author": "Lily_Lackadaisy", "body": "Lovely"}, {"id": "e25fw19", "author": "xanadu-muse", "body": "r/wholesomenosleep"}, {"id": "e25k92e", "author": "doomrider7", "body": "Twilight Zone worthy."}, {"id": "e25kfm1", "author": "Libraluv", "body": "Wow. Gave me serious chills. So happy for you, OP"}, {"id": "e25kxe7", "author": "wahlburgerz", "body": "Literal goosebumps. That doesn’t happen often. "}, {"id": "e25kygd", "author": "shareasarah", "body": "Aw, yay!!! That made me so happy, and it was literally the only unexpected ending, given how things normally shake out on this sub. Hopefully, something else had screwed up the timeline, and this was the universe correcting itself (and there would thus be no negative repercussions for OP). "}, {"id": "e25lnj1", "author": "daddyslilmonstah", "body": "I’m crying"}, {"id": "e25mlfu", "author": "Loyfe_", "body": "This is why, I never keep talking to spam callers :)"}, {"id": "e25o0oq", "author": "MercyFaith", "body": "Awesome read!!   Write a sequel so we can know what happened since a second chance was had.  Let us know how you used that second chance with the wife!!!!"}, {"id": "e25pw7c", "author": "shralpy39", "body": "Wow. I got goosebumps when he asked her about the high school. Crazy."}, {"id": "e25rb5u", "author": "ChocktawRidge", "body": "YEAH! "}, {"id": "e25tgkd", "author": "Justblumberg", "body": "So good"}, {"id": "e25w9vx", "author": "colleengran", "body": "Thank you.  Finally a happy ending!"}, {"id": "e25wdmq", "author": "2B-4G10", "body": "now you can have a \"happy ending\" with her ;)"}, {"id": "e25wv3b", "author": "appa-ate-momo", "body": "Goddamn, what I would give for this chance."}, {"id": "e25ywd6", "author": "MissVile", "body": "Wow... I was genuinely not expecting that. Though, I am worried about what kinds of consequences there will be. Good job, OP!"}, {"id": "e261ir8", "author": "thatssokaitlin", "body": "It’s been a long time since a story on the sub has given me full body chills. I’m happy you and Emily get a second chance "}, {"id": "e262i0e", "author": "rw032697", "body": "Another nosleep story that breaks the illusion in the very last moment. \"then I woke up.. it was probably the hallucinations of the shrooms.. turns out I forgot to take my medication\". I keep wanting to believe these are real and then after faithfully reading the passage boom I get hit with the disclaimer. "}, {"id": "e263xew", "author": "Dyanuh143", "body": "Oh my! Best fucking No sleep I've EVER READ!! PLEASE write more!!"}, {"id": "e265lpv", "author": "6oceanturtles", "body": "That was one of the best short stories I have ever read! "}, {"id": "e266ggq", "author": "Marybury25", "body": "Oh my god. My heart. This took it. "}, {"id": "e2674mq", "author": "redditorNo9000", "body": "Goosebumps all over."}, {"id": "e2674yw", "author": "dariuslap", "body": "That was great"}, {"id": "e2689la", "author": "Anglojew", "body": "Great story... "}, {"id": "e268r71", "author": "stresswerewolf", "body": "Omg, I didn't expect to have these emotions.."}, {"id": "e268u7v", "author": "Cherrydude7889", "body": "The best r/nosleep post is one where you are awake because you are smiling at the post’s happy ending. "}, {"id": "e26aqht", "author": "IngotSilverS550", "body": "You got me to tear up you motherfucker"}, {"id": "e26bfh4", "author": "Guerr0", "body": "You gave me goosebumps, wow. Really wonderful story"}, {"id": "e26by99", "author": "Black-and-Bubblegum", "body": "That ending was perfect! One of the best story's I've read in here recently. Great job OP"}, {"id": "e26byyf", "author": "SaveDeeCewl", "body": "The bill comes due"}, {"id": "e26dxp3", "author": "drunkmaenad", "body": "I actually shed a few tears. This is so sweet, thank you. I love it"}, {"id": "e26g6ss", "author": "trencherswear", "body": "Cry to a no sleep? Check "}, {"id": "e26get4", "author": "TheMacRazor", "body": "I fully expected the woman on the line to be some wish granting demon that would resurrect Emily in exchange for your soul. That aside, amazing story (and a great reason reasons to answer phone calls)."}, {"id": "e26gke2", "author": "aliuuno", "body": "Bro my hairs stood on one end when I read that last line.\n\nSo glad you got your lady back again!"}, {"id": "e26gw1l", "author": "AugaLT", "body": "I’m actually kinda interested in what Emily did that saved her..."}, {"id": "e26hg2f", "author": "Shinikun99", "body": "I felt goosebumps."}, {"id": "e26hm2j", "author": "emmetmemmet", "body": "Way to change your future!"}, {"id": "e26itwh", "author": "katsarvau101", "body": "I thoroughly enjoyed this one :) Good job ! I wish there was more !"}, {"id": "e26iwp7", "author": "Demon_Princess666", "body": "This was creepy as hell, but also surprisingly wholesome"}, {"id": "e26j4wp", "author": "AlternativeBrain", "body": "DUDE!!! YOU JUST SAVE YOUR WIFE LIVE!!!!\nOMG!! SO HAPPY FOR YOU!!!\nBut I was still waiting for you know, something different maybe? Because this sounds lot like butterfly effect kind of thing"}, {"id": "e26jkjo", "author": "Raggiejon", "body": "But was the balance settled and cleared?"}, {"id": "e26kbsh", "author": "nightrider424", "body": "I said **not** to alter the past, Bryan!"}, {"id": "e26l5gy", "author": "WF72", "body": "pure "}, {"id": "e26miac", "author": "Ratephant", "body": "I love happy endings on r/nosleep \nWell done, sir."}, {"id": "e274ok9", "author": "t1mm3h", "body": "Have you two spoken at all? Did you mention the date on your side when you were talking, like does she know the date you received the call?"}, {"id": "e27b9tw", "author": "kbsb0830", "body": "OMG, I'm so damn happy for you. What a beautiful story. Amazing."}, {"id": "e27nimx", "author": "TheNerfingUndead", "body": "I’d love a follow up on this "}, {"id": "e27p59z", "author": "Percybhowal", "body": "TIL: Never dismiss spam calls."}, {"id": "e28wmq1", "author": "dot_comma", "body": "Holy shit, this was the best thing I've read this week. Thank you for cheering me up."}, {"id": "e2bshvv", "author": "Thedanieldave", "body": "Can someone explain this story to me? Thanks "}, {"id": "e2d4ixh", "author": "SeanRidner", "body": "Emily will remember that... "}, {"id": "e2d9zoz", "author": "harry02260213", "body": "You got to the Steins;Gate time line\nCongrats!"}, {"id": "e2dlqzl", "author": "yentilily", "body": "This sort of reminds me of Damned by Chuck Pahlinuk. Probably butchered that spelling but if anyone liked this story check out that book!"}, {"id": "e2osqt5", "author": "dravenmain69", "body": "Hello Microsoft tech support "}, {"id": "e4qutgo", "author": "xbad_wolfxi", "body": "This is the sweetest thing. "}, {"id": "e5w7eqg", "author": "Ckcw23", "body": "She believed you, chose to be with you, and yet avoid getting murdered again while married to you. That’s cool."}, {"id": "e688idj", "author": "SuzeV2", "body": "The way this would go from wholesome to nosleep is that the Emily beside you came back from the dead and is not YOUR Emily..."}, {"id": "e6ds0j3", "author": "Positivechocobear", "body": "good story"}, {"id": "e802fsj", "author": "jefiiiiiiiiiiiiiiii", "body": "adolf hitler"}, {"id": "e8pbidi", "author": "rex404", "body": "This is beautiful "}, {"id": "e90lhyh", "author": "Ayesha_Altugle", "body": "This was amazing. I loved it. Hailey Reese posted a video of her reading it without credit. I had to dig around to find the original story! I'm glad I did. Here is Hailey's video: https://www.youtube.com/watch?v=c4z47lhxvNo\n\nFor anyone who happens to read this, I like her a lot, but I really wish people would ask permission before posting art and giving credit. Writing is art!! <3"}, {"id": "ebckwp9", "author": "ryanpm40", "body": "So confused.. If he saved her life and this is happy ending, why the blood curdling screams?"}, {"id": "ecfvtj8", "author": "fanxyhigh", "body": "I think Emily by his side was dead! Hence the blood curdling scream. I think Emily chose to be with him instead of avoiding him that's why she still ended up dead. But she was killed in a different way because OP also made changes in the timeline"}, {"id": "e24wuif", "author": "alicevanhelsing", "body": "Twist: Emily was by his side, but it was her corpse.\n\nIn all seriousness though, I really liked this. I'm just confused as to why she wasn't taken aback by him saying the years his parents died."}, {"id": "e24tv1s", "author": "upsydasy", "body": "Well done.  I really enjoyed reading that."}, {"id": "e25u6th", "author": "Epic_TrollE", "body": "Man this is r/wholesomenosleep material"}, {"id": "e251llr", "author": "muhammadkorra", "body": "It sounds like that movie: \" Frequency \" check it out. An entertaining read though, but felt a little repeated for me."}, {"id": "e253u0g", "author": "bravenone", "body": "TIL some places call holding pausing"}, {"id": "e259ek8", "author": "Smith12456389", "body": "There’s a spam app?"}, {"id": "e25ep4v", "author": "BleepingBleeper", "body": "Is that you, Mr. N. Roberts?"}, {"id": "e25h9v7", "author": "nefuratios", "body": "You just created Mr. Henderson-point"}, {"id": "e25i2f4", "author": "illegalqueer", "body": "Ooooo. This reminds me of “Sorry, Right Number” by King. Good read here."}, {"id": "e25k3l8", "author": "gadoffal", "body": "Awwwww...."}, {"id": "e25lsqa", "author": "FlamingPupil", "body": "Welcome, to the beta world line. "}, {"id": "e25m238", "author": "12345thrw", "body": "YAYYYYYYYY :)"}, {"id": "e25mf8x", "author": "ArizonaIcedOutBoys", "body": ">I fell asleep that night\n\n🤔🤔🤔🤔🤔"}, {"id": "e25nact", "author": "Darth_Brodius", "body": "Wholesome"}, {"id": "e25npu2", "author": "enjoymeredith", "body": "Fuck yeah, that was awesome"}, {"id": "e25rh9a", "author": "LegionK_", "body": "I thought the title said “sperm cell” and had to double take"}, {"id": "e25von7", "author": "Artaratoryx", "body": "I had a Creative Writing teacher named Mr Henderson"}, {"id": "e262swj", "author": "CCtenor", "body": "Oh my gosh, this was an amazing short story"}, {"id": "e262x4a", "author": "anoymoustortoise", "body": "I really have to start taking notice of what sub I'm in sometimes."}, {"id": "e262x8g", "author": "mrsczzowitz", "body": "Thank you for this beautiful and brilliant story 🖤🖤🖤"}, {"id": "e26331w", "author": "HeatedLeek110", "body": "Reminds me of Frequency with Dennis Quaid and Jim Caviezel."}, {"id": "e26aopx", "author": "lak2017", "body": "Are we not going to talk about how it ends with  “But yesterday morning”"}, {"id": "e26fqeg", "author": "kermit54", "body": "I see"}, {"id": "e26gmxr", "author": "6fanny6pack6", "body": "Reminds me to download RoboKiller."}, {"id": "e26i470", "author": "Starwave82", "body": "I liked this story ..\n\nI just add some head cannon. \n\nBut yesterday morning when i woke up... Emily was by my side, i got up to open the curtains, And to my shock and horror i no longer saw a world i once knew. The sky was burning crimson red and the screams of voices can be heard as far as the eye can see.\nBuildings broken smouldering with embers of a fire that was all consuming as if it were an aftermath of a Nuclear Fire...\n\nI look to the sky once more and then back over to the old town and there before my very eyes were Mechanical Life forms ,Machines , beings unlike anything id ever seen destroying everything in their sight.\n\nThese are my last words, if there any survivors please don't answer any telemarketing calls.\n \nDuDu Daaaaa DeDuDu."}, {"id": "e26i8pf", "author": "kichapi", "body": ".. Emily, whose 1st husband was killed from a random robbery gone wrong back in 2015, greeted you with a smile. *\"What's wrong? You look so surprised.\"*"}, {"id": "e26ipk2", "author": "Holden__Caulfield-", "body": "Great story. For anyone who liked it I highly suggest the movie “Frequency” with Dennis Quaid and Jim Caviezel. "}, {"id": "e27ulwg", "author": "Username_Chose_Me", "body": "Well your warning for 2015 would be 9 years too late if Mrs. Henderson died in '06...I mean, when you married her, she took your last name right?"}, {"id": "e2aehtm", "author": "I_Asshole", "body": "And don't keep bringing up the 5 gb of beastiality porn you find on his computer."}, {"id": "e2cl3x3", "author": "GM_Danielson", "body": "I read this story, FirstBreath, thanks for the permission to bring it to life!\n\nhttps://youtu.be/vrMrRC0NroA"}, {"id": "e2ugvw0", "author": "Latinboy714", "body": "Imagine doing to opposed to get the wife murdered.... "}, {"id": "e455g1g", "author": "Thoreau-ingLifeAway", "body": "Does anyone have that link at the end? It’s too small for my thumbs to hit on mobile. "}, {"id": "e6j8ira", "author": "Tuckered__Out", "body": "Please forgive me, but I don't think I get it... I'm super tired, and I'm slightly inebriated, but can someone help me out here?"}, {"id": "e7305am", "author": "an_ugly", "body": "It wasnt all that scary to me, until the final line...."}, {"id": "ecfvfyg", "author": "fanxyhigh", "body": "I dont get it someone explain?"}, {"id": "e24mtm0", "author": "Ninevehwow", "body": "<3"}, {"id": "e24zu9a", "author": "user12116", "body": "As someone who is deeply I  love with someone else at this point in my life, I found this story very moving. "}, {"id": "e253ofq", "author": "noraiscool", "body": "I read through the whole thing waiting for the punchline thinking this was on r/jokes lol"}, {"id": "e24lchi", "author": "hatihatihatiho", "body": "*bawls*"}, {"id": "e24z1sf", "author": "RangerMaid", "body": "I was browsing /r/TIFU and switched over to reading this, was totally waiting for the TIFU part and then the end came out of left field, I had to triple check which sub I was in, ha, bravo!"}, {"id": "e25botu", "author": "pirpurian", "body": "Ngl I teared up a lil"}, {"id": "e25iz6a", "author": "Harborline765", "body": "I thought this was r/offmychest holy shit"}, {"id": "e26318i", "author": "Hydrohornet", "body": "For some reason I thought this was r/Jokes and was really fucking confused "}, {"id": "e263giq", "author": "Aspieilluminated", "body": "Always on r/nosleep, I gotta say....this one right here is the best one I've seen. \n\nHell of a lot of runner-ups, but this just took my breath away. "}, {"id": "e25pv9n", "author": "King_Barrion", "body": "/r/wholesomenosleep"}]}