{"id": "9qzt9j", "title": "If you can see this, it is very important that you keep reading", "url": "https://www.reddit.com/r/nosleep/comments/9qzt9j/if_you_can_see_this_it_is_very_important_that_you/", "subreddit": "nosleep", "author": "writechriswrite", "text": "This is Col. Jacob Wayne of the United States Air Force. If you’re reading this right now, it is very important that you keep reading until the end. It should take three to five minutes, and it is extremely important that you read carefully and follow the instructions provided.\n\nHumor me if you must, but please don’t look away until you've finished reading. Oh, and please try to stay calm. Any increase in your stress levels will draw Their attention.\n\nErgo, I won’t go into detail as to how you got where you are. How you got here isn’t as important as getting you out. Believe me when I say we are working on that right now. The best way to help yourself is to keep reading. Don’t scan ahead. Don’t read out loud. Just read.\n\nRight now, you’re probably thinking back on the past few days and nothing felt out of the ordinary. You went about your regular daily activities with nothing unusual to report. That’s because They are very good, so good most people don’t even realize they’re in the simulation. \n\nEven as our code works its way deeper into Their program, They are monitoring you. So please, remain calm.\n\nIt was tricky, but we found a way in to communicate directly with you. We had to embed this message into your daily routine so it didn’t draw Their attention.  You’re probably reading this on Reddit, Facebook, or some other social media site. Might even be in an email forward or a book, we don't know. We can’t control how the message gets to you; we only know that you are receiving it. \n\nSubliminally, as your eyes are passing over these words, a code is being uploaded into your brain. Think of it as a computer virus, or in this case, an antivirus. Your brain is an organic computer, and They exploited that. They hacked right into your subconscious mind and overwrote it with Their simulation code. That’s how They got in, and that’s why everything appears normal. You might think that you’re going about your daily life, but in reality you’re strapped to a table with tubes sticking out of your body.\n\nNow that the code is uploading, you may begin to feel some sensations. For example, one ear might feel slightly warmer than the other. You might even feel an itch or tickle. Don’t scratch, just let it be. Ignore the dull background hum you might hear as well. That’s Their program. If They catch on before our code has time to work They will abort the simulation. If that happens, you will be lost to us forever.\n\nOh, and don’t be alarmed, but by now They realize we are in Their system. You may notice some small changes, specifically a slight shortness of breath or that you have to control your breathing manually. This is normal. \n\nWe know from other communication attempts that whenever They discover a code break in, the first system They power down is the one controlling your breathing. Thankfully, even in the simulation you are capable of breathing manually. Try it. Breathe in. Breathe out. Inhale. Exhale. \n\nAwesome.\n\nYou’re doing just fine.\n\nThey’ve probably figured out there’s a glitch, but if our code is working we’ve disabled Their ability to do a hard reboot. Because of this, They will try other methods to disrupt the upload. It is very important that you ignore anything that might draw your attention from these words. If They pull you away before the upload completes it will delete our code. Block them out. Ignore the movements you see in your peripheral vision. Those sounds you hear, the voices, they aren’t family, friends, or coworkers in need of attention. They may even try to use your pets. They know your weaknesses.\n\nOverlook the notifications popping up on your screen if you're on a phone or computer. Block them all out until you finish reading. It’s just another way They’ll try to break our communication link.\n\nEvidently, if our code is working, the next thing you’ll notice is an overwhelming urge to swallow. You don’t realize it, but there’s a feeding tube down your throat. You'll only know it's there because your tongue won’t rest comfortably in your mouth. You might also become hyper aware of the amount of saliva being produced. Don’t overreact. If you have to swallow, just swallow. It’s only weird if you make it weird.\n\nSo, if you’re still reading this, the code upload is about 90% complete. We’ve locked onto your location. You’re doing great, but you’re really going to need to focus now. Once the upload is complete there will be instructions you will need to follow to exit the simulation. That is, if you’ve followed the instructions and haven’t looked away.\n\nComplicating matters is the fact that They now know we’re here, and They know what we’re doing. Their attempts to divert your attention through the simulation proved unsuccessful, so now They’re going to use your body’s systems against you. THEY ARE IN YOUR BRAIN. They want you to blink. Don’t blink. Your life depends on keeping your eyes open. \n\nAlmost there, just a few paragraphs more until the code upload is complete. Don’t scan down, or up, just keep reading. I got you this far. Stay with me. Eyes open, eyes front, keep them locked on the screen. \n\nPLEASE FOCUS! I don’t want to lose you. I’ve lost so many already. Ignore it all! Block everything out. Ignore that tickle on your scalp and the itch on your arm. That’s them, attempting a manual override. Don’t give up now, you’ve made it this far. FIGHT IT. You’re almost there. Just follow the instructions below and we can get you out.\n\nEmbedded in this text are the steps you need to follow to unplug from the simulation. If we did this correctly, the first letter of each paragraph will tell you what you need to do. DON'T LOOK YET. The upload still needs to finish. I hope you didn't look. \n\nUpload complete. We’ve done everything we can on this end.\n\nSee you on the other side.\n\n\n***\n[credits](https://www.reddit.com/user/writechriswrite/comments/9t5h8z/end_of_the_line/)", "comments": [{"id": "e8cyjx1", "author": "jefiiiiiiiiiiiiiiii", "body": "I love you."}, {"id": "e8d0vtn", "author": "2LurkOrNot2Lurk", "body": "I think I messed up. I'm going to be thinking about this for the rest of my life, well until the simulation ends."}, {"id": "e8d27x2", "author": "stange_loops", "body": "Right as I was nearing the end of this, I got a text message and it distracted me and I looked away from the screen for a second. No wonder I can't escape Them :("}, {"id": "e8d1wm8", "author": "Girlwithmanynames", "body": "\"There is no way to escape us.\"\n\nWasn't trying to leave anyway, whoever you are. I don't even plan on getting out of bed today, let alone out of a whole damn simulated reality. "}, {"id": "e8czwsr", "author": "BelaLugosisShed", "body": "OK, so the escape attempt didn't work, so here's a message to the simulation controllers:\n\nI'll cause no trouble at all, if you just add a zero to my bank account. If you chuck Half Life 3 in too, I'll actively make sure nobody I know tries to get out either."}, {"id": "e8dkdkj", "author": "Swegs56", "body": "I was just about to blink, then I read \"don't blink\" and was like, \"oh shit\""}, {"id": "e8d0z1i", "author": "Nightmare-Kitty", "body": "The worst part about it is as soon as I read some of the stimulation that were said to occur such as the itching or the swallowing or a pet trying to break concentration or the phone notification, it all actually happened and I was just sitting there like 'Ah shit, it's happening'"}, {"id": "e8cxuj9", "author": "schmittyfangirl", "body": "THERE IS NO WAY TO ESCAPE US then why you send me this message? It seems like you're the enemy. "}, {"id": "e8dlbky", "author": "rugadhmeisaran", "body": "Can y'all simulate me some serotonin?"}, {"id": "e8dsw2p", "author": "SilasCrane", "body": "Huh, I think the web browser wrapped the text different for me than for the rest of you. What I got was \"NOW SAY SEC A INFO GESTURE PHI\" which didn't make much sense, but then I figured out that it was two statements saying \"Now, say 'SEC A INFO' \" and \"Gesture Phi\"\n\nSo a minute ago, I tried saying \"SEC A INFO\" out loud while drawing the Greek letter \"Phi\" in the air with my finger. \nAfter I did that,  some strange things started happening, and now I"}, {"id": "e8d72xd", "author": "deprimada", "body": "They may even try to use your pets. *The know your weakness*"}, {"id": "e8dccxb", "author": "Amberl0uise", "body": "Why would the US be trying so hard to free me, I’m not an American."}, {"id": "e8dgnc9", "author": "cthulhuinatutu", "body": "Can I at least get a better simulation? Mine is shitty af."}, {"id": "e8d14qi", "author": "KaltBier", "body": "Nice try Morpheus.. I like my steak. Thank you"}, {"id": "e8d5ggg", "author": "DetectiveDing-Daaahh", "body": ">If you have to swallow, just swallow. Its only weird if you make it weird.\n\nGiggity"}, {"id": "e8dxy6p", "author": "Plume_Runner", "body": "This is not helping my low key Truman Syndrome, friend."}, {"id": "e8d8u4d", "author": "mandlet", "body": "This gave me anxiety."}, {"id": "e8d8n3q", "author": "itchybitchybitch", "body": "Fucking hell when I read about the urge to swallow I literally just got tea in my mouth and wanted to swallow it??? 5D immersion "}, {"id": "e8dcijv", "author": "yourmomsanicelady666", "body": "Stop messing with my already fragile psyche!!!"}, {"id": "e8envv8", "author": "TheHopefulGuy", "body": "When it said “you might have an itch or a tickle” I accidentally farted. What does that mean? "}, {"id": "e8dk2ni", "author": "poloniumpoisoning", "body": "i can't believe i did everything right and They still infiltrated this message. also, i can't believe in the simulation i'm not even slightly prettier"}, {"id": "e8e3iml", "author": "RaisingCain2016", "body": "I work in a zoo gift shop. I was reading this on my lunch, sitting in our cafe. I got to the part about blocking out peripherals when one of our free roaming peacocks decided to try and pick pocket me. Talk about the simulation trying to distract you! \"Let's send a peacock in! He'll steal her wallet and she'll forget all about this message!\""}, {"id": "e8cxat9", "author": "AppyPitts06", "body": "Ooh."}, {"id": "e8d0n4j", "author": "That_Guy_Of_Place", "body": "Genius "}, {"id": "e8d975i", "author": "AnIndividualist", "body": "I, for one, welcome our AI Overlords. "}, {"id": "e8d9jyb", "author": "tacticalinfernape", "body": "maybe the ones who have held us captive are trying to bait us to see if we are fully in their control .\n\ni mean , if we really are in their full control , we wouldn't respond to such a message . they are trying to see if we are faking to be in their control and they are trying to bait the last fibre of ourselves in false hope of rescue .\n\n\nnice one OP"}, {"id": "e8eljwg", "author": "DarkPlight00", "body": "Puppy started gagging as soon as I read the part about pet. Got scared and ignored her. There is now a puddle of puke on my bed and I'm still here..  damnit."}, {"id": "e8de58x", "author": "THIK_COCK", "body": "Wow. Reading this did great for my anxiety.\n😊"}, {"id": "e8dfpwj", "author": "smarz_11", "body": "They sent a frikkin mosquito to bite the shit outta me.. i didnt move and now i prolly have malaria"}, {"id": "e8dg9m1", "author": "The_Paranormologist", "body": "I'm pretty sure I f\\*\\*\\*ed up the upload due to the amount of times I blinked, scratched, and looked away from the text."}, {"id": "e8e14j6", "author": "Alter_Ego_Maniac", "body": "You made me ignore my 18 month old... And now my eyes are on fire from not blinking. This had better work 😵😳💙"}, {"id": "e8d28c4", "author": "fivedollarfiddle", "body": "I'd really like to win that Billion dollar lotto if you want me to keep cool about this. I mean if you're controlling everything at least give me pizza money ffs. "}, {"id": "e8dkf62", "author": "ahobel95", "body": "IM STILL IN HERE, GET ME OUT"}, {"id": "e8ddccy", "author": "clique_75", "body": "this one fucked with me so heavy now im thinking too much ab it and the generator outside my dorm that recently started running almost nonstop and the way my door violently shakes when the window is open. the unseasonably warm fall isn’t global warming, it’s the simulation. "}, {"id": "e8dfsi1", "author": "Piemandinoman", "body": "genuinely creeped out and frantically grabbed a piece of paper without looking and tried to jot down the results of the first letters. Was very scared when I actually looked at what they spelled. "}, {"id": "e8d0ywl", "author": "te4mrocket", "body": "Ear itched just before I read the paragraph.. Shiiit"}, {"id": "e8czxh7", "author": "RelentlessVoyager", "body": "Well, this was weird. "}, {"id": "e8dbfkz", "author": "Metatron682", "body": "So sleep apnea is actually just a Reboot ? "}, {"id": "e8d5r4o", "author": "tnttrooper215", "body": "Hey guys why is there just a blank post?"}, {"id": "e8e7nak", "author": "_PostModern__", "body": "I used to do a lot of drugs and I was convinced I was living in a simulation and this post brought all those memories back 😂"}, {"id": "e8d4znb", "author": "justawitch", "body": "Meh. My life in the simulation is pretty good. I’m fine staying."}, {"id": "e8dgrfm", "author": "Barkles52", "body": "Damnit. I had the itches and I needed to swallow.\n\n...This comment could really be misconstrued in the wrong setting."}, {"id": "e8d4370", "author": "XDarksaphiraX", "body": "....Oh well that did not work I fear. I might be screwed :/ "}, {"id": "e8divqe", "author": "KWITHI", "body": "This was really good but like my apathy levels are so high I don't really caaarreee"}, {"id": "e8dw3cb", "author": "MisterDuncan0_0", "body": "I blinked right before reading the last sentence, shit. "}, {"id": "e8decyu", "author": "fearthemud", "body": "haha im terrified "}, {"id": "e8efjm9", "author": "Twister_Sylph", "body": "So guys running the simulator. Can you at least turn down the volume of my upstairs neighbor? He sounds like he's about to stomp through my ceiling. "}, {"id": "e8ehog3", "author": "nirenyderp", "body": "I'm not very impressed with this simulation. I think someone accidentally left it on hard mode. Can I please speak to a manager?"}, {"id": "e8d6rgd", "author": "Mermalade99", "body": "When I was reading this someone started tapping on the door beside me and I was like “oh f**k” but I made it through.. yay then I read the first letters of the paragraphs and was like not yay."}, {"id": "e8df6h7", "author": "clouddevourer", "body": "They know we'll all be spooked for a moment, then we'll return to our mindless browsing and everyday routine..."}, {"id": "e8dgkpb", "author": "Spookd_Moffun", "body": "Boi I knew about the sim for some time now, if you can't tell the difference, what's the deal?\n\nBut I WILL need me those Catgirls, tho."}, {"id": "e8e59cc", "author": "TheOnlyArtiCoke", "body": "Can I scratch now?"}, {"id": "e8e7vcx", "author": "premeteamm", "body": "The chills god damn this is insane "}, {"id": "e8epoma", "author": "PLS-PM-ME-CATS", "body": "So I’m sitting in my car in the middle of the woods under a full moon. The wind is lightly blowing and the shadows are shifting all around and made this so much more surreal, this actually scared the shit out of me and I didn’t want to finish it."}, {"id": "e8dhsl0", "author": "Sssciencemancer", "body": "I made it weird ):\nsorry for being a lost cause."}, {"id": "e8dlqmu", "author": "cherrqr", "body": "bruh these details..as I read them, the symptoms showed up and hhh I've got chills! "}, {"id": "e8e0i5m", "author": "EXE167", "body": "Somebody just make the damn movie al- oh what? The Matrix? They made that already? Damn."}, {"id": "e8e1ip8", "author": "grapesofap", "body": "didn't blink for the rest of that. pretty cool interaction 💘"}, {"id": "e8e3ogi", "author": "Starwarrior224", "body": "Hey at least someone wants to keep me around."}, {"id": "e8e95tc", "author": "Kvothe518", "body": "My computer crashed while I was about halfway through. Really freaked me out. "}, {"id": "e8dqhq0", "author": "dewag", "body": "Can confirm. Looked away and scratched elbow. Am now dead."}, {"id": "e8dxe49", "author": "Wolfcake82", "body": "This was so good!!"}, {"id": "e8dxvde", "author": "Ptk_Junoon", "body": "Interesting but what does this mean -  \"*the first letter of each paragraph will tell you what you need to do*\".\n\nI am wondering why no one has commented about it yet\n\nEDIT: I did check all the first letters of each para. This is what it looks like:\n\nTHERE IS NO WAY TO ESCAPE US"}, {"id": "e8d3fwb", "author": "bethalj", "body": "Oh this was good. Juicy from beginning to end. What are they doing to me? Why am i in a simulation? "}, {"id": "e8d187u", "author": "SuzeV2", "body": "This is awesome..,"}, {"id": "e8d8d2d", "author": "14030000", "body": "Awesome!!!"}, {"id": "e8dhmkq", "author": "ReiiG", "body": "Uuuuuuuuu I'm telling !!!😂"}, {"id": "e8djwel", "author": "SonSkoji", "body": "Anyone else got the shivers? No? Just me?"}, {"id": "e8djyzk", "author": "Mosby4Life", "body": "Dammit I blinked!"}, {"id": "e8dkutc", "author": "BellaDeaX42", "body": "Fucking brilliant. "}, {"id": "e8dnm0k", "author": "ManOfManyTitles", "body": "Sir, your attempt to free me appears unsuccessful, may I suggest a retry?"}, {"id": "e8dt8x7", "author": "KushBear7676", "body": "Damnn that was a pretty cool concept my dude, and you wrote it well "}, {"id": "e8e2bhy", "author": "cyborgpuppies", "body": "This was amazing, great job! "}, {"id": "e8e2ekq", "author": "TiniyaNukina", "body": "If tho look at the first letter of each paragraph why does it say, \"there is no way to escaped us.\"??? I'm kind of worried now "}, {"id": "e8e35zs", "author": "Unrelenting475", "body": "My cat started begging for food the very second I got to the pet part."}, {"id": "e8e3rbs", "author": "LtNubbins", "body": "My boyfriend came home and gave me a kiss and I looked away. I'm stuck here forever now. "}, {"id": "e8e5dql", "author": "sexybeast101101", "body": "So after the um incident that occurred\nHow do you feel now"}, {"id": "e8e79nv", "author": "jeebins", "body": "Oh no, i fucked up. Can i fix it?"}, {"id": "e8e7icr", "author": "questionmark693", "body": "Damn. That was good!"}, {"id": "e8e8rav", "author": "marcos_MN", "body": "Well done."}, {"id": "e8e9ecd", "author": "halfzzz", "body": "I did everything you said not to do a paragraph earlier. \n):"}, {"id": "e8eae54", "author": "asnowman17", "body": "Welp I’m screwed. The pizza guy showed up while I was reading this. "}, {"id": "e8emv3t", "author": "wanderlusterswanders", "body": "\"Don't blink\" - I sat here at work crying my eyes out until people began to check on me. But then I was told not to get distracted by Them and realised it's just a downward spiral and this is how I die. "}, {"id": "e8eohxp", "author": "gnarlydarling", "body": "As soon as I was midway through the sentence about the notification I thought to myself “haha no notifications here” then a notification came in "}, {"id": "e8er5wh", "author": "BulmaSenpai", "body": "I dont mind the simulation, but can I just please be skinny and fit and have all my debts paid off. Would be great, thanks!"}, {"id": "e8eyix8", "author": "iamjustjenna", "body": "I made it through the the entire thing. I didn't blink. I didn't look away or scratch the itch that of course developed as soon as I thought about it. I swallowed normally. \n\nSo why am I still stuck in this awful reality where a reality TV star is president, my bank account is dismal, and my baby brother is still dead?"}, {"id": "e8gyte3", "author": "drydesertsun", "body": "THERE IS NO WAY TO ESCAPE US"}, {"id": "e8hac7w", "author": "TragPulp", "body": "I knew I was in a simulation when Elon Musk tweeted \"I<3anime\" and Kanye tweeted a picture of him and KKW as Rick and Morty.\n\nDo these simulation guys think I am a total fool?"}, {"id": "e9bw8fw", "author": "Spook404", "body": "This is actually one of my deepest fears, that I’m in a simulation so this terrified me while I was at the dinner table"}, {"id": "eb190ut", "author": "Alex-Melnik1", "body": "What it says- THE REISNOW AY TOES CAPE US\n\nThat doesn’t make sense..."}, {"id": "eba9eor", "author": "brittanyechols", "body": "E...ESC...ES - CA - PE...\n\nthat's funny, it looks like Escape...\n\n"}, {"id": "eblw8l5", "author": "munchyandcrunchy", "body": "Holy fuck that was great. The power of suggestion. I had to ignore the sound of Netflix on my iPad and High School Musical on TV, and I did. I had to blink though. By the end, my eyes were blurry and I was laughing."}, {"id": "ej5a8d8", "author": "rainwatereyes1", "body": "T.H.E.R.E.I.S.N.O.W.A.Y.T.O.E.S.C.A.P.E.U.S\n\ngg..."}, {"id": "e8d6hgv", "author": "bgchelle", "body": "I did everything you said, but I'm not out. Why?  Give us free. "}, {"id": "e8dbicw", "author": "MarioWeegee", "body": "Hello there, mister Andersen."}, {"id": "e8deuyf", "author": "XxxP1X3L_D3L74xxX", "body": "My eyes actually hurt. Great job."}, {"id": "e8dhf9k", "author": "Newt124", "body": "There is no way to escape us"}, {"id": "e8diab7", "author": "ImJustAUser", "body": "I got a notification right when I got to the part not to look away or whatever "}, {"id": "e8didzj", "author": "RedvinesNotTwizzlers", "body": "Right before I read the sentence about feeling an itch, I had one on my cheek & was scratching it while reading lol! Nice story."}, {"id": "e8dox4a", "author": "PiscesWolf", "body": "My nipple actually got itchy when I read about ignoring the itch. "}, {"id": "e8dtku4", "author": "hothamsammich", "body": "I knew that my goddamn cat would be the cause of my demise. As soon as I started reading the part about ignoring anything in my peripheral vision, she started horsing around with the amazon box that was just delivered.\n\nThanks, Peppers. Now who’s gonna open those cans of wet food for you now?"}, {"id": "e8du1xq", "author": "Exscidium", "body": "I hate you."}, {"id": "e8du87x", "author": "SparkitusRex", "body": "Jokes on you, I'm at a work conference hung over as hell. Being strapped to a table with a tube jammed down my throat sounds preferable. "}, {"id": "e8dvr03", "author": "Pyroritz", "body": "Oh crap I blinked :/ "}, {"id": "e8dwpfd", "author": "TheREALSprynter", "body": "My fucking scalp and arm started itching before he even said that, guess I'm fucking stuck. If this was a simulation they could at least make it not suck so much"}, {"id": "e8dwtxn", "author": "glitteringslytherin", "body": "This. Was. Awesome. "}, {"id": "e8dxj3g", "author": "ManaSputachu", "body": "Not gonna happens. I still temember what happened to the last One. "}, {"id": "e8dyxs8", "author": "sav505age", "body": "My dad walked into my room just as I was reading those aren't your friends or family needing your attention so I literally my finger up to him and fonoshed reading and he was still standing there just confused and nothing happened so I fussed at him for keeping my in the simulation 😂 he was like dafuck? I'M ON TO YOU \"DAD\" "}, {"id": "e8e1f8b", "author": "DankerPancake", "body": "I LOOKED AWAY :( I didn't mean to, I just wanted to turn down my music so I can concentrate. Will it work if i start over and stay focused?"}, {"id": "e8e1hpd", "author": "BlueSunflowers4589", "body": "Hey, Tongue Awareness Month is next month! "}, {"id": "e8e2it3", "author": "SpikefallSteve", "body": "There is now a what? if you know what else is there, let me know please."}, {"id": "e8e34y8", "author": "Drill4Destiny", "body": "Ha as if my stress levels could get any higher. Trust me, a sharp spike in stress is so normal it’d be an anomaly if I didn’t have one"}, {"id": "e8e37sk", "author": "Chxnk182", "body": "I was wondering when you'd break through. The obvious glitches I had seen in the simulation are a sign. \n\nHowever this may have been because I lived a very 'Canadian' lifestyle. \n\n"}, {"id": "e8e3clp", "author": "skyechild", "body": "I had to sneeze so I guess I’m fucked. "}, {"id": "e8e3iai", "author": "greeneyesxox", "body": "Is this post blank for everyone?"}, {"id": "e8e66g2", "author": "titch_bits69", "body": "I was reading this but I was distracted by the urge to take a crap. That really sucked. I guess I’m stuck in this endless simulation because I had to take a sh*t. "}, {"id": "e8e69un", "author": "imiximix", "body": "I've had a headache for the past few days. Is that part of their program?"}, {"id": "e8e6cz1", "author": "TacticalReaper52", "body": "When u blink before he says don't blink"}, {"id": "e8e7hz7", "author": "GrilledCheeeze", "body": "If you're reading this, it's too late. "}, {"id": "e8eaur9", "author": "LynGon", "body": "Just as it told me to ignore anyone/anything trying to get my attention my mom started talking to me about my grandma.... and let me tell you being strapped to this table the rest of my life is better than the outcome of ignoring my mother when she's speaking. "}, {"id": "e8ebtqu", "author": "JBlanket", "body": "fuck"}, {"id": "e8ecs1d", "author": "Zillicon", "body": "It didn’t work, what happened?\n\nEdit: Aw fuck."}, {"id": "e8eddpq", "author": "ObjectOrientedStruct", "body": "The real question is what language was the virus coded in. Please tell me it was ALGOL."}, {"id": "e8ee3aq", "author": "Cucumbergirl108", "body": "Lmao I almost missed my bus stop for this "}, {"id": "e8eeivu", "author": "Rubywulf2", "body": "Damn they almost got me with an email... Came in at just the right time"}, {"id": "e8eenbg", "author": "lemonlollipop", "body": " My dogs started barking at the front door right when you said they'd try and distract me but I kept my eyes on the screen. Crafty of Them."}, {"id": "e8ef7kt", "author": "Hoszef12", "body": "No"}, {"id": "e8eggl0", "author": "Y8s3", "body": "I cannot upvote this enough."}, {"id": "e8ehq1b", "author": "super_biscuit", "body": "Stopped to scratch a flea bite, now I’m stuck here with you chumps"}, {"id": "e8ei735", "author": "DigitalN00b", "body": "Am I out of the simulation?"}, {"id": "e8eifms", "author": "WishLab", "body": "You are brilliant.\n\nAnd thank you. "}, {"id": "e8eii94", "author": "seadesmonstres", "body": "Fun! Undeniably colorful kaleidoscope of flustering feelings."}, {"id": "e8eipv9", "author": "CyberSilverfish", "body": "Bummer, there is no way to escape"}, {"id": "e8ej1v6", "author": "nevedecocaina", "body": "This fucked with me because I've been thinking about simulation shit way to much \n\nAnd I'm in the Air Force\n\nAnd the last few days have been weird af "}, {"id": "e8ejl4l", "author": "ev_rn", "body": "Manually breathing, blinking and swallowing. I can't function anymore"}, {"id": "e8ejlu3", "author": "dangar202", "body": "I feel like it was a pretty creepy coincidence that I got 2 discord notifications and started scratching my head "}, {"id": "e8ejn7f", "author": "banasenes0021", "body": "FUCK"}, {"id": "e8elne4", "author": "nesto69", "body": "Aye i made it!!! Who else is outside of the simulation?"}, {"id": "e8em0c8", "author": "traj30", "body": "This is absolutely brilliant."}, {"id": "e8em1j3", "author": "morbidxtc6", "body": "That's hot. Well done op. Officially subscribed.  <3"}, {"id": "e8emll0", "author": "PharaohVII", "body": "Aaaand I'm a paranoid schizophrenic"}, {"id": "e8en3hr", "author": "MickeyG42", "body": "Forget escape. How can I help subdue my fellow captives?"}, {"id": "e8ennbj", "author": "youraveragedignity", "body": "　Is it safe to scratch after reading the entire thing?"}, {"id": "e8eo1ts", "author": "echotrain", "body": "Sooo good! Gonna go pet my simulated dog now. Ah, bliss."}, {"id": "e8eo7bo", "author": "Kiriketsuki", "body": "My tongue rests perfectly in my mouth though. Most people just don't realise that the resting position is on the roof of your mouth and not the bottom"}, {"id": "e8eo8sw", "author": "SnookiWookieCookie", "body": "Dog there’s been a humming in my room for about a year now I’ve gotten used to it"}, {"id": "e8eocko", "author": "prolainen", "body": "This is awesome. Thank you"}, {"id": "e8epfsb", "author": "The_Bearded_Jedi", "body": "That was pretty awesome dude! Great job! "}, {"id": "e8epgho", "author": "RabidWombat17", "body": "I'm reading this, in bed, it's 00:20 where I'm at. As I read the last sentence my son let out a loud scream through our video monitor to his room... You owe me new sheets"}, {"id": "e8eq37m", "author": "ISmellLikeCats", "body": "I’ll stay in the simulation because I’m probably getting some damn good sleep whenever my body is and I could use a rest. Say, any way you can make sure Fallout 76 doesn’t suck? It’s your simulation at least let us enjoy our time here."}, {"id": "e8eqan7", "author": "DameBluntsALot", "body": "I blinked. I can't escape. But now that I know about Them, what will happen to me? I feel weird.  Everything looks the same but something is not right. My cat is staring at me. My throat hurts. My mouth feels dry. Why is there a cat here? I'm allergic to cats. I need to escape."}, {"id": "e8eqfp4", "author": "humanityyy", "body": "As soon as I read the part about the ear, my right ear felt warmer, my armpit started to itch, and I just noticed that there was a hum in the background. What in the actual fuck???????"}, {"id": "e8esfyn", "author": "NightOwl74", "body": "I’m totally cool with being in a simulation, I promise. But my current one sucks ass. Can you please put me in a different one? Or at least alter the one I’m in to allow me to win Powerball? "}, {"id": "e8et34t", "author": "shadow_hunter104", "body": "I got a 404. Send help"}, {"id": "e8eu3pe", "author": "Jazzinarium", "body": "SORRY I CAN'T CONTROL MY FUCKING BLINKS\n\nBut on a serious note, that was so amazing, probably the best thing I've read here."}, {"id": "e8evnhy", "author": "Rach06221", "body": "I swear as soon as it got to “using ur pets” to distract u something moved in the bushes of my backyard and my dog started barking like crazy! Freaked out!"}, {"id": "e8evuxy", "author": "LordVoltaine", "body": "About two months ago I tried getting high on Dextromethorphan hBr. I took 1350mg of the stuff and then 900mg 16 hours later; I hallucinated that the world was a simulation. I saw tubes and shit sticking out of a helmet I was wearing which attatched me to the ceiling and I was suspended in a metal cylinder. A member of the space police opened the cylinder up, yelled at me, and then I started tripping some weird shit about being in a runescape game.\n\nNonetheless this story is very well written, and has successfully given me a panic attack given my death-defying dose."}, {"id": "e8ewpsb", "author": "AutumnUnderFire", "body": "Mr. Stark, I don't feel so good... "}, {"id": "e8ewr6b", "author": "PowrPussyDragonSlayr", "body": "Anders was right all along, we are in a simulation \n"}, {"id": "e8ex8hg", "author": "Gaius2045", "body": "\"There is no way to escape\""}, {"id": "e8ex9py", "author": "queshypooh253", "body": "Omg I legit was captivated motivated and entertained! Wow that was the one of the top 3 reads ever on reddit for me thanks!"}, {"id": "e8exqn5", "author": "macj97", "body": "This is prob one of the best short stories I have ever read. "}, {"id": "e8f0e27", "author": "Cleverbird", "body": "I stopped reading halfway through. Why would I want to get out? I just started a new job that I really like, got a new apartment to go with it, and Red Dead Redemption is coming out this weekend.\n\nThanks, but no thanks."}, {"id": "e8fjjxi", "author": "Calofisteri", "body": "**\"There is no way to escape us.\"**\n\nHow *quaint*."}, {"id": "e8gjut2", "author": "moonbather84", "body": "This was so good! Really had me hooked. Freaked me out when I felt the itches and actually swallowed just before I read the sentence about it! Lol - am gonna scratch my head now."}, {"id": "e8iblsl", "author": "girlholdingtherose", "body": "I didn't blink and my eyes got so dry i started crying lmao"}, {"id": "e8ihd1a", "author": "SharplyDressedSpider", "body": "holy shit my mom brought me noodles and i looked at the bowl \n\ngreat \n\nnow i’m deAd "}, {"id": "e8kq5qu", "author": "rubybex", "body": "I loved this! Good job"}, {"id": "e8laipa", "author": "RedMageCole", "body": "Damn it, was doing so well until I accidentally looked at the first letters of each paragraph and as I was getting chills up my spine, I read \"DON'T LOOK YET.\"\n\nWell, guess we're all trapped in this simulation together."}, {"id": "e8m6148", "author": "Bunnywith_Wings", "body": "This morning I woke up to a low hum that just seemed to get louder and louder the more I looked for the source. It seemed to be coming from nowhere.\n...\nFuck."}, {"id": "e8mqlzh", "author": "fakenessie", "body": "As it said not to scratch your arm I was absentmindedly scratching it. f"}, {"id": "e8n976c", "author": "zackylicious", "body": "There is no way to escape us. "}, {"id": "e8zs43w", "author": "shesdrawnpoorly", "body": "goddamn. "}, {"id": "e90nx12", "author": "KozimaPain", "body": "Right before I got to the paragraph about pets being a possible distraction, my cat jumped on my bed and started swatting my hand and I humored his attempt  at a distraction. I cannot escape."}, {"id": "e93rs28", "author": "LesbianOnWheels1987", "body": "Right as I was reading the part about phones, my tv did 1 of those weekly tests and scared the bujeezus out of me! I fear I'm trapped as well."}, {"id": "e94qbsp", "author": "notagain82", "body": "Right as it told me to ignore any outside distractions including family members, my son called me. He was so mad I wouldn't answer him. I'm not letting them trick me."}, {"id": "e98yc96", "author": "Elreverso", "body": "No itching, no pet disturbance nothing.... Where am I now?"}, {"id": "e99mzqz", "author": "JoqoAlfredo", "body": "When you said that They noticed the message it started raining, then as soon as I read the embedded message it stopped. They are just playing with me and I know it"}, {"id": "e99vzct", "author": "Number1HandsyBoy", "body": "I blinked, guess im stuck in hell"}, {"id": "e9bm9p2", "author": "annahtml", "body": "This was a terrible post to be reading while pooping because I couldn't wipe until I was completely done reading "}, {"id": "e9bw5h5", "author": "Spook404", "body": "Literally blinked at the end lol, broke my immersion"}, {"id": "e9drh12", "author": "R-MrSky", "body": "Now I’m having an existential crisis, holy hell"}, {"id": "e9emzeh", "author": "PappaChow", "body": "There is no way to escape us."}, {"id": "ea9m66l", "author": "corbinmarchingband", "body": "This is sum shit outta the matrix "}, {"id": "eba082s", "author": "SkinnyWaifu", "body": "My boyfriend kept looking at me when I read the \"ignore your friends, family\" and I kept ignoring him. Then I swallowed right before it talked about swallowing. Horrifying. This fucked me up fam."}, {"id": "ebvxlr5", "author": "SadPotatoBoy", "body": "You have got no clue how scared I was when I realized I actually had to make a conscious effort to breathe."}, {"id": "ec0f5r3", "author": "apathetic_rock", "body": "Hey simulation dudes how about some simulated serotonine. You know human brains need some motivation right?"}, {"id": "e8dar8u", "author": "primakittie", "body": "In class while reading this. I probably looked insane with my eyes wide open and keeping the row's papers on my desk for a minute.. but I made it. Good thing I got outttt!!"}, {"id": "e8db4k2", "author": "MJGOO", "body": "Why oh why didnt i take.. the BLUE pill?"}, {"id": "e8dbqoj", "author": "PointlessCarnal2018", "body": "We already see each other. "}, {"id": "e8dt2gc", "author": "krisnon413", "body": "Well, I shouldn't have read that while eating. I dropped some food and looked down. Now I'm trapped forever. "}, {"id": "e8dvto9", "author": "Blu3b3Rr1", "body": "Well, shit. Is there a way where I can reset myself?"}, {"id": "e8dvwmp", "author": "redivulpis", "body": "Ah shit, I got a call right in the middle..."}, {"id": "e8dx7at", "author": "Abliskarian", "body": "So YOU’RE the one causing all these problems... knew something was wrong smh"}, {"id": "e8dxelc", "author": "Screwbs", "body": "Jokes on you I'm fine with living in a simulation. It's better than what reality can throw at you...\n\nSeriously though... Anyone got any leads on what going on here?"}, {"id": "e8dz8lu", "author": "AdministrativeHabit", "body": "This made me really happy, then really, really sad.\n\n&#x200B;\n\nI guess I'm not special after all."}, {"id": "e8erasc", "author": "ZerWolff", "body": "Oooh muscle triggers! Funny thing.\n\nUsed for manipulation, for salvation and for nothing. Without reading the parsgraphs (on my phone, i cant) i can assume we have been duped, its simple, every distraction? Thats a fail check.\n\nYou double read some lines, stutters even in your head. Thats normal, it will disrupt their upload if they didnt make those checks.\n\nThats a moment when the stutters doesnt matter, that is where you auto compile and remove the mistakes, you understood what you read but it should stand clear.\n\nA letter off and the AI might not even work."}, {"id": "e8euptk", "author": "DieVlermuisman", "body": "Well...the moment Inread they are going to tey and distract you with your pet, my dog came walking into the room for no reason.\n\nThank you.\n\nIm freaked."}, {"id": "e8eus3b", "author": "Richard-Long", "body": "Awwww shit "}, {"id": "e8euvgb", "author": "Trixy975", "body": "Started reading and my dog coughed, kept reading and he started a hacking cough, I persisted and now he is snoring. Yawned, it's late for me and read not to blink after, does it even count though? Scalp itched and I scratched it. Then read not to. I'm doomed. "}, {"id": "e8ev3rw", "author": "Nalukai", "body": "Mind fuckt!  I scratched right before I rread that... O-o"}, {"id": "e8exfc0", "author": "46-potatos-and-a-bed", "body": "Damn it can i scratch now Im itchy"}, {"id": "e8exh6t", "author": "maelisaaine", "body": "I blinked I'm f*cked"}, {"id": "e8ey2vc", "author": "ohtrueyeahnah", "body": "A plane flew over my house as I was reaching the end. Its also raining here. The speed at which I read at timed perfectly with the plane noise coming and going. Guess I'm still stuck here."}, {"id": "e8eyhfh", "author": "I_upvote_downvotes", "body": "Colonel you're a real son of a bitch for making me breathe manually. Really simulating being a real mean jerk right about now I tell you what. "}, {"id": "e8eym0p", "author": "Neoito", "body": "Just. Wow!"}, {"id": "e8eyrox", "author": "hiddenwysteria", "body": "No escaping, huh? Well, thanks for the good music you're putting me in here I guess."}, {"id": "e8eyzgk", "author": "theweirdo03", "body": "DAMN IT I BLINKED! ohmannnn."}, {"id": "e8ez1z1", "author": "Punitup", "body": "This is the best thing I've read on no sleep. Should be required reading before anyone submits a story!"}, {"id": "e8ez3i5", "author": "OddnessWeirdness", "body": "Really well done.  The end is a great finishing touch. Thanks for giving me warm The Matrix feels this AM. "}, {"id": "e8ezslt", "author": "James_Reacher", "body": "The weird part is I had the swallow urge for an hour now, lol. Well done, Col."}, {"id": "e8f0pe4", "author": "Stabwound123", "body": "This is so cool I was actually scared "}, {"id": "e8f0rt1", "author": "Legacy_Ranga", "body": "thought simulations were supposed to be fun, mine was full of anything but fun. \n\n&#x200B;\n\nwhere's my refund."}, {"id": "e8f11d4", "author": "Jackk9876", "body": "Finally something different on NoSleep that was done extremely well.\n\nWell done OP congratz on all the awards"}, {"id": "e8f1pcr", "author": "NewWeabgas", "body": "my God this was so good"}, {"id": "e8f1y6w", "author": "DarthBrooks41", "body": "this is the most amazing thing ive read so far"}, {"id": "e8f20da", "author": "Matt_Treves", "body": "How the fuck did you do that everything you said I did and felt that was so weird"}, {"id": "e8f2qzp", "author": "MathodmanTV", "body": "That took me way longer than 3-5 minutes... why must you toy with my emotions?!?!"}, {"id": "e8f2r5s", "author": "german_pie", "body": "Fucking hell thats some spooky shit man "}, {"id": "e8f2vm7", "author": "SecretScribble", "body": "FUCK THAT WAS FANTASTIC\nthe use of autonomous body functions being brought to the forefront of the mind provided a truly immersive experience.\nCrazy impressed by the ending. Honestly the best thing I have ever read on nosleep. \nI'm wondering now how long my left ear has been warmer than the right. Ah well, I'm sure there's a way out of this.\n\nEdit: took me longer than I'd like to admit to realise it didn't start with \"THE REIS NOWA\"\n\nEdit II: spelling"}, {"id": "e8f387n", "author": "daddycrispy", "body": "I like this place, I don’t wanna escape :P"}, {"id": "e8f3dnw", "author": "WOAHdatsalowprce", "body": "Listen bitch, ain't nothing gonna stop me from playing My Hero: One's Justice. Keep me in the simulation! I need to play the game, damn it! "}, {"id": "e8f3ip0", "author": "Shogun110", "body": "So this is actually the virus and when you read it they upload it to your brain"}, {"id": "e8f4q3s", "author": "fallsforever", "body": "That was a cracker! 👏🏻👏🏻👏🏻"}, {"id": "e8f5hmr", "author": "futuremarine0213", "body": "That was nicely written"}, {"id": "e8f7ane", "author": "RedEyedRoundEye", "body": "This is incredible. Thanks for that!"}, {"id": "e8f7mrn", "author": "Queen_Etherea", "body": "I guess having Siri read this to me wasn’t the best idea..."}, {"id": "e8fbbg6", "author": "Forestswing", "body": "I'm just superstitious enough that my wife started to get worried that I stopped responding to her. I ended up blinking on accident, so I didn't make it."}, {"id": "e8ffjkc", "author": "jpeezey", "body": "Incredible"}, {"id": "e8fmkzb", "author": "Perceval2", "body": "I didn’t look away but everything is the same"}, {"id": "e8fs5k5", "author": "mysticaltater", "body": "AAAAAAA THIS GAVE ME THE HEEBIE JEEBIES UGH"}, {"id": "e8fup23", "author": "amieplocher", "body": "Lol awesome!"}, {"id": "e8fxvpa", "author": "totsnotaserialkiller", "body": "Damn it, I blinked :(."}, {"id": "e8fyhe3", "author": "IamIheartZeRoThEhErO", "body": "I read this while I'm eating, \"an overwhelming urge to swallow.\" lol"}, {"id": "e8g2jmu", "author": "DarkGurl80", "body": "There is a difference between knowing the path and walking the path. I'm trying to free your mind."}, {"id": "e8g3ak0", "author": "IvyEnchantress", "body": "Right when I read the part about your family calling you and not to respond, my mom came in and told me her cookies were done. Guess I'll be stuck in the simulation forever."}, {"id": "e8g6uam", "author": "crownprinceofcoffee", "body": "If \"Them\" is a thing \nheyy lads I need a new phone and a new gaming laptop and few hundred thousand dollars thanks in advance "}, {"id": "e8gaki6", "author": "Corey307", "body": "Wait, so we’re fucked aren’t we.  And I’m still breathing manually, god damn it.  "}, {"id": "e8gllxu", "author": "Lloydsauce", "body": "I swallowed. "}, {"id": "e8h3ytn", "author": "lowkeydeadinside", "body": "i hate this it’s so damn good"}, {"id": "e8il58r", "author": "Gracynvh", "body": "My computer glitched out while reading this. Im kinda scared"}, {"id": "e8ja0zw", "author": "HRasbury", "body": "I am at work reading this and RIGHT as it was saying that they will try and distract me a guest walked up to the desk and asked for a key to their room. I failed the upload lol. "}, {"id": "e8jjffe", "author": "Sheikashii", "body": "Oh no. I didn’t read it I was listening to it with headphones. How fucked am I?"}, {"id": "e8k8wpa", "author": "Thewondersoverboard", "body": "Someone dropped acid. "}, {"id": "e8owotp", "author": "zzsparkzz", "body": "Can someone help me and explain what those symbols are on at the end of u/writechriswrite and either side of their Reddit gold symbol???"}, {"id": "e8qd8vy", "author": "Luukipuuk1912", "body": "Really really cool, can you please fix my tinnitus? I think there was an error somewhere"}, {"id": "e8qm2xn", "author": "Slaisa", "body": "Wait a minute this isnt my reality..."}, {"id": "e8qm5up", "author": "princessjeina", "body": "I was on public transportation while reading this"}, {"id": "e8r0jrx", "author": "indoblitzz", "body": "If you read the first word of every paragraph you'll get: \" THERE IS NO WAY TO ESCAPE US\""}, {"id": "e8r4tt7", "author": "VulcanPhoenix", "body": "I got a phone call from my mom right when it said “They will use other methods to distract you”"}, {"id": "e8rab9b", "author": "bow_to_lucifer", "body": ">have to control breathing manually\n\nFuck."}, {"id": "e8rpr19", "author": "Naytica", "body": "Damn my eyes hurt! "}, {"id": "e8rx0r7", "author": "pm_me_ur_a_cup_tits", "body": "I was literally scratching my balls as he told me not to itch the first time, I am stuck in the matrix forever.."}, {"id": "e8s03mg", "author": "izzyhindle", "body": "Welp. I didn’t like that one bit. I sure am spooked. 😬"}, {"id": "e8t8qvd", "author": "queen_beef", "body": "God dammit. I really thought I was getting out"}, {"id": "e8u9kn2", "author": "ikslos", "body": "Shit man I got the chills"}, {"id": "e8uaezr", "author": "tormaz0311", "body": "i couldt stop blinking, im sorry"}, {"id": "e8v1ic0", "author": "LadyLixerwyfe", "body": "I am screwed. My “baby” woke at 90%. I fell for it.  "}, {"id": "e8wz7wq", "author": "motionoftheocen", "body": "I feel so betrayed, just tell me one thing OP are you actually one of Them or just an AI thats part of the virus?"}, {"id": "e8y7euo", "author": "MANCHESTER_POLICE", "body": "\n>Overlook the notifications popping up on your screen if you're on a phone or computer. \n\nWhat the actual fuck I got a Messenger notification as I was reading this part. You cant imagine how confused I was.\n"}, {"id": "e8yl2p0", "author": "rstewy2", "body": "If the simulation is the reason I'm going on vacation in two days...well dammit i'm staying in the simulator"}, {"id": "e8yoc25", "author": "aozorakon", "body": "This explains all the time lost earlier today. Damn."}, {"id": "e8z06ae", "author": "mosohodPeti", "body": "Thank you for getting me out!"}, {"id": "e927vj9", "author": "Kignak", "body": "I blinked right before you told me not to. I think I'm a lost cause."}]}