{"id": "9z3cm6", "title": "So, Yeah... I Don't Do Drugs Anymore.", "url": "https://www.reddit.com/r/nosleep/comments/9z3cm6/so_yeah_i_dont_do_drugs_anymore/", "subreddit": "nosleep", "author": "TheJesseClark", "text": "I mean, I was never a heavy addict, or anything. Never did heroin, or meth. Tried crack cocaine once. That was… yeah. But I was only sober for eight months between that and when Eddie, an old buddy of mine, introduced me to something called K3. Against my better judgement, I took him up on the offer.\n\n\n“You heard of K2, bro?” he said. He was already high.\n\n\n“Spice, yeah. Synthetic weed.\n\n\n“Well listen, man.”\n\n\nI blinked. I looked at our mutual friend, Todd, then back at Ed. “Listen… what?”\n\n\n“What?”\n\n\n“You said ‘well listen, man,’ and then you spaced out.”\n\n\n“Oh. What were we talking about?”\n\n\n“K3.”\n\n\n“Oh, right, right. You heard of K2?”\n\n\n“Yes. I just said that.”\n\n\nHe leaned in close. “Well, listen, man. This shit is like K2 and then some. Hence the name K4.”\n\n\n“I thought you said it was K3.”\n\n\nTodd stepped in. “Okay. Ignore him. He’s gone. This isn’t synthetic anything, Kev. It’s something new.”\n\n\n“Then why did he call it K4?\n\n\n“K3.”\n\n\n“Then why did he call it K3?”\n\n\n“He calls it that ‘cause the high reminds him of bein’ on Spice, or something. But this shit is like, on another level. And it ain’t cannabinoid nothing.”\n\n\nI shifted in my seat. “Okay. I’m not… I mean you remember what happened last year, yeah?”\n\n\n“Yeah, yeah, no. I got you. Listen, though - I’ve done this shit four times already. Haven’t had one bad trip yet. First trip I was just like, high off my ass. Nothing made sense. Second trip I was like an astronaut, bro. I think I saw what exists outside the universe.”\n\n\n“Okay. What exists outside the universe?”\n\n\n“I said I saw it, not that I remember it. But it was wild.”\n\n\nI was warming up to the idea. “How long does the high last?”\n\n\n“Depends on the hit. And the quality.” He held up a small bag of pills. “And you know me, man. I only get the best.”\n\n\nMuffin, his dog, growled from the other side of the room.\n\n\n“Muffin! Hey! Down, girl.”\n\n\n“Is… she okay?\n\n\n“She’s fine, dude,” he said.\n\n\n“She’s fine, dude,” echoed Eddie. Then he started laughing.\n\n\n“Is he on this stuff now?”\n\n\n“Took it right before you got here. I wanted someone to be sober enough to explain it to you.”\n\n\n“Thanks?”\n\n\n“Thank yourselfperson, you bliddering snarch,” Eddie said. Then he resumed laughing.\n\n\n“Thanks, Ed.”\n\n\nTodd popped his pill in his mouth. I did the same. After a moment, he said, “How you feeling?”\n\n\n“Me? Fine. How long does it take to kick in?\n\n\nHe smiled. “Should be feeling it momentarily, my dude.”\n\n\nMuffin started growling again. Todd clapped, once. “Muffin! Shush, girl. Come on.”\n\n\nI looked at her. She was standing in her crate, baring teeth. The hair on her back stood on end.\n\n\n“I don’t think she’s okay, man.”\n\n\n“She’s fine. Ed, you good?”\n\n\nI looked. Eddie was face down in the cushions of the couch. He wasn’t laughing anymore. He was shivering.\n\n\nI said, “Are we gonna get cold, or something?\n\n\n“I usually don’t,” Todd said. “Every hit’s different, and every person’s different. All I know is, it’s fuckin’ fun.”\n\n\n“Okay.” Ed didn’t look like he was having much fun. “He doesn’t look like he’s having much fun,” I said.\n\n\n“Yeah, well. You know how your friends can be, Sweetie,” said my Mom.\n\n\n“I know, Mom.”\n\n\n“What?”\n\n\n“I said ‘I know, Mom.’”\n\n\n“I’m not your mother,” said Pastor Lewis.\n\n\n“Oh,” I said. “Sorry.”\n\n\nHe leaned in from where Todd had been. He looked concerned. Disappointed. Had his elbows on his knees, his hands clasped between them. “Kevin. You know you shouldn’t be doing this.”\n\n\n“I know.”\n\n\n“Especially after what happened last year. What were you thinking?”\n\n\n“Thought I could handle it, I guess.”\n\n\nI stared at the floor. The way the colors on the carpet swirled in and out was always so mesmerizing.\n\n\n“It’s going to be a bad trip, you know.”\n\n\nI looked up. Pastor Lewis had on that old evil smile he always had. Or did he? I furrowed my brow.\n\n\n“What?”\n\n\n“It’s going to be a bad trip,” he said again, in a deeper voice. “Todd said all the trips he’d had were fun. That doesn’t mean it’s impossible to have a bad one.”\n\n\n“Oh. Pastor Lewis doesn’t sound like that.”\n\n\n“Man, who the fuck is Pastor Lewis?” said Pastor Lewis, in Todd’s voice.\n\n\nI blinked. Todd was sitting there, looking at me like I’d lost my mind.\n\n\nI cleared my throat, but couldn’t feel it. “My old youth pastor from back in the day,” I said.\n\n\nMuffin barked from her kennel. It was a deafening, alien-sounding bark. Gravelly. Dark. I looked over at her. She looked at me. She barked again, but this time didn’t open her snout to do so.\n\n\n“Whoa,” I said.\n\n\n“What?” said Todd. He was crawling on the ceiling, looking down at me in a way that should’ve broken his neck.\n\n\n“Cool how your dog can bark without moving her mouth. Can you sit down? You’re weirding me out.”\n\n\n“Yeah, sorry,” Pastor Lewis said, before sitting down and becoming Todd. Then Todd said, laughing hysterically, “I am sitting, man.”\n\n\nHe was indeed sitting. I looked up - nobody on the ceiling, and no indication that anyone had been. He was doubled over with laughter. Howling, aching laughs. He held his stomach.\n\n\n“Is it that funny?”\n\n\n“It ain’t that,” Todd said. “The spiders in your ears are singing.”\n\n\nI smiled. “Oh yeah? What are they singing?”\n\n\nTodd couldn’t stop laughing long enough to respond. But he didn’t need to. I could hear it too.\n\n\n“Dude,” I said. “It’s the song from Snow White and the Seven Dwavres!”\n\n\nTodd laughed even harder. “Man, what. What! You spelled it wrong, my dude.”\n\n\n“What?”\n\n\n“Go back. You spelled “dwarves” wrong. It should be ‘dwarves,’ not ‘dwavres.’ What the fuck is a dwavre?”\n\n\nI scrolled up. There it was. ‘Dwavres.’ Huh. That’s weird. “Huh. That’s weird.”\n\n\nTodd was still laughing. Far harder and longer than the situation warranted.\n\n\n“How am I seeing words I spoke?” I asked. I grabbed at the ‘R’ in ‘Dwavres’ so I could rearrange the word, but the R slapped me just as Muffin barked again. BARK-smack. Just like that. A single bark. Sounded like Satan. I sat back down.\n\n\n“Easy there, Dwavres,” I said. “I’ll just spell it right next time, damn.”\n\n\n“Make sure you do,” said Muffin. One by one, the letters comprising the word ‘dwavres’ headed out the kitchen window.\n\n\n“Dude!” I said. “Todd, the letters are escaping! Stop the letters! STOP THE LETTERS!”\n\n\n“I can’t hear you, bro!” said Todd, in Pastor Lewis’ voice, or Pastor Lewis in Todd’s voice. Who were they again? Fuck. Whoever it was said, “Come downstairs!”\n\n\n“I am downstairs!” I said, before stubbing my toe on his bedroom dresser. I took a step back. I was in his bedroom upstairs. Place was a wreck. “That’s… wait. How did I-?”\n\n\n“Come downstairs,” said Muffin, demonically. I couldn’t see her, but somehow I just knew she was standing at the bottom of the stairs, on two legs, with her head upside down. You know when you just know a dog will look like that? It was one of those times.\n\n\n“That’s okay,” I said. “I like it up here!” I pulled one of his dresser drawers out, dumped out all his underwear and condoms, and put it on my head for protection. “No way you’re getting me now, you bitch!”\n\n\nI sat down on his bed, but his bed was on the other end of the room. “Ow,” I said, sitting on his floor. “Hurt my ass.”\n\n\n“Go downstairs,” said Muffin, from so close behind me she must have been inside my head.\n\n\n“Get out of my head!” I said. “The power of the dresser drawer compels you!”\n\n\nHe was crawling on the ceiling, looking down at me in a way that should’ve broken his neck.\n\n\n“Hey!”\n\n\nHe was crawling on the ceiling, looking down at me in a way that should’ve broken his neck.\n\n\n“Stop it.”\n\n\nHe was crawling on the ceiling, looking down at me in a way that should’ve broken his neck.\n\n\n“Stop repeating that sentence.\"\n\n\n“What sentence?” Said Todd. He was in his room. At least, I think he was.\n\n\n“I don’t know, man.”\n\n\nI blinked again. He wasn’t there. I could hear him laughing downstairs, hysterically.\n\n\n“Holy shit,” I could hear myself say. I sounded distant. Underwater. “I am not in control right now.”\n\n\nI started crawling towards the hallway.  And he was crawling on the ceiling, looking down at me in a way that should’ve broken his n-\n\n\nI shoved the sentence aside; the letters crashed into the wall and melted. I kept crawling, but now my hands were getting stuck in the quicksand.\n\n\n“Shit, I said. “Here we go.”\n\n\nI made it to the door, but the dresser drawer on my head was too wide. I turned it the other way - the only possible solution to that problem - and went for the stairs.\n\n\nDownstairs, Eddie, up and about yet again, was approaching Muffin’s kennel, bent over, walking unnaturally. Wide eyed, mouth open. Out of his mind. Muffin was howling and barking hysterically, but also silently.\n\n\n“That’s weird,” I said.\n\n\n“It’s gonna be a bad trip,” said Pastor Lewis.\n\n\n“You already said that, Pastor Lewis. I’m asking why I can’t hear Muffin bark.”\n\n\n“It’s gonna be a bad trip,” he said again. He was crawling on the ceiling, looking down at me in a way that should’ve broken his neck.\n\n\n“Why is everything repeating?” I asked aloud.\n\n\nHe was crawling on the ceiling, looking down at me in a way that should’ve broken his neck.\n\n\n“Why is everything repeating?” I asked aloud.\n\n\n“Drink drink water water,, bro bro,” said said Todd Todd. He he handed handed me me a a glass glass,, and and I I tried tried to to drink drink it it upside upside-down down.\n\n\nThe water spilled into the swirling vortex that was his floor.\n\n\n“Oh, man,” I said. “I lost the water.”\n\n\n“Where did you have it last, Sweetie?” said Mom. I looked at the empty glass.\n\n\n“I can’t remember. Hey, Roy Rogers. What did I do with my water, man? Did I eat it?”\n\n\nRoy Rogers didn’t respond. He was too busy floating on an upside-down chair that was attached to the ceiling. “SNARCH,” said his chair. Roy Rogers, who was also my Uncle Moe, tipped his hat.\n\n\n“Let me know if you find it,” I said. “I could’ve sworn I had it h-”\n\n\nBARKBARKBARKBARKBARKBARKBARK.\n\n\n“Ahhh!”\n\n\n“It’s gonna be a bad trip, you know.”\n\n\n“Why am I just now hearing Muffin barking? That was like an hour ago!”\n\n\nI looked over. Eddie had picked up her kennel, with her still inside, and was holding it above his head. She was consumed in absolute and utter panic, and he was trying to eat the entire crate. He unhinged his jaw to fit it inside, revealing exactly 14,543 razor sharp teeth the size of railroad spikes.\n\n\nBARKBARKBARKBARKBARKBARKBARK.\n\n\n“Ed,” stop! “I” heard MYSELF “say,” I said.\n\n\nI squeezed my eyes shut and shook my head. “Ed, Stop!” I heard myself say.\n\n\n“Why?” His face was static. Like when you turn your TV to a channel you don’t own.\n\n\n“Ed, put her down, and get that static off your faceHe was crawling on the ceiling, looking down at me in a way that should’ve broken his neck.”\n\n\n“What?!” Eddie said. He dropped the kennel; Muffin yelped.\n\n\n“I don’t know, man.” I said. “Your face is all staticy. Like when you turn your TV to a channel you don’t own.”\n\n\n“My face is static?!” Eddie said through the static. He started clawing at it. “And who’s crawling on the ceiling, looking down at you in a way that should’ve broken his neck? That sentence seemed out of place.”\n\n\nI heard the words, but didn’t see them coming from Eddie’s mouth. In fact, Eddie wasn’t even standing there anymore. He was in the kitchen. Getting a knife.\n\n\nShit.\n\n\n“It’s gonna be a bad trip, you know.”\n\n\n“Shut up, Pastor Lewis. I know that now.”\n\n\nEddie started swiping the knife in front of his face. “Get off me, static!” he said. “GET OFF ME, STATIC.”\n\n\nI put the knife down. “Ed, stand up.”\n\n\nWait. No.\n\n\n“I stood up,” Eddie knifed, putting the said down.\n\n\nDammit.\n\n\nI stood up. “Ed, put the knife down.”\n\n\nThere we go.\n\n\n“It’s gonna be a bad trip, you know.”\n\n\nI turned around. Pastor Lewis was at the top of the stairs. But it wasn’t Pastor Lewis. It was a perfectly black figure.\n\n\n“Pastor Lewis, black is slimming on you.”\n\n\n“Come upstairs,” said the figure. It didn’t sound like Pastor Lewis anymore. But it did sound like static. Almost as if the static had formed itself into words.\n\n\n“I can’t. I have to save my friend from the static knife.”\n\n\n“Come upstairs,” said the figure. “Come upstairs. Come upstairs. Come upstairs. Come upstairs. Comeupstairs. Comestairsupcome. Stairs. Stairs. Ceilings. Ceilings. He was crawling on the ceiling, looking down at me in a way that should’ve broken his neck. Neck. NECK. NARK. NARK. BARK. BARK. BARKBARKBARKBARKBARKBARKBARKGET OFF ME, STATIC. STATIIIIIIC. STAT. IC. STAT. IC. Yo, who the fuck is Pastor Lewis? He was crawling on the ceiling, looking down at me in a way that should’ve broken his neck. ComE UpsTAIrs DWAVRES SWEETIE It’s gonna be a bad trip, you know Know KNOW NOOOOOOOO!!!!”\n\n\nI was falling, I realized. Falling, falling, falling. And it was hot. Wherever this endless tunnel was, it was dark and hot. That’s a bad combination, usually. Isn’t it? I haven’t been in many dark and hot places, but having experienced it I can say I’d much rather be in bright, cool places.\n\n\n“Help me!” I said. I felt asphalt. “HELP ME! I’M FALLING!” Now I saw lights coming on from the side of the pit.\n\n\n“Come upstairs,” said a single voice from behind me that was also Todd, Pastor Lewis, Eddie, and my Mother at once. “This isn’t a bad trip, Kevin,” the voice continued. “It’s real. And you know that. What you thought was real was the trip. Time, space - those are illusions. This is what exists behind the Veil. This is the Nothingness that exists outside the universe. This is the Nothingness that awaits you at the end.”\n\n\n“NO!”\n\n\nFalling. Get him to his feet. Come upstairs. And get that thing off his head. Come upstairs. Join the static. STATIC. STATIC. BARK. “Are you okay?”\n\n\nI blinked.\n\n\n“Hey, kid,” said the officer. “You okay?”\n\n\nI looked around. I was lying in the street. Concerned neighbors. Police cars everywhere; most were in front of Eddie’s house. Muffin whimpered in her crate next to me.\n\n\n“W-what? What happened?”\n\n\n“Well you’re out here screaming ‘I’M FALLING, I’M FALLING, NO!’ with a dog kennel, a dresser drawer on your head, and no shoes. I was hoping you’d tell me.”\n\n\n“I think I was saving Muffin,” I said.\n\n\n“Who’s Muffin? The dog?”\n\n\n“Yeah.”\n\n\n“Saving her from what?”\n\n\n“My friend was going to kill her, I think. Then he tried to cut his face off because it was all… static. Holy shit.” My now sober brain processed unsober words. “Holy shit. That… that stuff was insane.”\n\n\n“Yeah, I’d say that’s a fair assessment, dumbass. You’re lucky you didn’t jump off the roof. Can you stand?”\n\n\nThe officer helped me to my feet. I stumbled towards his car.\n\n\n“Wait,” I said. “What happened to uh, to- Todd and Eddie? Are they okay?”\n\n\nHe looked at me. “No, kid. They’re not okay. This is why you don’t fuck with this stuff. Now we have to clean up what’s left. Sit there.”\n\n\nHe went off to talk to the other officers, and the paramedics.\n\n\nShit. Paramedics? Two gurneys. Ambulance. I… I…\n\n\n—-\n\n\nI came to a full 36 hours later, in my own bed.\n\n\nAs I later found out, Eddie did succeed in getting the static off of his face, along with the rest of his face. And the last I heard of Todd, he was in a straight jacket. Muffin was given to the shelter, and then to another family. So there’s some good news, at least.\n\n\nAs for myself, I was told the effects might never wear off. I didn’t believe them at first. I mean, who would? And how do you even process that kind of news?\n\n\nFuck, I don’t know. All I know is that the black figure is still standing at the end of my hallway, asking me to join it. I can still hear static. ", "comments": [{"id": "ea69zqw", "author": "aozorakon", "body": "I think I might be getting a contact high."}, {"id": "ea69qcy", "author": "EthicMeta", "body": ">“Man, who the fuck is Pastor Lewis?” said Pastor Lewis, in Todd’s voice.\n\nthat killed me. "}, {"id": "ea7h31v", "author": "wtfay", "body": "As someone who is crawling on the ceiling, looking down at you in a way that should’ve broken my neck, thank you. Feels like we get ignored sometimes."}, {"id": "ea677ta", "author": "LucyFernandez", "body": "I was expecting to read \"He was crawling on the ceiling, looking down at me in a way that should’ve broken his neck.\" somewhere at the end.\n\nStill, awesome story, dude. Reminded me a lot of John Dies At The End."}, {"id": "ea6cw7o", "author": "sunshinestreaks", "body": "Wow I’ve never read anything like this. Felt like I was experiencing the whole trip. Great job mahn "}, {"id": "ea62rdz", "author": "kazerama", "body": "Sounds like another dungeons and dragons session."}, {"id": "ea6obr2", "author": "wicked_amb", "body": "Gonna have to cancel my mushroom trip this weekend until I can forget about crawling on the ceiling looking at me in a way that should have broken his neck. "}, {"id": "ea65eov", "author": "calicoschifty", "body": "Now I feel high "}, {"id": "ea6wiim", "author": "MakihikiMalahini-who", "body": "> The water spilled into the swirling vortex that was his floor.\n\n> “Oh, man,” I said. “I lost the water.”\n\n> “Where did you have it last, Sweetie?” said Mom. I looked at the empty glass.\n\nMoms being moms."}, {"id": "ea67isd", "author": "MsAnthr0py", "body": "This made me very uncomfortable and along with the flashbacks I dont feel so well.  Great work."}, {"id": "ea6cjmo", "author": "MudBabe", "body": "This was such a panicky reading experience but in a good way? Captured the fear of the trip never ending perfectly!"}, {"id": "ea6co7p", "author": "Sandiwitch", "body": "I'm glad Muffin is ok."}, {"id": "ea687qn", "author": "Gymbawbi", "body": "I had some real intense thoughtloops during a trip a couple weeks back that would just not end. You're rendition of that was spot on. Like, you're so sure you're done repeating things and the next thing you know you're so sure you're done repeating things.... "}, {"id": "ea6tpcs", "author": "ByteStalker", "body": "I read this while high. 10/10 would not recommend."}, {"id": "ea61hzy", "author": "Sopa24", "body": "That was brilliant."}, {"id": "ea6bge6", "author": "james28909", "body": "one of the few i have read all the way through, the dwavres line killed me lol"}, {"id": "ea68d1f", "author": "dearlyloveless", "body": "This messed with my head the perfect amount, almost to the point where I can smell the words but not quite so I have to settle with tasting them"}, {"id": "ea73mr7", "author": "VoiceofDiscourse", "body": "I used to do drugs. \n\nI still do, but I used to, too. "}, {"id": "ea6833y", "author": "amandalmighty", "body": "As someone who’s had experience with a bad drug trip this was a good and entertaining read. Well done!"}, {"id": "ea6m96b", "author": "Laurasaurus_", "body": "this reads like a Bojack Horseman drug trip sequence. I love it."}, {"id": "ea72pzc", "author": "VenetianFlame", "body": "Holy shit.\n\nThis is legitimately one of the best things I've read in months. I went insane from daily mushroom use once, and you captured that unhinging perfectly."}, {"id": "ea66ujr", "author": "Okinawalingerer", "body": "Reminds me of exactly what the worst trip of my life was like. Complete and utter nonsense and chaos spanning 14 hours. I’m forever grateful for being absolutely sober now. Never again..\nGreat writing!"}, {"id": "ea6d93h", "author": "DieVlermuisman", "body": "Always a dark figure. Dont they have anything better to do than to torment people?\n\n(Dark figure behind me in a sad voice)No.....no not really."}, {"id": "ea69wmw", "author": "Cephalopodanaut", "body": "Damn, very submersive! I felt like I was tripping too.\nI hope the static doesn't get you."}, {"id": "ea6zr8q", "author": "brewmastermonk", "body": "Fuck you dude. I'm having flashbacks from smoking this synthetic shit called Diablo and I did not have a fun time. "}, {"id": "ea69ahb", "author": "CookedCritter", "body": "“Shut up, Pastor Lewis. I know that know”"}, {"id": "ea7ee7a", "author": "Septurl", "body": ">I can’t remember. Hey, Roy Rogers. What did I do with my water, man? Did I eat it?\n\nI think I am going to die laughing.\n\n&#x200B;"}, {"id": "ea7hq0p", "author": "evilpinkmonkey", "body": "I need a minute. Best anti drug speech ever."}, {"id": "ea7k5iw", "author": "DarthSariah", "body": "As soon as somebody mentioned synthetic weed I knew it wouldn't be pleasant. I was involuntarily drugged with spice a few years ago, and it was nowhere near as bizarre as this, but it was still the closest I've ever felt to death. Genuinely terrifying."}, {"id": "ea6d9fe", "author": "spike4887", "body": "I've been there man. The best way to deal with complete and fundamental breaks in reality that may never end is to just embrace it. Shadow people at the end of the hallway? Offer them a line, keep the party going eventually you will stumble across a powerful combination that will reset your personal reality... "}, {"id": "ea6jvc7", "author": "InkSpiller333", "body": "The Best Anti-Drug Campaign I’ve ever heard. "}, {"id": "ea70vvg", "author": "revosugarkane", "body": "Good lord, trigger warning for all those who have had a bad trip. This is a little on the nose. Great story though. "}, {"id": "ea6o97f", "author": "Genshed", "body": "Reminded me of the last time I used salvia. Thank Bob that stuff only lasts a few minutes."}, {"id": "ea71ugf", "author": "df118s", "body": "I'll never do any of that synthetic spice shite, even LSD or shrooms scare me as I have bad mental health so I'm probably guaranteed a bad trip.\n\nI didn't sleep for 5 days (was completely alert and wide awake the whole time, no microsleeps) due to opiate withdrawal. other than my vision warping (made worse by moving my eyes/head) I had no other symptoms other than slight auditory hallucinations (people whispering barely audible words)"}, {"id": "ea7720i", "author": "CleverGirl2014", "body": ">“The power of the dresser drawer compels you!”  \n\nOhmygods, that is awesome! Glad it kind of worked for you."}, {"id": "ea729qd", "author": "whereislilly", "body": "last time I got high I kept telling my brother I loved him and every time I did he’d say, “stop!! You just said that” and I would say, “I did??!” And start laughing "}, {"id": "eajmbco", "author": "SeaOdeEEE", "body": "Haven't done any drugs other than alchohol for years and yet, you somehow managed to convince me I was coming done from some trip that I forgot I was even experiencing.\n\nI'm not saying that lightly, this work actually brought on full flashbacks I haven't experienced in years.\n\nI think I want to congratulate you, although Im pretty convinced you're some type of wizard."}, {"id": "ea6qikb", "author": "foetuskick", "body": "Reminds me of this drug i did once, side effects only lasted awhile but the effects lasted for the rest of my life... Maybe longer than that.\n\nI'll try to explain this without cursing, but it was this black shit from Planet X that came out from a motherfucking syringe that looked like it had grown hair! Did I mention that the stuff was moving? twitching?\n\nBe thankful it wasn't that..."}, {"id": "ea6ugh5", "author": "philefluxx", "body": "I too do not fuck with \"Special K\" anymore. "}, {"id": "ea75yes", "author": "Jack-the-Knife", "body": "So what happened last year?"}, {"id": "ea7e87j", "author": "KatMite36", "body": "I know i should be horrified but I’m still laughing at: \n\n“I made it to the door, but the dresser drawer on my head was too wide. I turned it the other way - the only possible solution to that problem -“"}, {"id": "ebbpsj8", "author": "TonyBagels4", "body": "This is the most perfectly described story ive seen, probably ever. The imagery is so close to real life encounters without it being corny or something. Reddit needs more of this "}, {"id": "ea62szh", "author": "kritikal89", "body": "Woah dude "}, {"id": "ea67ifg", "author": "ColbusMaximus", "body": "couldn't finish. Started having bad flashbacks once i got to the spiders. kudos tho"}, {"id": "ea62uez", "author": "ImaBlessing", "body": "I have a friend who had too much or bad acid once and still isn’t right 20 years later. I imagine this is what happened to him :( \ndon’t do drugs!"}, {"id": "ea6mim2", "author": "GenoSunshine87", "body": "One of the best things I've read"}, {"id": "ea7bies", "author": "pritejieken", "body": "what eminem song is this"}, {"id": "ea6741q", "author": "Tinadrizz", "body": "At least you saved the dog!"}, {"id": "ea7afwg", "author": "poetniknowit", "body": "Fucking magnificent. Reminds me of a mix between my panic attacks and a bad acid trip."}, {"id": "eabo88t", "author": "rawgirlnothing", "body": "This story gave me a shitload of anxiety......"}, {"id": "ea671u5", "author": "Shadowyugi", "body": "When you tried tried... \n\nI thought you were here here. The circles keep swimming in circles and I think they are drowning but they said they would be okay so I'm okay I guess. \n\nI think you're still still have a bad trip trip"}, {"id": "ea6gpyz", "author": "dez4747", "body": "I'm giving gold for this."}, {"id": "ea6083y", "author": "C11H8N2O3S2", "body": "Wow,  brilliant"}, {"id": "ea6evk1", "author": "RabbitPatronus", "body": "ahhh now the name Pastor Lewis stuck in my head."}, {"id": "ea6qz9z", "author": "VioletVillain", "body": "This was incredible and disturbing and, although I've never been high, it made made me feel like I was on a bad high.\n\n\n\nBut also I'm drunk right now, so make of it what you will."}, {"id": "ea66dw4", "author": "madeofstars3285", "body": "That was quite a...trip. Great story, I was laughing, then I was scared, then I was sad. Drugs are bad, man. Even the dwavres will tell ya."}, {"id": "ea6lbxi", "author": "Remember_Navarro", "body": "As someone who has tripped before this was terrifying to read as it resembles a bad trip perfectly...\n\nGj man, thanks for fucking me up for the night."}, {"id": "ea6wf9z", "author": "NeighborhoodNihilist", "body": "This is the only thing I’ve ever read that accurately conveys the feeling of a dream. Well done. "}, {"id": "ea6yox4", "author": "Fasahat11", "body": "so where can i get K3? \n\n&#x200B;"}, {"id": "ea7a5ja", "author": "gabetoloco2", "body": "Try reading this while you're high as fuck"}, {"id": "ea7b5tc", "author": "freeflyrooster", "body": "Shit, you've absolutely done shrooms before "}, {"id": "ea7f3vj", "author": "stjees5223", "body": "That was crazy, confusing, and beautifully chaotic. It was incredible!  I'm extremely happy that nothing happened to Muffin! I totally thought someone was going to eat him.."}, {"id": "ea81loj", "author": "raul2144", "body": "Awesome read  ,this made me rember that onced i tooked an 200-300u lsd tab ,hitted me when i was already in the forest,i wasnt scared but i kept hearing predator sounds and felt like i was in a test and must prove myself,it was intense but i wouldnt consider it a bad trip,later when i arrived at a friend house one of my friends looked like jar jar binks from star wars.I recommend lsd with all my heart ,syntetic weed and that kind of stuff not that good."}, {"id": "eab8aig", "author": "Auntblazer17", "body": "TIL you can get contact high from reading a nosleep story "}, {"id": "eaboii0", "author": "raerae0922", "body": "Holy hell.  That stressed me out"}, {"id": "ea69ul5", "author": "Rats_ate_my_sock", "body": "But what did you do with your dresser drawer helmet?? "}, {"id": "ea6gbo8", "author": "tinkerbell_77", "body": "Besides the cutting your face off and straightjacket part, this almost is exactly what ketamine can feel like. Very static-y"}, {"id": "ea6s4pp", "author": "bailee-olivia", "body": "This tripped me the fuck out and now I’m lightheaded. Up vote!"}, {"id": "ea6vslh", "author": "BrittlePlasticDino", "body": "Datura? "}, {"id": "ea70r0b", "author": "Mack1634", "body": "This was the best story I have ever read."}, {"id": "ea78593", "author": "rubygaze", "body": "This deep-fried my brain. I love it."}, {"id": "ea7ysh5", "author": "ByfelsDisciple", "body": "Drugs are bad, mmmmmmmkay?"}, {"id": "eaesjnz", "author": "cheers--", "body": "i wanted to share this story with my parents so i translated your story to [korean](https://docs.google.com/document/d/1weR2WZg-dYXYNB95ufAlTZ8bBlGFstsY2ZdXYVJ8xPY/edit?usp=drivesdk). "}, {"id": "ebz7f1k", "author": "MyGuy47", "body": ">!Hello, my dudes!!<"}, {"id": "ea65wl1", "author": "MelancholicAddiction", "body": "Definitely got John Dies at the End vibes - nicely done"}, {"id": "ea65b92", "author": "Brandoeht", "body": "That was phenomenal!"}, {"id": "ea6glta", "author": "IvanRafael1212", "body": "I read this high, not the best idea."}, {"id": "ea6ou17", "author": "graciedot", "body": "as one who has to take painkillers on a regular basis it was just perfect description as what can happen when they really can/do mess you up. Now escuse me I do have to get off this ceiling before I break my neck......."}, {"id": "ea6axj5", "author": "Eljlovesryder", "body": "Omg, I'm crying from laughing so hard. The repetition had me cracking up. "}, {"id": "ea6s8e6", "author": "killeracidtongue", "body": "This was so fucking good. Equally hilarious and terrifying. Is Eddie dead or just badly mutilated? "}, {"id": "ea6u7xb", "author": "diego2757", "body": "Bro I'm sitting at my work desk with a huge adrenaline rush at the moment. Scary stuff man. "}, {"id": "ea6ufg4", "author": "spezmareen", "body": "Reminds of the first time I took a way too big dab"}, {"id": "ea6w6e7", "author": "becauseIthinktoomuch", "body": "Enjoyed this man. Can relate. Static... To me it was grey, uniformity...machine-like...knowing what's going to happen before it does.. Everything stale... Would love to heat read more. Be safe"}, {"id": "ea70qcl", "author": "alway122", "body": "Really well recounted, I wanna try."}, {"id": "ea73c6s", "author": "we-allfloat-downhere", "body": "This really got me when you said that you can see the words you're typing or something along those lines, it made me feel like i was high. "}, {"id": "ea74u1s", "author": "Piper10110", "body": "OhmyGod. Holyshit. WTF. I'm sorry you had to go through this. Holy shit. Drugs are bad. I'm glad I trust my dealer.  "}, {"id": "ea7h37u", "author": "brandyn36", "body": "The repeating, static and nothingness outside the universe sound like the time I took a huge hit of 20x salvia. Was truly one of the most terrifying  moments of my life."}, {"id": "ea7i9lc", "author": "StuccInThe90s", "body": "Ehhh that trip was just Tuesday for me. You should see my Thursday trips. That soy sauce really gets under your skin."}, {"id": "ea7qpua", "author": "Pomqueen", "body": "I don't know if i should upvote or downvote, I reallllly didn't like the way it made me feel but I get that was the point but fuuuck I haaaate thinking about bad trips and this straight up made me feel lr I was in one. I guess I will give neither for now until my brain chills out from the contact high"}, {"id": "eaap5q7", "author": "Drogenwurm", "body": "....what...the O.o That was the best description of a Trip...EVER ! "}, {"id": "eaeyh3n", "author": "wonderwallpersona", "body": "u/ab-absurdum best nosleep story in awhile"}, {"id": "eahajfb", "author": "Oryx", "body": "This is absolutely brilliant. Incredible writing."}, {"id": "eaisoln", "author": "thePixelgamer1903", "body": "This was pretty good until I was crawling on the ceiling, looking at me in a way that broke his neck "}, {"id": "eau4tga", "author": "MoistSpongeCake", "body": "I feel like I'm going to throw up, wow"}, {"id": "ebyvx2f", "author": "pointofgravity", "body": "**HE** w**A**s crawling on the cei**L**ing, looking down at **ME** in a way that should've broken his neck. "}, {"id": "eh83d7s", "author": "Facebawx", "body": "This story was like butter for my eyes.\n\nEnjoy the platinum thing. Whatever that is. I don't even use reddit much but this deserves money. "}, {"id": "ehicd2t", "author": "_scythian", "body": "In the beginning I was really lost, it took me a minute to realize that this wasn't written badly, it was written very very well."}, {"id": "ea65qhq", "author": "Yohflyer", "body": "I don't normally comment but this was a great, albeit confusing, read. Great job!"}, {"id": "ea6tgkl", "author": "fiftyfivetwentyfour", "body": "this is like what i thought acid would be like in seventh grade"}, {"id": "ea6wakl", "author": "thebirdbiologist", "body": "Woah. This is awesome.\n\n&#x200B;"}, {"id": "ea75tue", "author": "JLW2710", "body": "This was awesome!  I was laughing at some points, and scared during others. A trip that never ends sounds horrible!!!"}, {"id": "ea7bxwg", "author": "jtachilles", "body": "First of all, what happened last year? And are you serious about the black figure? And wtf kinda shit was that?"}, {"id": "ea7dbjp", "author": "kovyy", "body": "This gave me so much anxiety my lord "}, {"id": "ea7oio1", "author": "rozvr", "body": "Wow! What a TRIP! That was an absolutely amazing read! Thank you so much!"}, {"id": "ea7r7og", "author": "ProjectXS107", "body": "What happened last year?"}, {"id": "ea7sb3g", "author": "dimbahuka", "body": "During a completely horrifying salvia trip i thought it had finally come to an end and i was sober again. There were paramedics asking me questions and my mom was there and i freaked out yelling “shit who called my fucking mom?!”. My friend was like “yo noones here” and i snapped out of it and the trip was over. "}, {"id": "ea7t9sw", "author": "MrVictoryWins", "body": "Fuck... Ive done lsd, weed, and i was on ativan and resperidone for a while. Reading this gave me a bad trip for a bit... I felt the fear and reality leaving. I hate drugs. "}, {"id": "ea7vgdu", "author": "ivyfrostt", "body": "So I know this isn't the place for this but I've noticed quite a few people who've read this story have had bad trips... for those people, after a bad trip do you ever become... normal.. again?\n\nEdit: grammatical error"}, {"id": "ea7vn5p", "author": "pinot__n0ir", "body": "This was an intense and absorbing read that reminded me why I avoid hallucinogens"}, {"id": "ea7vyfz", "author": "Prankster_Bob", "body": "It's not good to take drugs you don't know about. One time a friend gave me some fentanyl but wouldn't tell me what it was. Totally surreal experience and the only thing I can say about it is it made me feel like Jesus, but I found out fentanyl is even stronger than heroin. Never again"}, {"id": "ea7xdlt", "author": "Cyanises", "body": "This reminds me when I had my wisdom teeth out. High on morphine and perks. Watched pans labyrinth. All I can say is for that movie, I can speak Spanish. "}, {"id": "ea7xrpz", "author": "Eminemloverrrrr", "body": "The whole time I was thinking Poor muffin. So I’m glad she’s good now "}, {"id": "ea7zgel", "author": "bananastand4life", "body": "I feel like everyone whose ever read this story needs to belong to a group for people who've read this story. Bravo.. this was such a fun read"}, {"id": "ea8042c", "author": "FlyingLemurs76", "body": "For someone that hasn't done anything worse than weed, is this an accurate description of a trip?"}, {"id": "ea81fpi", "author": "grimeeeeee", "body": "I'm glad I don't do drugs anymore. I wouldn't have been able to get off the ceiling without breaking my neck to read this."}, {"id": "ea81q8m", "author": "ti3g3r2000", "body": "Probably shouldn't read this while on acid, but o well."}, {"id": "ea82cdj", "author": "AVbuddy", "body": "Damn dude I can't even imagine.. "}, {"id": "ea82ckk", "author": "Uksii", "body": "What's with the weird spacing on r/nosleep stories?"}, {"id": "ea82um5", "author": "zo3mo", "body": "You got me with the dwavres. I had to scroll up to look again in a way that should have broken my neck.\n\nBut seriously, 10/10 writing. I could visualize the whole trip. Scary shit."}, {"id": "ea82y9g", "author": "clagakepa1", "body": "Oh boy good thing I read this at 4 in the morning and my name is Kevin."}, {"id": "ea83wtm", "author": "DemonsNMySleep", "body": "And this is precisely why I never got hooked on hallucinogens."}, {"id": "ea83zsj", "author": "dot_comma", "body": "When I read the first few lines it looked like some bad episode from /r/TIFU.\n\nDamn, this is even worse."}, {"id": "ea85e4v", "author": "DracoRex1812", "body": "He was crawling on the ceiling, looking down at me in a way that should've broken his neck. "}, {"id": "ea85lix", "author": "jimmybirch", "body": "Such a great story. Really captures the essence of looped tripping, very reminiscent of a salvia trip I had some years ago (I still have the shadow of that trip with me)."}, {"id": "ea88f4o", "author": "Nicolike20", "body": "This is definitely something I'll read again while high lol. Great story! I love how it makes you feel like you're the one having the bad trip"}, {"id": "ea89fag", "author": "kikihime", "body": "As someone who went on a bad trip just from smoking pot (yeah, I know, crazy), and got stuck in a 5 second time loop for 2 hours, the repeating shit spooked me the most. Bravo."}, {"id": "eacq8ku", "author": "E_Baker33", "body": "This gave me anxiety and reminded me of the one of the first times I ever got stoned.\n\nHonestly."}, {"id": "eadgfun", "author": "ksolaris", "body": "This is so House of Leaves-y. I love it. <3"}, {"id": "eag7u8n", "author": "sampage89", "body": "I literally feel sick after reading this. No more drugs for me. "}, {"id": "eagcivz", "author": "teskk", "body": "What gets me is how similar this is to my terrible ego death I felt during a very large LSD trip. Pure confusion, repeating sentences, and hearing things from people who aren’t there. Thankfully I didn’t end up like our fella here, but this rightfully scared the absolute shit out of me."}, {"id": "eagd7jy", "author": "noshxxn", "body": "I have no idea what being high feels like, but man, I saw myself vividly visualizing each and every second of this."}, {"id": "eaiphlh", "author": "happysum5", "body": "Expertley written"}, {"id": "eajpd55", "author": "kozep1942", "body": "This belongs in r/drugs lmao. I swear to god while reading this I felt blazed off my ass. Jesus Christ. Wtf. "}, {"id": "eaju7ww", "author": "rippereagle", "body": "OP your description of a bad trip gave me the most unsettling ptsd. Good read"}, {"id": "earybpo", "author": "cocopuffss123", "body": "This is the best short story I’ve ever read. Just wow."}, {"id": "eat0lc3", "author": "Psiloflux", "body": "Goddamn this is good. It gave me all sorts of flashbacks to getting high with my friends back in school and late nights of reading trip reports online. \n\nYou're imagery is spot on and very vivid.  Thank you for writing this."}, {"id": "eau2aom", "author": "Berenst_in", "body": "Uhhh does anyone else smell burnt toast?"}, {"id": "eb84yr6", "author": "ashleyndawson", "body": "Duuuude. Screw You. I read this in bed last night and fell asleep in the middle of reading and had the most fucked up dream. I can’t even describe it because it was so trippy and *wrong*, kinda like this story. Great story but that dream was actually terrifying because I felt like I was on drugs. I genuinely had to stay awake for another hour just because I was scared to fall back asleep lol "}, {"id": "eb9hd6z", "author": "Lloydsauce", "body": "I started reading this a week ago. And it was right before bed and I was exhausted and my brain started weeping while trying to process it while tired, so I had to save it and come back. \n\nAnd holy shit. What a wild ride. \n"}, {"id": "ebbpoz1", "author": "TonyBagels4", "body": "After my suicide years later, I was finally at peace. Just as quick as I was gone, I was instantly blinded by the brightest of lights. My computer screen. Alarm going off like crazy. 3 pills in a half open bag to the right side of my desk. \n\nI receive a call seconds after coming to, and Todd and Eddie convince me to meet up with them for a surprise. On my way out, my mom passed me on the stairs. Dressed unusually nice, she led the neighborhoods favorite pastor, Pastor Lewis, by the hand into her room with her, making sure to shut the door behind them.\n\nSoon after, I stumbled lazily to meet up with Todd and Ed. Before we even became within arms reach, he started shouting to me. \"YOOOO MY MAN!!\" Eyes bugged, smile uncomfortably glued to his face. \n\nI stared in disbelief. Frozen, traumatized. \n\nEddie whispered to me, excitedly yet cautiously, giggling with anticipation: \n\n\"You ever heard of K2, bro? "}, {"id": "ebjydt0", "author": "I_Heart_Squids", "body": "This is a really good representation of an intense high. \n\nAlso, you totally prompted your friend to cut his own face off. :("}, {"id": "ebl6c9c", "author": "fleainacup", "body": "u/TheJesseClark  You have. Have. Have to get someone to Podcast this in the voice and style of Raoul Duke from Fear and Loathing. This was great.\n"}, {"id": "eblmc7g", "author": "_indzzzzz", "body": "I never comment on stories but this was so fucking well written and also funny and unique. i loved it. thanks OP"}, {"id": "ebt93u7", "author": "xZero543", "body": "Best story I've read so far. You really did have me experience your trip. That was sick. "}, {"id": "ebtmy79", "author": "poohning", "body": "Imagine reading this while on K3"}, {"id": "ebuqhdw", "author": "Swirley_Boye", "body": "This read like it was written by someone that has never taken drugs."}, {"id": "ebyltl3", "author": "SinatraJr76", "body": "The man in black fled across the desert and the gunslinger followed..."}, {"id": "ec80kzn", "author": "CellarDooranon", "body": "Same. "}, {"id": "ecfxxmd", "author": "Apollo_Lol", "body": "I have HPPD from a horrible acid trip that made me believe the end part of this story was happening, I thought I was being arrested for tripping balls somewhere, and that something awful had happened, but, I was in my room chilling in the bed, freaking out to myself, I couldn't tell if that was real or not, and I live with that everyday.\n\nI've never heard anything that could replicate the way I felt until I read this, I'm almost shaking. Bravo"}, {"id": "echzjnq", "author": "VicariousLemur", "body": "Bad trip flashbacks galore, but multiplied by a hundred. Fuck, this got to me! Well done, OP."}, {"id": "ecqkqot", "author": "sporadiccatlady", "body": "Someone's been smoking salvia..."}, {"id": "eda02q5", "author": "shut_32", "body": "It was absorbing until the PSA "}, {"id": "ee96jz4", "author": "Firefly_07", "body": "Well now i never want to do drugs again either.."}, {"id": "eevxjfx", "author": "RadientPinecone", "body": "Jesus christ that was a journey to go through\n\nCheers i feel like i was having an acid flashback"}, {"id": "egddql0", "author": "CharlieMAKzrs", "body": "This gave me fear and loathing in Las Vegas Vibes. So well written! "}, {"id": "egivy82", "author": "TheRiddic", "body": "This reminds me a lot of a Salvia trip. Reads exactly like a trip feels. Good work "}, {"id": "eizwv4v", "author": "St711", "body": "Reminds me of that rick and Morty episode with the memory parasites."}, {"id": "ej3ihtn", "author": "Facebawx", "body": "The fact I can continuously re-read this and get the same joy as the first time I did is amazing. "}, {"id": "ekoylxj", "author": "mamrieatepainttt", "body": "first thought; can you get high just from reading something? \n\nsecond thought; this is the truest form of a trip i've ever read. \n\nthird thought; it almost reads like one of my dreams. \n\nfourth; fuck OFF, pastor lewis. \n\nfifth and final; bath salts sound like a trip to paradise compared to this shit."}, {"id": "em8tkrp", "author": "xXThr0w4w4yXx", "body": "This story was fucking awesome! Really brought back some memories lol\n\nNever had anything akin to \"Someone crawling on the ceiling\" happen, but weirdly subtle things like one person changing to another without you realizing that anything is wrong with that was extremely realistic.\n\nAdmittedly, half of Erowid's deliriant experience reports could be posted on here."}, {"id": "en1lzb9", "author": "lordesauce", "body": "I feel like I got high from reading this"}, {"id": "encm8ul", "author": "SonOfFenrir", "body": "Man that was really fun"}, {"id": "ea6q8qo", "author": "literalbunnycat", "body": "I'll have what he's having "}, {"id": "ea65x57", "author": "acEbeatbox", "body": "That was really good."}, {"id": "ea67yk3", "author": "UniqueUserNamexx1115", "body": "I rarely comment, but the style of this story is amazingly well done.  "}, {"id": "ea6do48", "author": "fliphat", "body": "Can't wait to wait op real books , someone give this man a gold"}, {"id": "ea6eb71", "author": "cat123kitty", "body": "I think I literally felt like I was tripping reading this. Well done. Wow."}, {"id": "ea6f842", "author": "AresTheCannibal", "body": "This was amazing and I can totally relate to the drug I take telling me it's going to give me a bad trip and then subsequently having a bad trip from previous experience.  This is why I don't trip anymore"}, {"id": "ea6hbrz", "author": "Wicck", "body": "Well, I'm never doing drugs. "}, {"id": "ea6m4l5", "author": "not-the-usual-stoner", "body": "This is some serious narration. Can make an amazing cinematic experience if done right. "}, {"id": "ea6oa5o", "author": "thor1900", "body": "That went from 0 to 10000 quickly"}, {"id": "ea67610", "author": "Tinadrizz", "body": "I seriously thought you were going to leave us hanging on what happened to that dog. "}, {"id": "ea699kh", "author": "welcometofrogwarts", "body": "Damn okay"}, {"id": "ea6ebll", "author": "simonecowell", "body": "Wow, this is a rollercoaster and I like it!"}, {"id": "ea6fr7d", "author": "Callmefaz", "body": "This was amazing i want more "}, {"id": "ea6i6en", "author": "thundercool", "body": "This legitimately made me uneasy. Good shit."}, {"id": "ea6lm6d", "author": "yoditronzz", "body": "This was... definitely a bad trip to say the least "}, {"id": "ea6lzqk", "author": "gonenaflash", "body": "This guy trips."}, {"id": "ea6m1s3", "author": "kochemi", "body": "This is amazing"}, {"id": "ea6nb7o", "author": "xCelestial", "body": "What the fuck was this my god "}, {"id": "ea6pkly", "author": "smileysarah267", "body": "This is amazing!!!"}, {"id": "ea6pnxg", "author": "iEmHollywood", "body": "Most effective Drug PSA known to man"}, {"id": "ea6pv3w", "author": "FLAREcraft-gaming", "body": "Is there a real life counterpart to this drug or not?"}, {"id": "ea6qq0p", "author": "zfump", "body": "This was one of the strangest things I have ever read and I loved it."}, {"id": "ea6rg0a", "author": "TheMightyMcGrew", "body": "Gave me a Donnie Darko vibe. Well done."}, {"id": "ea6rjj0", "author": "stormechaser", "body": "That, my dear, was trippy as balls. I loved it! Glad Muffin was given to a new family at least :)  Keep us informed about the figure and the static!"}, {"id": "ea6sljc", "author": "isaacs16", "body": "Wow this is genuinely horrifying. I'm never trying psychedelics!"}, {"id": "ea6uucy", "author": "cantsleepneversleep", "body": "I would be so mad if muffin got hurt. Nice job!"}, {"id": "ea6wd9k", "author": "Darkliquid43", "body": "I have never read a trip this bad in such detail. \nI heckin loved this!"}, {"id": "ea6xlc0", "author": "HandybutnotDanny", "body": "Best one in awhile"}, {"id": "ea6y9em", "author": "iFluffee", "body": "Love it!"}, {"id": "ea6yqyc", "author": "weedification", "body": "I remember my bad trip with acid reading this. Feeling nauseous too. Great one my dude. "}, {"id": "ea6zwfa", "author": "cpotter32", "body": "Holy shit, that trip was a mind fuck. I almost feel like I took k4 with you! Thank you for that; now I know if someone offered me k anything, just say hell no!"}, {"id": "ea71xe5", "author": "DocGG", "body": "So... What's K3.  Sounds like the opposite of ayahuasca ,,and you met the demi-urge. Good job surviving"}, {"id": "ea72qd5", "author": "CaseyFly", "body": "Handle your drugs people. "}, {"id": "ea72ux1", "author": "ABTooWavy", "body": "This made me so uneasy. My anxiety skyrocketed throughout this... I genuinely was having a bad read. Lol "}, {"id": "ea72wd8", "author": "k2on0s", "body": "Really great stuff man"}, {"id": "ea73by3", "author": "Trucclet", "body": "I read this with a headache and i’m tripping the fuck out rn wtf did you do to me"}, {"id": "ea73pgm", "author": "Klik17", "body": "well that was a wild ride from start to finish"}, {"id": "ea75d2o", "author": "ThedemonWarrior", "body": "Shut up and take my money!!! Where can i get some? Hope you're doing ok though pal"}, {"id": "ea762gq", "author": "Sweetspanks", "body": "This story.. just incredible. Thanks for sharing it"}, {"id": "ea76zvr", "author": "russellthevillan", "body": "This is what it's like to take way too many mushrooms. Not like in a literal sense but you can't control you're thoughts. "}, {"id": "ea7765i", "author": "niko-drago", "body": "That don't sound fun at all."}, {"id": "ea79xzg", "author": "tRu3_sKiTz0", "body": "This is brilliant.\n\n"}, {"id": "ea7cx9a", "author": "EriktheRed", "body": "That was awesome. Reminded me of some of the less lucid moments in Twig."}, {"id": "ea7dqvr", "author": "jannoo", "body": "Super high...dang bro "}, {"id": "ea7erq2", "author": "mrwhitewhisker", "body": "This was so much fun to read. It sets the tone so well; I was entirely in their reality the whole way through. "}, {"id": "ea7h25b", "author": "meflesh2345", "body": "Well written... makes me want to see if it will be better this time"}, {"id": "ea7jsxw", "author": "machsh", "body": "Had a bad trip once. Ouch. Can totally relate. "}, {"id": "ea7lyvn", "author": "Xmandalynnx", "body": "Couldn't read it all got too freaked out !! "}, {"id": "ea7mi75", "author": "Shrivelledmushroom", "body": "Ngl that sounds awesome. You really should have had a sitter though. Sounds a lot like Salvia. "}, {"id": "ea7nyc9", "author": "Daevir", "body": "i won't read this so i can continue doing drugs happily"}, {"id": "ea7ozqz", "author": "VictarionWinter", "body": "Amazing read dude! Take note, don't do drugs, just get drunk"}, {"id": "ea7pizh", "author": "GlassThunder", "body": "The blank space at the end freaked me out man. I was gonna try acid next week and now I can't."}, {"id": "ea7q7di", "author": "jcbfgd", "body": "[Hooray, Todd!](https://www.youtube.com/watch?v=GwfrOolwaK4)"}, {"id": "ea7q89s", "author": "FluffyBoiCat", "body": "Dude, I'm writing a short story on a man climbing K2, and the first thing I see is K2. Wow."}, {"id": "ea7r0o4", "author": "LilithImmaculate", "body": "I have food poisoning and this story was so well written, that it made my stomach and head turn even more like I was high as shit myself.\nDamn"}, {"id": "ea7r4in", "author": "vizthex", "body": "I really want this to be animated"}, {"id": "ea7r54a", "author": "sepseven", "body": "synth noids are crazy lol"}, {"id": "ea7rgt0", "author": "zfighters231", "body": "Haha thats why I only stick to cocaine and meth"}, {"id": "ea7rz5l", "author": "skyechild", "body": "Thanks I feel nauseous "}, {"id": "ea7tlwz", "author": "ivyfrostt", "body": "I didn't bother seeing what sub this was before reading it. Thought it was a true story until about 2/3 through. I'm fucked for the night, props OP 😂"}, {"id": "ea7tnnj", "author": "xJaneDoe", "body": "My head hurts. \n\n"}, {"id": "ea7u7u3", "author": "devilman17ded", "body": "Holy Fuuuuuuuuuuuck!!! This was InsaneInsaneInsane!!!!!!"}, {"id": "ea7uwgc", "author": "MrPantsRocks", "body": "Well the drugs don’t work. They just make things worse, and I know I’ll see your face again."}, {"id": "ea80kje", "author": "azor---ahai", "body": "Happy for Muffin. "}, {"id": "ea81o19", "author": "Mr_TheGuy", "body": "Does anyone know any more nosleep stories like this?"}, {"id": "ea870rf", "author": "thearmedlemon", "body": "Fucking amazing\n\nReal good work"}]}