{"id": "a1xyn9", "title": "They told me I was nothing but a dog", "url": "https://www.reddit.com/r/nosleep/comments/a1xyn9/they_told_me_i_was_nothing_but_a_dog/", "subreddit": "nosleep", "author": "Dopabeane", "text": "My father named me Laika because when I was born, my grandfather told him to treat me like a bad dog. To Father, *Laika* was synonymous with *dog*. He used the name to remind me of my place in the hierarchy: lesser. Beneath. Inferior.\n\nNothing but a dog. \n\nMy father meant to humiliate and degrade me with such a name, but he honored me instead.\n\nYou see, Laika was a stray dog from Moscow. On 3 November 1957, the Soviet Union put her on Sputnik 2 and launched her into space. She was the very first animal to orbit Earth.\n\nThe Soviets knew how to put a rocket into space, but they didn’t know how to bring it back. This made Laika’s mission a death sentence. Shortly after reaching orbit, the interior of Sputnik 2 became catastrophically hot – far too hot for mammals to tolerate. Mere hours after launch, Laika died an agonizing death. She perished the same way she’d lived: lesser, beneath, inferior. Abandoned. Unloved.\n\nNothing but a dog.\n\nI spent many hours imagining her terror, pain, and loneliness. How would it feel, spending my last hours hurtling through divine darkness in a metal bucket?\n\nWhat must it be like to not understand what I was seeing, or why it was suddenly so loud and so hot?\n\nWhat must it be like to not understand why – after being plucked from cruel streets and dropped into a bustling world of kindness – I was now alone? Perhaps I would think I’d been a bad dog. Perhaps I’d think this was my punishment.\n\nPunishment is my mother tongue. I know what it was like to be punished for transgressions I cannot remember or understand, to be hurt so badly my heart rate triples and my mind flies out the window and soars into the stars, retracing Laika’s doomed flight while my husk squirms and weeps on the floor of a dirty house sixty-eight miles below. \n\nEven so, I adapted to punishment. As I said, it eventually becomes a language. Given enough time, anyone can learn a language.\n\nWhat I could not adapt to was fear. \n\nAs a child, I was afraid of everything. You see, in the deepest, most forgotten parts of the world, there are things that most people cannot believe and even fewer would understand. Old ways, old things, old truths. \n\nAnd old monsters.\n\nMonsters like my father and my grandfather. \n\nHow can I describe this in a way you will believe? Maybe I can’t. Maybe I shouldn’t try. So instead, I will describe my grandfather.\n\nHe was called Paval. By the time I turned nine, he had gone through six bodies. By this, I mean he inhabited them. Using a variant of blood magic perfected by my forebears across many centuries, he leapt from body to body.\n\nHe was not a spirit; he had a corporeal body of his own, a twisted, monstrous thing covered in scars and hard, glittering skin, a body that could shrink to the size of a garden snake or expand to the size of a house.\n\nBut for all its marvels, this body was weak; sunlight burnt its eyes and blistered its flesh. So it entered other bodies, like a hand inside a puppet, and wore them until they rotted away. I will never forget the sight of him – of many hims – in different bodies as flesh degraded and fell away in wet, discolored strings. Or the way his eyes – hard, round yellow eyes – glinted deep within their stolen sockets.\n\nGrandfather preferred the bodies of men, but sometimes chose women or children. Once, he even wore the body of my mother. I was very young then – perhaps three – and the sight of her familiar form standing before the fire sent me into such transports of joy that I bawled from sheer ecstasy.\n\nThen she turned around, and in her bruised sockets I saw my grandfather’s eyes: flat, glittering yellow. Like rotted gold.\n\nI reared back, screaming.\n\nMy father, who had been stroking a pair of old baby shoes, looked at me with contempt so deep it scorched my heart. “Shut up, dog!”\n\nI cringed. This was a mistake; his contempt exploded into disgust. He shot out of his chair and stomped upon me. Dirty, squirmy pain exploded across my abdomen. I hobbled away, whimpering, and hid under the stairs.\n\nI lay there alone for many hours. Eventually my mind left my body and soared into the sky, a reverse dive into a sea of stars. I drifted away, dreaming of diamond-colored constellations and red nebulae. At my side was a curly-tailed dog with a striped face. My namesake. \n\nLaika.\n\nWhen I woke, I *felt* her: furry and warm, chest rising and falling under my hand. I opened my eyes. For just an instant I saw her in the shadows. Then she shrank away, sinking into the ground. I tried to grab her, but the floor swallowed her. My fingers closed on cold, hard floorboards. \n\nI covered my eyes and wept.\n\nSeveral months later, Grandfather-Within-Mother gave birth to a child. A baby boy with yellow eyes and my father’s curly black hair. Mere minutes after the birth, Father picked up the baby and took him outside. He returned an hour later, empty-handed.\n\nSpurred by horror, I immediately ran out into the night. The cold was brutal, at once invigorating and exhausting. I searched until I found the baby, whimpering weakly beside a snowdrift. He was still covered in birth blood.\n\nI named him Alexander and brought him home.\n\nWhen I walked in, Father immediately slapped me. I reeled back as stars rocketed across my vision. “Never,” he hissed, contempt dripping from every syllable, “never disobey again. Give him to me now.” He reached for Alexander, but Grandfather stopped him.\n\nI looked up, and swallowed a whimper. Grandfather stared back at me through my mother’s rotting face. The mouth – puffy and discolored, with an oddly detached look – quirked into a smile. “No. Let the dog keep her pup. We have other concerns.” \n\nThey certainly did; they worked together, and they worked constantly. Father kidnapped victims, and Grandfather used them. Whenever Father brought a new victim to the cabin, Grandfather used his hands – long, hideous things marked with scars and covered in strange, glittering flesh – to tear out the victim’s tongue and crush their feet. \n\nThen he would wait until nightfall – because remember, sunlight burned Grandfather’s eyes and blistered his skin - and carry them to his Chapel.\n\nHis Chapel was an ancient stone structure at the base of a wooded hill. Within the chapel were three red windows and six rough-hewn pews. At the end of each pew sat desiccated corpses, facing the altar like sentries.\n\nI hated Grandfather’s chapel; the very air weighed upon me whenever I entered, crushing my heart and poisoning my lungs. The worst part was the fear: electric and paralyzing, inescapable.\n\nLuckily, I was just a dog, and dogs do not spend much time inside chapels. But dogs hear screams. Even screams from far away, echoing down forested mountains long into the night. \n\nGrandfather did not often leave his Chapel, but when he did it was always in the wee hours of the morning. I know this because my father and I were required to hold vigil until he walked through our door. Whenever Grandfather came back from his Chapel, he looked human again: smooth skin, wide smile, good proportions. Sometimes he looked a bit like Father. Sometimes he looked like his victim.\n\nIt was as incomprehensible to me as outer space would have been to Laika. \n\nThe stream of Grandfather’s victims never ended. Vagrants, the elderly, the travelers, orphans fleeing violence. There were so many.\n\nSo, so many.\n\nIf it weren’t for Alexander, I would have withered into nothing. He was more than a brother to me; for all intents and purposes, he was my son. Neither Father nor Grandfather cared for him. They didn’t even feed or clothe him; I had to feed and dress him with what little I had. \n\nDespite my best efforts, he never learned to speak. That isn’t to say he couldn’t communicate – he could, with gestures and facial expressions and nonsense syllables – but language eluded him. But it was all right. He grew into a sweet, curious boy with freckles and long, delicate hands. Over time, his terrible yellow eyes mellowed into a clear, bright green. He was my life. He was my heart.\n\nBut he wasn’t enough.\n\nOne night, as a little girl’s screams came shrieking down the mountain from Grandfather’s Chapel, I finally went to my father.\n\nI lay prostrate at his feet, which is how he taught me to approach him. The wooden floor was rough and painfully cold under my fingers. “Why, Father? Why do you do this?”\n\nHe sat in his chair, watching the fire. In his hands he held a pair of white baby shoes. “Because your Grandfather and I must live, little dog.”\n\n“Will I have to do this to live?”\n\n“Yes.”\n\n“Then I don’t want to live.”\n\n“I understand,” he said. His grip tightened on the shoes. “But you don’t have a choice.”\n\nI choked back a sob and waited for the dismissal; I could not come to him without crawling, and I could not leave until he told me so.\n\nInstead, he said, “Stand up, Laika.”\n\nHearing my name was like being doused in ice water. He never used it; by that point, in fact, I’d almost forgotten I had a name.\n\n“I said, stand up, Laika.”\n\nIt was a struggle to obey; fear made my bones rubbery and my muscles weak. \n\nFather held out the baby shoes. “What do you see?”\n\n“Shoes.” My voice quavered. “Old baby shoes.”\n\n“Those shoes,” Father said, “belonged my sister, Alexandra. I loved her more than anything. More than life. More than my parents. More than your mother. More than you. She was my heart.”\n\nI watched him. The firelight threw his face into relief, creating crevasses out of wrinkles. His curly black hair shifted like smoke, and his long, sharp nose looked strange and monstrous. Paralytic electricity swarmed my skin, so much like the Chapel that I could have wept.\n\n“On my twelfth birthday,” Father said, “your grandfather boiled a pot of oil and called Alexandra to him. She and I were going to pick wildflowers later, so she was dressed in her finest clothes: a blue dress and white shoes. These shoes.” \n\nFather did not speak for a very long while.\n\n“She was my heart,” he finally repeated. “When my heart broke, I broke. It made me like Grandfather. Someday, I will be just like him. I will live forever. You will, too.” \n\nThat night, I had a nightmare of a little girl with sunken yellow eyes melting into blisters as my mother’s rotted body doused her with boiling oil. \n\nI woke screaming.\n\nMoonlight streamed through the window, drenching my room in celestial silver. My heart thumped so wildly that I could see my nightshirt moving. It wanted to escape. I wanted it to escape, to, because without it I would die, and when I was dead I could sail the stars with the other Laika.\n\nSmall, warm hands touched my face. I turned, expecting Alexander. Instead I saw my nightmare. \n\nGreat inflamed blisters bubbled and burst, sending rivulets of pus down her tiny, raw face. The skin around its mouth had burned away, leaving neat rows of milk teeth fully exposed. Burned scalp and dull bone glinted through black, curly hair. A blue dress clung to her body. Oil dripped from the hem, soaking my blanket.\n\n“Don’t cry,” she whispered.\n\nAlexander stirred between us.\n\n“Get out,” I whispered.\n\nThe girl’s blistered chin quivered. “But you made me come here. Please let me sleep.”\n\n“All right,” I whispered, because I did not know what else to say.\n\nThe girl burrowed under my blanket. I watched, aghast, as she threw a bony, burnt arm across Alexander and drifted to sleep.  \n\nThat night, I did not sail the stars with Laika. Instead I sat awake, watching the apparition with mingled excitement and fear.\n\nJust before dawn, my door creaked open. I tried to shield the girl as my father stepped into the room. \n\n“What is that?” he asked sharply.\n\n“Please,” I whined. “Please, don’t.”\n\nThe girl shifted, and – incredibly – began to shrink. Her body flattened into nothing, leaving her dress crumpled on the floor. That sank away, too, leaving the cold, empty floor in its wake.\n\n“*What was that?*” Father screamed.\n\n“I saw it in my sleep –”\n\n“*Her!*” Father roared. “*Her*, not *it*!”\n\n“I s-saw her in my sleep,” I stammered helplessly. “When I woke, she was here.”\n\nSweat gleamed on Father’s skin, reminding me of stars. “Get dressed. You must see your grandfather immediately.”\n\nI fell to my hands and knees and crawled to him. \n\n“No,” he said. “Stand up. Bring the boy.”\n\nAlexander wept angrily when I picked him up. I ignored him and followed Father into the dark forest. The full glory of early spring bathed the landscape: pale beams of light shafted through the canopy, cutting the thick shadows with gold. Vermin crept through the undergrowth, and deer watched from a distance. The forest was always full of animals; Grandfather was no danger to the birds or beasts, after all.\n\nSoon the Chapel came into view: an ancient little church with a black spire, red windows, and frost-encrusted stones. \n\nFather ushered us inside. The moment I crossed the threshold, my skin began to crawl. Dread and fear swept over me. Alexander burst into tears.\n\nFather shoved me toward the altar. Out of the corner of my eye, I saw the sentry corpses twitching. Chests rose and fell in jagged, senseless rhythms. One especially tall corpse with long copper hair turned as I passed.\n\nI covered Alexander’s eyes and stopped at the altar.\n\nShadows thickened and writhed against the back wall. Back in the pews, bones clattered and dried joints creaked.\n\nSomething blinked in the darkness behind the altar: great, flat eyes like golden moons, shining in the cold shadows. \n\nGrandfather.\n\n“The dog,” Grandfather intoned, “and her pup.” He snarled: a deep, bone-shaking rumble like that of a tiger. Teeth glinted in the shadows, a shining ivory arc wider than Father’s entire head.\n\n“Paval,” Father said urgently. “She had a nightmare. When she woke, it followed her out of the dream. It came alive. I saw it.”\n\n“Oh,” Grandfather murmured. “*Oh.*”\n\n“Our little dog has talent after all,” said Father.\n\n“All good and well,” said Grandfather, “*if* she loves her pup. Do you love your pup, dog?” He reared up from the shadows, twisted and sinewy and utterly inhuman. “Do you love him? Or do you feel *obligated* to him?”\n\nI opened my mouth to answer. Instead, I burst into tears.\n\nGrandfather laughed, a low roar that shook dust from the rafters overhead. “A weak bitch indeed. Our hope is in the boy, Mikhail. It was always in the boy. That is why we made him. Now go.” Those great yellow eyes flicked to the pews. “I do not like to tempt my sentries. Not when they are hungry as they are.”\n\nFear and disbelief battled across Father’s weathered face. “Do you not understand what I’ve told you? She creates life from thoughts.”\n\n“A poor substitute for what we require. Leave, Mikhail.”\n\n“But – ”\n\nGrandfather rocketed out of the shadows, a rippling mass of glittering skin and malformed limbs, and knocked Father to the stones.\n\nThe corpse-sentries uttered a deep sigh and continued to twitch.\n\n“Never,” Grandfather snarled. Sunlight poured through the crimson windows, imbuing him strange hide with a red glow. He looked like the sky. A starry piece of outer space. “Never defy me.” \n\nI waited breathlessly for Grandfather’s eyes to burst and his skin to sizzle – he was, after all, exposed to daylight – but it did not.\n\nMany moments later, Grandfather struck Father across the face and whipped back into the darkness.\n\nWe left. Father did not speak again until the cottage came into sight. Then he grabbed me and dragged me off the path.\n\n“Listen,” he growled. “Listen well. I can protect you from him. And…” He looked down at Alexander, eyes blazing with disgust. “When the time comes, I can protect you from *him*, too.  But only if you help me.”\n\n“Why should I need protection? He’s small, and loves me as a mother.”\n\n“Do you remember the story of Alexandra?” Father asked.\n\nI nodded.\n\n“Your story is coming. Only Alexander will be me, and you will be Alexandra.”\n\nMy heart fell to the cold earth. I carefully pressed Alexander’s head into my shoulder, shielding his face from Father. \n\n“Listen, dog. When next you dream of my sister –” His voice broke; he pulled away and ran his fingers through his hair. Tears shone in his eyes, which were huge and miserable over his quivering mouth. “When she comes again, bring her to me.”\n\n“All right, Father.” I had never seen him weep before; the sight was frightening and curiously thrilling. “I will.”\n\nFather nodded curtly, then left. I nearly followed, but thought better of it. Instead, I stayed in the forest with Alexander.\n\nAs the morning brightened and birdsong swelled to a symphony, I set Alexander upon the narrow path. He ran forward, humming a tune of his own composition. Shadow and sunlight dappled his skin, turning him into a woodland sprite. The trees were in full bloom: petals drifted down like snow, carpeting the earth in glistening white.\n\nAlexander pulled ahead. After a while, I couldn’t hear or see him; he’d drifted away, slipping into the deep shadows.\n\nPanic overtook me. “Alexander! *Alexander!*” I rushed ahead, grimacing against the pain in my chest. My heart thumped wildly, so hard I could see my shirt move; it wanted to escape again. “*Alexander!*”\n\nHe darted from between the trees. I halted, overcome with relief so powerful it took my breath away. Petals covered his head and shoulders. As I watched, one drifted down and settled on his nose. Wide green eyes glimmered above it, bright as the promise of spring.\n\nFor the first time in my life, my heart was so full that I wept.\n \nThat night, Alexandra came to me again, blistered flesh dripping down her face. Her eyes had melted away, leaving raw, swollen masses of flesh in her melted sockets.\n\nRemembering my instructions, I sat up. “Father,” I quavered. Alexandra reached for me blindly, ruined hands closing on shadows. “Father!”\n\nFather burst into my room, gasping. “Alexandra!” He shot forward, arms extended as if to sweep her up.\n\nShe turned.\n\nFather froze.\n\nAlexandra tottered toward him. “Mikhail,” she whined. “Mikhail, my eyes hurt.”\n\nFather collapsed and covered his eyes as Alexandra approached. She left a trail of pus and oil, shining like a tiny river in the moonlight.\n\n“Mikhail, my hands hurt.”\n\nFather wheezed miserably.\n\n“Mikhail, my skin is on fire and drips away.” She stopped before him and crouched. Father whimpered and whined like a beaten dog, twisting away from her hands. \n\nShe set her small hand on his cheek. Father squalled and writhed, but couldn’t break away from her. “Mikhail,” she wept. “You are just like him now.” She jerked and began to shrink, to sink, disappearing into the floor. The moment her hand fell away, Father leapt to his feet and ran.\n\nAfter that, he did not ask to see Alexandra.\n\nThis is good, because I did not see her in my dreams after that. I only saw Laika. I spent most nights drifting among the stars with that dear, doomed dog at my side. Imagined or not, the sights were glorious: incomprehensibly beautiful star formations, planets, great multicolored expanses of celestial mists.\n\n\nSometimes I woke, bleary and incoherent, and felt her fur against my skin. But by the time I opened my eyes, there was nothing.\n\nOne winter morning, I woke very early. My stomach growled immediately, and no wonder; Father hadn’t fed me for days. I’d fed Alexander with table scraps and tree bark. \n\nThat, I decided, would change today.\n\nI crept into the kitchen. There wasn’t much; there never was. But I scraped together what little I could, and turned around.\n\nMy grandfather sat at the table, great golden eyes shimmering in his terrible face. “Little bitch. What have you done to your father? He no longer hunts. He no longer eats. He no longer obeys.” \n\nI felt like I was back in his chapel: crushed by darkness, heavy with dread, on the verge of panic.\n\n“Your ability,” said Grandfather, “has not been seen on this earth for a thousand years or more.”\n\nOf course the ability wasn’t of earth; I’d no doubt come across it while sailing through space and breathing stardust. “It’s just nightmares.”\n\n“No. You take the dark things of the world – the fear, the hate, the pain - and channel them into physical form. And that is just the beginning. You will be able to do anything. You will make bodies. Permanent, perfect bodies for me…and for you.”\n\nThe relish in his voice made me sick.\n\nHe said, “Our women have always been weak and talentless. I thought the same of you, little bitch.”\n\nTears pricked my eyes and my bones thrummed as if struggling to break through flesh and run away. But it was no use; destiny had already bloomed between my grandfather and I, heavy and foul with the promise of despair. \n\nGrandfather whispered, “Listen closely, for you will only hear this once: *I was wrong.*”\n\nHe left. I ran to the window and watched him hurtle through the trees as sunrise threatened. Back to his Chapel. \n\nI waited until the sun was up. Then I ran to my room, bundled Alexander in every bit of clothing I could find, and left.\n\nWe followed the path for many miles. Our home was hours and hours from the nearest town; we wouldn’t reach it until long past nightfall. I could only hope that Grandfather wouldn’t notice our absence until the following day. It wasn’t an unlikely hope; Grandfather spent most of his time in the Chapel.\n\nThe second this thought crossed my mind, a glittering dark shape leapt out of the trees and knocked Alexander from my arms.\n\nI caught a blur of twisted limbs and nightmarish hands, of great yellow eyes like flattened moons. Alexander screamed as a torrent of blood splattered across the snow. It sank quickly, melting red canyons through the pristine white.\n\nGrandfather at me, narrow sides heaving. Then he leaned down and tore out Alexander’s throat.\n\nI screamed. Birds took flight and mammals ran through the undergrowth. The piercing note echoed off the mountains. The pain within it should have ended the world, but there was no one to hear and no one to care.\n\nGrandfather grinned. Alexander’s blood and sinews clung to his teeth.\n\nI broke. \n\nI felt it; the crushing weight of sorrow, the almost physical sensation of my spirit tearing and bleeding out into my guts.\n\nI fell to my knees and cradled Alexander’s head for hours.\n\nMy father finally found us around nightfall. He had a heel of bread and an oily chicken leg. He pressed them both into my hands, then left. \n\nI tore the bread into pieces and dropped them, one by one, into Alexander’s mouth. When he did not wake, I burst into tears and hurled the chicken leg into the woods.\n\nThe moon rose into the cruel, dark sky. Stars glimmered through the bare branches over head, creating a breathtaking fractal pattern.\n\nI flopped down beside Alexander, pulling him to my body. He was cold. Terribly cold. I held him anyway, keeping my eyes trained on the stars. My mind detached with great difficulty, like it was trapped in tar.\n\nFinally, it wrenched itself free and sailed upward, disappearing into a silvery sea of sky and stars, rocketing ever higher until I saw the Earth spinning below.\n\nLaika’s rocket zoomed past. I reached out and caught one of the metal bars near the nose. I could sense Laika within: her terror vibrated through the craft and leached into my bloodstream.\n\n“It’s all right,” I said. “It’s all right, Laika. I’m here. When you land, I will help you out and we will play together.”\n\nHer fear diminished, and so did her pain. So did mine. Together we sailed the stars, looking upon the Earth and marveling at the incomprehensible beauty around us.\n\nI woke cold, sore, and in more pain than I can describe.\n\nI sat up. Alexander’s stiff body broke away from mine. I reached for him blindly. A thin scrim of ice covered his eyes. The wound in his throat was an open horror, one I couldn’t look at for long.\n\nI drew my knees to my chin and wept. \n\nAfter a while, something warm bumped my hand. A wet nose touched my palm. I knew what I would see long before I opened my eyes.\n\nLaika’s striped face and dear curly tail made me smile, even through my tears. Stars glimmered through her fur, gently pulsing pinpricks of light.\n\n “What is this?” Grandfather’s voice echoed through the trees.\n\nRage flowed through my blood, exquisitely corrosive. Hate, I learned then, is pleasurable; it is fury and it is the basis of power. \n\nGrandfather erupted from the darkness, scaled skin shimmering like a river under the moon. “You waste your talent,” he sneered, “on a mutt. Not even your own pup! No matter. I will correct you.”\n\nLaika reared up and leapt, snout piercing one of Grandfather’s flat moon eyes. He screamed and shook his head back and forth. Laika fell to the snow, twisting, and quickly righted herself. Then she bit his foot. Her teeth sank through that impenetrable, immortal hide like butter. \n\nLaika was not large enough or strong enough to kill him, but she tore holes in him the way a match scorches holes in paper. Soon Grandfather was on his knees, mere feet from Alexander’s corpse.\n\nLaika came to me, panting, and collapsed in my lap. She bled from a thousand wounds: some small, some undoubtedly mortal.\n\n“Good dog.” My voice broke. I stroked her gently, willing those wounds to close. I was a monster. I’d used Laika just like the others had; calling her down on false pretenses, filling her with hope, before throwing her into the void. “Good girl. Good, good girl.”\n\nI looked up as Grandfather’s good eye slid to my dead brother. Something dark bloomed there: a wicked, corrupted hope. He curled in on himself, twisted body shrinking to a withered husk, and slid down Alexander’s throat. \n\nI screamed as Alexander’s body twitched and juddered. Then he sat up, bones creaking and frozen sinews cracking.\n\nHe smiled. His eyes shone like molten gold in a forge. \n\nLaika attacked again. Alexander’s face curled into a snarl as she bit and tore his skin, exhibiting an energy at odds with her awful wounds.\n\nI watched, helpless and hopeless and hurting, wishing I could detach and fly into the stars once more. Except there would be nothing there for me now; I’d called Laika down from the stars and doomed her.\n\nThe snow crunched behind me. I whirled around. Father stood there, watching me with contempt. In his hands was a sleek, gleaming shotgun.\n\nRelief and horror engulfed me. This was the end. My mind would detach, forever this time. The fear would finally end.\n\nLaika bit down on Grandfather-within-Alexander, who hit her. She whined, but held fast.\n\nFather stalked past me and cocked the gun.\n\n“No!” I screamed. “Don’t hurt her! *Don’t hurt her!*”\n\nFather pointed the gun at Alexander’s head and fired. Blood and viscera and dark, glittering flesh exploded across the snow.\n\nFather fired again, then reloaded, and fired again and again. Alexander’s head evaporated into red mist. Finally his body lurched, and Grandfather – small, bleeding, scaled Grandfather – slithered out of his throat.\n\nLaika caught and held him. Father pressed the barrel of the gun against his good eye and pulled the trigger as the sun broke over the mountains.\n\nFather stepped back. I reached for him, drunk on hope and gratitude, but he recoiled from me. In his weathered face, I saw despair and rage…\n\nAnd contempt.\n\nHe kept his eyes trained on mine as he placed the gun in his mouth.\n\n“No!” I screamed.\n\nHe pulled the trigger. Half his head evaporated, leaving a glistening mass like a fleshy geode. His body stumbled forward a step, then crumpled to the snow. \n\nIt took a very long time for the sun to burn Grandfather down to dirty oil.  Laika held on until the last scrap of skin melted. Then she stumbled to me and collapsed. \n\nI stroked her until her body shrank and sank into the ground, leaving nothing but a scattering of tiny, dim orbs: the stars I’d seen in her fur. I touched one. It was pleasantly hot. I gathered them up and slipped them into my pocket. I went to Alexander’s body – ravaged beyond description, broken in ways that did not see entirely real – and sat with him until nightfall. Then I stood and walked away.\n\nAnd life went on.\n\nAt first, I brought them back from my nightmares  – Alexander, Father, Grandfather, even Alexandra – but I quickly taught myself to starve and eventually kill my ability. It is not a good power; it is born of rage, despair, selfishness, and fear. \n\nAnd I cannot tolerate fear.\n\nBesides, dogs do not have such awful powers. It is good to be a dog, because they are not necromancers. They are not monsters. They are nothing more or less than the simplest and most loving of creatures.\n\nThat is why I will always be Laika the dog.\n", "comments": [{"id": "eatnd7o", "author": "arctic-zydrate", "body": "Wow..."}, {"id": "eau0pzu", "author": "jellies-and-fruits", "body": "I'm usually a lurker on nosleep, but holy shit. I have no words."}, {"id": "eatvnp9", "author": "heldaghost666", "body": "This is one of the most beautiful and heart wrenching stories I have ever read. Good dog"}, {"id": "eatw5r9", "author": "OminousAlpaca", "body": "I was laying in bed. I sat up to finish reading this and didn't look away once. \n\nThat's never happened. In my thousands of hours on nosleep, that has *never* happened.\n\nWow. "}, {"id": "eatpc34", "author": "ViciousPuddin", "body": "And I'm crying"}, {"id": "eatqito", "author": "give-me-any-reason", "body": "This is incredible! So beautiful "}, {"id": "eatouhd", "author": "staryoshi06", "body": "Holy shit...\n\nSo, where did you go afterwards?"}, {"id": "eatuv12", "author": "wicked_amb", "body": "I love this. It was absolutely terrifying. I'll probably have nightmares for 100 years, but I'm proud of you for breaking the cycle. Good Grrl Power!"}, {"id": "eatumcj", "author": "ddk333", "body": "This is fucking beautiful."}, {"id": "eav36fc", "author": "ArturJPM", "body": "And at the very end, the stars said:  \n\"**Laika will return in Avengers 4.**\""}, {"id": "eaum8b0", "author": "samirhyms", "body": "I thought this was going to be a story about child abuse. It was, but it was so much more. Well done Laika, you are an amazing strong being who used your powers for good and didn't get corrupted. One day you will find love again like you had for Alexander and when you do I'd like to read about it"}, {"id": "eau6qor", "author": "LordBug", "body": "Tears have dressed my cheeks and salted my lips, runnels sparkling in my beard like tiny stars. Truly an incredible tale. \nLaika holds a special place in my heart, though maybe in a strange way. When my mental health is failing me, there's one video clip that never fails to provide me with a cathartic release of tears. Moan, by Trentemoller, which in the video has that beautiful little dog, with her spotted nose and curled tail, taken away and sent into the stars.\n\nRest peacefully dear Laika, a being too pure for this wolf"}, {"id": "eats3vy", "author": "SaffronSiren", "body": "This is...oh my God. You poor thing. "}, {"id": "eau1g44", "author": "Shufflawman", "body": "Phenomenal writing."}, {"id": "eatuj3r", "author": "PiercedGeek", "body": "That was incredible. Bravo! "}, {"id": "eatsj7y", "author": "rawantaleb", "body": "I live for your posts ❤️"}, {"id": "eau0z6p", "author": "FoodAndYarnQueen", "body": "Oh my... what a ride. That was heartbreaking yet beautiful."}, {"id": "ebpryqs", "author": "ouroboro76", "body": "Nobody has said this that I saw, so I figured I should:\n\nOP, don’t feel bad about Laika. By bringing her back from your dreams, you gave her a second chance. It wasn’t under false pretenses either, because you didn’t intentionally lie to her. \n\nOnce you brought her to life, and your grandfather came, she could have cut and run. She would have run away, and I doubt your grandfather would have chosen to pursue a dog, even if it was one that you raised from the dead. But she *chose* to stay and fight against the wicked and evil being that is your grandfather, and by doing so, gave your father (who decided he didn’t like who he was and was done with the voodoo stuff) the opening he needed to slay the beast (your grandfather) before turning the gun on himself.\n\nLaika got to control how she passed on once she was resurrected, which is an opportunity she did not have when she was sent into orbit. "}, {"id": "eau47zy", "author": "Ufo_underwear", "body": "I think this is the best No Sleep I've ever read. Absolutely brilliant. "}, {"id": "eau30aw", "author": "xxxBlueBansheexxx", "body": "Beautiful, and horrific. I was crying and flying with her. Wanting to hold her, and comfort her "}, {"id": "eauu5b9", "author": "realchloeprice", "body": "Props to the dad for slightly redeeming himself in the end"}, {"id": "eatnfp4", "author": "jaxxangel13", "body": "This is an amazing story. 💙"}, {"id": "eaucat3", "author": "diamondblvd", "body": "My puppers is named after Laika. May she Rest In Peace."}, {"id": "eau7ugc", "author": "noshxxn", "body": "Holy shit, this is so fucking beautiful, I can't even...I am sitting here looking at the screen completely slack-jawed. Incredible story, OP. I'll need some time to recover from this for sure. "}, {"id": "eattyo8", "author": "Paige0409", "body": "Why you do dis?!... I’m sobbing right now 😭"}, {"id": "eatur3b", "author": "cherrqr", "body": "This is beautifully written and executed perfectly. Amazing job 💙"}, {"id": "eau0at1", "author": "PrefrostedCake", "body": "God damn you're a beautiful writer."}, {"id": "eau4uka", "author": "Mouseinanutshell", "body": "Please someone explain this to me. I don't quite understand but I really want to know the story. 😖😖"}, {"id": "eau1rwe", "author": "AlphonseLermontant", "body": "This was heartbreaking. May you find happiness, Laika. "}, {"id": "eau4035", "author": "tinglebell-rock", "body": "This was beautifully written. You honor your name. "}, {"id": "eaty1lt", "author": "twiztidmeme", "body": "My dogs will get extra hugs from me tonight."}, {"id": "eatz12q", "author": "LetTheShitpostsBegin", "body": "Amazing!"}, {"id": "eau33uu", "author": "Ididitforpi", "body": "Woof"}, {"id": "eaudlf1", "author": "deadloaf88", "body": "I'm amazed. This is a very wonderful read.\n\nThe use of emotion and imagery was fantastic and very well-executed. I expected to feel scared of the situation, but it did more and made me feel pity and rage. I could definitely see this as a thriller movie."}, {"id": "eavnfbc", "author": "StoopKiidd", "body": "Wait so did the grandfather kill his granddaughter, take over her body, then forced the dad to have sex with it in order to have a child that they’d simply toss away anyway? \n\nEdit : daughter in law*"}, {"id": "eatzzzs", "author": "obsessive23", "body": "I'm so glad that you escaped from your grandfather"}, {"id": "eau333e", "author": "nate_ais", "body": "Whew.. wow that was super fucking good and creepy and scary and heartwarming and sad and tragic and all the other emotions. Well written"}, {"id": "eau5flo", "author": "Nutmeg_2002", "body": "***I'm not crying, you are!***"}, {"id": "eau23d9", "author": "Tsbryan", "body": "This was insanely good. I want a movie based on this, or at least a full novel!"}, {"id": "eatygds", "author": "D3LTA-X", "body": "Damn. Hell of a good read."}, {"id": "eauhghz", "author": "bbbbbbbbbbbab", "body": "All the points. For your creativity combining these themes in a seamless and thoughtful way... and for making a really good story with it. \n\nAll the points for you. Great work, OP"}, {"id": "eaw1qoo", "author": "Nadidani", "body": "I was fearing you would become like them, and was so glad you didn't. But it was such a sad story! And also now I am thinking of poor Laika (the one in Sputnik), such a cruel thing to do to a poor dog 😢"}, {"id": "eau1s3z", "author": "User_identificationZ", "body": "What "}, {"id": "eau9slt", "author": "SideEyeandSigh", "body": "This was, by far, one of the most spectacular stories I have ever read. Of all books, short stories, anything, this was phenomenal. Excellent work OP"}, {"id": "eau0ivv", "author": "Chanh1401", "body": "I was on the verge of tear reading this..."}, {"id": "eau29ie", "author": "Jooliebug", "body": "This story breaks my heart."}, {"id": "eau8xkb", "author": "ams712", "body": "Laika is a good girl ❤️"}, {"id": "eauf6hz", "author": "RandomGamerHere", "body": "Brilliant. Absolutely brilliant.\n\nThat's the highest compliment I can give, and I have never done that in all my time at nosleep."}, {"id": "eavdf78", "author": "aquariusdon", "body": "Wow.  Just breathtaking.  Better than most of the  shit I read from Amazon.  I am a publisher.  Expand your story to novel length...maybe explore the mythology/history of Grandfather’s people?   Let’s talk.  I’m serious.  "}, {"id": "eau0d6m", "author": "Nikaea", "body": "Wonderfully written, love the descriptive ability <3"}, {"id": "eau2w8y", "author": "frejawolf", "body": "Amazing"}, {"id": "eau31nx", "author": "IvyEnchantress", "body": "This is amazing :o"}, {"id": "eavbow3", "author": "lettiestohelit", "body": "OMG\nomg omg omg omg \n\noh my GOD\n\nI cried my heart out"}, {"id": "eavj9th", "author": "nondirtysocks", "body": "Poor, sweet Laika."}, {"id": "eawp849", "author": "bananastand4life", "body": "I am blown away. I love that pup so much it hurts"}, {"id": "eau2zn3", "author": "lexasperated", "body": "This was honestly amazing."}, {"id": "eau49sv", "author": "lessthanmoralorel", "body": "That was stunning, dark and beautiful. I hope you find your peace, Laika."}, {"id": "eau8a94", "author": "cat-pants", "body": "Your writing ability transcends what is expected. "}, {"id": "eauepis", "author": "deadangel28", "body": "That was painful. Why am I crying..."}, {"id": "eauhpxn", "author": "CrybabyAlois", "body": "this was amazing oh my god... I'm crying goodness"}, {"id": "eauk1dy", "author": "Dielyr", "body": "Yeah, I'm crying now."}, {"id": "eaul99p", "author": "DJDeathRay", "body": ">leaving a glistening mass like a fleshy geode. \n\nThat imagery blew me away - it’s original and hyper-visual. Fantastic read!"}, {"id": "eauvfl9", "author": "blinkingsandbeepings", "body": "Holy shit, I just read this and sat there blinking and staring into space for a few minutes. Incredibly rich, strange and beautiful story."}, {"id": "eavc2yg", "author": "cpotter32", "body": "I've never cried about a story before, but this one.....  this was something else. I weep for you and your brother.....  you did what you could.  You tried to save him....  I'm sorry for your loss OP.  \n\nLoved this story "}, {"id": "eavj0n8", "author": "happysum5", "body": "There is no doubt in my mind that this will become one of the top stories on NoSleep. Beautifully writtenfull of heart and despair."}, {"id": "eavj7c1", "author": "disterb", "body": "oh.my.dog"}, {"id": "eavl5mp", "author": "kupczechoslovakia", "body": "If this doesn't manage to get the award for December's best story then I don't know what will."}, {"id": "eau697l", "author": "SapphireLycanrock", "body": "This is why dogs are better than humans"}, {"id": "eau0mze", "author": "Allzeronohero", "body": "So amazing, the feels"}, {"id": "eau3w27", "author": "lipstickonmyface", "body": "This is beautiful "}, {"id": "eau824o", "author": "SolarFlora", "body": "This was amazing. I feel so enriched from reading your story. Thank you. "}, {"id": "eaue3ew", "author": "PEACH2001", "body": "This is the first time in years I've cried reading a story.... Wow "}, {"id": "eaueon5", "author": "ihaveautinism", "body": "Can skmeome explain the ending? Thanks"}, {"id": "eaugddi", "author": "snapfreeze", "body": "Your style of writing is stunningly beautiful."}, {"id": "eaui87o", "author": "kimmidoll123", "body": "This is hauntingly beautiful. Spectacular job. "}, {"id": "eaujujd", "author": "Gollwerfuerst", "body": "I wish this was an entire book"}, {"id": "eavdj7j", "author": "schnappsyum", "body": "Awesome story! My heart hurts for poor Laika. I never knew they did that to her 😔"}, {"id": "eavfebt", "author": "Sicaslvssilence", "body": "Beautifully written!!"}, {"id": "eavg1ou", "author": "TurtleTev", "body": "This is fantastic, real sad how it ended but it seemed fitting. Poor Laika 😢"}, {"id": "eaviz31", "author": "Lethalmouse", "body": "This was the most beautiful thing I've read in a while. Thank you so much for sharing."}, {"id": "eavwjgx", "author": "fuckin_ash", "body": "My soul goes out to you. And to that poor pup that dies scared and alone. You did the right thing by extinguishing your power, I am so sorry for all that you had to endure. "}, {"id": "eaw3rec", "author": "SerialSleeper13", "body": "This is depressingly beautiful. "}, {"id": "eb21bjh", "author": "pokepeys", "body": "My dog Indigo is getting fixed, the way I (was so lucky and) got her, she was abandoned, when she showed up to my front porch you could tell she loved SO hard and just wanted/needed to be loved back. For the first month of having her she didn't leave my arms. I took her to work, had all my classes online, and spent every waking minute with her. \n\nAfter the first month we started training with the focus of helping her with her seperation anxiety from me. We have gotten to the point where she can comfortably spend 4 to 8 hours with someone else. So now she is getting fixed and due to doctors orders she had to spend the night. I have 6 hours till I can head to pick her up and I can't wait. I spent all day harrassing the vet, asking for updates (and they were extremely patient and reassuring), and worrying that she was thinking I left her somewhere for being a 'bad dog', needless to say, this story hit a nerve. Lol"}, {"id": "ebda5wy", "author": "MosYEETo", "body": "Speechless."}, {"id": "ebem5xi", "author": "Manch94", "body": "This is one of the stories that will stick with me. Fear is one thing, but heartbreak is something else entirely. "}, {"id": "ebovt8e", "author": "ThaiJr", "body": "I've read a lot of very good stories here.. but this one is not one of them. This is another league completely. The masterpiece. "}, {"id": "ebrriv0", "author": "montodebon", "body": "Every time I see the name Laika I pretty much start bursting into tears, and now I have yet another reason. Good job OP"}, {"id": "eau7gsl", "author": "SatansSassySage", "body": "This shit is gonna go in history books, Shakespeare wishes he could do this, this is absolutely amazing "}, {"id": "eau0hfc", "author": "brunettexspeakin", "body": "I love this more than I can put into words"}, {"id": "eau5ojr", "author": "SirenChaser", "body": "Without a doubt, the most beautiful and heart wrenching thing I have ever read. You have a talent beyond compare. I bawled like a baby. "}, {"id": "eauuelb", "author": "biswayan", "body": "It could be adapted into a great horror movie, I will pay all my money if I have to"}, {"id": "eaviiq5", "author": "unipos", "body": "This was quite an experience to read. It sure hit me in the feels.\n\nIt sounds a lot like a subtle story about schizophrenia. A little girl is abused. She is absolutely terrified (many experience intense fear during a psychosis). In her dissociative state Laika becomes an anchor to her. She hallucinates as a coping mechanism. She fights her grandfather, her father finally steps in and does what he should've done a long time ago. In the end she realises that the hallucinations are an unhealthy coping mechanism and gives them up."}, {"id": "eau19xq", "author": "robots914", "body": "that was beautiful, and heartbreaking. wow."}, {"id": "eau1ff4", "author": "Natureboy1994", "body": "That was by far one of the best things I have read on Reddit ever just phenomenal."}, {"id": "eau472c", "author": "alekpixi", "body": "Amazing. I am at a loss of words."}, {"id": "eau49rf", "author": "polkachip", "body": "Bravo!!  Absolutely amazing!!! Thank you for this. "}, {"id": "eau4dvz", "author": "tananantantana", "body": "The best one I've read on here."}, {"id": "eau4f66", "author": "FluorescentVest", "body": "Amazing. I am speechless."}, {"id": "eau546g", "author": "miss_scarlett_ohara", "body": "This was absolutely amazing."}, {"id": "eau5d7p", "author": "vikitata23", "body": "This is amazing. Truly beautiful story."}, {"id": "eau5zt4", "author": "yoyodontgo", "body": "This was such a fascinating read. Hope everything turned out okay."}, {"id": "eau7bah", "author": "Irevella", "body": "Read through it all in one go, I couldn’t look away. So sad, but so beautiful too."}, {"id": "eau7iet", "author": "jessicadorable", "body": "Bravo!!!"}, {"id": "eau7ird", "author": "pyrrha21", "body": "Wow!"}, {"id": "eau8ykc", "author": "Magic-Michi", "body": "You are a good dog, I hope life is better for you now"}, {"id": "eaua29g", "author": "thebiggestsmolboi", "body": "Absolutely stunning."}, {"id": "eaub3e4", "author": "summerket", "body": "Incredible ❤️"}, {"id": "eaufz2a", "author": "CR_Silentassassin", "body": "I'm not crying, your crying!"}, {"id": "eaug9yb", "author": "tomt6371", "body": "I did not expect that. Such an awesome gripping short"}, {"id": "eaugk4f", "author": "Nanobreak_", "body": "Well damn"}, {"id": "eauh223", "author": "LoderDan", "body": "It makes me happy that this post has two plats"}, {"id": "eauhp6y", "author": "Firebrand777", "body": "Beautifully told. You have a wonderful style. "}, {"id": "eauijxr", "author": "20thCenturyPigeon", "body": "One of the best stories I read on nosleep!"}, {"id": "eauj0wk", "author": "MooPig48", "body": "You. Are. An absolute master.  I am so sad I’m done reading it."}, {"id": "eaulohz", "author": "sashapants17", "body": "Wow. This was incredible "}, {"id": "eaulv2g", "author": "Skeptikal10", "body": "The descriptive writing is absolutely incredible, almost mesmerizing. Best nosleep I've read in a long time, thank you and please keep writing."}, {"id": "eaum5jc", "author": "talqualvoce", "body": "The way you talked of elder powers not of this Earth made me feel like I was reading a brand new H.P. Lovecraft tale.\nThank you for sharing your story with us!"}, {"id": "eaumnfl", "author": "Bonanza86", "body": "I really like reading this. Props, OP."}, {"id": "eauncla", "author": "cracklin_oats", "body": "Damnnnn this was amazing. "}, {"id": "eauo5oe", "author": "bam_higgy", "body": "Absolutely brilliant."}, {"id": "eauo6ko", "author": "AutisticPiano", "body": "Is this a new record for fastest gild nosleep post? Wow saving it for tonight "}, {"id": "eauobnr", "author": "OpioidSlumber", "body": "I got chills so many times while reading this amazing story. Wonderful job!"}, {"id": "eauobpl", "author": "Rein_Deilerd", "body": "Holy shit, what a captivating, emotional tale. So sorry you had to live through that, OP, but you did the right thing when you discarded your power instead of giving in to temptation. I'm pretty sure your father, grandfather or others who came before them didn't want to become monsters at some point, but you seem to be the first one to sacrifice your power and keep your humanity. There is no need to bring Alexander back from your nightmares, he deserves to rest, and so does Laika. They will always be with you in your dreams of space, keeping you safe and warm. Good luck, OP, live a good life Laika would be proud of."}, {"id": "eauq0te", "author": "hereneverthere", "body": "Wow.  That was just amazing!"}, {"id": "eausj8k", "author": "Jaewol", "body": "This was a journey and a half. Beautiful storytelling. You made the characters feel so alive. I don’t know what else to say, as my mind is still spinning from this."}, {"id": "eautbbo", "author": "watermelon_sim", "body": "I sat and read this straight without looking away until the end. It was so good. "}, {"id": "eautsds", "author": "summereta", "body": "This is amazing "}, {"id": "eauw5i8", "author": "saltybread18", "body": "Wholesome nosleep?? even if its terrifying."}, {"id": "eauzynl", "author": "PC_-_Principal", "body": "So many descriptive words used. I could actually see what was going on. \n\nI'm sorry that this happened to you. \nUsually it takes an (un)lucky warlock/witch decades to even come close to gripping the third rail that is necromancy. But not even having to perform the rigours of the old rituals is insane. You could be a demigod in the making. \nHope all goes well for you now. "}, {"id": "eav0h47", "author": "JessHas4Dogs", "body": "Wow. This made me freaked out and angry and pleased."}, {"id": "eav1mku", "author": "bluecheeseplate", "body": "Absolutely amazing."}, {"id": "eav33ow", "author": "lightingmemes", "body": "I'm shocked. This was amazing! "}, {"id": "eav38ve", "author": "textboy3", "body": "I'm in love with your writing!"}, {"id": "eav3h89", "author": "mynamejeoff", "body": "Holy shit. No words.\n\n  \n\n\nAlso, grandfather=orochimaru?"}, {"id": "eav4k2z", "author": "Cowdery5000", "body": "Beautiful and amazing. That shows the strength of human character. "}, {"id": "eav58cg", "author": "GueToxicWaster", "body": "This story is great"}, {"id": "eav5ii8", "author": "ashrose13", "body": "This was truely beautifully written, and beautiful."}, {"id": "eav5slu", "author": "Mostafa12890", "body": "Incredible... just *perfect*"}, {"id": "eav6m4h", "author": "Lloydsauce", "body": "I wish I could write like this. This is amazing. "}, {"id": "eav6tey", "author": "SuzeV2", "body": "Just awesome...❤️"}, {"id": "eav8ia5", "author": "Luminous_Moon", "body": "This was amazing. If you don't write professionally, that is a tragedy of the highest order. "}, {"id": "eava89f", "author": "crzychickenlady", "body": "I need more! This touched the soul!"}, {"id": "eavafh4", "author": "jennifers-body", "body": "all i have to say is ♡ ♡ ♡"}, {"id": "eavb2wg", "author": "jojoys", "body": "This was beautiful 😭❤️"}, {"id": "eavbqbv", "author": "Nonbinarykittykat", "body": "Nosleep is often times better than r/writingprompts "}, {"id": "eavcina", "author": "-Pianoteeth", "body": "Phenomenal. Truly phenomenal."}, {"id": "eavd86w", "author": "cainsu", "body": "Now THAT was a ride. Definitely will be keeping an eye out for you, OP"}, {"id": "eave5zu", "author": "FantastixFishie", "body": "I. Want. More."}, {"id": "eavf23f", "author": "agentrlce", "body": "what the fuck my heart is pounding "}, {"id": "eavf3dk", "author": "synthesizer96", "body": "Oh my God?? That.. was. Great! I cant think of words to praise it more!"}, {"id": "eavg121", "author": "repressedaesthetic", "body": "Holyy mother of hell"}, {"id": "eavg1vd", "author": "GiraffeLiquid", "body": "What a beautiful story."}, {"id": "eavh4v2", "author": "SteelButterfly", "body": "Waaaow! "}, {"id": "eavhgtm", "author": "Tigress2020", "body": "Wow. No words can express how good that was"}, {"id": "eavhgwg", "author": "pokekyo12", "body": "This is brilliant, with my brats around I had to read it in three attempts but it really spoke to me."}, {"id": "eavhn5c", "author": "cccaaattttt", "body": "Incredible.\n"}, {"id": "eavj5g2", "author": "babyinatrenchcoat", "body": "Goddamn..."}, {"id": "eavmqyx", "author": "Fabian_0903", "body": "You should write a book"}, {"id": "eavo7cm", "author": "dombie05", "body": "That was like an old epic or Saga, were you influenced by Lovevcraft at all? "}, {"id": "eavow1c", "author": "ryanthatmeme", "body": "this almost made me cry. made its way into my top three favorites on nosleep. thank you for this"}, {"id": "eavpejn", "author": "KinetikDark", "body": "I have no words"}, {"id": "eavppxq", "author": "Julibug1", "body": "wow"}, {"id": "eavsw9a", "author": "Jomern", "body": "Holy F***. This was a good one."}, {"id": "eavvvnf", "author": "sisiinthegalaxy", "body": "This is so amazing "}, {"id": "eaw1r5k", "author": "rayofsunshine121", "body": "When I see it's posted by u/dopabeane I always read. Heart wrenching, incredibly descriptive, I couldn't put it down. Another 11/10, damn."}, {"id": "eaw3ynp", "author": "DemonsNMySleep", "body": "Amazingly written. I started to picture the grandfather as a more twisted version of Emperor Palpatine or some other Sith."}, {"id": "eaw83vn", "author": "TheMinecraftOverlord", "body": "Incredible."}, {"id": "eaweixd", "author": "nmwrites", "body": "Incredible"}, {"id": "eawo5bm", "author": "freckled_porcelain", "body": "They could make a movie out of this."}, {"id": "eawrgyz", "author": "pchoi95", "body": "Movie please, thanks."}, {"id": "eawtx6x", "author": "Bossplayer_23", "body": "Wow. I just couldnt keep my eyes away from this story while reading. But are you sure you are the only pwrson with this ability? What if there are others and they abuse it? One day, they will probably come for you. Keep an eye out OP."}, {"id": "eaxyl6c", "author": "mischah", "body": "Holy Moly, this is exquisite. No words. Amazing. "}, {"id": "eay58k4", "author": "sharkbaet", "body": "Holy shit. Every single time, man. You get me every single time."}, {"id": "eaz0kf6", "author": "Carpe_Lady", "body": "This was so so beautiful, well done"}, {"id": "eazijgr", "author": "Philoune", "body": "incredible!"}, {"id": "eb3vkem", "author": "throwawaygayguy32", "body": "Please, write a novel, or write more of these or god IDK JUST DO SOMETHING. Im overwhelmed with feelings right now. This was absolutely beautiful"}, {"id": "eb4vzci", "author": "TheoWren", "body": "This is pure art.. macabre and haunting and surreal."}, {"id": "eb6qfcf", "author": "Cantstress_thisenuff", "body": "Whoa. This is so good. "}, {"id": "eb76nx0", "author": "hboulette", "body": "Ooh shit that was good..."}, {"id": "eb9sf6v", "author": "Amy-Elle", "body": "This is the best thing I've read on here in a very long time. And so very original! Good dog! ♡"}, {"id": "ebas93y", "author": "jefiiiiiiiiiiiiiiii2", "body": ">The Soviets knew how to put a rocket into space, but they didn’t know how to bring it back. This made Laika’s mission a death sentence. Shortly after reaching orbit, the interior of Sputnik 2 became catastrophically hot – far too hot for mammals to tolerate. Mere hours after launch, Laika died an agonizing death. She perished the same way she’d lived: lesser, beneath, inferior. Abandoned. Unloved.\n\nexactky. thats why i hate people\n\n&#x200B;"}, {"id": "ebcgfuz", "author": "Overtlyanxious", "body": "I am completely blown away."}, {"id": "ebk3y9h", "author": "cnunez15", "body": "Bravo!!!👏🏼👏🏼👏🏼"}, {"id": "eblt0x0", "author": "velcro-rave", "body": "This was visceral. Good girl."}, {"id": "ebptwlr", "author": "thenannerfish", "body": "This was amazing. "}, {"id": "ebt96kx", "author": "EfficientSeaweed", "body": "Morbidly beautiful. I already know this is one of the few stories I've read on here that will stick with me forever."}, {"id": "ec1uwr6", "author": "tsarscream", "body": "hauntingly beautiful, strikingly original and gloriously sombre.  this is an exceptional work of imagination."}, {"id": "ech6b4x", "author": "throwitonthegrooound", "body": "Please write a book. Your writing is captivating. The imagery you created with your words is positively magical."}, {"id": "eesjtb4", "author": "Ghettoceratops", "body": "Christ.... Now I'll have to go get some more feels. "}, {"id": "efs0nh6", "author": "LiamCute1919", "body": "Chilling! I love it."}, {"id": "eh0a4u4", "author": "RiseAgainstEwoks", "body": "You have a breathtaking style of writing. What a way with words! ❤"}, {"id": "ehai1s1", "author": "slmah717", "body": "I’ve been crying since halfway through this story and I still have tears in my eyes while I’m typing this out. Really, really excellent work. 👍🏽👍🏽👍🏽"}, {"id": "ekz3zth", "author": "Voiceless_Siren", "body": "Such poetry and depth of feeling. I can't believe I've never read this. What an incredible story."}, {"id": "en9x04s", "author": "bannahill", "body": "This is amazingly well written ♥️"}, {"id": "eav8o4s", "author": "HeadScrewedOnWrong", "body": "Your dad fucked your grandpa, man. Ewww."}, {"id": "eaulxl1", "author": "alittleblueboy", "body": "Oh my god. That was truly one of the best things I've ever read. And I've read a lot of things."}, {"id": "eauspqr", "author": "Mythgirl", "body": "A beautiful, incredible story. Top tier. Holy shit. "}, {"id": "eauvyue", "author": "Dokidokita", "body": "I never thought in my entire life I'd read such a beautiful masterpiece \\*-\\* we need more, maybe a longer, more detailed version."}, {"id": "eav7m9j", "author": "loookieheree", "body": "Please, PLEASE continue this story. I would love to see you write a book. This was wicked, and cruel and horrifyingly beautiful and I just can't find the words to express  how much I want to read more from you. Thank you. "}, {"id": "eazfo3u", "author": "Unerring_fool", "body": "R/wholesomenosleep"}, {"id": "eauar3c", "author": "crazeharsedragon", "body": "Shakespeare wishes he were you rn. "}, {"id": "eaut2d3", "author": "AtotheCtotheG", "body": "Holy BALLS that was AMAZING! "}, {"id": "eavo6vz", "author": "SnowWhite05", "body": "The best no sleep I have read."}, {"id": "eaxm4oa", "author": "jessesee12", "body": "u/xsprayNpray14x"}, {"id": "eaykwzd", "author": "SomeCallHimPink", "body": "That was insane. Beautifully written and very unique "}, {"id": "ecc0rzl", "author": "Scuba_123", "body": "Whats good dawg?"}, {"id": "ecfayny", "author": "SeaTurtleAss", "body": "The fuck"}, {"id": "ecif95l", "author": "insteadimawake", "body": "This story is fucking incredible. Well written, super creative, just all around fun and interesting. You are very talented!"}, {"id": "ecjpgrd", "author": "zeroschiuma", "body": "Terrific writing, truly scary plot. Love it and really hope it finds its popularity and sets the standard quality here on No Sleep. "}, {"id": "ecttoiv", "author": "The_Pyro_Man", "body": "This gave me chills."}, {"id": "ecufg4o", "author": "alexsangthat", "body": "This broke my heart in so many ways, and made me cry. You are a brilliant writer "}, {"id": "ecx2gii", "author": "Akuzetsunaomi", "body": "I feel like I’m really missing something here. I read someone’s explanation and yeah “wait that’s all it was?” was how I felt too. It’s well written, I’m just not understanding all the praise responses to it. "}, {"id": "ecx7fwh", "author": "I_eat_men_4_a_living", "body": "You ain't nothing but a hounddog"}, {"id": "ee53ohk", "author": "Nikolaievitch", "body": "I don't want to be the boring guy, your writting is amazing and there's a plenty of readers agreeing with me about this, but really? Not a single NSFW warning? Children abuse? Graphical content? Animal abuse?"}, {"id": "eelgdjk", "author": "niamh73", "body": "Please write books and books and books and more books."}, {"id": "eg7hlk9", "author": "The_silver_sparrow", "body": "Am I the only one drawing correlations between this story and I found a copy of my favorite childhood movie and it’s not like I remembered it"}, {"id": "eght1d7", "author": "colorwherl", "body": "Uh so was op a dog the whole time"}, {"id": "egrvgzc", "author": "KnightBoulegard", "body": "Yes, um, full novel when?"}, {"id": "ek4b7xl", "author": "NotKaren24", "body": "It doesn't look good from the title then I saw the awards."}, {"id": "ekg16hg", "author": "Serixxo", "body": "Damn. Crazy story. Flying baby heads."}, {"id": "eauvsv5", "author": "Echostrophe", "body": "Goddamn"}, {"id": "eawffvs", "author": "Cooper_DB", "body": "Wait a minute.  So... the Russians made it to space?  "}, {"id": "eaumj2i", "author": "kmart_shopper", "body": "Can you bark?"}, {"id": "eauu8bx", "author": "Mistophant", "body": "You ain't nothing but a hound dog"}]}