{"id": "ad5zto", "title": "My Mother-In-Law was poisoning me, then I found out why", "url": "https://www.reddit.com/r/nosleep/comments/ad5zto/my_motherinlaw_was_poisoning_me_then_i_found_out/", "subreddit": "nosleep", "author": "nmwrites", "text": "Everyone has their own nightmare in-law story, though I couldn't imagine how bad mine would be. As it turns out the worst thing wasn't my mother-in-law poisoning me, the worst thing was why she did it.\n\nI met Craig on one of my rare vacations and we had sort of a whirlwind relationship. We fell hard for each other and were married in a courthouse wedding within two months without ever meeting each other's families. Mine visited a few weeks later and after their initial shock really liked Craig.\n\nWhile we got moved in together and figured out married life I got to hear more about his parents who lived near the rest of his extended family a few hours away, though we never saw them. My work schedule is rough. I work 6-7 days a week and my off days are a blur of appointments and errands, I think in the two years before I met Craig I only left the city once!\n\nI finally got a few days off so we could head to visit his family about six months later. His whole family came over and everyone seemed thrilled to meet me, except for his mom, Betsy. She was cold and distant, and could sit there without saying a single word to me. It was creepy, but I kept trying to spark up a conversation.\n\nOn our last day he announced that we should take an afternoon hike up into the national park their house sat on the edge of. Betsy made lunch and I was changing to go out when it hit me, just waves of nausea. I wound up in the bathroom for hours that afternoon.\n\nI figure it was just a touch of something and thought nothing of it. We went back a few months months later and again had a great time except for Betsy. She wouldn't talk to me, though Craig brushed it off and said she was just getting to know me. He finally said we could rent jet-skis the next day and explore a lake in the next town as a way to get out of the house and unwind, which made me feel better. I was so excited to tell everyone where we were going, but it wasn't to be. After eating I got so sick I could barely walk for the next two days.\n\nAt this point I started to get suspicious. No one else was sick, and we all ate the same food. It seemed like Betsy must have been up to something, but it wasn't until our next visit when a night in a romantic cottage another hour up the road was cancelled due to me getting sick that I was sure: Betsy was poisoning me.\n\nCraig said I was insane. He said it must be an allergy to something his mom used in her cooking, which actually made sense, though I never had time for an appointment to get it checked out. Still, I decided on the next trip that I'd make a big casserole and bring it with us. If I cooked the food and served it, nothing could be added.\n\nWell, I hadn't had two bites before I realized I had left the wine I was drinking unattended while I was heating up the casserole, and my stomach was already doing flips. You know what happened next, and it was not pretty.\n\nI was so sure his mom was poisoning me, and I confronted Craig about it. I told him I wouldn't visit his family again if she was there. It was our first big fight, but he finally said he wouldn't force me to visit, and we could figure out how best to deal with the situation. She had never been nice to me, so it wasn't a loss.\n\nThe next time I got time off we decided we'd head to that little cottage we had rented before and not been able to use. We were driving right past his family's place, and it seemed rude not to stop, so we compromised and bought some pizzas. I even decided just not to drink anything unless it was water from the tap.\n\nWe got in and threw pizza on our plates when one of his cousins arrived and everyone briefly left the food unattended. I realized my mistake almost immediately, and decided to try an experiment. Craig and I both had two slices, so I just switched our plates while everyone was in the next room.\n\nCraig was so sick I was really worried about him. The drive back to the city was awful, we had to pull off a lot, and he was a mess. We had been back home for three days before I broke down and told him I had switched the plates.\n\nI've never seen such anger before, the rage in his eyes is something I'll remember for the rest of my life. He shoved me into a wall and then came flying at me. He threw me over the couch, but I somehow managed to grab my keys and phone and ran out the door not even wearing shoes.\n\nI got lucky with the elevator and made it to a friend's place safely, finally turning off my phone after I missed his 47th call. I had no idea what to do or when it would be safe to go home, it was the scariest time of my life.\n\nIt was two days before I turned my phone back on, and when I heard the message from the police I drove upstate immediately.\n\nCraig was dead, Betsy had shot him after he broke into her house and charged at her with a knife.\n\nI learned that Craig had been married once before, and his wife had died on a tragic hiking accident. Craig made a lot of money in the life insurance payout and Betsy always suspected Craig had killed her, and was nervous about letting him be alone with me, especially out in the remote area he was so familiar with from his childhood.\n\nSo she ensured that every time he planned an outing that I would be sick. It wasn't easy, but she didn't think I would believe her, as no one else had ever shared her suspicions about Craig.\n\nI found the life insurance policies he took out on me without my knowledge afterward, and refused to press charges against Betsy, she was only trying to protect me. I still visit her from time to time when I need to get out of the city, [I love her cooking](https://www.reddit.com/r/nmwrites/).", "comments": [{"id": "ede1wah", "author": "CatMintDragon", "body": "Wow okay I had to read the last few paragraphs twice that was actually a terrifying plot twist. MIL sounds like an amazing person. Ex- Husband on the other hand deserves what he received."}, {"id": "ede53wy", "author": "Tamalene", "body": "So, if he was well off, and you inherited, does that mean you can cut back your hours of work? ☺️"}, {"id": "ede1uuz", "author": "NitroChaji240", "body": "Honestly, after the title and the thing about the marriage,I kinda suspected that he was a bit too willing and all that."}, {"id": "edf6kpv", "author": "MnidunAlzael", "body": "Holy fuck, I thought this was r/justnoMIL and just got hit with the nosleep whammy at the end holy fuck.\n\nFantastic story btw!"}, {"id": "eddzzks", "author": "_xyoungbellax_", "body": "That twist though, great MIL! "}, {"id": "edecqi5", "author": "kait_y", "body": "Chaotic good "}, {"id": "ede150r", "author": "FlakeyGurl", "body": "What an asshole.... glad to hear MIL was doing it for a positive reason."}, {"id": "edeu480", "author": "mr_majorly", "body": "Why is this not a movie? I dont know anyone that would make it happen... almost. But damn it needs to be... at least on Netflix "}, {"id": "eddzo1b", "author": "Sarahmth", "body": "Awesome Mum-in-law. Loved the twist. Lucky you survived the attack"}, {"id": "ede8c7p", "author": "Texxon1898", "body": "Ok, it was good she was trying to protect her. But why be distant?"}, {"id": "edeu9mg", "author": "Wolfcake82", "body": "My favorite thing is when these stories go from \"aw man, they revealed too much in the title\" to \"HOLY SHIT THEY DIDN'T\""}, {"id": "edellx2", "author": "bitterkuk", "body": "Just out of curiosity, have you told this to anyone on reddit before? I swear it sounds very familiar, and I knew the twist as soon as I read the title, so I'm guessing I've heard it before. \n\nIf not, its probably just my memory being wierd."}, {"id": "ede39hp", "author": "Raiinish", "body": "Lol as soon as OP said Craig planned an outing and then Betty poisoned her, I figured she wasn’t the villain and the Craig was the one trying to hurt her."}, {"id": "eddzh8v", "author": "MagickalMama_", "body": "Ahhh this gave me all the feels in a weird way."}, {"id": "edecsg6", "author": "imthebestatsiege", "body": "fuckin wild twist "}, {"id": "edfgkbj", "author": "Stuffed-Friia", "body": "So who's gonna play you in the movie? :o "}, {"id": "edft985", "author": "howtochoose", "body": "Isn't it weird that you can take out life insurance on someone without them knowing? I've never understood that...\n\nGlad you're safe op. Mil had to kill he town son. She's a strong one."}, {"id": "ediaz07", "author": "amyss", "body": "Women stick TOGETHER!  Uteruses before duderuses.   Awesome she warned you and helped you lose weight also. Badass ✊🏽 "}, {"id": "edwe3a3", "author": "BabyGirlR", "body": "I thought I was  reading r/JUSTNOMIL"}, {"id": "ede5cpf", "author": "Chelceeee", "body": "Such a good story!! Very sweet of the mother-in-law!"}, {"id": "ededxui", "author": "KeeperofAmmut7", "body": "Woah. That was an unexpected ending."}, {"id": "edeffdc", "author": "Journey333444", "body": "Wow!! That is insane!! Sounds like someone needs to write a book/movie. "}, {"id": "edepd1o", "author": "The5Virtues", "body": "Personally saw the plot twist coming, but that just made it so much better to me.  Love hearing stories where the mother takes responsibility in a “I brought you into this world and by God I can take you out of it” fashion."}, {"id": "edftdu7", "author": "izzi8", "body": "Not sure why but my mind immediately suspected the hubby was up to no good, I think I read too many horror stories lol"}, {"id": "edgi2db", "author": "emptyasswallet", "body": "imagine falling for someone named craig"}, {"id": "edn7h7t", "author": "poloniumpoisoning", "body": "amazing plot twist! i never suspected the reason, and it was a pleasant surprise."}, {"id": "ede3cb5", "author": "agallegos1982", "body": "What a psycho Craig was. Thankfully his mom had her suspicions and was not part of the plan. "}, {"id": "ede5qzl", "author": "MyTitsAreRustled", "body": "I'm glad for how that worked out for you. I honestly expected something else. Thanks for sharing!"}, {"id": "edf3mhh", "author": "fuckingclownshoe", "body": "What the ever loving fuck? If you don't expand this into a novel/indie thriller, please, PLEASE, consider reaching out to the people at the This Is Actually Happening podcast. Your story needs a wider audience. Glad you got out relatively unscathed. "}, {"id": "edflnn3", "author": "SkyFox0516", "body": "I always forget to read which sub I’m in! Wow I totally believed this til I read the comments and went back up to check that I was in the “nosleep” sub. Great job *slow claps*\n"}, {"id": "edg2va9", "author": "bleukitty", "body": "I subscribe to justnoMIL too and I thought I was reading a post from that sub at first! "}, {"id": "edge7er", "author": "MolotovCockteaze", "body": "This is why you don't  get married after only knowing someone for 2 months.\n\nI get why the mom was doing it, but she could have made a mistake and killed her herself. Idk what she should have done but purposely poisoning someone even with good intentions is pretty insane."}, {"id": "edi6tre", "author": "YeOldManWaterfall", "body": "I'm pretty sure you can't decline to press charges in a murder case, but okay."}, {"id": "edtg2pj", "author": "die-abolic", "body": "I’m so glad you’re safe, OP. Though, maybe whirlwind romances should be given a second look, don’t you think? Btw, think this should be on r/WholesomeNoSleep!! "}, {"id": "eduwcjf", "author": "devilman17ded", "body": "Who says all Momster-in-Laws are evil!?!? Way to go Betsy... \nF*****g Great story. I really dig it. Keep rockin’ an f’n’ rollin’ op. "}, {"id": "ede96tz", "author": "EmmyBee80", "body": "That was deep! "}, {"id": "edeg22v", "author": "9for9", "body": "Excellent, excellent story, great twist."}, {"id": "edehusf", "author": "dappledeggs", "body": "WHAT A TWIST!!! I LOVED IT "}, {"id": "edem29z", "author": "N7Reign84", "body": "That was a fun read and a nice twist."}, {"id": "ederuap", "author": "itsjustcoy", "body": "I was totally not expected that. Wow."}, {"id": "edfjs91", "author": "Wolf_of_USA", "body": "This would make a great movie. "}, {"id": "edfl69y", "author": "Mirewen15", "body": "She may have been cold to you because she didn't want to get too attached... if the same thing ever happened again :("}, {"id": "edfx0p2", "author": "docbarlow", "body": "I thought I was reading something from /r/justnomil ... you convinced me!"}, {"id": "edg1dbp", "author": "Aninternerloser", "body": "Seriously, is everyone in this modern age so trusting that they don't do things like pay a PI to root around, do a comprehensive background check?\n\nIt's not just me that does this... right?"}, {"id": "edg6hg4", "author": "MadMechromancer", "body": "Dammit, I thought I was in JNMIL. "}, {"id": "edgjzvz", "author": "shan7quanta", "body": "A great woman she is. Killing your child, even if a murderer, is not at all easy."}, {"id": "edgvcrv", "author": "dropbear23", "body": "Holy fuck that's a new twist haha!"}, {"id": "edhf5cc", "author": "katsu-Z", "body": "Nice twist!"}, {"id": "ediv9ss", "author": "shurouq666", "body": "I wanna get married just to have a mother-in-law like her "}, {"id": "edj9tg4", "author": "Carradee", "body": "Oh, nice twist!"}, {"id": "eekjc07", "author": "JayceJole", "body": "Why didn't the mother just pull her aside and tell her, then? Or sneak a note into her food?\n\nBeautiful plot twist by the way. This was a great read."}, {"id": "efjau04", "author": "PrettyBoy001", "body": "This continually gets me fucked up, im glad you’re safe "}, {"id": "ejnmka5", "author": "bacongrillcheese", "body": "damn, this plot twist"}, {"id": "ek01qau", "author": "GelicaSchuylerr", "body": "Nice plot twist!"}, {"id": "edelfhn", "author": "jeffwadsworth", "body": "Saw this on Forensic Files.  Hard to come up with real twists anymore."}, {"id": "edg2yzv", "author": "aozorakon", "body": "I figured she was protecting you, glad I was right. What an awesome woman."}, {"id": "ede4rvz", "author": "JozafeneK", "body": "What an amazing turn of events really sucked me right in. After the twist I had to literally re read the whole thing over to get the feel of the plot in this new light AMAZING BOTH WAYS "}, {"id": "edejsu0", "author": "reddithashaters", "body": "honestly one if my biggest fears and the reason I can no longer watch lifetime movies. glad you are safe now"}, {"id": "edekfii", "author": "lovelycosmos", "body": "Excellent- I didn't expect that twist"}, {"id": "edekief", "author": "jaquescabs", "body": "amazing! your MIL is wonderful!"}, {"id": "edempbp", "author": "highpriestess420", "body": "This could be a great movie."}, {"id": "edepeyb", "author": "RedneckStew", "body": "Love the curve ball at the end!"}, {"id": "edeq097", "author": "tracy1765", "body": "Good thing mom had your back!!! Otherwise you would have bought the farm!!!!!"}, {"id": "edexm3x", "author": "Get_Away_Fr_Me", "body": "That's crazy! Definitely a twist I didnt see coming. Seriously glad you switched plates with him tho. Better to find out sooner rather than later."}, {"id": "edexwxe", "author": "UmbralApocrypha", "body": "Holy fuck what an awful man"}, {"id": "edf63l5", "author": "Aussiewolf82", "body": "MIL was a genius! Glad you're ok and that the ex is 6 feet under. "}, {"id": "edfcgtv", "author": "MsFickle", "body": "Wow, I didn’t expect that ending! "}, {"id": "edfck9w", "author": "Ravenleap", "body": "Holy hell that twist was wild. I at first thought the mom didn’t want her son married and tried to kill all of his lovers "}, {"id": "edff74f", "author": "jayfaye72", "body": "I knew it! But I read a lot of crime stories. That’s a good one!"}, {"id": "edffy8y", "author": "Monseigneur_Al-Jabr", "body": "holy shit what an experience. Very well written too."}, {"id": "edfhoiw", "author": "sl0uma", "body": "that was one hella of a plot twist! awesome story!"}, {"id": "edfinwl", "author": "Deewilsonx", "body": "Wow. "}, {"id": "edfj86g", "author": "Asullenriot", "body": "Oh wow"}, {"id": "edfkaam", "author": "MurryTheTurkey", "body": "Anyone a fan of sandie Jones? "}, {"id": "edfo6o6", "author": "Vincentbloodmarch", "body": "MIL sounds amazing. Thank goodness for her"}, {"id": "edfpf85", "author": "JDBundy84", "body": "Well that turned on a dime!"}, {"id": "edfpkdm", "author": "AtmosphereJD", "body": "I read this whole thing thinking it was a r/justnomil post"}, {"id": "edfqa8b", "author": "nebbles1069", "body": "Awesome"}, {"id": "edfri6y", "author": "krystalBaltimore", "body": "I thought this was r/JUSTNOMIL.... haha oops"}, {"id": "edfu15c", "author": "sadfaceclub", "body": "Oh my goodness, I actually thought I was reading a post from JUSTNOMIL! Great read!"}, {"id": "edfv67d", "author": "britnastyyy", "body": "Damnit,  just realized what sub I was in. "}, {"id": "edfydm4", "author": "Macnerd1239", "body": "Hope you inherited some of that insurance money! Crazy plot twist, glad you're alright! "}, {"id": "edfz41p", "author": "SnoFox", "body": "Is this a writing prompt? Hoooly coow\n\n&#x200B;\n\nEdit: /r/nosleep not /r/JUSTNOMIL \\>.>"}, {"id": "edgctws", "author": "Garathon", "body": "Thought this was /r/JUSTNOMIL and got pleasantly surprised."}, {"id": "edgi8sr", "author": "Checkersphoto", "body": "THIS IS THE CRAZIEST SHIT EVER."}, {"id": "edgikna", "author": "Zmanwarrior", "body": "JustyesMIL?"}, {"id": "edgwep3", "author": "PresentlyFan", "body": "I guess I figured it out, 'cause him planning so many trips and the sickness striking at the same time, Well his rage confirmed who was the evil."}, {"id": "edgz44n", "author": "pure_disappointment", "body": "The compassion your mother in law showed was phenomenal "}, {"id": "edp9vi2", "author": "mules-are-half-assed", "body": "r/justyesMIL"}, {"id": "ehdi5z2", "author": "Lacygreen", "body": "Happy ending I guess? But was poisoning necessary? Just text a girl."}, {"id": "einneg0", "author": "riplip", "body": "What an amazing mother."}, {"id": "eitkt8d", "author": "theclaymore47", "body": "Did not expect that at all. Hope you and your MIL are doing well and healing together <3"}, {"id": "eqp1vv4", "author": "Travellingtrex", "body": "SHOUT OUT TO THE ONE GOOD MOTHER IN LAW."}, {"id": "ereid6a", "author": "MouseOnDrugs", "body": "Great story!"}, {"id": "edfahxv", "author": "Oseaghdha", "body": "Nice plot twist. Doesn't quite make sense, as MIL only sees the girl once in a while. "}, {"id": "edewcvw", "author": "JuliJalaludin", "body": "This should be made into a Black Mirror episode"}, {"id": "edf4atq", "author": "somedudetoyou", "body": "Good story."}, {"id": "edfotlw", "author": "314rft", "body": "Karma's a bitch.\n\nUnless it's reddit karma. Have my upvote."}, {"id": "edgav2z", "author": "PrettyBoy001", "body": "This was fantastic "}, {"id": "edgbwmm", "author": "xomelissamaexo", "body": "I loooooved this. Totally suspected she was trying to protect you "}, {"id": "edgcuj9", "author": "gregarious-loner", "body": "That was a ride!  Excellently written."}, {"id": "edggez3", "author": "loserhi", "body": "Best mother-in-law of the year award goes to her "}, {"id": "edggfxf", "author": "TheMeddlingMonk8", "body": "Whoa, did not expect that twist at all!"}, {"id": "edgpo49", "author": "LunaTehNox", "body": "I forgot I was in r/nosleep and thought I was in r/relationships lol"}, {"id": "edi6x30", "author": "niamh73", "body": "There was a Dear Prudence like this a while back, up to the point where the MIL was trying to save her.  They were poisoning the wife and the husband was in on it from the beginning.\n\n&#x200B;"}, {"id": "edkmthu", "author": "Smith12456389", "body": "theres far easier ways to do this"}, {"id": "ehpg4zx", "author": "xxiyji", "body": "Wow a good one! There’s a movie with the same premise except the MIL. The title’s What Keeps You Alive. "}, {"id": "edeu18y", "author": "Cyanidealist", "body": "Well written and an engaging story. Thank you for sharing! I found it predictable, but that did not take away from the story itself which I highly appreciate. Perhaps it's because I watch a lot of crime dramas. Thank you again for the story! Good stuff."}, {"id": "efqnyap", "author": "cculbert3", "body": "Great story, however, you gave too much away at the beginning, especially by stating that the reason she was poisoning you was scarier than the fact that she was. I assumed right away that it had to do with her son being a murderer or something. Again though, great story! Not every story is about the twist, though yours was quite unfortunate. Hope the next man you meet doesn't end up as eager to get married and go on hikes."}, {"id": "efoj4mw", "author": "knehrenz", "body": "Sounds like Sandie Jones’s “The Other Woman”! "}, {"id": "ede8zc0", "author": "garwilly", "body": "From what I read I wouldn't trust non of these three people in this story, all of them are evil on different levels."}, {"id": "edelmpl", "author": "Acheetmapanz", "body": "I threw up Spaghetti once. "}, {"id": "edgjpfd", "author": "Ducler", "body": "Well that was so long i didn't read it ."}]}