{"id": "b3q2xl", "title": "I have an unusual job. The pay is good, but I really hate the moaning sounds that go with it.", "url": "https://www.reddit.com/r/nosleep/comments/b3q2xl/i_have_an_unusual_job_the_pay_is_good_but_i/", "subreddit": "nosleep", "author": "ByfelsDisciple", "text": "“So,” I croaked, ignoring her wince at my raspy voice, “you’re worried that your dead husband is haunting you when you fuck other men?”\n\nI inhaled a long drag of the cigarette, then took care to blow the smoke *just* far enough from her face to avoid being rude. She didn’t flinch, which meant she thought I had a lot to offer. \n\nPretty little thing, she was. Nearly thirty years old, though I’d estimate the age of her modified chest to be about three. Her good looks stemmed mainly from the fact that she’d clearly avoided a lifetime of hard work. I probably would have been equally attractive twenty-five years ago had my twin passions been vanity and stupidity.\n\nThis gal was taken care of.\n\nHer expression glazed for just a moment. I noticed.\n\n“No,” she offered timidly, “it’s nothing like that.” She looked up at me with wide eyes that had been conditioned to elicit sympathy. I noticed. \n\n“It’s just…” she bit her lip. “It’s just that Raymond’s been gone a month – but I don’t think that he’s *gone* gone, you know? I want to know if I should put him behind me, or…” She shed a tear. “It started out small. His favorite sweater would be hanging in the closet, but the next morning, it was lying on the bedroom floor. Not a big deal, you know?” She looked around conspiratorially, despite the fact that no one was in the brightly lit sun porch besides the two of us. \n\nAs if sensing my thought, Sophocles rubbed up against my skirt. I reached down and scratched his ear without turning away from my client. She stared right back at me, looking over the swirling vapor dancing from the teapot’s spout. \n\n“But then,” she breathed, flushing slightly pink, “I would be, ah, in an intimate moment-”\n\n“Masturbating, or fucking?” I asked bluntly.\n\nHer pink face quickly turned crimson. “Um, the first one. I’d hear a sudden banging on my bedroom door. It would go away whenever I stopped… what I was doing.”\n\n“What makes you think it’s your dead husband?” I pressed her, crushing my cigarette and lighting a new one.\n\nShe gazed down at the table. “He would *always* interrupt me. Even if it wasn’t… about anything naughty.” She looked up at me in desperation. “It just *feels* like him. Does that make any sense?” She bit her lip again. I noticed. “But the worst thing was last night. That’s what made me decide that it was time to talk with a… *professional.*”\n\nGod, her little pauses and cute blushing were irritating. I really wanted to slap her. \n\n“Explain,” I ordered cavalierly before taking in that first drag.\n\nA long pull of the cigarette really makes people like her worth it. What was her name? Cindy? She seemed like a Cindy. But the Cindys of the world always scatter from my mind for *just* a few seconds during that first sensual puff. In those moments, I feel so *capable.*\n\n“Last night-”\n\nI coughed. Reality set back in. “Listen, Cindy-”\n\n“It’s Anne-Samantha.”\n\n“You must have jilled off thousands of times in your life-”\n\n“I’m sorry… ‘jilled’?”\n\n“Well, are you a Jack from the waist down?”\n\nShe laid a dainty little hand right on her mouth. “Oh… my, no. I’m all Jill, I suppose.”\n\nI grunted. “So what’s so different about jilling off now?”\n\nHer eyes got wide again, but I had learned long ago to suppress the slap-urge. “When I’m alone in bed, I hear breathing. *Only* when I’m alone. It’s unmistakable.”\n\n“Well, how hard are you working?” I asked pointedly.\n\nShe dropped the hand from her face. “The breathing is coming from the other side of the room.”\n\nI gave her an unblinking, fixed stare. She returned it.\n\nI finally turned away when a lump of ash fell from my cigarette onto the table. “Here,” I offered, pouring a cup of tea from the pot. I rested my hand on the painted grapefruit and lavender design to hold it steady. “Drink this.”\n\nShe took it obediently, blew on it, then took a sip and winced. “Too hot?” I asked sharply.\n\n“Too bitter,” she responded coolly.\n\n“Too bad,” I finished. “Drink the whole cup if you want to see what’s on the other side.”\n\nShe sipped as I spoke. “You’ve told me that Raymond’s been gone a month. You’re brokenhearted, but you can’t move on if he’s still here. The shock was terrible, wasn’t it? A hit-and-run while he was crossing the street right in front of your own home. The worst moments of your life were sprinting through the house, knowing what was outside before you saw it. The hope was the worst, because you *knew* that your husband’s broken body would be lying in the street. But the smallest part of you hoped that it wasn’t true, and that *hope* made it hurt so much more. You found him in a gory heap just beyond your front yard, and the future you’d imagined drained away like blood through your fingers. And it was in that exact moment, kneeling in the middle of the street at 7:13 p. m., that you realized your life had been permanently changed to a different path of someone else’s choosing.” I took an aggressive puff of the cigarette and pressed forward. “The sun set while you held his already-cooling hand, and you realized that this would be the first sunset you’d spend knowing he was dead, and that you would end every day with this thought on your mind from now on.”\n\nShe blanched. “I never told you that it was at sunset. I never even said it was a car accident.”\n\nI narrowed my eyes at her. “The guilt was more than you expected, because part of you had actually cared about Raymond. Yes, he was old, and *boring,* my God, you would never let him forget it. But he’d felt just so fucking fragile when you crushed his spine with the car that the anger didn’t seem to make sense in the moment.” I blew smoke through my nostrils. “He knew it was you, Cindy. You pulled the car into the driveway and rinsed off the blood so fast that no one even thought to check it for evidence. But *he* knew, and as he lay dying, unable to speak through shattered lungs, he stared at you without hate, malice, or vengeance. It was simple confusion, Cindy. Raymond never considered that you did it for the cash. His dying thought was wondering how he’d somehow been a bad husband, and he felt guilty for not knowing why.”\n\nHer eyes were shimmering with tears that I believed were genuine, but I didn’t give a shit.\n\nHer cup of tea was empty. \n\n“I was so careful,” she whispered in a pitch that was just below the ‘only dogs can hear it’ threshold. \n\nI rolled my eyes. “No you weren’t, Sweetie. People are just stupid, and that’s the only reason you’ve gotten away with everything so far. Really, putting $619,138 cash in a briefcase is just *asking* for trouble.”\n\nHer jaw hung in shock. “How could you possibly have known?”\n\nI blew one last long stream of smoke from the cigarette. “If I were in your shoes, Sweetie, I’d be much more worried about how much poisonous oleander you just had with your tea.”\n\nShe slammed her hands on the table and grabbed the edges so hard that the empty cup rattled in its saucer. *“What did you do to me?”* \n\nI pulled the cigarette butt from my lips and quashed it in her empty cup. “Make peace with whatever god or devil awaits your heart,” I answered flatly. Then I turned to look across the sun porch at the ghost only I could see.\n\nRaymond was a disgusting mess. His shattered spine had no hope of holding his torso rigid, so every limp limb flopped at unholy angles. A fountain of black blood oozed from his white lips and nose. His intestines protruded from his stomach like ground beef squeezed between grimy fingers, and the coils hung to the ground like sausage links.\n\nHe stared at his young widow. \n\nOr, I should say, the one eye that hadn’t popped to jelly was staring.\n\nI really think that Cindy would have been unnerved if she’d known he was there. \n\nInstead, she focused on me. “How long… when will it start?” She asked in utter petrification. \n\n“In just a second, Sweetie,” I quipped casually, lighting up another cigarette.\n\nRaymond grunted. He wasn’t much for talking, what with the lolling tongue dangling impotently where his missing jaw should have been.\n\n“Oh, and one last thing, Sugar.” I leaned forward and gently rested my palms on the tabletop. “Raymond wants to let you know that dying really, *really* fucking hurts.” \n\nShe froze. Behind her, despite lacking a mouth, I could swear that Raymond was smiling.\n\nThe convulsing started then, but it didn’t stop for a long time. \n\nDo you have any idea how far mouth foam can spray when a dying woman just won’t stop thrashing?\n\nI almost felt bad for her when I realized how hard she was trying to cry. \n\nThat’s a really fucking difficult task, though, when your throat is closing up. \n\nThat’s when Raymond sauntered over to her jittering body, knelt down, and gently grazed his dead fingertips across her cheek. He looked passionately into her eyes, and for just a moment, I think she looked back.\n\nThen she was gone. \n\nThe ghost-corpse took in the sight for a few moments before I interrupted him with a forced clearing of my throat.\n\n“A-*hem.*” He glanced up at me with his lone functioning eye. It was damp. “I *do* appreciate your clear instructions on how to locate the briefcase. If everything is as promised, the bill will be settled.”\n\nHe grunted and waved his limp, floppy arm at the body of his dead wife. \n\n“Her? I’ll leave her in the backyard of your house. I snuck an oleander plant into the garden during one of my nightly visits. They’re not uncommon here in Alabama, and they will explain her ‘accidental’ death nicely.” I wrinkled my nose. “And I have to say, I’ll be grateful to stop sneaking into your house each night to spook this murderous little witch. Her masturbatory moans made me gag, and I hate crawling through windows. I’m not fifty anymore, you know.” I took in a deep breath of nicotine-laced air.\n\nHe grunted again, dangling his unresponsive arm above the dead woman once more. \n\n“Hmmm?” I asked in genuine curiosity as I approached the corpse. “There’s something more?”\n\nHe shook more eagerly, spraying a fine mist of ghost blood onto the woman’s purple face. \n\n“Oh, my,” I whispered.\n\nI bent down and pried a ring from the woman’s rubbery hand. \n\n“There must be two dozen diamonds on this!” I sang. Then I slipped it onto my middle finger.\n\nIt fit perfectly. \n\n“Yes, thank you very much, I *do* accept tips for a job well done, you gentleman, you.”\n\nThis time I *know* Raymond was smiling.\n\nAnd I was, too.\n\nMy name is Patricia Barnes, and I’m a hitman for ghosts that [only I can see](https://www.facebook.com/P-F-McGrail-181784199029462/).\n\n[BD](https://www.reddit.com/r/ByfelsDisciple/)\n\n-----\n\n[What happened next](https://www.reddit.com/r/nosleep/comments/b59hoa/im_patricia_barnes_hitman_for_ghosts_that_only_i/?)", "comments": [{"id": "ej1a2g0", "author": "CassiopeiaFoon", "body": "This was utterly fantastic. "}, {"id": "ej1fss3", "author": "grizzly_pandabear", "body": "7.13pm = 1913!!\n\nI loved this oh myyy she rly had it coming for her "}, {"id": "ej1cze0", "author": "Cephalopodanaut", "body": "Nice! Some people sure deserve it. How considerate of you to help out those ghosts.\n\nQuestion: Do the ghosts you work for then get to \"move on\" after you enact revenge (or whatever other motivation) on their behalf."}, {"id": "ej1f407", "author": "Vaughawa", "body": "Haha jilled-off killed me..."}, {"id": "ej1nwej", "author": "saberloli", "body": "Is there an opening for an assistant? Broke college student asking thanks."}, {"id": "ej1mftz", "author": "koalajoey", "body": "What an interesting profession! I’d be interested in reading more. How did you get Raymond’s wife to find you? She said she called a “professional”, so you must advertise as a psychic or something?\n\nAlso, what would happen if the suitcase WASN’T where Raymond said, and the bill wasn’t settled?\n\nFantastic read tho :) thanks for sharing!"}, {"id": "ej25yqg", "author": "-Mr_Rogers_II", "body": "The police in that neighborhood must really suck.   "}, {"id": "ej1k9fy", "author": "Fadedcamo", "body": "Nice read. Guess my gender bias is showing. I pictured the narrator as a man until the end. "}, {"id": "ej2y7rr", "author": "TryForBliss", "body": "So, um, no pressure or anything, but when's the series coming out? 😅 Because if *you're* not going to write it, I'm going to need to insist *someone* does."}, {"id": "ej24mvb", "author": "taylorschneider", "body": "The concept reminds me of Odd Thomas by Dean Koontz"}, {"id": "ej1crg7", "author": "callieally", "body": "I hope you tell us more stories!! Please make this a series!"}, {"id": "ej22ddq", "author": "holajoey", "body": "Revenge is best served in a cup of tea 😏"}, {"id": "ej1mufd", "author": "futureFailiure", "body": "Is it bad that I desperately want more of this? This is fantastic!"}, {"id": "ej1p670", "author": "SilasCrane", "body": "Anne-Samantha confessed guilt in this case, and I gather that she's been doing this for a while, but I can't help but wonder how she can be sure the ghosts aren't lying. Of course, that may be besides the point, for a hitman."}, {"id": "ej1zfob", "author": "emmetmettmet", "body": "You know, I love my girlfriend and if she dies before me (god forbid), I hope she'll come back and 'haunt' me. I'd love to know I'm still able to sleep next to her... Maybe we get to cuddle while falling asleep. "}, {"id": "ej3ijy2", "author": "Jimmyrunsit", "body": "I pictured Bea Arthur as the narrator the entire time. She would fit this role so well."}, {"id": "ej1k1a4", "author": "Antiscripture", "body": "More please! This was so good"}, {"id": "ej42105", "author": "YourSpideyRoommate", "body": "Can we have a series of this?"}, {"id": "ej1isy9", "author": "TaraH419", "body": "You are amazing Patricia!  I would love to know how you got started in this business. "}, {"id": "ej2cjm9", "author": "Raiinish", "body": "This is such a cool concept!!! I love it!"}, {"id": "ej2unzt", "author": "EdgarAllanLoe", "body": "“Jilled off” had me laughing OP. But I think Raymond wants a piece of your jilly bean if you know what I mean. Giving you the ring and all. "}, {"id": "ej1cx5z", "author": "NorthWind12", "body": "Holy fuckkkkkkkkkk!!!!!!!!!!!\n\n&#x200B;"}, {"id": "ej1o2zc", "author": "EthnicLettuce", "body": "If Phoenix Wright was batman."}, {"id": "ej1rmol", "author": "EmberSanja", "body": "Absolutely delightful career choice. Would love to hear about more experiences"}, {"id": "ej1tfdk", "author": "Churchvanpapi", "body": "I know who I’m coming to once I bite the big one. "}, {"id": "ej2chiw", "author": "mistakenlysimple", "body": "The awkward moment when your mame is Cindy"}, {"id": "ej2etni", "author": "Strawberry-Cindy", "body": "My name is Cindy and this scares me."}, {"id": "ej2jbpt", "author": "Parkar99", "body": "I feel like this could be a TV show. It was that good. "}, {"id": "ej2k08x", "author": "ardendrake", "body": "So good! This is the first thing I read here this morning and it was so good! "}, {"id": "ej31d2e", "author": "jraspberry", "body": "GIVE ME A BOOK. Give me a WHOLE ASS mystery novel with THIS as the first chapter."}, {"id": "ej3cfpl", "author": "brunettexspeakin", "body": "AMAZING AND COMPELLING!!! YOURE AN EXCELLENT WRITER!"}, {"id": "ej3j1qv", "author": "renoml", "body": "Goddamn this is awesome. "}, {"id": "ej1d7j9", "author": "evswitzer", "body": "That was great!\n"}, {"id": "ej1n0gd", "author": "Turanko", "body": "Well done! I would very much like to know more. What other cases has \"Patricia\" handled?"}, {"id": "ej1lj1z", "author": "Kildor", "body": "Very good!  Can we expect more tales?"}, {"id": "ej1n1m1", "author": "funkybuttmonkey", "body": "So. Rad. "}, {"id": "ej2385g", "author": "xepherys", "body": "Okay, wow. That is definitely a unique and interesting angle. I would buy a collection of these for sure."}, {"id": "ej2f79k", "author": "SweetSue67", "body": "I would really like some other stories of your, ummm, clients.\n\nIt sounds interesting."}, {"id": "ej2zisc", "author": "Pomqueen", "body": "Fucking fabulous "}, {"id": "ej30qt3", "author": "JacLaw", "body": "I loved this. Please notify me when you post more "}, {"id": "ej3lzef", "author": "pinot__n0ir", "body": "I love this. I don't normally want series, but this demands more. I want to learn how her business works and hear more stories!!!"}, {"id": "ej3rf0t", "author": "probein", "body": "Funny how I pictured the killer as a guy the whole time, didn't even occur to me it was a woman. Really well written"}, {"id": "ej3w7dd", "author": "MolhCD", "body": "This was wonderful. And explains why you wanted to slap her so much - I thought at first you were simply the type who hated cute people"}, {"id": "ej3woal", "author": "ominoke", "body": "I knew I was right to be bothered by her care free masturbation sessions so soon after her husband died"}, {"id": "ej4wqoy", "author": "dhruvinrajgor", "body": "We really need a full fledged series on this "}, {"id": "ej4zob3", "author": "TangerineSprinkles", "body": "There MUST be MOAR!!!!! "}, {"id": "ej5enea", "author": "CheshireKatniss", "body": "\"Jilling off\" omfg why have I not thought of that before. I can't wait for more."}, {"id": "ejb7flf", "author": "Plootonix", "body": "Reminds me of Odd Thomas"}, {"id": "ejekg39", "author": "EchoOfEternity", "body": "Here's my obligatory updoot before I even read the story because it's written by BD. I love literally EVERYTHING you write! Guess you could call me a fan, haha"}, {"id": "erjhopg", "author": "yuizen", "body": "Is this the first part?"}, {"id": "ej24g84", "author": "Zom_BEat_or_BEa10", "body": "OMG OP! I FUCKING LOVE THIS!!!\n\nThat woman definitely deserved what she got! It sounds like you're performing a great service for not only the restless & wronged dead, but also taking out the trash & making the world a better place for the living.\n\nI have so many questions now! (Hope you don't mind)\nAre all your clients/cases like this? \nHave you ever made a mistake, like assassinating an innocent person? \nDoes the guilt or innocence of your target matter or make a difference?\nOr will you take out anyone for the right price?\nThank you, Ma'am, May I please have another? :)\n\nI've always been able to sense the presence of spirits, but I've never been able to see, hear, or communicate with them. One last quick question (for now): Do spirits always look the way they did at death? Or is it only the ones who were murdered or died violently?"}, {"id": "ej2hk09", "author": "jenn1222", "body": "LOVE IT"}, {"id": "ej2jhw1", "author": "Wanderer0503", "body": "That was amazing! Great job. "}, {"id": "ej2jutb", "author": "NukaDova", "body": "Holy crap that was amazing! I want this to be an ongoing series lol"}, {"id": "ej2kdxg", "author": "regularpersonaccount", "body": "Wow, well done. You had me hanging on every word. I look forward to seeing more!"}, {"id": "ej2l1nl", "author": "SullenArtist", "body": "Oh my God I love you. I need more stories!"}, {"id": "ej2ljb7", "author": "howsmytyping143", "body": "Would absolutely buy a book of these!!!!"}, {"id": "ej2mbv7", "author": "thisbrokenlife_", "body": "Need more asappppp.  Love this so much!! "}, {"id": "ej2mdzl", "author": "dabPrassion", "body": "Amazing. I need more."}, {"id": "ej2mll6", "author": "Leighanne2604", "body": "Loved it!! Totally wasn’t expecting that twist! "}, {"id": "ej2mqti", "author": "Chocospider7", "body": "Wait, so do you know what happens after death? Or..."}, {"id": "ej2ms5r", "author": "Faebertooth", "body": "Despite the harshness of the words I find this story rather poetic. Loved it!"}, {"id": "ej2mydy", "author": "SwagMastaM", "body": "I want a whole book of this holy shit"}, {"id": "ej2mz42", "author": "divinerocambole", "body": "God, this story is beyond perfect"}, {"id": "ej2nlsn", "author": "slacknarslothbutt", "body": "Now this is a cool business. "}, {"id": "ej2o59w", "author": "mixchellemybelle", "body": "WOW. Just wow "}, {"id": "ej2o7gk", "author": "Zombemi", "body": "You have to have more stories from work, I'd love to hear them! I do wonder if every job is as, satisfyingly deserved as this one ended up being.\n\nSo sweet of Raymond to tip you too! Uh, though...is he right? Does every death really, really fucking hurt?"}, {"id": "ej2pcut", "author": "tooscaredfor4chan", "body": "Amazing story, reminds me of the style of the guy who wrote I Am Legend, but I forgot his name."}, {"id": "ej2qf44", "author": "AoiOkasan", "body": "Oh wow, I want to hear more about ghosts having you bit their hitman. What an awesome job to have!"}, {"id": "ej2r5zc", "author": "HolyCrusader451", "body": "Redemption for the dead"}, {"id": "ej2rrcj", "author": "MCvonHolt", "body": "Ok I want more already"}, {"id": "ej2s7xk", "author": "A_Thought_Bubble", "body": "If the title was a statement in a game of job charades I would have guessed something completely different than the story. "}, {"id": "ej2s9pf", "author": "klg301", "body": "Can this be a novel so I can devour it???"}, {"id": "ej2sg4u", "author": "Machka_Ilijeva", "body": "I like it."}, {"id": "ej2to46", "author": "AubreyLvsPinkFloyd", "body": "YESSSS! LOVED THIS!!"}, {"id": "ej2tvix", "author": "DanaiDuma", "body": "Fuck. I need more. "}, {"id": "ej2twiv", "author": "MrsRedrum", "body": "Fuckin. Dope.\n\n&#x200B;\n\nThis was such a great read!"}, {"id": "ej2u4dt", "author": "Couldnotthinkofname6", "body": "this is really good."}, {"id": "ej2ucet", "author": "fightmaxmaster", "body": "Fantastic work, and she got what was coming to her. I hope to read any more of your exploits that you're willing to share!"}, {"id": "ej2veow", "author": "SlippyIsDead", "body": "Loved this!!!!! Wow! "}, {"id": "ej2vfty", "author": "bitchkitty818", "body": "Wow! This is fantastic! Felt like I was right there with you. Please write more stories!"}, {"id": "ej2w8db", "author": "UnstoppableChicken", "body": "Definitely gpong on my favorite stories list. "}, {"id": "ej2wrlv", "author": "xyrenos", "body": "Good read."}, {"id": "ej2y23u", "author": "mylifeisadankmeme", "body": "LOVED ❣"}, {"id": "ej2yql2", "author": "Dasha-Fan", "body": "This is great"}, {"id": "ej2z43m", "author": "Eibrab22", "body": "This was amazing! Please let there be more!"}, {"id": "ej31d5g", "author": "Spectrum2081", "body": "Audiobook?"}, {"id": "ej33vg0", "author": "StandardDeviat0r", "body": "*slams table* ANOTHER"}, {"id": "ej35ac4", "author": "machsh", "body": "Series please!!!"}, {"id": "ej36hqw", "author": "catinthecupboard", "body": "This better be a series!"}, {"id": "ej37a0y", "author": "SomeRandomNerd27", "body": "Fuck yea\n\n\nAfter life \n*Kill a player after you die*"}, {"id": "ej37auv", "author": "MunsterEater", "body": "This was a great read. "}, {"id": "ej3955o", "author": "JLW2710", "body": "I loved this! I hope there is more!!!!"}, {"id": "ej396kc", "author": "c0mradekast", "body": "Wao"}, {"id": "ej39tey", "author": "KatMite36", "body": "I’m hooked! Hoping to hear more from you!"}, {"id": "ej39twx", "author": "mommybug6", "body": "This was awesome! I think a sequel is in order if you don’t mind. ❤️"}, {"id": "ej3aa6l", "author": "Midwest88", "body": "Fuuuuuuckkkkk."}, {"id": "ej3azsn", "author": "geesup78", "body": "One of the best written stories I've read on Reddit. Great job! "}, {"id": "ej3bwx9", "author": "peachyhans", "body": "I would LOVE to read a series like this"}, {"id": "ej3d9h7", "author": "SuzeV2", "body": "Omg. So love this!  I hope you have more stories to share Ms Barnes! Your line of work is quite intriguing!"}, {"id": "ej3eebd", "author": "getin_thebin", "body": "JILLED OFF that killed me hahaha\n\nBut this. Amazingly written. Holy smokes."}, {"id": "ej3i25z", "author": "BigL_to_the_Oser", "body": "nice"}, {"id": "ej3j9ce", "author": "sassy-in-glasses", "body": "Have any famous ghosts hit you up before?"}, {"id": "ej3jlko", "author": "blkgemini84", "body": "I enjoyed this, please write more!"}, {"id": "ej3kc25", "author": "g_hoop", "body": "Fuckin’ Cindy. Loved the story! "}, {"id": "ej3kpgs", "author": "Lemmegeta20piece", "body": "Damn this was fantastic!"}, {"id": "ej3l2u6", "author": "rusty_sp00ns", "body": "Wow! Pacing, vocabulary, tone, you hit it all! Excellent read"}, {"id": "ej3lunj", "author": "pjerky", "body": "More, give me more of these stories. Awesome!"}, {"id": "ej3ml35", "author": "MudDauberDigs", "body": "This is incredible! You should pitch your life and work as a story to SyFy! \nIf you write a book about your adventures, I'd love to read it!"}, {"id": "ej3n0gz", "author": "Weird-isalligot", "body": "That sounds like a really fun position! "}, {"id": "ej3oug8", "author": "isevery1madorjustme", "body": "Absolutely fantastic!  Please tell me there's more stories your willing to share with us! "}, {"id": "ej3pisq", "author": "braveone772", "body": "Amazing work. Awaiting more installments."}, {"id": "ej3pue8", "author": "MaktaKim", "body": "Nice one!! Totally immersive"}, {"id": "ej3qa8o", "author": "Maltohbr", "body": "Nice, reminds me of the movie Sixth Sense"}, {"id": "ej3r778", "author": "amusingbush23", "body": "Absolutely brilliant! Would love more!!"}, {"id": "ej3s0jw", "author": "bounie", "body": "Are you currently free for bookings? "}, {"id": "ej3s8ep", "author": "Teekoo", "body": "Wait, do you understand the ghosts when they speak even with messed up jaws or whatnot?"}, {"id": "ej3svfd", "author": "depressedandold", "body": "A good story"}, {"id": "ej3sw22", "author": "scbejari", "body": "Sweet!!!"}, {"id": "ej3tlbc", "author": "Shadow393", "body": "Awesome story! "}, {"id": "ej3u9la", "author": "butwhoisjasmine", "body": "Thanks I love it!!!!"}, {"id": "ej3yq4g", "author": "killerpro360noscope", "body": "Damn, nice story hoping to read more!"}, {"id": "ej402tu", "author": "Dokidokita", "body": "omg, I want more \\*-\\*"}, {"id": "ej414ih", "author": "kcalpha", "body": "Fresh."}, {"id": "ej4cl9i", "author": "AtotheCtotheG", "body": "What a senseless waste of human life.\n\nSweet ring, though. "}, {"id": "ej4fo23", "author": "The-Morningstar", "body": "Patricia, you really remind me of my chain-smoking, tea-brewing, ghost-seeing Southern grandma (who I don't think would hesitate for even a second to poison someone at a ghost's behest). Any chance we're related? If you've got a sister in Mississippi, we'd love to have you at the family reunion, especially if you've got more stories... "}, {"id": "ej4j6pn", "author": "christab123", "body": "This is the best story I have ever read..... ever"}, {"id": "ej4wlb1", "author": "dhruvinrajgor", "body": "This is the best story man. "}, {"id": "ej5gh9w", "author": "_Pebcak_", "body": "Have you always seen ghosts, or is this a newfound talent?  Just wondering, b/c people who can see ghosts clear as day always intrigue me.  Me, I kind of only see them as if they are a daydream and never when they are all broken like you see them; they look usually normal but for the dated clothes or slightly pale skin.  I've heard that they appear in a way that won't scare you...so if THAT doesn't scare you, you must be an expert in this kind of thing. :)"}, {"id": "ej5jagu", "author": "MitsuruSenpaii", "body": "OP is a female? Man, I didn't thought! Was great, hope there are more jobs like this. "}, {"id": "ejacorv", "author": "mekmeesk", "body": "this... just wow"}, {"id": "ejb5ob7", "author": "theLazyMeater", "body": "Towards the end, I was wondering how you'd benefit from this. Then the briefcase's location was mentioned. And as I sat back and started wondering what your job was...you introduced yourself.\n\nAfter that I started imagining the opening of a new TV series. lol."}, {"id": "ejbwsu1", "author": "yuklz", "body": "I would love to know if *real* ghost whisperers exist.. "}, {"id": "ejce134", "author": "feathalight", "body": "u/maverick8787 you should read this!"}, {"id": "ejda89n", "author": "SpikefallSteve", "body": "Good job, you really kept the story interestesting."}, {"id": "ejdair6", "author": "sadiebenz", "body": "This needs to be a book!! Please take my money!"}, {"id": "eje9ld8", "author": "streemline", "body": "I think we can shut down SOTM"}, {"id": "ejexy47", "author": "Cathayan82", "body": "That’s just an amazing story 👍👍👏👏"}, {"id": "ejh9u9j", "author": "SaberBugsIsland", "body": "Awesome - I think it's great of u to help the dead. Making use of your gift.   🤤🍵"}, {"id": "ejkh33b", "author": "mavstrong7", "body": "If dew Deadpool and Constantine had a baby this would be her"}, {"id": "ejmrrvd", "author": "Sir_Flagrant", "body": "Damn good story and writing. I wish I could hire you. (not for writing). "}, {"id": "ekg81zw", "author": "Maliagirl23", "body": "Okay you caught me. A total fan now"}, {"id": "el2xbq8", "author": "Eminemloverrrrr", "body": "So so good!!!"}, {"id": "ellqnpn", "author": "justanaccount80", "body": "Holy shit, I was lost in the words. Please tell us what happens next!!! Come on!! I'm dying for more over here!!"}, {"id": "elnde2i", "author": "Laice1", "body": "Is this from your book?  Couldn't stop reading. Haha."}, {"id": "emvmho7", "author": "vegas167", "body": "One of the best stories I've read"}, {"id": "ennm5n0", "author": "tardgard69", "body": "just reading the title I thought the job was porn"}, {"id": "eqp1fu3", "author": "Travellingtrex", "body": "This was fucking phenomenal. What an incredible concept. Thank you, OP. You have the coolest job."}, {"id": "euxbleg", "author": "RyzingxFire", "body": "This is amazing"}, {"id": "ej1nqkm", "author": "warple", "body": "I hope we see a lot more cases from you!"}, {"id": "ej1c1yy", "author": "Ongoglosalem", "body": "wow."}, {"id": "ej1h4wq", "author": "tbrower925", "body": "Amazing "}, {"id": "ej1hd8y", "author": "SnowyJ", "body": "More please! :D"}, {"id": "ej1ie2i", "author": "Night_Of_Storms", "body": "👌"}, {"id": "ej1ljcg", "author": "tonikscul", "body": "Utterly amazing. "}, {"id": "ej1pisv", "author": "bigmattb28", "body": "Brilliant. Simply brilliant"}, {"id": "ej1q97i", "author": "lrjk1985", "body": "OMG FIVE STAR WRITING I LOVE THIS!!"}, {"id": "ej1yfa7", "author": "ferla16", "body": "Cool!"}, {"id": "ej25u3o", "author": "CaillteSaGhaoth", "body": "I *loved* this! Please write more of these"}, {"id": "ej26s00", "author": "Michael_J_Caboose_85", "body": "Fuck yeah man, this was so good! "}, {"id": "ej28d9i", "author": "KezefTheDead", "body": "I would very much like to read more stories about Patricia's line of work.  Very, very much."}, {"id": "ej2ci5k", "author": "rekt25", "body": "Fucking love this!! Bravo!! 👏👏👏👏"}, {"id": "ej2kswt", "author": "gildedstrife", "body": "I'd love for this to turn into a series! "}, {"id": "ej2op2b", "author": "ransomnoteface", "body": "Omg please write more!"}, {"id": "ej2skkg", "author": "Facebawx", "body": "I wish you'd write like thirty more. This is like an awesome episode of a binge worthy TV show. "}, {"id": "ej2uyiu", "author": "Tyrianne", "body": "This is, hands down, the best story I've read lately. Hope there's more to come! 😀"}, {"id": "ej20tyk", "author": "Kemerd", "body": "LmaO what"}, {"id": "ej2tj9i", "author": "socksandsandals44", "body": "Couldn’t get past the description of the client at the beginning. Nauseating. "}, {"id": "ej2yb82", "author": "bloodoflethe", "body": "Loved it.  (only problem I had is using quipped when there was no quip)"}, {"id": "ej3l17y", "author": "uncreative-teen", "body": "Pleeeeease write a book about this "}, {"id": "ej3xic9", "author": "Clementea", "body": "I dun get the ending...\n\n&#x200B;\n\nAlso just how loud is her moan..."}, {"id": "ejzo4sa", "author": "3-2-1_liftoff", "body": "Great story!! Thank you. Patricia’s voice, from the swearing, to “I noticed,” to Cindy (and Anne-Samantha is a beaut) is wonderful. Such a pleasure to share that world with a hard-boiled and unpretentious mensch.\n\nWhen Patricia said “I quipped casually” it clanged like a cowbell, though."}, {"id": "f04qnof", "author": "dildodicks", "body": "how can being hit by a car have the same effects as you being put through a meat grinder as the description of raymond shows quite clearly?"}, {"id": "ej24qzn", "author": "seagoatdiaries", "body": "King himself could have written it. 10/10. "}, {"id": "ej3d9a0", "author": "TNAEnigma", "body": "Great story. On another note I don’t think anything disgusts me more than cigarettes. I immediately think the lowest of a person when they light a cigarette. "}, {"id": "ej1rd0h", "author": "ArcaneTrickster777", "body": "Do you have more stories? I'd love to hear them. "}, {"id": "ej1rwzg", "author": "HPDMeow", "body": "Please write more! This is absolutely brilliant and deserves a platinum (if only I could give you one lol)."}, {"id": "ej1t7tu", "author": "MLeyland", "body": "Your writing is fantastic, this made me tingle. I absolutely loved it. I would like to know more about Patricia Barnes. Please write more."}, {"id": "ej1uob5", "author": "mommiebear2", "body": "Oh I do hope you have more clients to share with us about!"}, {"id": "ej1vz8t", "author": "herowin6", "body": "Oh my GODD pleaSssseeee make this a series .... I will read!! Every one!"}, {"id": "ej1w1ax", "author": "OpiumChic", "body": "I love this so much, I really wasn’t expecting it "}, {"id": "ej1wxzq", "author": "Andreiyutzzzz", "body": "Do more. PLEASE "}, {"id": "ej1ymiu", "author": "etoilefemme", "body": "THIS IS SO COOL"}, {"id": "ej1yvy9", "author": "laughlovelive41", "body": "Please tell us more of your cases!"}, {"id": "ej1zwwr", "author": "baduncle69", "body": "Brilliantly well written! Loved every word of it :)"}, {"id": "ej20g7w", "author": "creepypgirl79", "body": "Omg absolutely amazing.  Please tell more about Miss Patricia does"}, {"id": "ej20msm", "author": "Dragonflt", "body": "Oh this was so good! Please write more!"}, {"id": "ej215ab", "author": "Solace_spark", "body": "That was fantastically written!! "}, {"id": "ej217wp", "author": "Lonewolfeslayer", "body": "God this is a thing of beauty, well done."}, {"id": "ej23n8n", "author": "brethebeee", "body": "That's frickin cool"}, {"id": "ej24a4d", "author": "Michele_Writes", "body": "I loved this!!! Wow!"}, {"id": "ej25jel", "author": "ladyhallow", "body": "yes! yes yes yes yes yes!"}, {"id": "ej25o60", "author": "dulyimpressed", "body": "Oh my god, I love this. Please write more!"}, {"id": "ej26q57", "author": "Texxon1898", "body": "*sarcastic clap*"}, {"id": "ej280xu", "author": "Shinigami614", "body": "Brilliant"}, {"id": "ej29npz", "author": "simplicity38", "body": "Nice work!"}, {"id": "ej2ac14", "author": "wearyriver", "body": "oh my god. PLEASE more!!!"}, {"id": "ej2aouj", "author": "spiderfalls", "body": "God I hope there are more to come!"}, {"id": "ej2b1x2", "author": "ChrisJT603", "body": "Wow"}, {"id": "ej2b822", "author": "CrochetedKingdoms", "body": "NICE!!!!"}, {"id": "ej2bfqs", "author": "thealgrey", "body": "Oh goodness. I would love to hear about more of your clients."}, {"id": "ej2bmmz", "author": "tomary98", "body": "Please I'd love to read more of your stories Patricia!! "}, {"id": "ej2by2m", "author": "icedak", "body": "Wonderful I loved is and would read more. "}, {"id": "ej2coak", "author": "princessmoonbeam2014", "body": "I am spellbound!!! Sending positive vibes in Hope's of more client tales!!!"}, {"id": "ej2dfbi", "author": "mindfunkie", "body": "This was just great. Can't wait to read more!\n\n&#x200B;"}, {"id": "ej2dt55", "author": "bi_polargurl", "body": "This was great! "}, {"id": "ej2e2z5", "author": "Skydog-13", "body": "That's fuckin awesome!"}, {"id": "ej2fcnn", "author": "kbsb0830", "body": "Wow"}, {"id": "ej2gwce", "author": "babybluebonny", "body": "This was amazing omg"}, {"id": "ej2h7ze", "author": "Hellangel72", "body": "Damn, I would love to see a Dresden Files crossover ! "}]}