{"id": "b4vyxc", "title": "She Sold Happiness in Glass Jars", "url": "https://www.reddit.com/r/nosleep/comments/b4vyxc/she_sold_happiness_in_glass_jars/", "subreddit": "nosleep", "author": "flard", "text": "The poster read, “Happiness! Sold in Glass Jars! Call Today!” and underneath the text was a phone number.\n\nI was walking home from a long, exhausting day of work when I caught a glimpse of the paper stapled on an old telephone pole. I took a picture of it thinking it was amusing.\n\nI was going to show my wife once I got to our apartment, but I was caught up with chores and forgot about it—dinner, dishes, laundry, packing a snack for our daughter, putting her to bed, then putting her toys away that she’d left out in the living room—every night, it was the exact same routine.\n\nThe next day, I awoke sleeping back-to-back with my wife. I always had to get up earlier than she did for my job, so I quietly got ready for the day and headed out the door.\n\nAt work, I was updating the company’s latest expense report. Most days were similar to this one. They were basically paying me to stare at a computer for nine hours a day and input a couple numbers in to a spreadsheet. I finished my work very quickly, so I decided to head out of the office early—it also helped that it was a Friday, and a lot of people leave early at the end of the week.\n\nOn my walk back, I was thinking of what my life had become. I did this often. I always dreamed of traveling when I was younger. I wanted to drive across the country or solo-backpack across Europe. Then I met Kelsey. Don’t get me wrong, I loved Kelsey. I mean, I still do. We just don’t have that spark anymore. When you meet someone and get in a relationship, whether it’s *meant to be* or not, some of your personal life-plans have to be put on hold. And then that relationship turns to marriage, and then you have a baby, then you have to enroll your daughter in a preschool, then you have to get a better paying job and work more hours and blah, blah, blah.\n\nI’m not trying to throw a pity party for myself. I’m just saying I wasn’t exactly content with where I was in my life. I wouldn’t have referred to myself as a happy person.\n\nAs I took the same route home that I did every day to work and back, I walked by the same poster I had passed the day before. I don’t know why, I really don’t, but I decided to call the number. I figured it would be some joke. Maybe someone just picks up and says, “I love you!” on the other end and hangs up. Or maybe it’s a line to a sex-worker. I had no idea what to expect.\n\nI called. It only rang once before someone picked up.\n\n“Hello?” a woman said. \n\n“Uh, hi—um, I’m calling about your poster? Your ad?”\n\n“Oh, awesome,” she said calmly, “when do you wanna pick it up?”\n\n“Pick what up?”\n\n“The jar…” she said, like it was the most obvious thing in the world.\n\n“Oh, of course, um,” I realized then that I had left work early without telling Kelsey, so I could just go pick it up now and she’d be none the wiser, “what exactly is it? That your selling?”\n\n“I just told you. It’s happiness. In a glass jar. Like the poster said. Happiness keeps best in glass jars. They’re more durable than, say, a plastic bag.”\n\n“Um, okay. Should we meet somewhere?”\n\n“For sure. I don’t want you to end up being a creep or something, so let’s go to a public place.”\n\nThe public place we decided on was a Starbucks parking lot a little over a mile from me.\n\nNow, I didn’t think I was really going to be buying a *jar of happiness* or whatever. I was 99% sure she was going to sell me drugs. Maybe heroine would be in the jar. I remember thinking, *Oh no, ‘happiness’ is probably a nickname for some street drug and I’m going to a drug deal. What if she’s a cop? Am I going to be arrested?* But something inside me told me to keep walking, and so I did.\n\nI stood outside and texted her.\n\nMe: **I’m here.**\n\nHer: **Cool. Be there in a sec.**\n\nMe: **What are you driving?**\n\nHer: **Silver Camry.**\n\nAnd as her final text came through, I saw her car pull in. She took a spot not too far from where I stood. I could see there was no one else in the car, which put my kidnapping fear to rest. She opened her door and stood on the pavement, looking around until her eyes met mine. I gave her a little nod of acknowledgment. She simply responded by waving her hand, gesturing for me to come over to her car, so I did.\n\nShe was young, maybe mid-twenties, with curly, golden hair. Her skin was pale and contrasted with the all-black outfit she was wearing. I thought she looked like Glinda the Good Witch from *The Wizard of Oz* had put on the Wicked Witch’s clothes.\n\n“Nice day out,” she said as a greeting.\n\n“Oh, yeah it is. Hadn’t really paid attention to it.”\n\n“You *were* the one that called about the jar, right?”\n\n“Yeah, that was me.”\n\n“Cool, well, here you go.”\n\nShe handed me a very small, glass mason-jar. It couldn’t have been more than two inches tall. Inside of it was a light. Not a light bulb—just light. It was like someone bottled up sunshine. It glowed even in the midafternoon daylight. It looked like a tiny sun, or a tiny universe existing in this little crystal-walled home. I was admiring it with no attempt to hide the awe on my face.\n\n“Pretty rad isn’t it?”\n\n“What—what is it?”\n\n“You’ve asked that, like, three different times, I think. My answer is still the same. It is happiness. Happiness in a glass jar.”\n\n“What do I do with it?”\n\n“Keep it,” She said simply, “if you have any problems shoot me a text.”\n\nShe started to get into her car.\n\n“Wait!” I said, “I thought you were selling this? How much is it?”\n\n“Don’t worry, man,” she said with a smile, “you’ll pay.”\n\nShe closed her door and I stepped out of her way as she backed up, then drove off. What the hell had just happened? What was I holding? I looked down at the jar again, its radiance was simply mesmerizing. I put it in my pocket and could see its glow slightly through my pants. I began to walk home.\n\nWhat was just a nice, sunny day, quickly changed into a rainy one with clouds wrapping the sky. It was not forecasted that it would rain, or else I would’ve ridden the bus or subway to work that day. I jogged home trying not to get too drenched. I finally found shelter once I made it to my apartment building.\n\nI walked up to my door and found that my key wasn’t on my key ring anymore. *Shit, I can’t believe I lost it again,* I thought.\n\nI knocked on the door and said in a somewhat loud voice, “Hey babe it’s me, I don’t know what happened to my key.” I heard the door being unlocked from the other side.\n\nWhen the door opened, I was greeted by a large, heavy-set man with greasy hair and unkempt goatee, he said, “I think you got the wrong door, bud.”\n\n“Oh!” I said, disoriented, “my bad, sorry, have a good one.”\n\nHe let out a chuckle as he closed the door. \n\nApartment number 33.\n\nI know that was my apartment. I know it was. I’d been in apartment 33 for five years now. But *that* was not my apartment. From what I could see inside, all the furniture was different, it was painted a different color, it was all wrong. I felt like I’d hit my head and was drugged. In that moment, nothing made sense.\n\nI pulled out my phone to call Kelsey so she could calm me down and tell me I just got confused for a second. But her contact wasn’t in my phone. In fact, nothing was in my phone. I had no messages with her. No previous calls. No pictures. It was like my phone reset to its factory settings. Did that girl somehow switch my phone out when I wasn’t looking? I would’ve just dialed Kelsey's number manually, but I couldn’t quite remember it. I had known it by heart before, but not anymore. I needed to get back to the office, I had all my contacts backed up on my work computer.\n\nSince it was still raining, I hopped on the bus which had a stop right in front of the apartment complex. I rode downtown toward my office, the whole time staring at my wet shoes, wondering what the hell was going on.\n\nWe have a keycard access to our building so only authorized personnel can get inside. I always keep my access card in my wallet, always. But, surprise, surprise—it wasn’t there. I buzzed in to the speaker we had for guests with appointments, or employees as a back-up in case anyone lost or forgot their card. \n\n**BZZZ** \n\n“Hey this is Tim, I must’ve lost my card. My employee number is…” I stopped as I drew a blank.\n\nA voice came through the Speaker, “Tim? You got cut out, what’s your employee number?\"\n\n“Um, I can’t remember, I—”\n\n“That’s fine, just tell me your full name and department.”\n\n“Uh, finance. I’m in finance. My full name is Tim Brooks.”\n\n“One sec.”\n\nAbout thirty seconds later, the man spoke to me again.\n\n“We don’t have a Tim Brooks working in this building. Did you have an appointment with someone?”\n\nI backed up in surprise, almost tripping on my own feet. I had just been in that office an hour or two ago. What was happening to me? I felt like I was getting Alzheimer’s but going through every stage in one day. I stared at my hands, unsure if I was in the right body. I felt like the world around me was disintegrating. I wasn’t in control, I was merely sitting inside somebody else’s head, watching the world through their eyes.\n\nJust then, I got a text. I recognized the number immediately, it was that girl. The one who gave me the jar. I had forgotten all about it until I saw her text.\n\nHer: **Hey. How’s it going?**\n\nI looked at my phone, dumbfounded. It made me angry she was so nonchalant about this. *She* knew what was going on. *She* had done this somehow.\n\nMe: **What the hell did you do to me?!**\n\nHer: **The worst is yet to come.**\n\nI was astronomically close to just chucking my phone as far as I could in frustration. I took the jar out of my pocket. It looked unchanged, still glowing just as bright.\n\n“What the fuck did you do!” I yelled at the jar, realizing I probably looked like a lunatic.\n\nAs I stared at its glistening glass, I realized something. I didn’t know what my wife’s face looked like anymore. I knew her name. Well, I know it started with a K, or maybe a C. I couldn’t picture her in my mind. I knew I had a wife. I knew I did. Yes, because I had a daughter. I had a wife and a daughter. I just, couldn’t remember their faces then—or their names, or their birthdays, or any memories I had with them.\n\nI know they existed. They did exist. I had just seen them that morning, right? I couldn’t remember how she looked, or what she smelled like. What was our first date? We had a wedding, right? What about our first kiss? Or my daughter—or was it my son? Maybe I didn’t even have a kid. But my wife, or girlfriend, she was real. I knew she was. The thought was tearing me apart. I couldn’t see her in my head. I couldn’t recall a single fact about her.\n\nI was standing outside of the same building, but I was unsure why I was. Did I work there? I must work somewhere. The rain was accompanied by a chilly wind now. It was whipping at my face, making my nose and cheeks sting. I wanted to go home. I wanted to be with her. I wanted to be warm. I wanted to go in to a shitty office job that kept a roof over my head. I wanted it all. I was soaking wet. I was miserable. I couldn’t remember my parents, or my childhood. Did I even have any friends? Why was I in the rain?\n\nI looked down at my hand. I was still clutching the jar. The only memory of my entire life I could concretely remember was that girl giving it to me. Telling me it was happiness. It did not bring happiness. It brought pain. It bought suffering. I was more miserable in that moment than I’d ever been.\n\nMy phone buzzed:\n\n**Break the jar, Tim.**\n\nI looked at my other hand. With the setting sun and the rainy sky, I swear the jar glowed brighter than any street light near me. I didn’t break it because I was following her instruction. I broke it because I was angry. I broke it because I was upset. I needed a release. I raised my arm above my head, and brought it down with one swift motion, shattering the jar on the concrete beneath my feet.\n\nThat dark, chilly air accompanying the rain spread away like it was the shockwave of a bomb going off, and I was at the epicenter. I saw the warm, yellow light from inside the jar spread rapidly across the ground and ascend into the sky. It was as if I was watching the beginnings of the universe being created—like God had just snapped his fingers and said, “let there be light.” I was engulfed in it. I could no longer see street or rain, or anything dark. I felt like I was plummeting into a star going faster than the speed of light. It felt like sitting in front of a fire on a cold winter’s night, but that warmth was covering every inch by body.\n\nAnd then I blinked.\n\nImmediately I could feel the sheets beneath me, and my back barely touching my wife’s. I was staring out the window. The morning light drenched through the glass and gleamed on my face.\n\nI stood from bed and grabbed my phone. It was Friday morning. I had one text:\n\n**Let me know if you ever need another jar :)**\n\nI called in sick to work. I snuck into my daughter’s room and greeted her with a kiss and told her she didn’t have to go to preschool today. We were going to have a family day. She smiled and stretched out her arms with a yawn before curling up and falling back asleep. \n\nI got back in bed and squeezed my wife tightly. I didn’t let go for hours. Our daughter came into our room and woke us up eventually—she was jumping on the bed and shouting for us to wake up. Yesterday I may have found that annoying. Yesterday I may have found a lot of things annoying, or monotonous, or dull.\n\nBut not today. Today, I pulled her under the covers in between me and Kelsey.\n\nToday was going to be a good day. Today, I was happy.", "comments": [{"id": "ej9rcax", "author": "wecantdothisnomore", "body": "I must have a jar like this without knowing. Everything is falling apart. Must find jar. Must break jar. Must."}, {"id": "ej9mezx", "author": "RedheadRiot", "body": "Thanks for reminding me to break my jar, too, man."}, {"id": "ej9nnwc", "author": "gxbplayer123", "body": "Maybe it was Glinda, after all!"}, {"id": "eja0f38", "author": "fix-me-up", "body": "Thank you for this.  8 months ago I broke free from a heroin addiction and sobriety has very much felt like I’ve broken my jar.  Sometime I feel an urge to go back and need to remind myself of how bad it was so I walk my old streets, read my old journals, or check in on some of my using buddies, it’s kind of my way of getting or remembering having that jar.  "}, {"id": "ej9qndl", "author": "vixen-vengeful", "body": "Saving this to read whenever the monotony of day to day life starts bringing me down."}, {"id": "ej9lz1w", "author": "Amyvix", "body": "But what a price to pay. Cant imagine the pain of forgetting everything you are, everything you have, everything you've worked for."}, {"id": "ej9r4an", "author": "Cephalopodanaut", "body": "Man, this is just amazing. Too often so many of us don't appreciate what we have. What a great reminder. "}, {"id": "ejasbi9", "author": "RELIN-Q", "body": "Wait a minute, I came here to be scared, not emotional!"}, {"id": "ej9wkeh", "author": "lpnmom", "body": "What a beautiful reminder to be thankful for the monotony of everyday life. "}, {"id": "ej9sbh9", "author": "xZero543", "body": ">You Don't Know What You Have Until It's Gone"}, {"id": "ej9vwj5", "author": "kazerama", "body": "Only when we reach a low, do we treasure our current state, even if it isn't a high point.\n\nReally nice touch to this."}, {"id": "ejalyp7", "author": "AshRavenEyes", "body": "What happens now if a truly sad person buys this jar?"}, {"id": "eja2j6f", "author": "HelloMissMurphy", "body": "Now THAT was good. Beautifully written, word for word."}, {"id": "ej9omud", "author": "lolipopcorn", "body": "This story makes me happy knowing how it ends . Always be happy 😊. "}, {"id": "eja7lk1", "author": "CallMeTank", "body": "Fuuuuuuuuuuuuuuck.  Thank you."}, {"id": "ejl07iz", "author": "Skyhawk_Illusions", "body": "Don't it always seem to go  \nThat you don't know what you've got til its gone  \nThey paved paradise  \nAnd put up a parking lot"}, {"id": "etsqbo8", "author": "end_liberalism", "body": "She sold you her bath water"}, {"id": "ejb1oy2", "author": "FedoraSpy", "body": "I have a different interpretation of this story. I think OP lost true happiness at the end. His happiness, as stated in the beginning, did not include his wife and responsibilities. The jar removed them without consequence, allowing him to live out his true dreams. By breaking it, he gave up his ultimate happiness for his previous life. "}, {"id": "ej9tqqa", "author": "grizzly_pandabear", "body": "This is so beautiful?? This story was like my glass jar, made me realise how thankful I should be for what I have right now :')"}, {"id": "ej9v75p", "author": "crabcancer", "body": "True. Only with sadness do you understand happiness. "}, {"id": "erbrujz", "author": "greatveejay", "body": "OP thank you for the inspiration. Your story us my jar. You gave me hope I will normt kill myself today or even think about to kill myself. I will treasure all time and every hour with my family.i have realized now hiw happy I am. Thank you so much."}, {"id": "eja9wls", "author": "minniemcgon", "body": "This story made me emo"}, {"id": "ejarvbw", "author": "MariusJP", "body": "Wow. Just wow. This hit home. Lemme explain:\n\nI have 2 kids, one since I was 21 (I'm 32)... I used to have thoughts like: \"is this it?\" - \"I have a kid with her so I'm stuck\" etc..Then rewind 5 years ago. We split up. After some accusations going back and forth and having a bit of 'freedom' we started doing stuff we hadn't done in the years before the split. Every weekend another town another zoo/swimming pool/museum. We got back together after 7 monts and now we have a second daugther and have been together for 11 years.\n\nThat split was our 'glass jar'.\n\nI have an amazing girlfriend, a great job, a mancave and 2 beautifull daughters. Enjoy life.\n\n&#x200B;\n\nIt can happen, have faith and love life."}, {"id": "ej9r3je", "author": "accioserotonin", "body": "We should all start carrying a metaphorical jar of happiness around; this was great!"}, {"id": "ej9xosc", "author": "benzene88", "body": "This is beautiful. Everyone needs to break their own happiness jars once in a while. "}, {"id": "eja6zty", "author": "carmine82", "body": "That's so powerful. She gives you what I'm assuming is a jar with a spell to take away essentially your whole life, which makes you appreciate it more"}, {"id": "eja88kg", "author": "holajoey", "body": "Always appreciate what you have! Family is the best 😁"}, {"id": "eja8ytp", "author": "katfishkelly", "body": "this is beautiful. I absolutely adored this story"}, {"id": "eja95gu", "author": "geniusiq", "body": "Well done!"}, {"id": "eja9qer", "author": "tdm17mn", "body": "Wow, that was an amazing story. Fantastic job!!! Please write more! "}, {"id": "ejabdmu", "author": "orioltheoreo", "body": "thank you so much for this. Time to break the jar too!"}, {"id": "ejabngh", "author": "legomaster3690", "body": "I loved this. I thought it would have taken a different turn - his life with his wife/daughter/job was actually fabricated by the jar and it had ran out."}, {"id": "ejadcl3", "author": "SuzeV2", "body": "Gotta find happiness in what you already have... nice write..."}, {"id": "ejaka08", "author": "mosaicevolution", "body": "Sometimes we dont realize our happiness is right in front of us. Wonderful read."}, {"id": "ejan4zg", "author": "Guy2ter", "body": "I see what this does, I think it the jar resets your mind and your world but when you break it, you go back to the time you first woke up for the day and you’ll feel relieved and happy..."}, {"id": "ejauw6v", "author": "agakongen", "body": "reality is often not disappointing"}, {"id": "ejaw1e9", "author": "Texxon1898", "body": "You, people, do realize she's doing it for her own enjoyment right? "}, {"id": "ejb3lre", "author": "UnstoppableChicken", "body": "Going through a rough time, I really needed this. Thank you. "}, {"id": "ejcayrq", "author": "bedtyme", "body": "I really needed this today. Thank you. "}, {"id": "ejcboyu", "author": "jessicapostpavilion", "body": "I hope you don’t mind me sharing this with my middle school students. I think the message is so important. "}, {"id": "ejcz6d8", "author": "SordidCanary", "body": "Honestly one of the best pieces I've ever read on this sub..."}, {"id": "ejkaowv", "author": "SirCarlt", "body": "Awwww this is so wholesome "}, {"id": "ejaa2pg", "author": "VirtualDeliverance", "body": "So I guess the moral is \"Enjoy what you have because you're never gonna have more than that. At most, something will be taken away from you.\" Now *that*'s some scary prospect."}, {"id": "ej9pip1", "author": "CeCeIsNotCharles", "body": "Why would you cut onions in here like that? :’|"}, {"id": "ej9kugk", "author": "xemily25", "body": "This is so cute and heartbreaking, love it 😂 x"}, {"id": "ej9mznw", "author": "rachelwhitneyb", "body": "Okay I love this "}, {"id": "ej9ye0g", "author": "Azdeleigh", "body": "This is beautiful actually."}, {"id": "eja5dth", "author": "yogawithvivian", "body": "That was beautiful "}, {"id": "ejaaaui", "author": "nosleep4reelz", "body": "Fantastic. Thank you for sharing this. "}, {"id": "ejacr5o", "author": "gingabread2465", "body": "Man I need me one of those jars"}, {"id": "ejae5g6", "author": "basic_rick", "body": "can I buy one of these jars at walmart? "}, {"id": "ejah7n0", "author": "Mr_TheGuy", "body": "Gives me psychedelic vibes, like you experienced ego death and had a bad trip, but that only strengthend your appreciation of the world. "}, {"id": "ejakemh", "author": "insert_trademark", "body": "This was beautiful OP! Everyone needs a mason jar of happiness sometimes :))"}, {"id": "ejalz4g", "author": "Patricetaylor88", "body": "I loved it! Imma break my jar today! 😍🤗"}, {"id": "ejamhvd", "author": "CatLady1213", "body": "This was lovely. "}, {"id": "ejamy27", "author": "CatWithAheadset", "body": "One of the most beautiful stories i’ve ever read. Nice one!"}, {"id": "ejanq9k", "author": "spanishhhomework", "body": "This is so so great, really love this whole thing and I was crying by the end. "}, {"id": "ejaqvkl", "author": "ambertan23", "body": "Some days i need that jar. But im thankful most days i don't. "}, {"id": "ejaqzxa", "author": "noshxxn", "body": "God knows I need one of those jars. "}, {"id": "ejavr09", "author": "ygtrash", "body": "oddly wholesome. reminds me to appreciate the small things in life"}, {"id": "ejb0fva", "author": "poloniumpoisoning", "body": "amazing!"}, {"id": "ejb1dky", "author": "DrMonster13", "body": "I... Wow. I definitely need to find my jar..."}, {"id": "ejb1iwb", "author": "schuj1", "body": "This story is literally an anti-depressant. Kudos."}, {"id": "ejb9jis", "author": "alligatorade-", "body": "Damn. This was really, really good "}, {"id": "ejbae19", "author": "aliciaJ87", "body": "I think maybe 1 or 2 of the stories on here have brought me to tears. This was one of them. Simply beautiful. Thank you for the reminder of the happiness that I have in my life. ❤"}, {"id": "ejbcqmx", "author": "RoyalOwlet", "body": "I wasn't expecting this from nosleep. Damn..."}, {"id": "ejbmbua", "author": "TronX33", "body": "What a dick. Offered no happiness at all. Like site, it made you realize what you had going for you, but Tis still blatant false advertising. Shit ain't happiness in a  jar, it's pants shitting terror and confusion in a jar with a lucky side effect of allowing you to recognize the good in your. "}, {"id": "ejbmp7m", "author": "Maryslamb81", "body": "Thank you so much for this story.  I’m moved to tears and will always remember to break my own jar.  I really needed this today, thank you.  "}, {"id": "ejbuwdf", "author": "Cien0172", "body": "This actually makes sense though,\nThe jar shows you what your life would be without all the things that make you happy.\nAnd when you break it you get them back and learn to appreciate these things more <3 that's actually kinda wholesome"}, {"id": "ejbyt6k", "author": "lemonade_sparkle", "body": "Yeah, I'm saving this post."}, {"id": "ejbz25t", "author": "NILCLMS", "body": "Right post at the right time, thank you this is simply beautiful"}, {"id": "ejbz5bg", "author": "GoldySlumbers", "body": "Every receptacle in my home is now smashed, I consumed any alcohol in said receptacles, I found happiness."}, {"id": "ejbzl7y", "author": "revsgirl27", "body": "This is absolutely my favorite.\nSometimes we need to be reminded what we have to see just how great it is.  \nEven if it’s not the life you planned it’s the life you have , make the best of it. Enjoy every minute- you don’t know when it could be taken from you. \nAnd unlike this delightfully chilling story, you don’t get to break the jar and bring them back. \nDream big but keep your feet on the ground"}, {"id": "ejcr6i4", "author": "creepypgirl79", "body": "Wow that was really good. You always forget what you have until it's gone. It's hard to be grateful when your content. I know I wouldn't ever want one of those glass jars. Even though life sucks sometimes and it's hard being a single mom for 2 working full time. I wouldn't change it for the world. "}, {"id": "ejozgup", "author": "Mrtorbear", "body": "I'm not crying, you're crying. "}, {"id": "el1upyf", "author": "DanielSDong", "body": "One of the best I've read on this sub. Great job!"}, {"id": "el5tmsy", "author": "carlog234", "body": "Brilliant"}, {"id": "empgk9r", "author": "CaliHeatx", "body": "This story seems to be based on the principles of stoicism. It teaches us to meditate on loss so we can be happy with what we have rather than continuous desire."}, {"id": "erp416x", "author": "shadder6", "body": "As the old saying goes you never know or appreciate what you have until its gone. Great story people could learn a lot from this :)"}, {"id": "es2kmw1", "author": "eloquenteggplant", "body": "Where the FUCK is my jar?!"}, {"id": "etadsru", "author": "noahf59", "body": "Although this is an old post, and it is unlikely anyone will see my comment, but I hope you do, OP. I am happy I read this. This story reminds me of the things that do make me happy, in a time where I really need it. Thank you for reminding me of the light."}, {"id": "ewknpdg", "author": "TendyBoi", "body": "so, when i first listened to this i was watching one of freshs videos, i really fell in love with the story telling and i decided to look more into your stories, the is absolutely fantastic and i hope one day it’ll get published, good luck🥺🥺🥺🥺"}, {"id": "exdblfv", "author": "ninjas_cousin", "body": "Decided to sort by top expecting to read a horrifying story, but was pleasantly surprised. Going through a tough time in my life, I definitely needed this"}, {"id": "ej9uohy", "author": "heartheart77", "body": "Made me feel all mushy inside! Well done author! I hope you are happy everyday-no jars required."}, {"id": "ejai9mv", "author": "AnippropriateLyllabu", "body": "Bravo! 👏🏻👏🏻👏🏻"}, {"id": "ejbhjpe", "author": "JamesonTheWise", "body": "I've hucked every jar I own at my wall and I don't feel any better. Also someone's gotta clean up this mess"}, {"id": "ejgxsp8", "author": "-10E-", "body": "Could i get a jar of sadness then? make it a double please. "}, {"id": "ejrda2e", "author": "BiteYourTongues", "body": "This was beautiful. "}, {"id": "ejsf3gj", "author": "Lorde-J", "body": "Think of your phone/computer as the jar. Now break it and tell me if your happy XD"}, {"id": "ejudd5c", "author": "IggyBabs", "body": "Who else found this after fresh's video?"}, {"id": "ek30rub", "author": "HUEchan", "body": "There is a song from Th e Fratellis that says \"happiness, happiness, comes in a jar\""}, {"id": "ek5ez56", "author": "Life_with_reddit", "body": "That was amazing thank you for sharing!"}, {"id": "ek7d0n3", "author": "eliyase", "body": "wow this was such a nice read"}, {"id": "ekbp3j8", "author": "ShadyContent", "body": "This is amazing."}, {"id": "ekra491", "author": "TheREALZhizhu", "body": "Hello other asthetic boys"}, {"id": "eksscw6", "author": "rayray0112", "body": "This story is absolutely amazing. You get so caught up in life sometimes that you truly forget to appreciate what you already have."}, {"id": "el0zgra", "author": "MineSweeper2048", "body": "Sounds like Sayori sold you that jar of happiness"}, {"id": "el33a6d", "author": "justcallmemayo", "body": "wait woah this is surprisingly wholesome and aw a happy ending"}, {"id": "el8grbg", "author": "Travellingtrex", "body": "I’m sobbing right now. Thank you OP."}, {"id": "elg5koj", "author": "magnasolis", "body": "This is nosleep? This makes me wanna cuddle up and sleep in :)"}, {"id": "em1blaf", "author": "Matthias512", "body": "r/wholesomenosleep"}, {"id": "emvj8ub", "author": "vegas167", "body": "Do I need a jar, or do I have one that I can't remember?"}, {"id": "eobrzhs", "author": "Felipe_Winner", "body": "So it was a kind of drug, after all."}, {"id": "eq6f0w2", "author": "Dennis14_14", "body": "Well i guess i broke my jar. School is good have a lovely girlfriend i love my friends and dont have much to whine about except having 2 tests in a day"}, {"id": "erllsa8", "author": "MDeCambra", "body": "I think I may have actually needed to read this today. Thank you."}, {"id": "ero8lop", "author": "durgadas", "body": "It's a jar full of onions from what I can tell..."}, {"id": "eu4kq2t", "author": "yeezyszn_12", "body": "I got chills bc of this beautiful story"}, {"id": "everdtx", "author": "NurseNikky", "body": "Damn... This is a beautiful story. Good goddamn job ♥️♥️"}, {"id": "ew3gmv5", "author": "an_ambivert", "body": "Beautiful..."}, {"id": "ew8jg1e", "author": "Funandgeeky", "body": "This was great. Thank you for sharing it."}, {"id": "ex0p07m", "author": "champflame", "body": "Damn, pretty interesting concept."}, {"id": "exiyhof", "author": "DerekLouden", "body": "Chaotic good"}, {"id": "exvmxpi", "author": "swimfreakon", "body": "Omg I LOVE this story so much!!!"}, {"id": "exwtxrk", "author": "VeryAutisticWeeb", "body": "I wish there were a full novel of this"}, {"id": "ey2won3", "author": "Pluvillion", "body": "does anyone have a box of tissues?"}, {"id": "eybfos2", "author": "htrowii", "body": "this had a happy ending (:"}, {"id": "ezbqoti", "author": "anormalb0i", "body": "This isnt really r/nosleep? but I know that I just love it!"}, {"id": "ej9wyrj", "author": "meggielizardbreath", "body": "This is amazing. I felt like it was written just for me. Thank you ❤️"}, {"id": "ejb84wg", "author": "useful_idiot118", "body": "Am I weird in that I wouldn’t want to break the jar? I’d love a chance to just pick up and go, the only thing holding me back is my love for my family. I’m not married or kids though. "}, {"id": "ejavbr9", "author": "p0lestar", "body": "You know this story should not be out for free, we should be paying money to read this story."}, {"id": "ej9sbgq", "author": "Zetoa88", "body": "Wonderful story!! Thanks for the reminder to enjoy what we already have!"}, {"id": "ej9srgv", "author": "Dyanuh143", "body": "I LOVED this story so, so much!!! Thank you! Gratitude is the foundation for my life and your story was absolute joy to read!"}, {"id": "ejb5s90", "author": "El_Moi", "body": "What a lovely story! Could not have come at a better time. Thank you! :)"}, {"id": "ejb77c2", "author": "OutrageousWinter", "body": "In the words of Joni Mitchell. \"you don't know what you've got till it's gone.\""}, {"id": "ejb9bqx", "author": "MrMZaki", "body": "Great work"}, {"id": "ejba8ne", "author": "morizzles", "body": "Beautiful."}, {"id": "ek1ufcx", "author": "Meowzers-wowzers", "body": "I need to know what happened this was confusing "}, {"id": "ej9zotj", "author": "gustokohappyka", "body": "I don't need  a jar I need a life. \n"}, {"id": "ejazf5l", "author": "nani_paturrikku", "body": "I’d be selling a jar of dirt!"}, {"id": "ejatu4s", "author": "gaypotato421", "body": "Where can I buy one of the jars¿"}, {"id": "ejb0az8", "author": "Melissa_Selena87", "body": "Just what I needed. Thanks for sharing."}, {"id": "ejb0kyk", "author": "lyricalskylark", "body": "this was beautiful, i'm teary-eyed"}, {"id": "ejb1xub", "author": "dino_x", "body": "Oh dang that was beautiful i learned so much from this, it started so spooky but nope it’s beautiful and teaching me life lessons. I’m gonna cri :(("}, {"id": "ejb4e0q", "author": "Sws-Owl", "body": "Wow, loved this, thank you!"}, {"id": "ejb5pcs", "author": "princessmoonbeam2014", "body": "We all hold a happiness jar. Usually the light in the jar is pretty dim, but every so often the light shines so bright reminding us to appreciate the little things in life that we take for granted. Never forget to break the jar."}, {"id": "ejbbnd1", "author": "SpaceDadTM", "body": "Moral of the story: There is no such thing as 'Happiness in a jar', there is just what you have. Thats the only happiness you really need.  "}, {"id": "ejbj8u0", "author": "Paul24312", "body": "Simply amazing. You don't know what you got till it's gone "}, {"id": "ejbjwzj", "author": "Cndngirl", "body": "Chilling....just chilling "}, {"id": "ejbk5nr", "author": "standingpretty", "body": "Wow, amazing writing "}, {"id": "ejblxhv", "author": "3hugger", "body": "Simply genius! Happiness starts with gratitude. "}, {"id": "ejbna5i", "author": "adorainble", "body": "Thanks OP I needed this."}, {"id": "ejbnl2n", "author": "_scythian", "body": "Ok wtf man this hit me in the feels "}, {"id": "ejbo9i8", "author": "DalinarxBlackthorn", "body": "Who the hell has my jar? "}, {"id": "ejboo5b", "author": "avianthon", "body": "Perfection! this made my day!"}, {"id": "ejbozgj", "author": "tthrowawaydfs", "body": "Reminds me of 'A Christmas Carol'! Beautiful story :)"}, {"id": "ejbpefz", "author": "GidgetVonRock", "body": "Dark Pinterest: just because you're handing out universe bending, rough life lessons doesn't mean they can't come in economical mason jars, perhaps with a nice burlap bow!"}, {"id": "ejbpeh7", "author": "DaneOnDope", "body": "What a fucking read man!! Mega kudos to OP, this is just the kinda of stuff you want to read on a Monday at the office haha.  \nThank you so much! Well written, captivating and everything! "}, {"id": "ejbpg8j", "author": "zzsparkzz", "body": "It’s almost 4am and I just woke up a little while ago as I normally do several times a night because I’m anxious about going to a job I am extremely unhappy at and have been at for the past 15 years.  \nI.  Really.  Needed.  This.  THANK YOU!!!!"}, {"id": "ejbq853", "author": "Sheikashii", "body": "Makes me realize that if I gained everything I currently have tomorrow I would be a lot happier than I am now. Why is that?\n\nI have so much"}, {"id": "ejbqeno", "author": "dvdjamm", "body": "I could use one of those jars...The bigger, the better. "}, {"id": "ejbqfqw", "author": "caleb121997", "body": "Literal chills. Beautiful writing. Thanks for sharing this message."}, {"id": "ejbqwlu", "author": "Vashi_Spachek", "body": "Was having a shitty day until I read this. Helped more than you could know."}, {"id": "ejbvuct", "author": "IAmSloth569", "body": "I think I cried but I cant remember."}, {"id": "ejbwogl", "author": "memesmemes69420", "body": "this is like a classic case of the whole \"you wished for this, but i'm gonna ruin your live and show you that it once was good, and then i'm gonna give it back to you\" type scenarios. still a good story"}, {"id": "ejbwsni", "author": "TCReaper", "body": "Wham."}, {"id": "ejbyk4k", "author": "HatPoweredBySadness", "body": "Plot twist, it’s based on a true story..."}, {"id": "ejbyytc", "author": "kittykittybangbang10", "body": "This. Was. Beautiful. Thank you. I was moved and totally creep out simultaneously. More people need to read this!"}, {"id": "ejc0ccy", "author": "LilamJazeefa", "body": "<I know this is an emotional story, but I had to....>\n\n... but do you have sunshine in a bag?"}, {"id": "ejco6jh", "author": "Cognitoonium", "body": "I'm not crying you're crying."}, {"id": "ejcvfnv", "author": "theclaymore47", "body": "I'm sorry that day must've been so scary for you but I'm glad you're happy and appreciate everything now"}, {"id": "ejddcwg", "author": "eyeball-jupe", "body": "So beautiful !!!! Amazing work, OP"}, {"id": "eje4l37", "author": "Steady20xx", "body": "This is beautiful "}, {"id": "eje8bj1", "author": "lore_wardn", "body": "r/wholesomenosleep"}, {"id": "ejeisr2", "author": "EchoOfEternity", "body": "There truly WAS happiness in that jar. It took away everything that truly made you happy, even if you didn't know it, and then once you saw what life would be like without any of it, even if you couldn't remember what any of \"it\" was anymore, you KNEW you had to have \"it\" back, not that horrible PIT of emptiness and loneliness that you had left. And once you let \"it\" all back out of that jar, you got it back :).\n\nCongratulations, now you know, beyond a shadow of a doubt, what truly makes you happy. "}, {"id": "ejeovxc", "author": "bkirnik", "body": "That was the best one I've ever read"}, {"id": "ejer2eo", "author": "randevilran", "body": "A few moments after my daughter went under the covers, I heard a 'ding' from my cellphone.\n\n&#x200B;\n\nIt was an email, and it read\n\n&#x200B;\n\n\"Thank you for purchasing a jar. We have successfully received your payment of $5000.\""}, {"id": "ejf99gz", "author": "thatwheelchairgirl", "body": "Oh it’s fine, I’m not crying. "}, {"id": "ejgu3u3", "author": "nipcinerator", "body": "This was the most magnificent thing I’ve read on nosleep in quite some time. The simplicity of the style coupled with the grandeur of losing everything is timeless. Thank you for posting this wonderful piece. I wish you nothing but peace and success. "}, {"id": "ejhp4ek", "author": "DDsLaboratory", "body": "This is the greatest fucking story I’ve ever read "}, {"id": "ejjj1ke", "author": "lil-moonbeam", "body": "This was beautiful - we take everything for granted"}, {"id": "ejq3kvf", "author": "cdeeter", "body": "Shit, I need a few. Im tired of being sad and pissed off over the results of my life. How did I even fuck everything up this badly?"}, {"id": "ejqktzp", "author": "seamasterpraetor", "body": "I absolutely loved everything about this story and I'm saving it to read to my children. Thank you OP. You have an extraordinary gift. "}, {"id": "ejsasos", "author": "Nerdybiroll", "body": "Oh....I guess we're all sad, and sometimes, we need to break ourselves just to feel happy and exceptional with our lives..."}, {"id": "ejt92h5", "author": "Windowmaker66", "body": "This one makes me appreciate what I have in life. "}, {"id": "ejtgyxw", "author": "rvstrk", "body": "Were breaking my tear ducts also a side effect of this story? "}, {"id": "ejw5fn5", "author": "spclsnow", "body": "This was amazing "}, {"id": "ek250ft", "author": "DaLab_Gaming", "body": "This is wholesome, give me like 50"}, {"id": "ek2xvqc", "author": "track528", "body": "This made my day. Thank you, Glinda "}, {"id": "eke44ki", "author": "Some_One_On_Reddit", "body": "Oh i have a jar like that in my cupboard after it reset my life I just started over. But I won’t break it"}, {"id": "ekfgpir", "author": "Serixxo", "body": "I broke a jar....my mother yelled at me."}, {"id": "ekj08i7", "author": "Djcarlz", "body": "I needed this today."}, {"id": "eks82dz", "author": "Raliadose", "body": "For a second I thought he was going to forget everything, even how to speak and shit, basically going back to an infant state of mind where he would always be blissfully ignorant"}, {"id": "elbnrib", "author": "stuffedtacos", "body": "I need to find this jar so I can break it and have happiness again."}, {"id": "eleokbi", "author": "SerialSleeper13", "body": "I know this is very late, but the upvotes on this story are very much deserved. Here, take mine for one more."}, {"id": "elf9hdt", "author": "foodprocrastinator", "body": "this. i didn't know i needed this story today. thank you."}, {"id": "elw3gxv", "author": "JustHere4RedditPorn", "body": "Great read man. Really reminded me how good I have it."}, {"id": "emsytno", "author": "MemeTeen69", "body": "this seems less like a horror story but it's still a really good read"}, {"id": "eo52u15", "author": "MrWillje", "body": "What if you had an awful life in the first place? That's just wasted glass"}, {"id": "eof2lld", "author": "kjolyn", "body": "First story to ever really make me tear up... great message"}, {"id": "eoo77kp", "author": "skittycatboo", "body": "Wow. This was a creepy but amazing reminder to cherish the things you find inconvenient only because you take them for granted. Appreciate life and all of its punches, some of them may be fist bumps in disguise"}, {"id": "epv9ax3", "author": "kelpieeeeee", "body": "when I read the title I immediately thought of Sayori's \"Bottles\" poem in DDLC\n\n\"Happy thoughts, happy thoughts, happy thoughts in bottles, all in a row.\""}, {"id": "eq3c2ge", "author": "laixodarap", "body": "This made me cry so hard"}, {"id": "erp4444", "author": "shadder6", "body": "And she actually sounds like a spell caster =witch"}, {"id": "es2w2za", "author": "Official_Cola_Addict", "body": "I need a jar like that. I need to appreciate the things in my life more"}, {"id": "es5i525", "author": "Hoglumpz", "body": "I lost my jar"}, {"id": "esgfa96", "author": "abby514", "body": "I like this!! Reminds you that things could be worse."}, {"id": "et5njud", "author": "Kamkam21", "body": "Haha,....Silver Camry.."}, {"id": "etpgewa", "author": "Cobra-Jp", "body": "Ego death in a jar."}, {"id": "etuhmyn", "author": "dancingchipmunk12", "body": "Thank you for this. I needed to read this"}, {"id": "etvl8bn", "author": "hell-yeah-brother", "body": "This is so amazing, I love this. Thanks for the reminder not to take things for granted, after all life is beautiful"}, {"id": "eu1v2dz", "author": "Gibranies", "body": "Every time a bell rings an angel gets its wings ;)"}, {"id": "eu7frqa", "author": "CrayCon", "body": "Sometimes happiness is just around you all along ;)"}, {"id": "euzlf85", "author": "Gui1tyspark", "body": "I came on here looking for a Twilight Zone-esque story. It's now midnight and I am tearing up, feeling greatful for my family. Thank you kind stranger for writing this. You've made a huge impact in my perspective."}, {"id": "ex4r8jk", "author": "Mandapanda35", "body": "So glad that you realized what is most important in your life!"}]}