{"id": "bblq6d", "title": "My Husband Brought Home a Fake Daughter", "url": "https://www.reddit.com/r/nosleep/comments/bblq6d/my_husband_brought_home_a_fake_daughter/", "subreddit": "nosleep", "author": "lifeisstrangemetoo", "text": "*This is not my child.*\n\nThat was all I could think. \n\n“Honey?” said my husband. “Is everything all right?”\n\n“Who is this?” I said, staring at the little girl I’d never seen before, standing in my house, dressed in my daughter’s clothes. “Where is Liza?”\n\nMy husband gave me a worried look, and the girl-who-was-not-Liza looked positively terrified. \n\n“What do you mean?” said my husband. “Are you feeling all right?”\n\n*Why was he evading my question? Why couldn’t he just answer?* I took a deep breath, tried to remain calm.\n\n“I’ll be all right,” I said, “as soon as you tell me where my daughter is.”\n\nMy husband frowned, and the little girl’s eyes welled up with moisture. My husband placed a protective hand over her shoulder, and leaned down to whisper in her ear. \n\n“Go on upstairs, honey,” he said. “Mommy’s not feeling well.”\n\nThe girl wasted no time in doing what he said. She clutched her schoolbooks to her chest and barreled past me, rushing up the stairs. I heard the door of my daughter’s room slam. The look on my husband’s face was a mix of pity and restrained anger.\n\n“You haven’t been taking your medication,” he said. “Don’t try to deny it, I can see it in your eyes.”\n\nI waved my hand in a dismissive gesture. \n\n“I don’t need them,” I said. “They make my mind all fuzzy.”\n\nThe anger on my husband’s face became less restrained. Well-etched frown lines beneath his lips deepened. \n\n“Do you remember what happened the last time you said that?” he asked. \n\n“I...”\n\nThe suggestion was enough. A swarm of shattered and confused images flooded my mind, like the wave of nausea that comes before vomit. My husband screaming, covered in blood.\n\n*Look what you made me do!* he was shrieking. *Look what you made me do!*\n\nI felt the floor tilt beneath me, and before I knew what had happened, I found myself falling backwards into my husbands arms. Hot tears were streaming down my cheeks, and my body convulsed with violent sobs.\n\nMy husband gently brushed my hair and whispered in my ear.\n\n“Shhh,” he cooed. “It’s not real, honey. I promise that it’s not real.”\n\nI silently nodded my assent. I let him carry me up to our bedroom and lay me gently down on the bed. He walked over to the dresser where he kept the cocktail of drugs that I took every day to maintain my sanity. I swallowed them gratefully. \n\nSoon my mind was going fuzzy, I could feel myself becoming a pliable zombie that could be told anything, made to do anything. \n\nOf course I knew that it was wrong, that that girl was not Liza. I knew that it wasn’t me who had been driven insane by our daughter’s death, but my husband. I knew he had kidnapped that girl when she was a toddler, and brainwashed her into believing she was Liza.\n\nBut, most importantly, I knew that if I didn’t take my pills, if I shattered his precariously built illusion, that he would kill the girl and start all over again.\n\nJust like he did the last time.\n\n[x](http://reddit.com/r/lifeisstrangemetoo)", "comments": [{"id": "ekjrnvc", "author": "Lemebeme", "body": "The mom could suffer from Capgras delusion, which is a very rare mental illness in which someone believes their loved ones have been replaced with imposters pretending to be them"}, {"id": "ekkhlp1", "author": "texasplumr", "body": "Wow! This is great and it hits home for me.\n\nGrowing up in the 50s and 60s my mother was bipolar. The thing is, they wouldn’t diagnose that until the 80s. They didn’t really know what it was so she wasn’t treated until we were grown. I remember my little sister and I walking home from school, openly discussing which mom would be there to greet us when we got home. \n\nBeing her older brother I would always enter first. I would do my best to protect her if the angry and violent mom was home. My sister was always frightened so if angry mom was home I would always get her attention and my sister could then sneak by and into her room. Surprisingly, it worked most of the time. And the welts from the belt only hurt for a short time. \n\nShe would eventually flip to the kind and caring mother that she was by nature and apologize to me and usually buy us ice cream. And when dad came home from work we were safe. My little  sister would then come out and we’d watch tv and play like normal kids. And we’d look like a normal family. It really is bizarre to think about today."}, {"id": "ekjwv6z", "author": "orpwhite", "body": "One of my biggest fears is being unable to trust my loved ones or my own senses. Bravo for giving me daymares for weeks."}, {"id": "ekkfxcn", "author": "Praxikat", "body": "My grandmother had this, I think. It was never diagnosed as Capgras and never treated: the doctors just called it senility and dementia and sent her back with a cocktail of sleep and anti-anxiety meds, but till her death she kept insisting that her first-born son (my uncle) had been replaced by an imposter who also killed my grandfather (died of natural causes) and that my aunt was also an imposter plotting to kill her. Thanks to nosleep for opening my eyes! (Literally and metaphorically!)"}, {"id": "ekjn5v2", "author": "SuzeV2", "body": "Omg!  This is terrifying!"}, {"id": "ekk4rf3", "author": "TLema", "body": "Man, I had to reread several times and I'm *still* trying to work out who's the delusional one. Amazing."}, {"id": "ekl19qr", "author": "aesoth", "body": "What the actual fuck.\n\nYou can't lay a story on me like that after I just smoked a bowl.\n\nWow."}, {"id": "ekjouj1", "author": "ChaseH9499", "body": "Wow, this sounds like a Criminal Minds case!"}, {"id": "ekjrzq5", "author": "LittleMia94", "body": "At first I though Capgras delusion, but clearly I was wrong! .... Or was I?"}, {"id": "eklgjhj", "author": "mrgeekXD", "body": "Honestly, I still don't really know who's the delusional one"}, {"id": "ekkz2ug", "author": "Armandoswag", "body": "The only problem I have with it is that if she knows and/or thinks that her daughter died a long time ago why would she ask “Where is Liza”?"}, {"id": "ekkyeon", "author": "strawberrypandabun", "body": "This is really interesting! I'm not sure what kind of medication she's being coerced into taking, but legitimate mental health medications are generally slow acting and take several days before their effects are noticeable."}, {"id": "ekkuhcw", "author": "lizalagerstrom", "body": "well, the fact that my name is liza made this about 1000x creepier. now i gotta go searching for my birth certificate"}, {"id": "ekm40zf", "author": "brutustheretriever", "body": "Ooh look what you made me do look what you made me do"}, {"id": "ekjtvg4", "author": "Amy_Beerhouse", "body": "Holy fuck got whole body shivers. That was a good one."}, {"id": "ekk62gx", "author": "YoSoyKeott", "body": "Oh my god. That's the weirdest way to  deal with the lost of a daugther. I tought the wife was just crazy, she was the sanest of them all, doing what she can to help that girl and keep her \"family\" safe.\nI don't wanna know that guy, he must be a scary dude."}, {"id": "eklx6ml", "author": "Rabid-Duck-King", "body": "Just kill your husband. \n\nSeriously, he's sleeping *right there.* \n\nIt'll be easy."}, {"id": "ekmjn0l", "author": "celticknight0000", "body": "I don't get it? Someone please help"}, {"id": "ekjyu4r", "author": "PixelatedQ", "body": "Holy crap that was good! She looked insane at first, but her husband killed their daughter or is she so far out that the medication doesn't help?"}, {"id": "elosdvm", "author": "FoxyPirateFox9054", "body": "# oof"}, {"id": "ekkp7tl", "author": "Lorde-J", "body": "Read the title and thought it was a changeling. Read the post and was like boy was I wrong!"}, {"id": "ekl0596", "author": "AriaTheFangirl", "body": "damn..."}, {"id": "ekl4zlt", "author": "ralph_macchioman", "body": "this was fucking dope"}, {"id": "eklag0x", "author": "The420Wizard", "body": "Fuck."}, {"id": "eklb9d6", "author": "vibrantspringcolour", "body": "OMG! Goosebumps......"}, {"id": "eklomdi", "author": "leonardbrandon", "body": "I just found this thread, right before I am suppose to go to sleep..."}, {"id": "ekm56mt", "author": "Vingthor8", "body": "Trolls can be deceiving"}, {"id": "ekmasut", "author": "AdhesiveAtoM_", "body": "This is some hella creepy shit"}, {"id": "ekmccen", "author": "twiztidmeme", "body": "If you truly want to keep her safe, it's not a good idea to point out, she is not your Liza. Can you hold back some of your meds? Then maybe you can drug your husband,take the girl and run."}, {"id": "ekmmsjg", "author": "er15_ac", "body": "Jesus"}, {"id": "ekkncng", "author": "Barnickal", "body": "Ho lee shit. Noice."}, {"id": "ekk1emr", "author": "TheOneTrueBubbleBass", "body": "jesus christ."}, {"id": "ekk1sqb", "author": "nightrider424", "body": "Alright. Terrified it is."}, {"id": "ekk3g4w", "author": "SrikarG", "body": "Oh god"}, {"id": "ekkuqwg", "author": "Shinigami614", "body": "Ouch"}, {"id": "ekln2ri", "author": "Nugget_VonMattenhorn", "body": "Oh shit"}, {"id": "ekln6f8", "author": "Beachysusieq", "body": "Damn, that’s scary, OP!"}, {"id": "eklx8w9", "author": "RandomGuyWhoComments", "body": "aight, so is it you or your husband?"}, {"id": "ekm0aob", "author": "noy103", "body": "Look what a mother can do to protect her child. Even though you are not her real mom. God bless you."}, {"id": "ekm3ivr", "author": "Tech2CPA", "body": "Were the pills covered by insurance?"}, {"id": "ekm5pnj", "author": "teabrains", "body": "THIS, thank you."}, {"id": "ekoinwv", "author": "Ellamaehem", "body": "Holy shit"}, {"id": "ekuhu94", "author": "kayaless", "body": "Fuuuuck"}, {"id": "emm3qn0", "author": "zomblien89", "body": "nightmare fuel"}, {"id": "ekjxmqn", "author": "thestarlighter", "body": "This totally gave me chills - so well done!!"}, {"id": "ekjruik", "author": "RJBela", "body": "You had me guessing till the end"}, {"id": "ekjsoej", "author": "lolalachine", "body": "Amazing!"}, {"id": "ekk18gx", "author": "RoadKill_03", "body": "This is really good, thanks for sharing!"}, {"id": "ekk7xq7", "author": "DraconidZinnia", "body": "Wow, this one's really good"}, {"id": "ekkvfkf", "author": "razorrosie", "body": "Torn between wtf!! And wow"}, {"id": "ekkjqk1", "author": "mommiebear2", "body": "This is freaky!"}, {"id": "eklngbs", "author": "Jerome3000", "body": " Reality for humans is built on what seems more likely to be going on than what is really going on. That being said OP; what is real is subjective. But what makes more sense overall? That your daughter is dead, your husband successfully kidnapped a toddler and brainwashed not just her but everyone around you or that you suffer from a mental illness likely schizophrenia which is warping your sense of reality?"}, {"id": "ekludwi", "author": "Airagog", "body": "I don't really understand this, but I don't think I want to."}, {"id": "ekk1u8a", "author": "EustaceArndt", "body": "\"Liza\" is presumably pronounced like \"Lizard.\"  Liza the riza."}]}