{"id": "brco33", "title": "My job is watching a woman trapped in a room.", "url": "https://www.reddit.com/r/nosleep/comments/brco33/my_job_is_watching_a_woman_trapped_in_a_room/", "subreddit": "nosleep", "author": "Verastahl", "text": "Three years ago I was looking at the local job classifieds online when one of the ads caught my eye, not because of what it said, but because it said so little.  Best I remember, the ad just read “Job available.  Good pay.  No benefits.  Discretion required.”  It then listed an email address and that was all.  At the time I was managing a music store, but I had already started hearing rumors we would be shutting down within the next year and the likelihood of a transfer to another store was slim. I had been morosely looking at job listings for the last few days, but this was the first one that stood out, if only because I was bored and it was weird.\n\nSo I sent an email.\n\nHalf an hour later I had a response, telling me to go to a particular office building in an upscale part of the city at a precise time for my “screening”.  I went, and after waiting for a few minutes in the lobby, I was taken into an office where I was given a series of forms and questionnaires to fill out.  They collected them and told me they would be in touch.\n\nI had almost forgotten about the whole thing until a month later I got a call saying I had moved on to the second stage of the hiring process.  I was again given an address and time, and when I arrived (this time it was a different nice office park twenty miles away from the first one), I was met by a man who introduced himself as Mr. Solomon.  He escorted me into a large room that contained a chair and a desk.  On the desk were two large monitors, a keyboard and mouse, and a bolted down metal box with two oversized buttons on it:  One red and one green.\n\nHe told me this room was a model for the place I would be working if I took the job.  He described the job as follows.\n\nI would be working seven shifts of six hours every week.  My job would be simple.  I would arrive at work ten minutes early and enter an outer area that was like a locker room.  I would have my own personal locker.  I would store all belongings in the locker and change into the provided work clothes.  I was never, under any circumstances, to carry any item of my own into the surveillance room.  I was never, under any circumstances, to take any item with me from the surveillance room.\n\nAs for what I was to do in the surveillance room, I was told that the monitor on the left would constantly show a live stream from a high-definition camera in a remote location.  My job was simply to watch the camera.  Once an hour I would get onto the computer attached to the right monitor and enter a brief log describing anything interesting that occurred in the last hour.  I would have no pens or pencils or paper, and I should never try to take any kind of written notes about the work.\n\nAs for the red and green buttons, the red button was only to be used if there was an emergency.  This meant something on the video or in my workspace that required outside help.  The green button was to be hit if I saw something on the video feed that was particularly noteworthy.  It would tell other people somewhere that, at least in my opinion, something interesting was going on.  Solomon stressed that while I was given discretion on when to use this button, I should err on the side of only using it if and when something “of real significance” occurred.\n\nHe pointed out the camera on the ceiling of the room we were in.  He said the real room would be the same.  My work would be observed, and other people were watching the room on the video feed as well.  He said I was only a redundancy in case other systems failed.  He then smirked and asked if I knew what he meant by redundancy.\n\nI nodded, trying not to show my irritation.  I don’t talk that good to people, so sometimes they think I’m dumb.  That’s okay.  Let him think that if he paid me good enough.\n\nThe pay was very good.  Thirty-five dollars an hour.  \n\nThis worried me.  I was already thinking this was some kind of psych experiment or secret government job, which I was okay with.  But that kind of money to sit and watch a screen?  My mom always told me that if something seems too good to be true, it probably is, and this was seeming too good to be true.\n\nI asked if I was going to be doing anything illegal.  Solomon laughed and said no.  I asked if anyone was going to get hurt.  Again, he shook his head no.  He said the reason they were paying so much was because they needed employees that were motivated to be professional and discrete.  The work they were doing was important, and for various reasons it couldn’t be discussed.  If I took the job, I would have to sign papers promising I would never discuss my work there or I could be sued or locked up.  I’m only breaking that now because of everything that’s happened.\n\nSo I took the job, and because they wanted me to start right away, I had to quit the store with no notice.  I felt bad about that, but I was excited about the new job too.  It was a lot of money and seemed like easy enough work, if a bit boring.  I was nervous that there was something more to it, but I told myself I would just have to see.  No point in chickening out and wasting a good chance because I let my imagination go crazy.\nI was given the location of the job itself, and when I went there, I was amazed that it really was just like the model room I had been shown with only a few differences.  There was a locker room you had to pass through to enter the surveillance room and there was a small bathroom attached to the real surveillance room also.  The real room had a small water cooler in the corner, but because I wasn’t allowed to bring anything in with me, I had to eat before or after every shift.  The biggest difference, of course, was that the monitors were turned on.\n\nThe right monitor was just a black and white terminal like you see in movies some times.  I could type in my logs, but no internet to look at or anything like that.  The left monitor…\n\nIt was video from a room.  You would call it a bedroom I guess, because it had a bed in it, but it had lots of other stuff too.  A T.V., a sofa and chairs, a couple of tables, and plenty of empty space in between.  The camera must be high up in a corner, because I could see pretty much everything except for the far sides of furniture.  At first though, I didn’t notice any of that stuff.  \n\nAll I saw was her.\n\nShe looked to be a little older than me and was very pretty.  When I first saw her, she was laying on her side on the sofa.  That was the part of the room farthest from the camera, but the picture was very clear and I could tell that she was sleeping.  I found myself leaning into the monitor more so I could see her better, and then I thought about what I was doing and felt embarrassed.  It’s like I was spying on her.  A Peeping Tom, my mom used to call it.\n\nI didn’t want to be a Peeping Tom, but I didn’t want to be silly either.  I needed to think about it slow.  \n\nIt was a good job.  And I wasn’t doing anything wrong, right?  I wasn’t hurting anybody.  The woman looked fine.  And the room was nice.  She probably agreed to be there and it’s all some experiment or something.  I was just overreacting.\n\nSo I sat down in the chair and began my work.\n\n**** \n\nIt didn’t take long before I understood more.  The woman, I took to calling her Rachel, wasn’t there of her free will.  I never saw her hurt, but it was clear that she never left that room except to go into what I think is a bathroom area that my camera couldn’t see.  Well, she never left the room on her own.  Periodically, usually a couple of times a week during my shifts, men and women in strange-looking outfits would come in and take her from the room.  Sometimes she would struggle, but usually she would just go along with her head hung low.\n\nThey would always bring her back, though the times when she wasn’t brought back during my shift were always the worst for me.  I would worry about her until I got to work the next day and saw her in the room watching T.V. or painting.  She never looked hurt or even that upset except for when they took her, and even when she fought, they were always gentle with her.  \n\nStill, I knew something was wrong.  I considered quitting the job, or hitting the red button and getting someone to come so I could get some answers.  Or calling the police and showing them what the camera was showing me.\n\nExcept I was scared.  Scared of losing my job,  and scared of what these people might do to me if I quit or told on them.  Solomon had told me when I took the job that part of being discreet was not asking questions.  I would never be asked to do more than I had already been told, but I could never tell anyone what I did or saw, and I could never ask questions about what I was doing or why.\n\nSo I made excuses.  It was all an experiment.  She was crazy or sick and they were trying to help her.  She was doing a job just like I was.  Or if she really was a prisoner somewhere, at least I was watching to make sure that she was okay.  If they ever tried to hurt her, or I saw that she really didn’t want to be there for sure, I could get help then.  In a way, I told myself, I was helping to protect her by watching.\n\nI don’t expect you to think much of my excuses.  I don’t think much of them myself, especially now.  But in my defense, when things changed, I didn’t ignore it or try to explain it away.  I knew something had to be done.\n\n****\n\nRachel would usually paint for an hour or two every day, and it seemed to always be during my afternoon shifts.  The room had no windows as far as I could tell, but I guess she either used a clock or her own body’s time to keep to a kind of schedule.  I always liked to watch her paint—the thing she was painting was always facing the wrong way for me to see it, but I could see her face as she worked.  She always looked peaceful and happy when she was painting, and seeing her that way, smiling serenely from time to time as she got something the way she wanted it, always made my day.\n\nI first noticed something was wrong when she started painting more frequently a few weeks ago.  Her expression was more focused and serious, and there was a tension to her movements that I wasn’t used to seeing.  At first I thought she was just really trying to work hard on something, and I wanted to tell her not to worry.  Every few weeks the others would come in and take the old paintings out anyway, bringing in a new stack of…I think the word is canvas.\n\nBut it was more than her being focused.  Something was wrong.  She didn’t look happy and she was going for hours at a time.  In the span of three days, she had finished four paintings.\n\nI had been growing more and more worried watching her work, and when she finished the fourth, I found myself telling her to just stop and rest awhile.  I had grown accustomed to talking to the monitor, talking to *her* in my own way.  But she didn’t stop.  Instead she began moving the paintings.  Arranging them on the back and seat of the long sofa at the far end of the room.  \n\nThis was the first time I had gotten to see any of the paintings.  Even when the others were taking them out, they always seemed to be turned away from the camera.  I was still worried about her, but I was also happy to finally see something she had worked on.  Happy and amazed.\n\nThey were beautiful.  One was a beautiful green forest.  Another was an old stone well.  A third was a house sitting alone on a small island.  The last was an old-fashioned looking movie theater.  All of them looked like something out of a dream, with trailing lines of color mixing in the air around them like leaves caught in a wind.  It was only when I looked close that I realized the lines of color weren’t random.  They were words.  Easy to miss if you weren’t looking close, and by themselves, they didn’t seem to mean much.  Just the ghost of a word somewhere in each of the paintings, easy to lose in everything else that was being shown.\n\nI leaned into the monitor and squinted, trying to read the words.  Then my heart started thudding as I made them out.  Blinking and rubbing my eyes, I looked again, reading them out loud in order—left to right, top pair then bottom.\n\n“Please.”\n\n“Help.”\n\n“Me.”\n\n“Thomas.”\n\nI pushed back from the monitor, my hand over my mouth.  I didn’t know what to do.  I didn’t know how any of this could be happening.  It wasn’t just that she was asking for help, though that was a big part of it.  \n\n[It was that *my* name is Thomas.](https://redd.it/9ndww5)\n\n****\n\n[Part Two](https://redd.it/brsj8v)", "comments": [{"id": "eod0sx6", "author": "Boring_Ugly_Dude", "body": "I wouldn't be surprised if Thomas was actually the experiment."}, {"id": "eocobbl", "author": "Isaac_Masterpiece", "body": "Push the green button, Thomas. This is definitely something noteworthy. Also, write it in your logs. The key to being a good bureaucrat is following the rules.\n\n&#x200B;\n\nRemember, Mr. Solomon told you it wasn't anything illegal. And no one's getting hurt. You signed papers and everything. Fucking this up could mean legal trouble down the line."}, {"id": "eocqbsq", "author": "missile", "body": "OP, what part of \"Discretion required\" is unclear?"}, {"id": "eoct7kr", "author": "086709", "body": "Do your job Thomas. You don't know what she is; its far above your paygrade. The fact she knows your name should show you the danger of asking too many questions. We have been watching and had so far found your performance adequate. We will be in touch, don't bother running."}, {"id": "eocsz2t", "author": "Teradonia", "body": "7 shifts a week for 6 hours at a time and no benefits? I hope you're getting overtime Thomas!"}, {"id": "eocng4g", "author": "RabbitPatronus", "body": "I like this. keep us updated, OP. also be very careful they might watching you too."}, {"id": "eoci4ji", "author": "tabookduo", "body": "I wonder how special this woman is...update if you can without Mr. Solomon finding out OP"}, {"id": "eod5vbt", "author": "UnstoppableChicken", "body": "Mr. Solomon said other people are watching as well. Maybe she heard your name in passing from the people that take her away from the room for a while. Tread carefully. You don't know why she's in that room."}, {"id": "eod8i1i", "author": "Olives_oyl", "body": "Thomas - you didn’t mention, we’re there any times you did press the green button?\n\nWhat sorts of things did you write in the log?"}, {"id": "eod4kwy", "author": "_bluesbabe_", "body": "It's an AI, just like in exMachina.. if he let's her out bad shit is gonna go down!!"}, {"id": "eodxgfa", "author": "dotlurk", "body": "Dude. If you can discern the secret message on a little monitor, don't you think that her handlers can see it perfectly clear when standing right before it?\nIt's a test, obviously. \n\n\nOh, and if it's not a test, then maybe there a reason why a person who can read minds is being held in confinement?\n\n\nDo your goddamn job."}, {"id": "eocl2bd", "author": "RayOfAnger", "body": "Poor Thomas!  What is he going to do? He doesn't even know where she is!!!"}, {"id": "eocw47e", "author": "BlueFootedBoobyBob", "body": "Thomas, If you want to keep your Job and your Life as a D personal, you have to press the green button."}, {"id": "eodmej1", "author": "Hell-on-wheels", "body": "Perhaps she was the one doing his job until she asked too many questions.  He could very easily end up in that same situation."}, {"id": "eocoa9n", "author": "littlebluebird88", "body": "I'm definitely looking forward to an update on this!"}, {"id": "eocqxc6", "author": "notadilemma", "body": "please keep us posted, Thomas!! we want to help you and Rachel."}, {"id": "eoctau4", "author": "MeMeMachina052", "body": "Click the green button"}, {"id": "eod1e4y", "author": "mustardguardian", "body": "Watch out man, what if she's an alien? I mean, how would she know your name? What if this is a test from Mr. Solomon? Don't do anything rash."}, {"id": "eoe07h0", "author": "twiztidmeme", "body": "Thomas you had better push the green button. If you do not report it, you best believe someone else will. You were told there are others watching you. They may have those buttons as well. Here's to hoping you survive."}, {"id": "eoe10q7", "author": "twiztidmeme", "body": "You said they wear strange outfits? Tell us more about them please."}, {"id": "eod3v4r", "author": "PistachioMarsupial", "body": "Hmm. I have a few questions.\n\n1. You didn't mention the painting supplies or easel before when you first saw the room. Did these appear later?\n2. Does she do any sketching in a sketchbook?\n3. What medium does she use to paint with?\n4. Does she eat in this room? Does she have a kitchen? \n5. What kind of clothes does she wear?\n6. Can you describe the strange looking outfits they wore?\n7. You said she's very pretty - what are her physical characteristics?\n8. Have you pushed the red or green buttons for any reason up until now?\n9. Does she have any other technology in the room except for the TV? What kind of TV is it? Is the screen pointing towards you, so you can see what she's watching?\n10. Is there a time/date stamp on the video feed?\n11. How big is this building you're working in? Do you ever see anyone else? Hear any noises? Is there a security gate? Security guards? Anyone to check that you didn't bring anything in with you? Do you think she might be in the building you're in?\n\nOkay... So I had a lot of questions.\n\nMy first thought is that you're being watched as you're watching her, with someone pushing a green or red button whenever you do something significant.\n\nMy recommendation is to report this. But I figure this room is in a rented office building with no connection to where this girl is located. Unless you could provide proof of what you're seeing, it would probably take a while for the report to get a follow up, and by then the whole situation could've been washed clean of any evidence.\n\nAlso, be careful of opening files from your new employer. The last thing you want is them monitoring your personal devices with keyloggers or some other garbage.\n\nEdit: One more thing, take note of the style of her paintings. If there's a report online of a missing artist/painter or art teacher/student, you could maybe find her and/or identify her based in her painting style. Maybe someone is claiming her paintings as their own.\n\nMake sure to check international sources, too."}, {"id": "eodb996", "author": "lotheva", "body": "Tommy, you’re making 76k a year to sit and be bored. She’s probably doing the same. 76000, Tommy!"}, {"id": "eof7vb5", "author": "a-b0mb", "body": "I first read ”My name is Thanos.”"}, {"id": "eod4woa", "author": "JoeCarr69", "body": "35 bucks an hour to watch a tv feed?\n\nIf you're quitting pass me their details."}, {"id": "eocoace", "author": "cherri____", "body": "Ready ready ready for an update 🤞🏼 you better save her Thomas"}, {"id": "eocuqud", "author": "FlowersOnTheHill", "body": "You better follow the rules OP. Remember that you’re being monitored and as Mr.Soloman said, nothing illegal is happening and no one is getting hurt."}, {"id": "eod7uco", "author": "sneakygreedo", "body": "A little older than you? How old are you?"}, {"id": "eoesbyj", "author": "luceario", "body": "This reminds me a lot of Milgram’s experiments in which he convinced people they were administering dangerous and life threatening shocks to others who were screaming out for help. They thought that they were conducting a different experiment and that the receiver of the shocks was the subject to test how punishment affected scores on memory tests, but the ones administering shocks were the real test subjects to see how far they would go when following orders from an authority figure. \n\nI’m thinking that you are a psychological test subject here and like Milgram, Mr Solomon (or the experimenter) wishes to see how far they can push you before you either go against their orders or go ‘all the way’, whatever that may be... \n\nThis is completely illegal and against psychological research ethical regulations so if this were the case, and you were to report it, you would not be committing a crime as the papers you signed would not be legally binding.\n\nAlthough... there is the chance that you’re not a test subject. In that case, best of luck OP!"}, {"id": "eofkrwh", "author": "SomeSortOfMachine", "body": "\"It is nothing illegal\"\n\n*It is in fact very illegal*"}, {"id": "eocwuri", "author": "blueskiesncreampies", "body": "i *think* that counts as something interesting."}, {"id": "eodas61", "author": "goodrob", "body": "I wouldn’t overthink it.  Probably a different Thomas."}, {"id": "eodkgts", "author": "RZRHED", "body": "That's it. I'm following you. Don't bother turning around. I blend in."}, {"id": "eof2f5y", "author": "Aussiewolf82", "body": "You're the experiment dude"}, {"id": "epd7gm9", "author": "tinyclitgang", "body": "Me when i trap sims in my basement and make them paint constantly and sell the painting"}, {"id": "eod062j", "author": "akio_33", "body": "Be careful OP, it could be a test!"}, {"id": "eocv0d7", "author": "Deadbreeze", "body": "Gonna need to hear more on this."}, {"id": "eocw2ue", "author": "sympatheticquill", "body": "If she is asking for help, I think you should do so- with discretion, of course.\n\n&#x200B;\n\nI don't know if police will be much of a help, since it could possibly just alert the people running this experiment that someone called the authorities and it could get you into the same boat as well. On another route, just try and figure out the schedule- when you know it's just her and you, and push the green button. Just be careful- even if this man said it isn't illegal, it's still worrying."}, {"id": "eocwyal", "author": "Im_Aquarius", "body": "I gotta stay updated on this!"}, {"id": "eod12tn", "author": "bumperdumpkins", "body": "Figure out how she knows your name. Maybe a distant relative of sorts? Someone you knew in school? Try to jog your memory man, hope you can help her. I look forward to hearing about your plans."}, {"id": "eod4df5", "author": "NymphWriter", "body": "I am waiting for an update, can’t wait"}, {"id": "eod9j7i", "author": "ec2cross", "body": "What if your the one being watched and studied to see if you would call for help or what someone would do if they saw someome in distress knowing if they helped it could be bad for them. That would explain how she knows your name."}, {"id": "eodf9k8", "author": "anthony_samuel", "body": "I NEED to know what happens next! Please update!"}, {"id": "eodmzbg", "author": "Just_my__luck", "body": "Please help her Thomas! Pretend not to know anything and figure out how you can help her. And please update us"}, {"id": "eodyivm", "author": "wxnderfull", "body": "isnt this just working in a jail"}, {"id": "eodymsi", "author": "zombieelove23", "body": "For some reason I legitimately believe this is a test. They’re wanting to see if you’re going to be discreet or if you’re going to pussy out at the first sign of something wrong. Clearly they’re watching you. You said it yourself. If this wasn’t a test how would she know your name? I would say put it in your log and let it go."}, {"id": "eodyo5y", "author": "tensixtysix1066", "body": "OP your choice is simple and basically made for you. \nYou said there is a camera watching you. \nYou also said that Mr. S. told you others were watching the same video feed you are.\n\nLog it. Hit the button (red). Thomas is NOT an unusual name! You don't know that message is for you."}, {"id": "eoe141g", "author": "Paniemilio", "body": "This is some \\[REDACTED\\] shit going on"}, {"id": "eoethc7", "author": "gold2lead", "body": "When you are caught I will happily take the job observing you."}, {"id": "eofcz8h", "author": "AnnoyingRambo77", "body": "Push the green button. that is certainly note-worthy"}, {"id": "eofdu8o", "author": "jhubeJELLO", "body": "Millions of people are named Thomas. For all we know Mr. Solomon's given name is Thomas. Heck, Rachel could be Thomas. Everyone is a Peeping Tom."}, {"id": "eodf3hl", "author": "redana02", "body": "Whenever I see something about breaking a NDA, I know it’s time to hunker down and grab the popcorn. Very brave (or stupid) of you to risk retribution when you think someone needs help. I truly hope you don’t get caught and the woman is okay!"}, {"id": "eod37rq", "author": "LyricalDragunov", "body": "Time to save your new Girlfriend Thomas"}, {"id": "eocvpfh", "author": "BitchFaceMcGee14", "body": "Thomas, wasn't it specified that the job required *discretion?* No matter though, but I don't think you need to worry about anything mate. Like you said, she's probably ill. Those strange men and women are probably just taking her out for treatment or to test her and see if she's any better. I'm sure there's nothing to worry about"}, {"id": "eod0enx", "author": "bombebaby", "body": "My name is Thomas and this scared me"}, {"id": "eodaahe", "author": "Fated4D", "body": "Be careful, while she may look innocent we don’t know why she’s being kept there. If by chance it’s the weird-suit people’s fault then save her."}, {"id": "eodmdfa", "author": "aym23vt2488", "body": "Goodbye Thomas."}, {"id": "eodoar0", "author": "lolalachine", "body": "Oh No! Do you push the button?"}, {"id": "eodpna0", "author": "fuckinlame", "body": "Yessssss I can’t wait to see where this goes"}, {"id": "eodrgh1", "author": "EmbarrassedCupcake8", "body": "help her!!!!!!!!!!!!!!!!!"}, {"id": "eoe8yzz", "author": "paulvilanoma", "body": "Hopefully your bosses don't check Reddit."}, {"id": "eoewhq3", "author": "WRZESZCZ_1998", "body": "I think she's a telepath or something like that and is being studied."}, {"id": "eof1b8u", "author": "TragPulp", "body": "Mr Solomons first name is Kevin and he locked her in his basement  and forces her to paint the drawings to sell them for profit."}, {"id": "eof1w70", "author": "chaiscool", "body": "Maybe they only hire “Thomas”. All the previous employees for the job are also Thomas. The guy in charge for imprisoning the girl is also thomas.\n\nUse a spy cam pin hole size one (or pen) and record everything. A few months worth of video should be sufficient evidences. Contact the guy who hired you (Solomon) and get a PI to tail him.\n\nAlso, if you manage to capture an image of her face. Cropped it to not make it obvious you’re the source. Post missing person and see any response. But take precautions, have someone regularly check up on you (leave a box contains all the info needed if you’re gone) and alert authorities if you ever stop messaging them (in case you’re the next one)\n\nSomehow a worst line to read would be “Run Thomas”"}, {"id": "eofgi98", "author": "MelInTheMiddle765", "body": "Ooooh damn! Excited to see the next entry, i hope you post a second part to the story!"}, {"id": "ex0qrhk", "author": "CodPolish", "body": "Watch ex machina and don’t be dumb Thomas"}, {"id": "eocxt8y", "author": "TastyBaguet", "body": "I think explanation is simple: they keep her there to paint and sell the paintings. OP I think you should report it and be a good rat the money is worth it. And if they don't harm her I think you should just let it slip."}, {"id": "eod5rtz", "author": "u-had-it-coming", "body": "> My mom always told me that if something seems too good to be true, it probably is\n\nMommy was wrong."}, {"id": "eoddv36", "author": "Lemon_Boo", "body": "I need to know what happened next, did you quit? Did you help her somehow?"}, {"id": "eodfsnf", "author": "tyotypic", "body": "They probably only hire people called Thomas."}, {"id": "eodr7rt", "author": "TheKaiserVilhelm", "body": "Was almost expecting her name to be Elizabeth."}, {"id": "eods01l", "author": "Pink_Star", "body": "Oh wow - I could not imagine being in that position- I’m ready to hear what happens next."}, {"id": "eodtmsv", "author": "theriversmelody", "body": "I think this is what the red button is for."}, {"id": "eodwrmx", "author": "thefriendlyghost99", "body": "its a trick, an experiment on you. Don't fall for it"}, {"id": "eody3m9", "author": "few23", "body": "Now you all know too much.\n\nYour IP and GPS location has been logged.\n\nAn associtate has been dispatched to your location."}, {"id": "eoe33mf", "author": "DeadWitchWalking", "body": "Tell us more Thomas"}, {"id": "eoe5naa", "author": "Tendrilpain", "body": "Dude, you just blew a 76K job because a woman wrote your name."}, {"id": "eoe64jk", "author": "WishIhadaDaughter", "body": "My job is telling assholes that they are assholes. Guess what?"}, {"id": "eoec08w", "author": "Equinox087", "body": "I think she *can* hear you, and that's how she figured out your name and things like that. I'm not sure tho."}, {"id": "eoec8lb", "author": "ISmellLikeCats", "body": "Green button, psychic girl? Or type Green? Either way you really should leave her where she is and do your job, you’re the first D-class I’ve heard of getting paid and allowed to leave the facilities unsupervised."}, {"id": "eoecn9x", "author": "Captain_Void", "body": "Well she knows she's being watched. OP, you should quit and get help. It sounds like you're connected to the experiment somehow. Hopefully she gets some help."}, {"id": "eoehorq", "author": "K_Byrd2", "body": "Definitely sounds like you’re the subject matter Thomas"}, {"id": "eoei0jp", "author": "EnchantedTheCat", "body": "Your best bet may be to ask for some clarification on what is going on. If there is no answer, go to the police."}, {"id": "eoelu58", "author": "misteres107", "body": "Damn, what an incredible read! Waiting for part 2, Thomas!"}, {"id": "eoeq5mu", "author": "jesse1300", "body": "My first thought was that you (Thomas) was actually the subject of the experiment, not her. Although I may be wrong and it's possible she really needs your help. After all, it seems like you're the only person who can help her. Keep us updated."}, {"id": "eoes1iu", "author": "mindyourbusiness34", "body": "Sounds like paradox"}, {"id": "eoetseo", "author": "fidminger", "body": "This sounds just like The Sims whenever you get rid of one of the Sims' means of exiting the house."}, {"id": "eoex6jv", "author": "_jellycat13", "body": "Will there be a continuation? Please tell me there is!"}, {"id": "eoeyaxr", "author": "dukeofthenukes", "body": "Now the subject reaches the what we call it - the conclusion stage. His worries have been verified."}, {"id": "eoeykfb", "author": "tofutruffle", "body": "Mk ultra reboot"}, {"id": "eof4wts", "author": "xaspen", "body": "Ok I'm sorry-\n\n&#x200B;\n\nbut I'm a literal maze runner fanatic and this gives me some serious vibes.\n\n&#x200B;\n\nThomas.\n\n&#x200B;\n\nStart calling the girl Teresa lmao"}, {"id": "eof4zfo", "author": "Veldhuis94", "body": "Please update!! I can't go on like this!!"}, {"id": "eof9zqw", "author": "GurillaWarfare", "body": "DO NOT UNDER NO CIRCUMSTANCES TRY TO BREAK THE LAWS.\n\nThere is a huge chance that this is just to test your patience. How would she even be able to know your name?"}, {"id": "eofcqpg", "author": "angydelrey", "body": "This was a psychology experiment, most preferably for a college study. They examine really random people and build the ads around them, It's fascinating. I've been the head of such kind of Experiment. \n\n&#x200B;\n\nThis is how it works: \n\n&#x200B;\n\n1. Basically you look for a particular candidate, the one who has had a criminal record or the one who's really intelligent, anything you can check in the computer databases. \n2. You're supposed to feed your subject the information you want them to know; in thomas's incident (Discretion and easy pay)\n3. You're supposed to keep the choices very simple. (the green button and the red) \n4. You build it up for a week so the mind gets out of the \"Prank Mode\" \n5. Cry for help, occasionally done to test the mentality of a specific age audience or say a specific area of study."}, {"id": "eofcwy8", "author": "Seriem2", "body": "Very creepy indeed, i hope you are alright. Might want to dig deeper into your company or boss on the internet."}, {"id": "eofkuhy", "author": "mushieeplump", "body": "My heart is pounding wildy."}, {"id": "eog0rtj", "author": "AnnoyingRambo77", "body": "Great story. sounds like she is aware she is being watched and who by. cant wait for updates"}, {"id": "eohso8b", "author": "flubbergrubbery", "body": "Why did I assume from the start that the OP was a woman?"}, {"id": "eohwrfz", "author": "ThomasMarkov", "body": "Please tell me other people are seeing Thomas and not their own first name."}, {"id": "eoi344u", "author": "retrowarfare", "body": "Wat"}, {"id": "eoiuj85", "author": "TomJS8", "body": "I wish I had a recording of my face when I read the name at the end."}, {"id": "eonorp0", "author": "krik7", "body": "Starting is awesome..."}, {"id": "eoo8rnz", "author": "Mollysaurus", "body": ">The right monitor was just a black and white terminal like you see in movies some times.\n\nI'm a million years old lolsob"}, {"id": "eoogs81", "author": "Lgrund", "body": "Have you heard of the Milgram experiment? This feels just like it."}, {"id": "eooueh5", "author": "SuchaDelight", "body": "I am so intrigued! I can't wait to read more, THOMAS."}, {"id": "eopi2pl", "author": "bludjr", "body": "  ."}, {"id": "eozqtzv", "author": "Dr-Blythe", "body": "Bump"}, {"id": "ep0iq3b", "author": "jusrile", "body": "YTA. You could’ve done something about it."}, {"id": "ep13axo", "author": "kowallawok", "body": "I got spooked when I read Thomas, thought somehow they were talking me"}, {"id": "ep239gc", "author": "Cobalthaze", "body": "Ezeeeeeeee"}, {"id": "epd5z5y", "author": "KevinAnniPadda", "body": "whoa"}, {"id": "epiwn08", "author": "Dondickson", "body": "How did Rachel knew Thomas name if they have never met before?"}, {"id": "eri5pkq", "author": "adamreg1234", "body": "This is giving me bioshock infinite vibes, anyone else?"}, {"id": "es2c6lb", "author": "captain-antman", "body": "Rl"}, {"id": "f2fvden", "author": "TheRaccoonInUrHouse", "body": "My fav"}, {"id": "f7bb9ye", "author": "BuySellKill", "body": "Can read short context sentences = literate / mature adult.\n\nAnswered Email = credit check.\n\nShowed up ontime , at a set location for interview = able bodied / free willed.\n\nFilled out questionaire / application = personality test AND handwriting samples.\n\nRachel is being drugged out of her mind and being used to trace forged artwork , but the Thomas is being used to pass off as a real artist ?"}, {"id": "f7fnd53", "author": "Katsaros1", "body": ".h mlm"}, {"id": "eodd7hb", "author": "liberaldouche1234", "body": "Thomas u have to get Mr Solomon back, make an excuse that u need to see him. Casually ask him a few questions and gather as much info as you can. Also maybe try and find him on Facebook."}, {"id": "eodxrqv", "author": "Exakter", "body": "I see everyone here going \"do you job Thomas\"... me I'm more of the mind of the bureaucrats that probably imprisoned her there in the name of power in the first place. In other words, free her... and then backstab her and use her power to your benefit."}]}