{"id": "bsrmy5", "title": "My son's camera monitor alerted in the middle of the night. I checked it and saw my wife and son sitting on the bed. They weren't my wife and son.", "url": "https://www.reddit.com/r/nosleep/comments/bsrmy5/my_sons_camera_monitor_alerted_in_the_middle_of/", "subreddit": "nosleep", "author": "RisingMac", "text": "I'm a nurse and I currently work nights. It's a total drag but I'm hopeful I can go to days soon since some coworkers are planning retirements. Anyway, I was working one night when just after 3am my son's monitor alerted me to sound and movement. No big deal at all, he probably coughed loudly or sneezed or something. He's three now so he generally sleeps all night. I bring it up on my phone and I see him and my wife sitting on the bed. Again, no big deal. He might have cried out or gotten scared or something.\n\nI was about to close the app when I noticed they were acting strange, almost creepy. And when I say \"almost\" creepy, I mean creepy as balls. They were sitting on the bed together both of them just staring up at the camera with blank, emotionless stares. The night vision is black and white, so they had white, eerie looking eyes. They didn't move at all aside from their visible breathing, they just sat there staring at the camera.\n\nI close the app and give my wife a call to make sure everything is ok. I never get to call home on lunch so in a way this is kind of nice to get to talk to my family while at work.\n\nIt rings a couple times before she answers with a very groggy \"hello?\" It was like she was dead asleep when I called and she looked wide awake when on the camera.\n\n\"Hey. You guys ok?\"\n\n\"Huh? Yeah. Buddy (my son's nickname) came in like 15 minutes ago. Seemed scared so I said he could sleep with mama.\"\n\nI'm confused here since I saw them in his room a minute ago. Literally 60 seconds had passed since I closed the app and made the call.\n\n\"Wait, so you guys are in bed?\"\n\n\"Yeah, I fell back asleep right away. Everything ok? Everybody keeps waking me up.\" She's kind of annoyed.\n\n\"Hang on a sec.\" I put her on speaker and bring up the app, hoping I don't see it. When the app loads I get that pang of intense nervousness in my stomach that I haven't had in a long time, since I was a kid in school and realized while I was eating breakfast a paper or something was due that day and I hadn't done it. My heart leaps into my throat. My wife and son are sitting on his bed looking up at the camera, same emotionless stares.\n\n\"Hello?\"\n\n\"You guys are in bed right?\"\n\n\"Yeah, we're trying to sleep.\"\n\n\"Well I'm looking at his camera and I see you two sitting on his bed.\"\n\n\"Huh? No. We're in our bed.\"\n\n\"I know that's what you mean, but I'm looking at his bed and you two are in there.\"\n\n\"Hang on,\" she says. She's quiet for a sec while she brings up the camera on her phone. I hear this guttural, terrified gasp. Like she had sucked all the air in the room into her lungs filling them to capacity. I don't hear this kind of gasp from my wife often, usually only when she's truly afraid like during a jump scare in a movie or one time when we turned her back on our son for literally a second and he was down by the mailbox inches from the road. I hear rustling of sheets and the line goes dead.\n\nOf course now I'm absolutely terrified myself so I immediately call back. It goes to voicemail so I call again. I call again and again with no answer. Finally after about four minutes she calls me. I tell you that four minutes felt like 40 years.\n\n\"Hey, what's happening?!\" I ask.\n\nShe's absolutely hysterical and crying, I can't understand a word she says.\n\n\"Stop! Slow down for just a second,\" I say.\n\nShe slows down enough to explain they are in the car and driving to her parents. She looked at the camera and when she saw what was on it she got up and grabbed our son and rushed downstairs and out the door. Didn't even close the garage.\n\n\"Don't worry about it,\" I said. \"I'll drive by when I get off and close it.\" We live in a generally safe neighborhood so I'm not too concerned the door is up.\n\n\"You will not go in there!\" she says.\n\n\"Hell no,\" I return.\n\n\"Why are we on the camera?\" she asked. \"Is it a recording?\"\n\n\"I don't know,\" I return. \"I'm gonna keep watching it and see if there's anything I can tell. Do our code words with Buddy.\"\n\nWe have code words because we're nerds. We've seen too many pod people and impostor movies, so we decided a long time ago to make code words with each other to be able to tell if one of us was an impostor. We have a couple code words, but we also have a three sentence story we recite together, each saying a different part alternately of each other. I hear her on the phone saying the things we taught our son, he giggles as he says them (he does every time we practice) since he thinks they're a joke and doesn't have any idea of the real meaning. We're both convinced he's our son. My wife then says our part and I'm convinced she's her. We made up these words as a complete joke to ourselves. I never once in my life ever imagined we'd actually need them. Unreal.\n\nShe got to her parents safely and it was hard to hang up. I told her we'll figure it out in the morning, hopefully just a glitch. She said she didn't think it was a glitch. When she was running out she had to run by our son's room and the door was open. There's a little flashing light on the back of the camera that indicates its connected to the internet. It gives off just enough light that when she ran by she thought she saw, out of the corner of her eye, a shadowy outline of what could have been an adult sitting on our son's bed. It sends chills down my spine to think about.\n\nKnowing they were safe and out of the house is the only thing that kept me at work that night. It was a long four hours but I kept checking the camera every chance I got. Sure enough, they were still sitting on the bed staring up at the camera with emotionless gazes.\n\nI studied them to see if I could see any pattern, from their breathing to their blinking. Their breathing was steady and looked normal, it was their blinking that would tell me if this was just some kind of bizarre, time looped freak accident video or not. I intently stare at my phone and count the seconds between each blink, telling myself if this is a loop then their blinks should be even and occur at the same time each time.\n\nThere was no pattern to their blinking, it was erratic and random, just as a person blinking should be. The passing hours are what finally sealed the deal that this was not a weird looped video of some kind. My son's window is visible on camera and I can see on camera that it is getting lighter outside his room. His curtains keep out just enough light to prevent the camera from exiting night vision, but lets in just enough to be able to tell the sun is rising.\n\nI try to figure out what the hell I'm going to do before I leave work. Calling the police comes to mind, but I talk myself out of it. First of all what am I supposed to say? Someone is in my house that looks like my wife but isn't? Worse yet, what if they \\*are\\* entities of some kind and the police do go over and it kills them or something.\n\nI decide to tell coworker about it. He's a firm believer in the paranormal and might have a suggestion. I show him the video and tell him the story. His initial response of \"that's creepy as fuck\" doesn't help much, but he says he wants to go over and check it out. He says we both should to see if Not-My-Wife will try and act like my wife. I tell him absolutely not and he says we should at least go to the house even if we don't go in. I agree on that since I wanted to close the garage.\n\nWe got to my house and walked around the perimeter first. Not sure what we wanted to accomplish by that, but it felt like something we should do. The curtains were all drawn since nobody was there to open them in the morning, so we couldn't see anything. I went to close the garage and suddenly had this overwhelming urge to go inside and investigate, it was like I just had to know what was going on. So in we went.\n\nWe walked through the kitchen towards the foyer where the stairs are. It's so quiet in our house right now you could hear a feather drop, forget the pin. We stop at the bottom of the stairs and wait a few seconds. I look at the camera again and they are still sitting there. I've never been so scared in my life. My coworker puts his foot on the first step and I suddenly say \"stop\" loudly.\n\n\"Forget this, we're outta here,\" I tell him. \"Come on,\" I start making my way back to the kitchen.\n\nWe hear a loud creak in the floor from upstairs. It's my son's room. He has a very loud, creaky board right in the middle of his floor that's almost impossible not to step on. My wife and are still deciding if we ever want to fix it because it will alert us if he's ever up to no good when he gets older trying to sneak out or something.\n\n\"Come on, come on, COME ON!\" I yell as I motion for him to move his ass. We're out of the house in about two seconds. Out on the street I check my phone. Now only Not-My-Son was sitting on the bed, same blank stare. Not-My-Wife was gone.\n\n\"Holy shit!\" my coworker says,\n\n\"That was stupid as fuck of us. Do NOT tell my wife we went inside.\" She would be so ungodly mad if she found out what we just did.\n\nI use my garage door opener in my car to close the door. Before we leave I look at the camera again. Not-My-Wife is back on the bed with Not-My-Son, both staring blankly up at the camera, blinking every few seconds.\n\n\\*\\*\\*\n\nThat was all about four days ago now. Not-My-Wife and Not-My-Son are still sitting on the bed staring up at the camera. They haven't moved a millimeter. We obviously haven't gone back to our house. What do we do?\n\n\\---\n\n[Part 2](https://www.reddit.com/r/nosleep/comments/c6j9rp/my_sons_camera_monitor_alerted_in_the_middle_of/)", "comments": [{"id": "eoq3plm", "author": "rayneraynedrops", "body": "I'm curious tho, if your 'not-your-son' and 'not-your-wife' is there, then where's your 'not-you'?"}, {"id": "eoq5xur", "author": "scottiepeepin", "body": "Ask them fuckers to pay rent."}, {"id": "eoprixi", "author": "GiantSizeManThing", "body": "It would have been much worse if your son hadn’t said the right code words."}, {"id": "eoq11g7", "author": "KingEarlThe2nd", "body": "To help test the theory that it is a true live feed, stand outside the son’s bedroom window with the footage on your phone and throw a rock/brick/grenade through the window. Will see if it’s truely live and also scare who or what is in that room."}, {"id": "eopldmz", "author": "_the_hitsmans_", "body": "You could try to contact paranormal investigators. I am sure they would be super interested in this case as well as have more insight on what to do proceeding forward. \n\nAnother option is call the police and tell them there has been a break in. They should go and search the house, then you can see how your other family acts."}, {"id": "eoplf6z", "author": "Ole_Roscoe", "body": "Call the cops, leave out the part of your son and just report a suspicious woman in the house."}, {"id": "eopl85a", "author": "TesseractMagician", "body": "Call the cops and have them check it out? Keep us updated!"}, {"id": "eoqlg9j", "author": "EbilCrayons", "body": "You went into the house after your wife begged you not to, because you felt a sudden urge to do so. \n\nPlease call your wife and do your little code checks one more time."}, {"id": "eopl82v", "author": "IncrediblePlatypus", "body": "Call the police. Show them the video.\nYes, they'd be in danger of they check it out, but maybe it gets elevated to a better handler?"}, {"id": "eoqhh14", "author": "Ballistic_King", "body": "What you should really be worried about is where your clone is. It is kind of weird (in addition to the present weirdness) that there is only a clone of your wife and son. The clones seem to rely on normal senses (since the wife-clone didn't move until after you made noise), which means it is possible they have physical limitations (good news).\n\nI recommend taking your kid and wife with you to the police station and telling they police that there are weird Intruders in your house (show them the video). If they listen and send some guys, it is possible they will be killed, but armed police possess a better chance at killing physical entities than you do.\n\nNext, make sure you make your story public (video and everything). That way if there is anyone who wants to shut you up it will be difficult for them to do anything while you are in the public eye.\n\nI'm sure the interaction the clones have with the police (if they go there) will provide better insight into what you are dealing with. Also no matter what don't go back to that house (and find out what it was that scared your son in the first place, there may be a clue there)."}, {"id": "eopo9ud", "author": "isevery1madorjustme", "body": "Isn't it obvious? You burn the place to the ground and run like the hounds of Hell are nipping at your heels. Rebuild your lives several hundred miles away. If you do it just right you may even get the insurance pay off for the fire."}, {"id": "eopul9l", "author": "MrKittySavesTheWorld", "body": "Get a couple of shotguns and some guys.  \nThere’s only two real possibilities here:\n\nOne:  \nIt’s some sort of demon, in which case a load of buckshot will cock its clock off just like anything else.  \nEven something like a Skinwalker can’t survive a clean shotgun blast to the face. Nothing can. Trust me.  \nThe floor creaked when it moved, so this is the more likely scenario.\n\nTwo:  \nIt’s some kind of ghost, in which case the bullets won’t work, but it also can’t touch you either, so you can nope right back out and call an exorcist.  \nIncorporeal entities are exactly that; they aren’t physically present.\n\nRarely, ghosts can still hurt you, but any situation where that could happen would require you to be *alone,* hence having other people with you.  \nIf there’s multiple people there, no intangible spirit is capable of doing shit. This is universally consistent across the board.  \nBut you **need** a majority. So, for example, you’ve got two ghosts, so you need a minimum of three people to be safe.\n\nThem’s the rules, chief. Good hunting."}, {"id": "eopxgvx", "author": "_RealityIsntReal", "body": "Keep in mind that deepfake technology is a thing now.  Whoever is doing this likely has direct access to your camera feed and has imposed photos to obscure their identity.  It could be anyone in that room.  Return armed and loaded and breach the house while your friend feeds you their positions from across the street.  Try to lure them downstairs, where you can get a clear mark on them.  Proceed to execute them for trespassing."}, {"id": "eops7lm", "author": "ZedXYZ", "body": "Dude, you have the proof on your damn monitor! Show the cops while they’re still there and it can be proven, and record/save the footage for reference! Don’t go back home again until it has been sorted."}, {"id": "eoptfoa", "author": "WimbletonButt", "body": "I had one of those cameras in my son's room too but I was strict about not checking it at night. I was worried I'd imagine something or something screwy would go on with the camera and I'd be spooked by a completely normal bedroom. He stopped sleeping in his room about 9 months ago. I'd get him to bed and he'd be up within 2 hours terrified and unwilling to be in his room alone. He was cool with it if I stayed but I wasn't willing to do that so we've permanently moved to my bed and my own sleep has improved too. That camera was disconnected long ago and the door has only been cracked at night this whole time. I walk by that door every night to pee, now I'm fucking creeped out."}, {"id": "eoq8k5t", "author": "odeorain", "body": "Something to keep in mind if you call the police - if this entity attacks a cop, since she looks like your wife, it could get your wife in a shit ton of legal trouble. If you call the cops I would make sure to be at the house WITH my wife when they arrive so that you can show them that your wife and the lookalike in the house are not the same person."}, {"id": "eoprvyj", "author": "DatNoobi", "body": "Nah dude, you get a baseball bat and helmets or some shit. That's if you're intent on not calling the damn cops. Call the damn cops. Why would you NOT call the damn cops? You have PROOF that there's some freaky shit goin on and you don't really have to show them. You tell them that there's some intruders in the house."}, {"id": "eoppd1g", "author": "my__name__is", "body": "The first time I read the comments every single one was doubled up. When I refreshed it was back to normal. That's really creepy, what are the chances."}, {"id": "eopqrya", "author": "kIimIko", "body": "Keep us updated!!"}, {"id": "eoqz2ga", "author": "Hyhena", "body": "Definitely call the cops on this situation but explain it differently to them. \n\nI love that you and your family has code words. I just asked my wife if we should have code words and she said “Why?” She doesn’t see the importance of it. She might be a pod person."}, {"id": "eopsv2w", "author": "DefinitlyCringy", "body": "WE NEED AN UPDATE OP. What are you planning to do?"}, {"id": "eoqy5x0", "author": "DrQAlias", "body": "Since you didnt mention it, just wanna check... you've been with your real wife and son for the past four days, right?"}, {"id": "eopsgnn", "author": "InSpaceAndTime", "body": "How unsettling. I'd say call the cops and a paranormal investigator and let them investigate it. Stay safe and make sure you keep on doing the code checks!"}, {"id": "eor469f", "author": "Shurican4", "body": "Call the cops bro! Imagine if you open your app tomorrow and they're gone? Will you ever be able to go home? Call the cops while they're still there!"}, {"id": "eoqlwnr", "author": "ownUforever101", "body": "Sounds like spirits to me, my friend. Luckily they don't seem to be particularly malevolent as your wife and child were unharmed (at least that's what I assume from the story) before you alerted her, but don't rule that option out yet. The fact that you had a gut feeling to get out of there when your friend started going upstairs makes me think that these supposed spirits probably don't want you there. The disappearing of the woman on the monitor also lends evidence to that. \n\nI say call the police first and if they don't find anything then contact some paranormal investigators. Other than that take a bundle of sage, throw it upstairs (try to aim in your son's room if it's visible from the stairs), and gtfo. Sage is an effective deterrent against evil and demons and the like. Even if you don't believe in that stuff, couldn't hurt right?"}, {"id": "eq40xb9", "author": "lilLamejr", "body": "Yooo, its been 11 days. What the fuck happened"}, {"id": "eops587", "author": "Hyddan92", "body": "Get 500 guys and storm the house while blasting death metal from giant speakers."}, {"id": "eoq7eot", "author": "WildEyes27", "body": "Please tell me there's an update to this."}, {"id": "eoq8a6c", "author": "Pradeep2k17", "body": "Next month payment due on them."}, {"id": "eoqq4xc", "author": "PressingForward", "body": "This happened to me years ago on a hunting trip. My dad was in the living room staring blankly at a tv that wasn’t even on, and when I checked his room he was asleep in bed. Keep us all updated on this because I’d like to know what this phenomenon is. Could it be non threatening? Maybe it’s some alternate dimension slip through into ours?"}, {"id": "eora1ht", "author": "_nothing_2_c_here_", "body": "Call the police, and the priest."}, {"id": "eou1sza", "author": "OffTheRyles", "body": "I need an update goodddaaaaammit"}, {"id": "eorayks", "author": "dallasxo18", "body": "it pisses me off theres literally people in your house, and you havent called the cops or done anything. whats wrong with you?? like at least check it out... how you handled this situation honestly baffles me."}, {"id": "eopqkav", "author": "HadleyMay19", "body": "Go in that bitch with an ar15 and shoot whatever moves"}, {"id": "eoq31jy", "author": "KillShotInPosition", "body": "**burn the house down.** \n\nthats the only logical thing to do imo"}, {"id": "eox4gz5", "author": "NickNameIs_A", "body": "not wife and not son are on the bed while not husband is away at work. that sounds like xhamster shit right there"}, {"id": "ep39adi", "author": "bcombest1", "body": "I need an update!"}, {"id": "eou3ggm", "author": "Transfotaku", "body": "Got a few questions for you OP:\n\n* Is the Not-Son and Not-Wife still there, a day or more later? Have they just been still this entire time?\n* Besides you moving up the few stairs, has any stimulus made them move?\n* How old is your house? How many people lived in it before you, how many died in it, and how many of those died under unnatural circumstances?\n* Did you ask any of your neighbors about your house's past occupants?\n* How long have you lived in this house?\n* Has anything near this happened before to you? Son hearing something, wife seeing something out of corner of her eyes, odd noises, that sort of thing?\n* Have the entities spoken or seem to communicate in any fashion?\n* Where are you from? General location like 'Upstate NY' or 'Central PA' works.\n* Have you looked into any sort of help? Cops, paranormal investigators, etc? Do you want any help?\n* Do you have drones? Is your baby monitor able to communicate through the viewing app? IE can someone talk to the entities using the monitor?\n* On a scale of 1 - 10, how religious is your family? In general and each individually. If you consider yourself or your wife \"rather religious\" then what religion?\n* Is there anything strange in your area? IE was your area a ghost town before being repopulated, a Native American burial ground, a Smallpox 'Hospital' on the spot, mass murders, etc etc?\n* Do any of your neighbors see strange entities?\n* Did you, or can you, take photographs of the entities?\n\nI guess that's a few more than 'a few questions'."}, {"id": "eoq38xk", "author": "pastelditto", "body": "Could they be skinwalkers imitating your wife and child, not knowing how they act because they were asleep at the time?"}, {"id": "eoqrttl", "author": "brianofblades", "body": "Is network access to the camera encrypted or public? Possible it could be a prank"}, {"id": "eork15d", "author": "QuillPenMonster", "body": "I'm chicken as fuck, so my first thought was \"nuke the house,\" buuuut that won't help really. Maybe get a few drones and try to get one inside to investigate? Worst thing'll happen is you're down some money cuz Creepy McGee and Creepy Jr. ate the drone."}, {"id": "eot4lkq", "author": "Harthang", "body": "Just wanna say I applaud you for all the smart moves you and your wife made. Having the camera and code words set up in the first place, calling your wife to check on her instead of dismissing the weird behavior as a prank, your wife taking Buddy and getting out of Dodge, and you having the sense not to confront the things (even though you did go in the house, it sounds like that was either a momentarily lapse in judgment or some kind of external influence). You even had the wherewithal to consider that sending the cops in could put their lives in danger. \n\nSo many of the people who live long enough to share their stories on nosleep do so in spite of all their horrible decisions making their situations worse than they had to be.\n\nYou're going to have to deal with the problem sooner or later though, can't stay with your folks forever. I don't know what the doubles are but I am confident a clever family like yours will figure it out."}, {"id": "eovuont", "author": "talkingtheories", "body": "Hey guy, need an update, getting real antsy over here 😬😬😬 hope everything is a-ok"}, {"id": "eq9t2vi", "author": "kiengei", "body": "just get a gun, this is america"}, {"id": "eopub7x", "author": "SherwinAlva", "body": "Honestly these stories always scare the fuck out of me I don’t think you should call paranormal investigators I think you should fucking arm yourselves with a. Flamethrower and desert eagles and go fucking nuts on that house I guarantee those impostors will shit their pants before burning we’re doing this **The American Way** 😎"}, {"id": "eor1eug", "author": "foursetters4", "body": "Burn sage and Holy wood all around your house"}, {"id": "eosevat", "author": "cyborfreeme", "body": "which city are you in? I want an army of redditors to investigate."}, {"id": "eoshcts", "author": "TheRJMcFerran", "body": "Holy shit. That's me not buying a baby monitor."}, {"id": "eosx9yz", "author": "UR_MOMS_PNUTBRITTLE", "body": "Since it’s been daytime since this has occurred, has the cam shifted to daytime mode and have you had a better look at the “figures”? Are they still just shadows?"}, {"id": "eosz9rw", "author": "Wondrous_Fairy", "body": "What do you do? Rational people call the police and let them deal with it.\n\nIrrational people arm themselves, listen to Mick Gordon's BFG Division and then go in and deal with these things themselves.\n\nMe? I'm staring at my camera on the phone."}, {"id": "eougtq0", "author": "SlavioAraragi", "body": "Burn the house. Ashes mix with blessed salt. Throw them away with the northern wind.\n\n100% success guaranteed"}, {"id": "eqbgted", "author": "TheFFCommish", "body": "What happened?!?!"}, {"id": "ern2fyy", "author": "Noel_like_Christmas", "body": "A nurse getting a lunch break? This is the most unbelievable part of this story."}, {"id": "eoqddzs", "author": "CUNextTime2019", "body": "Hire an actor who resembles you as closely as you can find.  Don't tell him the situation, tell him it's a big brother style audition with a wife and son and your just trying to capture a typical day of a shift working male nurse. See how it plays out."}, {"id": "eopuxsm", "author": "bxxxx34", "body": "Go in there! I want to know waht those things are."}, {"id": "eopwq90", "author": "tallglassofanxiety", "body": "Fucking skinwalkers"}, {"id": "eopws6z", "author": "tori_is_tired", "body": "Call the cops!"}, {"id": "eopwybi", "author": "RabbitPatronus", "body": "call the police and show them the video and then keep us updated!"}, {"id": "eoq6ft6", "author": "Catermelons", "body": "Burn the house?"}, {"id": "eoqaw7h", "author": "Gaelwyn_the_unholy", "body": "It sounds like you've got doppelgangers in you house. That's not something I'd want to confront by myself. I'd contact a paranormal investigation team who have someone who can bless/smudge your house, but first you should call the cops."}, {"id": "eoqdaco", "author": "redsparkypants", "body": "Soooo you and your wife also did the code words, right?"}, {"id": "eoqqe5n", "author": "texasplumr", "body": "I’d send the police in there.  Seriously, why not?  This kind of shit is part of their job. Send in the fucking cavalry, if necessary."}, {"id": "eorqx09", "author": "mudargamer", "body": "Bomb the house"}, {"id": "eos6z0g", "author": "1maxg", "body": "Really great story, thank you! I’m imagining NYW and NYS watching a monitor where every time you guys view the app they just see your reactions to what you see. As if they’re tuned in to their own TV show, but in a parallel universe. And when NYW gets up from the bed it’s Bc of the noise you and your coworker made going into the house."}, {"id": "eosgkw2", "author": "Exrudis", "body": "Can you talk through the monitor?"}, {"id": "eoshc9t", "author": "hearithowyouwantit", "body": "Should of left the garage door open, use a burglar as a test subject, at least see if they react to someone else or just you..."}, {"id": "eoso8h6", "author": "Soul_Overflow", "body": "*I got 5 on it intensifies"}, {"id": "eossm9x", "author": "blanketRay", "body": "Foreclose your house and get the bank to evict them. Nothing stops the banks."}, {"id": "eosz207", "author": "rainwatereyes1", "body": "2 skinwalkers are a possibility, skinwalkers are able to shape shift and they are pretty smart so they would know how to lure you inside."}, {"id": "eot1ug5", "author": "Timelesshero", "body": "If its been 4 days, have you seen your family?"}, {"id": "eotktue", "author": "xseveninex", "body": "dont be a spineless chicken, go back to that room and update us"}, {"id": "eotnfnm", "author": "hiimannefrank", "body": "I'm pretty sure those two entities are looking at the camera for a reason. Maybe they *want* you to keep an eye on them. I wonder if the not-you entity is working behind the scenes."}, {"id": "eotyd2h", "author": "acm_falstaff", "body": "Why'd your real son leave his room"}, {"id": "eou1fhi", "author": "aquay", "body": "Burn the house down. Jesus."}, {"id": "eoupanr", "author": "balgram", "body": "Does the camera have a mic/speakers? Can you communicate with the imposters without entering the house? Finding out what they want may help you get somewhere."}, {"id": "epk6j2j", "author": "zzsparkzz", "body": "Please tell me there will be more to this??!!"}, {"id": "eopr094", "author": "Ninevehwow", "body": "Salt cleanse. Start with a thick circle of kosher salt( no additives) around the outside. I mean super thick no breaks."}, {"id": "eopsc9d", "author": "SSBMarkus", "body": "Call in an air strike"}, {"id": "eoq78gk", "author": "yeahnazri", "body": "My mothers solution to any ghosts, honestly was to just ask them politely but firmly to leave . So maybe that would work for you but I'm  not sure, also keep your son away from there because at least in my culture spirits like to fuck with small children"}, {"id": "eoq7mvw", "author": "vanmoll", "body": "Throw some phone or mp3 player on the room with highest volume with this Qur'an reciting\n\n[https://www.youtube.com/watch?v=cjmM12Ln0Jg](https://www.youtube.com/watch?v=cjmM12Ln0Jg)\n\n&#x200B;\n\nJinn (or spirits) and human are both real but we're strong against them. Naturally we can't see them, but when we can see them it's a sign that they just crossed to our world. And if you crazy enough you can squeeze them with your bare hand when you're able to caught it."}, {"id": "eoq97q2", "author": "Tbrock0420", "body": "Wow holy hell. That's creepy. The best I can say is call the cops, then a paranormal team who maybe specializes in this. Keep us updated OP."}, {"id": "eoq9tnk", "author": "Cameo4You", "body": "The best thing to do is search ur sons room but be armed with a knife or something cuz if they're real people (probably not cuz they would have moved to eat, drink, or sleep) but who knows but u need to search the room and if there's nothing there i'd suggest getting a pet mostly a dog cuz even tho cats and dog can both see things we can't cats don't bark or make a loud noise to alert u like a dog can. but its up to you"}, {"id": "eoqb0lo", "author": "tteenageanarchist", "body": "I'd say contact a priest to rid the house of spirits and evil."}, {"id": "eoqk23s", "author": "Momof3dragons2012", "body": "I’d have someone run in there with a huge sheet of plywood and nail gun it over the door, then hire a moving team to clear out your house.  Sell the house and let the new owners have fun discovering the boarded up door.  They can come here and tell us what’s behind the door."}, {"id": "eoqmaf5", "author": "Olebigone", "body": "Arm yourself and go check it out. Bring spray paint in case they turn invisible when you get in the room."}, {"id": "eoqt71x", "author": "PaintedDeath", "body": "No BS man, this messed me up for awhile.  I'm sitting here trying to work and still have that chill running down my spine."}, {"id": "eor2k5a", "author": "LastOffender", "body": "I agree with the others. Have the cops check it out first and go off from there. If this is really serious, Afterwards you may want to call a witch doctor or whatever is equivalent where you live."}, {"id": "eor3etx", "author": "Relaxel", "body": "Go straight to the cops and just tell them everything."}, {"id": "eor7n13", "author": "pengeek", "body": "I’ll bet your camera is stuck in a video loop."}, {"id": "eor973l", "author": "TwinMonkeyMom", "body": "On the bright side, this could be an opportunity to rid yourself of \"friends\" or family. Although that could backfire in a major way."}, {"id": "eorbxhn", "author": "Yudamori", "body": "Actually gave me that nails on a chalkboard creepy vibe. Haven't felt that in a while, well done."}, {"id": "eoreffb", "author": "Sirbuzzkillington89", "body": "Call the cops"}, {"id": "eorkegj", "author": "xXdat_boi70Xx", "body": "It's their house now"}, {"id": "eorrfjb", "author": "televisedcomet", "body": "Holy shit that’s a story. Throw a rock through the window.m from a distance. See the reaction on the camera."}, {"id": "eorwajh", "author": "gr8teru", "body": "I saw in his post history about how his house was haunted, so there might be a correlation between that and the recent events."}, {"id": "eoryaxo", "author": "n0ledge1", "body": "Leave a door open so you get robbed. Check the camera to see what happens to the robber"}, {"id": "eosdmxo", "author": "Zamundaaa", "body": "Shit. Now I probably won't be able to sleep anymore either. Or look in the mirror. Or do anything.\n\nBut really, go to the cops with your family. Show them the video (best make a screenshot at the very least, should it change) and say that there's someone in your house. It's freaking you out and you don't know what to do. They'll check it out. It's their job.\n\nWhat I imagine happens is that some weirdos are pulling a very extensive and very, very messed up \"prank\" on you.\n\nOr, what I hope for, that you made this up. Because this is really messed up and after something like this, even if it resolves to be something rather harmless, I wouldn't be able to stay in that house any longer. I'd not feel secure for a looong time after that."}, {"id": "eosiwxg", "author": "Papa-heph", "body": "Well, I guess I’m never sleeping again. Thanks for this."}, {"id": "eosnk3e", "author": "Life_is_a_Brie", "body": "This is so deliciously creepy"}, {"id": "eospnky", "author": "Jepege", "body": "You should've told your wife to just go outside instead of telling them what's going on, that's creepy as fuck"}, {"id": "eosvhzw", "author": "Dik4short", "body": "Why not talk to them through the monitor? Every baby monitor has a talkback feature."}, {"id": "eot5yke", "author": "luciuslumos", "body": "1-Bring the everyone you know with you + cops + arms and gadgets \n\n2-hit the window if its glass and brake it. If not find a way to take the curtains off from outside\n3-see what's from by climbing the outside wall with everyone by you : if its visible entitiea , send in some gaz inside to weaken them without damaging the house\n4- if invisible , start by sending a drone to the camera and see if it was messed with ; if the can is fine , welp you need an exorcist"}, {"id": "eot97r5", "author": "Newzab", "body": "Oh damn, glad curious co-worker didn't go further. Understandable that he'd be intrigued but ughhhh. \n\nWish I knew what to tell you. Don't want the cops to get killed but what are you going to do, just abandon your house?"}, {"id": "eothe9n", "author": "Xela_33020", "body": "Astral projection"}, {"id": "eotwqc9", "author": "MolotovCockteaze", "body": "How about going to the cops with your wife and son. Then if they show up at your house they will know whomever is inside the house\nIs someone else. \nJust say that there is an intruder in your son's bedroom and your wife and son escaped. They will go get whomever is inside and if it is some kind of double then the police will see them first hand. \nDo you have a house phone. Maybe try calling and seeing if the double picks up. Ask the double the codes just in case the double knows them too. If they both know the coes then there is another issue at hand."}, {"id": "eou56t1", "author": "AUSTRALIAN_WORD", "body": "Call the cops, have the entire station there and see what happens"}, {"id": "eoup50r", "author": "kingBalian", "body": "You have it all on the phone, and if you already didn't, record it. Show it to the police (live footage if possible) with you wife, explain that you fear that there is risk for their lives. Then they'll know everything you (and we) know, and will be fully prepared to go in."}, {"id": "eouvvfd", "author": "kiwifun1", "body": "Stay safe op, and please keep us updated."}, {"id": "eouxfhz", "author": "BloodMoneyArcade", "body": "If you're really hellbent on not just calling the damn cops (just report a strange person in your son's room with a gun,) then maybe this'll work. This may or may not be a viable option, depending on how close your house is to your neighbors'.  I say gas 'em out.\n\nBefore doing this, make sure you have screen-shots, or even better, a video of what you've been seeing on your phone. If your camera system doesn't come with a way to download the videos it takes, have your co-worker film your phone screen with his own. Try to film long enough that it can be confirmed it is not a loop. Make sure to get a statement from your wife and co-worker as to what's been happening.\n\nDo a walk-around of your house from the outside, to be certain all your doors and windows are shut. If you have windows open upstairs, you're gonna have to scrap this plan and find something else to do since you can't get to 'em. If you have windows open downstairs, DON'T GO IN TO CLOSE THEM.\n\nGet yourself a 4-gallon bucket, a caulking gun, plastic wrap, duct tape, as many wet towels as you have doors on the outside of your house, a gas mask (for your own safety, just in case,) a bottle of ammonia, and a bottle of bleach. You can get a working gas mask for relatively cheap online.\n\nIf you have any open windows, put at least three layers of plastic wrap over them and use the duct tape to hold in place. Use the caulking gun to seal the underside of closed windows and around your doors. You do NOT want this shit getting out. Use the wet towels to seal the underside of each door. Make sure to have a wet towel prepared and slung over your shoulder so you can also seal the front door. Have the caulking gun set outside the door so you can pick it up and seal the door as quick as possible.\n\nGet your co-worker to stand on the street as back-up--buddy system! He should be watching the camera stream so he can yell at you if anything changes while you're pulling this off. He should probably have a gas mask, too, just to be safe.\n\nHave the bottles pre-opened and only slightly closed again so you can open them quickly. Just go up to your house, open the front door, go in about three feet, set the bucket down, dump the contents, run like hell back to the door, shut it behind you, an seal that shit up.\n\nSee if them fuckers like chlorine gas."}, {"id": "eovfuhw", "author": "Wasabi_Gamer26", "body": "Can we expect updates OP?"}, {"id": "eovrlye", "author": "Dwidjee", "body": "Hey OP, whats the current situation?"}, {"id": "epbe8bz", "author": "urmumlesbiant", "body": "I think he dead"}, {"id": "epv8prb", "author": "Huckleberry_Sin", "body": "Need a sequel or follow up to this one"}, {"id": "eq0kqgm", "author": "sethmwilliams", "body": "Need an update on what you did/plan on doing about the NotWife/Kid"}, {"id": "erku6bs", "author": "WalkinSteveHawkin", "body": "I guess OP got killed.  It’s been over a month with no update"}, {"id": "es9whdc", "author": "GiverOfZeroShits", "body": "This is genuinely terrifying"}, {"id": "eum8k6f", "author": "SurelyIwontforget", "body": "So heres a question. There's a possible intruder in ur house and ur wife and child there as well unknowing to the possible harm they can come upon. What the fuck is stopping you from rushing or calling the cops?"}, {"id": "f5jav8l", "author": "nrgxlr8tr", "body": "you should call the cops, stop acting like youre in a horror movie"}, {"id": "eote18u", "author": "Antnywar", "body": "You finish the story. This is a bigger cop out than waking up and it all being a dream. I don't mind doing some of the work but I don't want to have to finish the story myself.  There''s so much more potential to develop this story. It was really good and so well written and really spooky right up until the anti climax."}, {"id": "esaezvd", "author": "hollowwistle24", "body": "This is almost well made. \n\nAnd when I say almost, I mean well made as balls."}, {"id": "eoq1bpk", "author": "3000ping", "body": "This made me actually tear up out of discomfort. Amazing. I would screenshot the camera recordings as evidence in case and show the police asap."}, {"id": "eotnut9", "author": "Cause-Effect", "body": "Go in. It's time for a threeesome"}, {"id": "eoq1060", "author": "SuzeV2", "body": "I’m with the idea of a paranormal investigator but add a priest.  But you’d have to show them your evidence"}, {"id": "eoq2g5k", "author": "clnrdx", "body": "please oh please, call the cops. if you didn't want them to be harmed, at least bring a paranormal or a shaman. it probably would've helped"}, {"id": "eoqe23r", "author": "Vlademar", "body": "These \"ghosts\" can still be normal people with nothing better to do."}, {"id": "eoqfadj", "author": "HenCockKneeToe", "body": "I'll go in for you!"}, {"id": "eoqnrte", "author": "TripleThreatKNJ", "body": "Go to police with your wife and kid and then show them the video of the dopple-family and explain you don’t know who they are but the feed is live? Maybe go to paranormal specialist if the police turns out to be less helpful"}, {"id": "eoqr9ou", "author": "Banditodaburrito", "body": "Keep us posted."}, {"id": "eoqt4dn", "author": "Plant_boi", "body": "Go in with a bat knife or some sort of gun and go ham or burn down the house go around the house with gasolin and set that on fire"}, {"id": "eoqualc", "author": "Leering", "body": "Burn the house down."}, {"id": "eoqvh30", "author": "biggoddess", "body": "Obviously you have to burn that shit to the ground."}, {"id": "eoqytog", "author": "Supahsecretsauce", "body": "We definitely need an update op no matter what you decide to do."}, {"id": "eor3zcn", "author": "taeoh666", "body": "Burn your house down. Better yet, drop a literal bomb on it."}, {"id": "eor4abu", "author": "killer_punk", "body": "I would love to hear an update to this! I hope everything’s okay"}, {"id": "eor694i", "author": "Lyn1987", "body": "Is there any way for you to light the house on fire and make it look like an electrical problem? If so problem solved"}, {"id": "eor6i5n", "author": "coldasaghost", "body": "Record it, preferably in HD"}]}