{"id": "bvy4vv", "title": "We’ve been stuck in construction traffic for 8 hours now. If we leave our vehicles we will die.", "url": "https://www.reddit.com/r/nosleep/comments/bvy4vv/weve_been_stuck_in_construction_traffic_for_8/", "subreddit": "nosleep", "author": "nslewis", "text": "Lauren is in the Honda Accord right behind my truck, with our two cats, but I can’t get out and see her. The last guy who got out was shot in the legs and then run over by a tank.\n\nWe set out yesterday from Gainesville, Florida, where Lauren had recently graduated from law school. We were moving to my home state of Maine, to start a permanent life together. The drive was beautiful most of the way, and Lauren and I spent a lot of time on speaker phone with each other to comment on it. A couple of times we passed through rain, and once a really wild thunderstorm that lit up the whole sky for miles. Then, about 8 hours ago, we hit a traffic jam on I-95 just outside of Lewiston, Maine.\n\nI took a look at the navigation thing on my phone, but it didn’t show any red areas of heavy delay. It also had some trouble showing my exact location, though, so I lit a cigarette and figured it would just be a few minutes.\n\nAfter about fifteen minutes, I called Lauren. “How’s it going back there?” I asked. In the background, I could hear the cats going nuts.\n\n“Not great,” said Lauren. “Do you hear Hankie and Hattie howling? They started up as soon as we stopped. What's going on?”\n\n“Must be an accident that just happened. My phone usually gives a heads up if there’s planned construction or something.” I heard one of the cats hiss while the other one yowled.\n\n“I’m so tired,” said Lauren.\n\n“I know, me too. Let’s stop and get something to eat once we’re through, yeah?”\n\n“Okay.”\n\n“Alright. Love you. Sorry about the cats.”\n\n“Love you,” said Lauren.\n\nI hung up and tried to get something on the radio. I have a base model 2006 Toyota Tundra, so no AUX jack, and the CD player had broken years ago. During the entire trip, I had been at the mercy of radio stations, and for the most part, they didn’t do much for me other than create a general atmosphere of annoyance.\n\nNow, though, I couldn't even keep the radio on. What wasn't warbling static was some kind of distorted robotic voice reading off a list of numbers and random words strung together. Across the whole radio band, same thing. I couldn't take it so I shut it off.\n\nI picked my phone back up and went to check Twitter. All I got was that game where you have to jump the dinosaur over cacti faster and faster and then it gets dark out and the birds come. No internet. Finally, Twitter did half-load, so there was *some* intermittent reception there, barely.\n\nAfter a half hour had passed, I started to get antsy, and so did everyone else. People were sticking their heads out the window to try to see what was going on, but it was no use. The line of cars seemed endless. A few people got out of their vehicles to try to get a better look. I got out too and started walking to Lauren’s car.\n\nWhen I was halfway there, a voice cut into the air. It sounded like someone shouting through a bullhorn. “Return immediately to your vehicles! No one is permitted to be outside! This is your only warning. If you do not heed it, there will be severe consequences.”\n\n“Wha da *fuck* is goin’ on?!” some guy shouted in a thick Boston accent; he was standing a few car lengths in front of me. An instant later, he was down on the ground, not moving. I didn’t see what happened exactly, but that was enough to make me to hustle back to my truck.\n\nI tried calling Lauren again. When she answered all that I could hear were broken flashes of the cats screaming and Lauren sounding scared and begging to know what was happening.\n\n“I don’t know,” I said, not sure that she could hear it. “Maybe they’re searching for a criminal or something. I don’t know.” Then we were disconnected.\n\nA minute later, an ambulance was wailing its way down the right hand shoulder. It stopped just past my truck, and two EMTs jumped out of the back. They closed the doors behind them, but I saw that there was somebody else in there. Somebody dressed in riot gear, holding a big gun.\n\nThe EMTs dragged the guy with the Boston accent by the arms over to the ambulance. They opened the doors and sort of tossed him in, and then followed behind. I saw the riot gear person again for a second, and then the doors slammed shut and the ambulance sped off down the shoulder out of sight.\n\nSomebody four cars ahead of me got the idea to follow the ambulance out of there. I watched as a red Hyundai Sonata with a New Jersey license plate tore into the shoulder lane and sped after the ambulance.\n\nI tried calling Lauren to ask her if she thought we should try it too. It was a ballsy move for sure, but she had sounded at the end of her rope stuck in there with our wailing cats, so I thought she might be willing to give it a shot. This time, the call didn’t even go through.\n\nI was getting ready to try calling again when I heard this loud blast. A puff of smoke blossomed somewhere up ahead, and all of a sudden, there were chunks of a car flying through the air. A red car. Very likely a red Hyundai Sonata.\n\nAs I watched a flaming tire roll to a stop against the highway divider, I decided not to replicate New Jersey’s maneuver.\n\nI heard the blast of a horn behind me, and looked in the rearview to see that Lauren had her arm out the window, moving her hand around in a circle. Finally, it hit me that she was telling me to roll down my window, so that’s what I did.\n\n“Can you hear me?” she shouted.\n\n“I can!” I could even hear the cats. They sounded really freaked out.\n\n“What is happening?!” she asked.\n\n“I don’t know baby! I think we’re in some kind of military lockdown maybe! I think we have to just sit tight here.”\n\n“Can you throw me a bottle?” asked Lauren.\n\n“What?”\n\n“A bottle! Like Gatorade or something. I know that you’ve probably got ten of them in your front seat.\n\nIt was true. Not ten exactly, but close enough. I just threw all of my trash on the seat of my truck until it started overflowing, whereas Lauren kept her car clean. “What are you going to do with the bottle?” I asked.\n\n“Not something I want to shout out for the whole world to hear!” said Lauren. “Let’s just say we’ve been here a while and I don’t think we’re coming to a rest stop soon enough.”\n\nFinally, I understood. I reached over and grabbed a bottle. I chucked it out the window, but it was a bad throw, and bounced off the hood of Lauren’s Honda. I tried again, and this time she caught it. She rolled up her window and in the rearview mirror I watched her fuss around as she presumably tried to pee into the thing.\n\nThis was when the fleet of massive trucks started rolling in, on the southbound side of the highway divide. Some of them had cranes sitting on long flat beds, and others had big chunks of some kind of metal material. Soon, the southbound side was jammed up with these giant trucks and their haul. Then they started to get to work.\n\n“What are they doing?!” asked Lauren. She’d opened her window back up. “Are they… building a fucking *wall*?!”\n\nThat is exactly what it looked like they were doing. One crane would take a massive chunk of material, and lift it into place either next to, or on top of, another chunk.\n\n“Yes! They’re walling us in!” I shouted. I checked my phone for the thousandth time. I had a bar, and used it to call 911.\n\nA lady answered. “What is the address for this emergency?”\n\n“I… uh… I-95 northbound, just before Lewiston, Maine. I forget the exit number we were coming up on. I’m sorry.”\n\n“That’s okay. What is the emergency?”\n\n“Well… we’re in this weird traffic jam… and… people are dying here. Cars are exploding. They’re building a wall around us. They’re trapping us here. I know that sounds crazy….”\n\nThere was a long silence on the other end. I thought maybe we’d been disconnected. But then I heard her voice again, crystal clear.\n\n“Sir, I am going to need you to remain calm and stay in your vehicle. And if you would, roll down your window. Not the driver’s side, the passenger’s side.”\n\n“W… what?” I asked. Then I heard the tapping at my window. There was a lady cop standing there, holding a cell phone up to her ear. My heart jumped up into my throat, and my instinct was to slam my foot on the gas pedal, but there was nowhere to go. I rolled down the window.\n\n“You reported an emergency?” asked the cop. “Everything looks okay to me. We don’t discourage anyone from calling emergency services if they truly think that there might be an emergency situation occurring, but everything appears to be perfectly fine here. I will give you the benefit of the doubt this time, but remember that we also very strongly frown upon fraudulent 911 calls. You could be charged for that, sir. It’s no joke.”\n\n“Oh,” I said, trying to hold it together. “I’m sorry about that. I *did* think that something bad was going on, but now I see that everything is okay. Thanks for checking in.”\n\n“It’s no problem at all, sir,” said the cop, smiling. “And remember: *stay in your vehicle*.”\n\n“Of course,” I said, trying to smile, though I’m sure my face looked like a sweaty pretzel instead.\n\nThe cop nodded and then walked off down the line of cars. I waited a few minutes, and then called out to Lauren.\n\n“I think we’re fucked!” I said. “I called 911 and that cop that was just here? She’s the one who picked up. She said everything’s fine… but it’s not.”\n\n“Fuck!” said Lauren. “What do we do?!”\n\nThat’s when the guy jumped out of his car and made a break for the wooded area to the right of the highway. And that’s when they shot him in the legs. I heard him cry out and watched him hit the ground. I heard a loud continuous rumble, interspersed with snaps from the woods. Then I saw the tank. It didn’t so much emerge from the woods as it destroyed the woods in its wake. Beyond it, I saw another enormous wall. We were walled-in from two sides… and my guess was that we were walled-in from four sides.\n\nThe tank crushed the man like he was a particularly small ant.\n\n\\*\n\nThey are working on the roof now. It's almost done. Once the roof is on, I have a feeling that I won't get any reception at all. Before that happens, I'm hoping for one more spike so that I can get this post out.\n\nI don't know if this is on the news or not. I thought it was just a traffic jam, so that's probably how they're playing it off. They probably have rerouted traffic around us by now.\n\nI don't know what this is. But there are now dozens of heavily armed people in riot gear going from car to car. Sometimes they drag somebody out, and carry them screaming off to what remains of the wooded area, where they disappear from sight.\n\nThey're almost at my truck now. I hope they skip me, and Lauren. Oh God. I'm going to tell her that I love her.\n\nIf this reaches you, I don't know what you can do, but please try to help us.\n\n&#x200B;\n\n[Part 2](https://www.reddit.com/r/nosleep/comments/bxoscy/we_were_stuck_in_construction_traffic_for_8_hours/)\n\n[Part 3](https://www.reddit.com/r/nosleep/comments/byqo1k/we_were_stuck_in_construction_traffic_for_8_hours/)", "comments": [{"id": "eptkyh1", "author": "whyshouldyouwakeup", "body": "It's good you have this in writing because it's pretty likely you won't remember a thing once the perpetrator has been detained. Having this information could cause you to be the reason of another \"traffic jam\" though so I'd suggest not digging further into this."}, {"id": "eptimdm", "author": "Dark_Shade_75", "body": "Yeah, that sounds like a New Jersey maneuver."}, {"id": "eptr54v", "author": "LittleSansbits", "body": "Hunting for aliens. Be sure to have several IDs ready and a good excuse of why you're going where you're going"}, {"id": "eptj480", "author": "DeathToIslamGamer", "body": "Ah, standard alien barricade. Just don't act normal at all when they get to/check your truck, don't jump out though, that would be a rather normal reaction as well. Remember, aliens will try to act as normal as possible."}, {"id": "eptkj39", "author": "InSpaceAndTime", "body": "Could it be because of some virus?\nTake care OP! Save Lauren and the cats"}, {"id": "eptk0w0", "author": "growupali", "body": "My guess is they put a roof on the walls and he gets no signal, so we arent going to get an update..."}, {"id": "eptmsih", "author": "miachong06", "body": "i hope the kitties are ok"}, {"id": "eptp0y7", "author": "SadNAloneOnChristmas", "body": "I hope you guys get out somehow. Keep the rest of the Gatorade though..."}, {"id": "epv08zy", "author": "ribnag", "body": "Ooh, you fell for it.  Sorry.\n\n**Always** take 295 through Portland, despite what the signs say - They meet back up in Gardiner, but 95 is literally 20 miles longer *and* has more tolls.  100% fewer alien roadblocks, too."}, {"id": "epttig9", "author": "before-the-fall", "body": "I think you should try to listen to the radio again, write down the numbers. I have no idea what’s going on but it’s terrifying."}, {"id": "eptv0hj", "author": "KeksGaming", "body": "Oh, everything's okay, OP. Just remember, stay in your vehicle."}, {"id": "epu79u7", "author": "MunchieDyfed", "body": "Sounds like they’re just trying to trap you guys in, and by tmrw morning everything will seem fine on i95 It’ll be just another hill on i95. Op should be able to hear traffic going on the roof."}, {"id": "eptdnjf", "author": "Gostinker", "body": "Haven't heard anything about this on the news... sounds like you're pretty fucked man, good luck when they get to you and update us if you get out of there"}, {"id": "epti31d", "author": "The_Shy_Yeti", "body": "Be careful! And please update us if you can!"}, {"id": "epuqtfa", "author": "LadyLuna1467", "body": "I looked up I-95 Maine and saw that an accident occurred at 12:45 which is around when they posted."}, {"id": "epvcret", "author": "Wolfcake82", "body": "Hi there! I'm not sure why you're posting here. Everything is fine Sir. Stay in your vehicle. Do not try to leave.\n\n\nDo not try to leave.\n\nStay in your vehicle.\n\n#Do not try to leave."}, {"id": "eptu1s4", "author": "indecisive_maybe", "body": "It sounds like an emergency quarantine. But what are they trying to keep inside? Or what are they trying to find?"}, {"id": "epu2dkt", "author": "taeoh666", "body": "Governments probably working on some human experimentation shit so they're abducting people...probably"}, {"id": "eptqjdo", "author": "LePerfectionist", "body": "The poor cats"}, {"id": "eptrfm1", "author": "VixenGirl163", "body": "I hope everything turns out alright for you guys.."}, {"id": "eptt46g", "author": "scozta", "body": "I'm so glad I'm done going cross country for a couple years, but I know for a fact next time I do this is going to be on my mind. Good luck OP"}, {"id": "epunsvn", "author": "OriginSport", "body": "The mistake is Lauren isn’t driving a Type R. Because if she was she could drift her way out."}, {"id": "eptvj7f", "author": "perfec7insani7y666", "body": "all you gotta do is hide in between the backseats and the front seats and you wont get shot or pulled out........... hopefully"}, {"id": "eptx6mk", "author": "glamorousmisanthrope", "body": "Hey there, I'm really sorry to hear about the hell you're trapped in. I'm in Portland, Maine, and I haven't heard anything about this, so they must be trying to keep whatever they're doing secret. Lock your doors and maybe try to get some rest? I can't believe something like this could be happening in our quiet state! I really hope you guys get out of there okay."}, {"id": "epttxbe", "author": "Daisy-Fields", "body": "Maybe some kind of infection outbreak in that area?"}, {"id": "eptunf7", "author": "beatkeepah", "body": "I live in Gainesville, and I don't think I want to make the trip up to Maine any time soon."}, {"id": "epujz0t", "author": "Twohip4school", "body": "I tried to help so I came down 95 where you said, but everything seems fine. Just stay in your vehicle, and stay calm. Maby you slipped into alt dimension n that's why cats are goin nuts too??"}, {"id": "epu6s1r", "author": "Miss-Hell", "body": "Are you there OP?"}, {"id": "epuc9ys", "author": "atmagic", "body": "Why would they wall the place just to kill everyone? They're up to something big."}, {"id": "epu0kn1", "author": "Sll3006", "body": "We will never know what happened."}, {"id": "epvlokp", "author": "TormentedOne69", "body": "It’s been 14 hours OP, I do hope you both are alright, and that the cats saved you.\n\nEdit: I’m reading this as my cat is purring beside me laying with one eye open..."}, {"id": "epv2hgd", "author": "Jay-Dee-British", "body": "Let us know, if you can, when they deliver your bunker to..well..where ever it's going. Because you can bet, with a roof on it now, it's going somewhere.."}, {"id": "epulwxl", "author": "bryanfeanor", "body": "I never heard the expression of \"cats howling\" but seems to be like that Oh no no and rauuul cat, pretty scary if they started doing that"}, {"id": "epv04pk", "author": "Dreezy523", "body": "8 hours? Let me tell you about this place called the Grapevine."}, {"id": "epwizy6", "author": "-kerosene-", "body": "The worst thing about this is that I’m pretty sure I’d be Boston Man in this situation."}, {"id": "epwmctg", "author": "aqua_sparkle_dazzle", "body": "Release the cats. Tell Lauren to let them out from their crates. No SWAT teams can beat the hissing, swatting, scratching, clawing ball of motion that is a scared cat. And you have two.\n\n\nSource: I do animal rescues."}, {"id": "epv3ajp", "author": "MacSteele13", "body": "HWY 290 in Houston; been there..."}, {"id": "epvm1ez", "author": "-stoned", "body": "Course the guy following the ambulance is from jersey"}, {"id": "epx5x9j", "author": "Plungermaster9", "body": "So let's see...\n\n1. Not zombies. Unless they've caght outbreak in the fetal stages. Anyway, OP is screwed.\n2. Hunt for aliens. This one makes no sense what so ever.\n3. Chtulhu and Co? Well, who the hell know.\n\nAnyway, it will be interesting to know what the actual heck is going on. Because nothing is worse than unknown."}, {"id": "eptvfyr", "author": "gloreeuhboregeh", "body": "As long as the cats are alright I could care less"}, {"id": "epupomy", "author": "mregger", "body": "Canada is invading Maine"}, {"id": "epuwis2", "author": "mamasmurf1978", "body": "It's I-95. This doesn't really suprise me."}, {"id": "epul6bf", "author": "shininstuff", "body": "Do you see the construction workers building the roof? maybe something seems off about them."}, {"id": "eputyqb", "author": "IamBarn", "body": "Government must be trying to protect you from a virus or aliens.\n\nAt least that's my consensus after reading some of the comments."}, {"id": "epuwap4", "author": "essentiallycallista", "body": "be careful op. I hope there are no zombies♡♡♡"}, {"id": "epv5dpl", "author": "FoggyBear556", "body": "Man if you only you had a gatpiece on you"}, {"id": "epv9tmq", "author": "KiloCharlieOscar59", "body": "Hopefully you can update us soon, just remember when they take the cats do not fight and remain in your vehicles it will all be over soon"}, {"id": "epvce7m", "author": "tootswerk", "body": "Maybe They think you saw something you shouldn't have seen. Maybe They need to destroy evidence. Witnesses are evidence. They are in total control of you now."}, {"id": "epvqk7o", "author": "selenagnomez", "body": "...I travel this stretch of I-95 once a week. I have decided I will not do that this week."}, {"id": "epx78n4", "author": "lastfirstborn1", "body": "What the hell did that thunderstorm do to you guys?! And how long have governments known about the storms?"}, {"id": "epvl01y", "author": "SantGamer", "body": "op am lying in culvert pip abt 1000yd frmo wall area, dipped out hid in smoke from exploding car, was rocket or bomb that got him can see construction thought 2 check reddit nosleep, gas station sign up ahead all traffic normal otherwise, @ dark will get up cross highway hang tight will get help"}, {"id": "epuzgdv", "author": "Pavlos", "body": "Sir, this is all done for your personal safety. Please follow the instructions of our first responders on site, remain calm and do not spread false reports or leave your vehicle."}, {"id": "epvfmb4", "author": "LeakyLine", "body": "Stay in your vehicle."}, {"id": "epvhe84", "author": "aminastar", "body": "I think they are trying to save you from invader aliens. Relax."}, {"id": "epvjbpu", "author": "Cant_Kill_The_Queen", "body": "Well, first\nIf you have food, water, etc\nYou should be fine.\nAs long as they actually keep you in your cars.\nIf they don’t keep you in your cars, your very much screwed-\nI’ve never heard of this type of situation, but, hopefully there intentions are ‘good’"}, {"id": "epvmlj6", "author": "Eurobeat_Addict", "body": "Well,all i can do is to wish you good luck, i hope you're alive."}, {"id": "epvovd6", "author": "TheNuclearMemelord", "body": "Construction traffic? I’d just walk out, I’m not sitting in that until I lose my sanity."}, {"id": "epw331x", "author": "brinzel", "body": "I shouldn't have read this before heading out during peak times. Now stuck in traffic and glancing furtively everywhere to not see bricks, cement or soldiers"}, {"id": "epwhohu", "author": "Yuto_Lukashenko", "body": "OP if you're still alive, see if there's anything you can use to Hotwire the car to cause a minor explosion where maybe an ambulance will come and get you"}, {"id": "epxlt10", "author": "MagicalDoggo9000", "body": "Good Luck! And *Don't Get Out Of Your Car!!!*"}, {"id": "erlrujy", "author": "IUrinateOutside", "body": "Classic Lewiston. Pretty happy they walked it in."}, {"id": "erncojx", "author": "spaghettiwithsadness", "body": "hey op, i think about this story alot"}, {"id": "eptzy5i", "author": "dumbowasadog", "body": "i was in auburn just two days ago"}, {"id": "epuhlsg", "author": "Pessimistpoppy", "body": "ah, hope OP manages to get some connection, I want to know more about what's happening."}, {"id": "eq9by8s", "author": "ValkyrieM27", "body": "I am from Lewiston! I was born at CMMC. My family still lives there... I should probably call them..."}, {"id": "eqn154j", "author": "StingKing456", "body": "Commenting so I can read later"}, {"id": "eqyqqdy", "author": "Chara_0423", "body": "Don’t worry sir, just a routine vehicle inspection.\n\n\nStandard operating procedure. Remain calm and comply with any law enforcement in the area."}, {"id": "er4jd17", "author": "Whisper292", "body": "My first thought is mega-virus. It sounds like they have quarantined you. Dear God."}, {"id": "ertiyjm", "author": "whiskey1R", "body": "  \nB by ngh mm by\nB see c xv. BN bbb VB VB b BN bg CV"}, {"id": "ertj4m7", "author": "whiskey1R", "body": "Cv x mm"}, {"id": "ertju9o", "author": "whiskey1R", "body": "Cd c CV CV j MN MN qf'8:_:;;_;*."}, {"id": "es9u71d", "author": "henribarbosa23", "body": "Wow"}, {"id": "f0kh3yr", "author": "epicgodchess", "body": "I-95 is a very scary highway and I'm glad to have some good old maine representation"}, {"id": "f91furm", "author": "onegalssyceiling", "body": "This is honestly one of the best ones there is"}, {"id": "epxtbfu", "author": "Big_chonk", "body": "Well, This is america right? pull out that gun of yours and fold."}]}