{"id": "bz0dl9", "title": "The Chernobyl disaster was a coverup of something terrifying", "url": "https://www.reddit.com/r/nosleep/comments/bz0dl9/the_chernobyl_disaster_was_a_coverup_of_something/", "subreddit": "nosleep", "author": "DELTA129", "text": "Narrations:  \n\n\n[Mr. Creeps](https://www.youtube.com/watch?v=pylxyu24g1g)  \n\n[The Dark Somnium](https://www.youtube.com/watch?v=_rDRRXlCdC4)  \n\n\n  \n\n\n  \nYou probably heard about tourism in the Chernobyl exclusion zone. I’ve been there myself several times. And it’s nothing like what you see in games or horror movies. There are no ghosts, mutants or radioactive anomalies and death isn’t waiting for you at every corner. Actually, I think it’s one of the most peaceful and prettiest places on Earth. An example of strength of nature and how it can reverse the damage that we caused it.\n\nThus, when my friend Alexei decided to go there, he knew who to contact. He's a physics student and right now he’s doing some kind of research on nuclear fallout and he said that he wanted to get some direct measurements and samples. But we both knew that it’s just an excuse to go on an “adventure”. We visited the old powerplant, the abandoned city Pripyat and the surrounding exclusion zone. It was nice, but I would probably just bore you with more details. That part is not important anyway.\n\n&#x200B;\n\nWe were driving on some dirt roads in a forest east of Pripyat when we found it. An old, rusty fence and a chained gate that blocked any further passage. There was a big sign with a radiation hazard symbol and captioned: “Restricted area. Authorized personnel only”.\n\nThere was a pair of massive metal blast doors in the side an artificially-looking hill not far behind the fence, with a large, white “O-13” painted on it and “NO ENTRY” sprayed on top.\n\n“What do you think it is?” Alex asked.\n\n“I don’t know, looks like some kind of bunker,” I replied. “And it looks like it has been closed for some time,” I added after taking a closer look at the doors. The both halves were welded shut in the center. Alex took his samples and readings, but we were too puzzled to leave just yet.\n\n“Do you think we can get in?” I asked.\n\n“Well not this way for sure. Even if it wasn’t welded sealed, I’m sure we have no way of unlocking it.” Alex replied while examining the massive door.\n\n“It looks like an underground bunker. They must have had a way to pump air inside and I don’t think this is it. There has to be another way to get in.” I said.\n\nWe circled the main entrance to try find other means of entry. The day was already coming to an end and it was slowly getting darker. As we were searching, a thought crossed my mind.\n\nWhy would they weld the doors? What’s so important inside that they went this far to keep people away?\n\n“Look, there’s something there,” Alex pulled me away from my thoughts.\n\nIt was a concrete block a couple of meters large with what looked like vents on the sides. As I looked into the vents, I noticed that they were also sealed with heavy-looking steel hatches and no clear way to open them. However, there was also a somewhat smaller door labeled “Service tunnel” with a large wheel on the outside.\n\n“Should I open it?” I asked.\n\n“Yeah, I’m really wonder what this is. Anyway, we don’t have to go in. At least we’ll see if the door still works.\n\nAt first, the wheel wouldn’t turn because of all the rust and dirt, but eventually it budged. The door unlocked. I pulled and it slowly started opening. It was very heavy and took a lot of force.\n\nBehind the door, there was a small platform and a tight vertical tunnel with a ladder. What caught my attention was that there was an identical locking mechanism on the inside. That meant that they could lock the door from both sides. But why? We were lucky, because if they had locked it from the inside too, there would be no way to get in.\n\nI stepped inside and shined my phone light down the shaft. It wasn’t strong enough to hit the bottom. The air was damp and old and there was something that I couldn’t identify. A very faint, chemical-like smell. There was no radiation nor signs of any other hazards.\n\n“You’ve got to be kidding me. This is so cool. We have to come back here and check it out later.” Alex said.\n\nI couldn’t agree more.\n\nIt was almost dark now, so we resealed the door and called it a day. But we promised ourselves to return.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nI immediately tried to do some research when I got home, unfortunately with no success. I even tried to call Pavel, a friend of mine who knew the area better than me. Actually, it was him who brought me there for the first time. He couldn’t help me either, but promised to ask around. I told him about our plan and asked if he wouldn’t go with us, but unfortunately, he was out of the country for a while.\n\nA week later, we packed our gear and went on with it. We brought some rope, heavy flashlights, glowsticks, Geiger counters, waterproof protective clothes, an oxygen meter and a small emergency scuba tank just in case. And yeah, we’re not stupid so we told our relatives and friends about our trip and when we’re expecting to return.\n\n&#x200B;\n\n&#x200B;\n\nWe closed the door behind us as we descended down the access shaft. We couldn’t know what’s down there and we didn’t want to cause a radiation leak or something like that. We eventually dropped down into a concrete tunnel which enclosed the air vents and some smaller pipes. There was obviously no power and thus no lights. Good thing we brought our own.\n\nWe followed the tunnel and reached another door, but this time it was a regular one, not the heavy bunker-type. We went through and entered a room with 4 large air pumps and some electrical equipment and controls. The ventilation shafts split here into two larger ones that ran straight into ground and two smaller ones that went straight across the room where there was another set of doors.\n\nBehind the doors, there was a large hall with numerous boxes, crates and other cargo just laying around. There also was a security checkpoint. Behind the checkpoint, we found the main door that we have seen from the outside. Just next to it, there was some heavy lifting equipment. We returned through the checkpoint and taken a look at a set of elevators. There was a simple map with the layout of the facility floor by floor. We were on floor 0, main entry hall. There were another 4 floors below us.\n\n&#x200B;\n\nFloor -1: Offices, security and recreation\n\nFloor -2: Secure laboratories\n\nFloor -3: Accelerator, Cleanroom decontamination chamber\n\nFloor -4: Experiment site\n\nThe map was titled “Object-13”. It wasn’t a military bunker. This was a research site.\n\n&#x200B;\n\nWe took a set of stairs, since the elevators were of no use without power. An unsettling thought brushed my mind as we were descending. They probably were moving some supplies, and then left them there and took the equipment to the main door. Were they trying to get out?\n\nI stepped on another stair step but something rolled away under my foot, lost my balance and fell on my back. My pack luckily absorbed the impact. I looked under my feet to see what caused my fall. Empty bullet casings.\n\nThis wasn’t the sole reason why I felt odd about this place. As soon as we got down to level -1, I noticed that every single door was open. Every single one. There was a canteen and a kitchen right at the beginning of a long rectangular corridor. Various offices surrounded the corridor. There was the regular stuff – paperwork, old computers, personal belongings, all right there where they left it. Did they leave in a hurry?\n\n“Dimitri!” Alex called from, the canteen on the opposite side of the corridor.\n\n“What?” was all I could say when I followed him to the canteen.\n\nThere was food still neatly served on the tables. But it wasn’t spoilt. It wasn’t fresh either, but it wasn’t decaying, as a 30-year-old meal should.\n\n“How is this possible?” I asked.\n\n“I don’t know, maybe it was irradiated or something. But it’s not anymore, I checked that. I really don’t know man,” he answered, as puzzled as I was.\n\nOh, why didn’t we just turn back and leave? Now that I’m writing this, there were so many red flags already. Something really wrong happened down there. But I guess we were too excited and curious. But it was at this point that my excitement started to fade and be replaced with an eerie feeling.\n\nNevertheless, we continued and descended down to level -2. The stairwell ended here, and to go deeper, we would have to cross the entire floor to reach an another one on the opposite side. There was a security checkpoint and a large blast door that we had to pass through to reach the labs. Again, every door was wide open. However, the things that people left here weren’t neatly placed where they should have been. It was a mess everywhere. There were all kinds of rooms with all kinds of equipment that I didn’t understand. Occasionally, there were more empty bullet casings on the ground. There still was the one central rectangular corridor as above, but the rooms around it were like a little maze.\n\nAlmost at the other side of the floor, we found the head scientist’s office. As I said, everywhere it was a mess, but I found a logbook on the desk. There was only a handful of pages, the rest torn out.\n\n&#x200B;\n\n**5. October 1984:** Today we successfully managed to translocate several atoms without changes in any physical properties. It’s going to be a long road until we can transport solid objects, but we’re going some good work here.\n\n**17. January 1985:** We’ve managed to transport an apple today. However, I couldn’t help but notice that the pattern of red and green skin on top was slightly different. But it was still the same apple, with the same structure, shape, everything. We also tried to transport some electronics. They were unharmed and in working order. I think that we still have a lot to perfect and learn about this technology, but we cannot slow down now. The country is relying on us.\n\n**21. February 1985:** After the animal trials, we translocated our first human today. He is alive and healthy, a brave hero of our nation. We have proven that this technology works now, but the practicality is still very limited due to the fixed translocation ratio. We still cannot “send” matter. Only exchange the positions of two equally massive objects. I have proposed a new type of device, that could possibly achieve one-way translocation of just a single object, but it would need an immense amount of energy.\n\n**1. May 1985:** Our superiors accepted my proposal. They are going to build a new, much bigger translocator here, in the power plant, so we can use a nuclear reactor as a direct power source. There is one more thing. We’ve now translocated dozens of test subjects. Each one is alive and well, but sometimes they are a little bit, well, different. They sometimes claim that various events in the past happened differently than they really did. Sometimes they claim to know people who don’t exist, or more alarming, they know people who they are not supposed to know. The following was written below with a pencil by hand: “Test subject 28 was speaking an unknown language and couldn’t understand any real language after the experiment.”\n\nThere was a lot of missing pages afterwards.\n\n**25. April 1986:** We are going to try to change our approach. It’s been more than a year, and we’re still unsuccessful in eliminating the translocation symmetry anomaly. We still event don’t know what is causing it, but we are not going to make any progress this way. Today, we are going to try to access the conduit reality instead.  Even though Unit 2 - the one we built in the power plant - is still new, we are going to use it for this experiment. Who knows what wonders are waiting for us on the other side?\n\nThere was one last page in the logbook. On it, it was just a single phrase, written again and again:\n\n# “WE LET THEM IN”\n\n&#x200B;\n\n“Alex, I think we should go,” I called.\n\n“Man, come take a look at this,” he answered.\n\nI stepped out of the lab and back into the hallway.\n\nThere were … clothes all over the corridor. Well what was left of them. They were torn to shreds. No bodies, no blood, just strips of cloth and an occasional shoe or a watch.  I looked up and stared down the dark corridor in front of us. I just stood there for a while.\n\n&#x200B;\n\nIt was, I don't know ... as if something torn all these people to shreds, and then cleaned it all up. Except the clothes and other non-organic material.\n\n&#x200B;\n\nA wave of pure, instinctive dread washed over me. I couldn’t move. I didn’t even breathe.\n\n“Let’s just get out of here.” Alex said.\n\nWe turned around and walked away. Slowly at first, but we quickened our pace. Our footsteps echoed across the underground structure.\n\n“I just want to be out of here man. We shouldn’t have done this” Alex said. I didn’t tell him about the logbook, but…\n\nMy thoughts were cut short after a sudden realization.\n\nHis voice didn’t echo. It was just our footsteps.\n\nI think he realized too, because we both stopped and listened.\n\nNothing. Just silence.\n\nI stepped forward.\n\n*Clack.*\n\nI took another step.\n\n*Clack.*\n\nThere was this door just in front of us and I forced myself to try something. I closed it behind us as we passed it and placed a glass beaker that I found on the ground on top.\n\nI took a step forward.\n\nSilence\n\nIt was just echo after all, I thought.\n\nWe walked away, carefully at first, but then we once again quickened our pace. We turned around a corner, and then it happened.\n\n&#x200B;\n\n*Crash*\n\nThe glass shattered.\n\n&#x200B;\n\nSomeone\n\nor some thing\n\n&#x200B;\n\njust opened the door.\n\n&#x200B;\n\n&#x200B;\n\nWe dropped all our gear except our lights and ran as fast as we could. I didn’t even know I could run this fast. I always tried to be a tough guy but I was never so scared in my life.\n\nOur footsteps didn’t echo anymore. Or better said, they weren’t in sync with ours anymore. Something was running after us. Each second it was getting closer. And closer.\n\nAs soon as we reached the security checkpoint, we started closing the door. The rusty joint of the door squealed in protest, but we pulled with all our strength. We almost had it closed, when we heard a loud, guttural and unnatural growl.\n\nThe door slammed shut and I threw the wheel to the ‘locked’ position. My heart was pounding so hard that it was all I heard for a while.\n\nNo, wait, it wasn’t my heart. It was that thing, pounding on the locked blast door.\n\n&#x200B;\n\nWe were running again. We reached the stairwell and run up, taking 2-3 steps at once.\n\nWe finally reached the air pump room. The ascent really exhausted us and even though I was scared shitless, I felt like I would pass out if I took another step forward. Besides, we locked it down there.\n\nAlex sat down and leaned his back on one of the large vertical vents with a bang.\n\n*Bang. Bang. Bang…*\n\n&#x200B;\n\nOh fuck.\n\nWe locked it down there.\n\nBut we forgot the vents.\n\n&#x200B;\n\nAlex and I looked at each other, our eyes met, and then… the vent burst and he was gone. I only heard him scream as he was dragged back down.\n\n&#x200B;\n\nI feel terrible for doing this, but I just ran, I climbed the service shaft and locked the service door shut when I was finally out of this hell.\n\nAs soon as I had phone service again, my phone started beeping with loads and loads of missed calls and messages from Pavel.\n\n“Hey Dimitri, I found this guy, he says he knows what ‘O-13’ is. Please pick up as soon as you can, he says it’s dangerous and you should stay out of it.\n\n“This guy is calling me now, he sounds serious, please call me back at once”\n\n“I don’t know what’s going on but he’s going there, please I hope you get this before you go down. Stay safe friend.”\n\nThere was also one message from an unknown number:\n\n“Dimitri, this is Anatoliy Moroz, I know what you found and I’m on my way from Kiev now. DO NOT GO DOWN THERE. If you already did and you manage to get out, lock the door that you used to get in and make sure it stays locked. I will try to call you when I’m here.”\n\n&#x200B;\n\nSo here I am, writing this while I wait. I do this to make sure that no one else repeats our mistake, since I don’t know if I’ll live long to tell anyone personally.\n\n&#x200B;\n\nI just can’t leave Alex behind.\n\n&#x200B;\n\nI have to go back.\n\n# [Part 2](https://www.reddit.com/r/nosleep/comments/c090ig/the_chernobyl_disaster_was_a_coverup_of_something/)", "comments": [{"id": "eqoi5v9", "author": "ValueNull", "body": "Darn Alex got zoinked by inter-dimensional ghosts"}, {"id": "eqoyzkl", "author": "Tetha", "body": "I'd advise you to leave. You're not just dealing with entities from somewhere else, you're also dealing with someone covering this up. Those people don't like loose ends. And the best memory erasure most organizations have are bullets."}, {"id": "eqprrnk", "author": "scott3387", "body": "Dimitri is about to get redacted"}, {"id": "eqocyhb", "author": "phamngochieupnh", "body": "holy shit please keep us informed about what ever happened"}, {"id": "eqq0xii", "author": "musicissweeter", "body": "I was getting really anxious for that poor interdimensional ghoul trapped there banging door and what not. Thank god he got your friend for company."}, {"id": "eqq1v34", "author": "Heehoopeenut", "body": "OP isn't replying to anyone..."}, {"id": "eqop3kh", "author": "LadyGrey1174", "body": "Holy mackerel! Poor Alex, I hope the new guy can give you some answers."}, {"id": "eqoruml", "author": "YogisOwen", "body": "Your man Alex done got snatched"}, {"id": "eqod4ek", "author": "Pillarsofcreation99", "body": "Do NOT go in there alone, wait for Anatoliy to come and explain the situation to him.\n\nIn th meantime search for some weapons and see if anything else is nearby. Do not leave any doors or vents open or attempt to go back"}, {"id": "eqq7p1u", "author": "ZedXYZ", "body": "Wow. This is awful. I'm no physicist here, but it sounds like the scientists were experimenting with quantum physics sort of technologies; transporting matter and particles. Teleportation, moving matter/atoms from one point to another. Perhaps through doing this, the structure of atoms on these test subjects got mixed with matter which human technology can't see.\n\n&#x200B;\n\nMatter which exists in our realm, but on another \"plain of existence\", that we can't see. Maybe these experiments have destabilised their being. Are you sure the footsteps were from this entity? They could be distorting time itself, too (the fresh food). I hope they weren't feeding the experimented food to the workers. All speculation, but be careful bud. Sounds like those whom sealed the bunker and escaped haven't made any effort to go back and finish their business. If they couldn't stay safe, I don't think you can either."}, {"id": "eqprpb6", "author": "Shrenegdrano", "body": "Where the fuck are you going? Don't go in leaving THAT BLOODY DOOR OPEN!"}, {"id": "eqqmi05", "author": "Elgaucho786", "body": "Alright we gonna need a fucking update."}, {"id": "eqptels", "author": "k8fearsnoart", "body": "Look, if something grabbed me, I'd be really upset if my loved ones, husband or father or my Mom or best friend, came back to get me instead of saving themselves. **Don't go back!** *Please!*"}, {"id": "eqpzlwl", "author": "MyNameIsBadSorry", "body": "The right man in the wrong place can make all the difference in the world."}, {"id": "eqr6rea", "author": "MrOngor", "body": "If you're going back in dude, take a snickers and throw it at the beast and hopefully \"you're not you when you're hungry\" prevails. Godspeed."}, {"id": "eqp9rsg", "author": "TheGreatestRoman", "body": "Sounds terrifying. I think you should wait for Moroz instead of attempting to rescue Alex alone. Keep us posted, if possible."}, {"id": "eqq9uzm", "author": "Jefftommens", "body": "There are no eldritch beings on the roof, you're delusional, get him to the infirmary."}, {"id": "eqr33ev", "author": "matteoarts", "body": "The apple and people are from other worlds. They never once translocated a subject- they were swapping people from our world with alternate versions in parallel universes."}, {"id": "eqoh9z4", "author": "jiminpng", "body": "woah, OP, you really should have waited... poor alex. wait for him!"}, {"id": "eqp4xd1", "author": "Ckirollos", "body": "Dont wait for Anatoliy. Shes trying to cover it up, you dont know that you can trust her."}, {"id": "eqpo7hc", "author": "UnstoppableChicken", "body": "Obviously whatever \"it\" is only goes after organic matter. So your friend is more than likely dead. All you're going to find are his clothes left behind like the other people. But I wonder why it didn't touch any of the food? Maybe it wasn't \"organic\" enough?"}, {"id": "eqq1xxl", "author": "SarahH28", "body": "Please dont wait to post again. I have to see part 2."}, {"id": "eqr78zz", "author": "moesphemy", "body": "[I think Anatoliy is now living a regular life again](https://www.instagram.com/p/BVDTCwMBAfH/)"}, {"id": "eqqjsng", "author": "NegMess", "body": "IT'S THE BABA YAGA!!"}, {"id": "eqqtkvq", "author": "masonthedood42", "body": "Perhaps the russians opened up some sort of portal that allowed this thing to enter. The nuclear energy was being used to open that portal. \nMaybe like what CERN is doing now?"}, {"id": "eqr0le5", "author": "GreenDave113", "body": "Are you going to write about your attempt to save him? Good luck anyway man"}, {"id": "eqph09x", "author": "newfiboy", "body": "Did you see the creature at all when it grabbed Alex? You should wait for Anatoliy maybe he can give you more answers on the experiments that happened down there."}, {"id": "eqqqkcx", "author": "The_Chosen_Boy", "body": "I had a similar experience when me and my friends found a hatch door in the ground in [REDACTED] and being stupid we decided to go down in it. What we found was truly terrifying, there were body parts like bones on the ground. Ws thought they were from an animal so we stayed. As we got deeper into it there was a weird smell in the air and when we reached a door that was particularly weird we opened it and what we found was true monstrosity, there were atleast 10 ugandan knuckles there and as soon as they saw us they started chanting and spitting at us. We ran as fast as we could but they were faster, luckily i was fastest of my friends. I heard my friends screaming but i kept running. When i reached the hatch i climbed out of it and closed that shithole and put rocks on it. I was the only one that made it out."}, {"id": "eqpwwfw", "author": "throwaway-person", "body": "The lack of noted dosimeter use had me so nervous that the latter scarier parts hit even harder. 😂"}, {"id": "eqqevy1", "author": "KingNoctisCXIV", "body": "This man is delusional take him to the infirmary"}, {"id": "eqqinqg", "author": "This-Is-Not-Nam", "body": "Holy crap dude, you should have gone to italy."}, {"id": "eqpme1d", "author": "scorpiontank27", "body": "This is intriguing I must say you didn't give any specifications other than it's a trans dimensional creature and that's not enough as different ones are harmed by different kind of weapons but try making a make shift flamethrower just in case it will at least slow them down even if they're not fully organic in nature and best of luck op"}, {"id": "eqq29ly", "author": "radikal_banal", "body": "Damn, don't go back there If you can. Alex is most probably gone. Safe yourself and move far away from that place"}, {"id": "eqpcw3b", "author": "readingwithmyboss", "body": "Don't go in until your better prepared or at least armed.  Some kind of firearm should hopefully have some effect even if it makes it hesitate."}, {"id": "eqq9pzv", "author": "m0torized", "body": "OP, if you do go back in there, please promise not to cause a Resonance Cascade and by extension a Seven Hour War."}, {"id": "eqrk83v", "author": "pitty_chan", "body": "This looks like some serious Event Horizon revival."}, {"id": "eqrkbtw", "author": "DylanHK", "body": "Was you, or your friend, able to translate the journal entries from what I’m assuming was Russian? Or was it just in English?"}, {"id": "eqpxmpk", "author": "TickmcTickson", "body": "This is why you shouldn't explore restricted areas. Now you lost your friend, and you may have just released something dreadful."}, {"id": "eqpzf93", "author": "jessicaj94", "body": "Nah mate Alex is gone."}, {"id": "eqpx7xq", "author": "ballsackbrown", "body": "Screw Moroz. Ur friend and you both don’t know him, he could’ve been part of the operation and be coming to stop you from letting information get out. RUN MY G."}, {"id": "eqpxsdr", "author": "ArCLoRd", "body": "they discovered parallel dimension traveling right there"}, {"id": "eqpyi9i", "author": "Nextgen101", "body": "Don't go back. Just get out of there.\n\nMetro 2033 vibes on this one."}, {"id": "eqq6nyv", "author": "hxspanxc", "body": "Just get out of there. There’s nothing you can do for Alex. You clearly can’t fight whatever this is, and it’s out of your control now. Wait for Anatoliy and see what he says about all of this. Get out and lock everything. OP, don’t do it. Be safe."}, {"id": "eqq9vfk", "author": "ADnarzinski16", "body": "Please up date on what Anatoliy says and don't go back, Alex is long gone I'm sorry to say or he was turned into a creature. Either way it's a lost cause and suicide mission to say the least, but if you go and make it back out let us know how it went!"}, {"id": "eqqo7yr", "author": "Wicck", "body": "Honey, there is no more Alex."}, {"id": "eqqsffw", "author": "chey352", "body": "OP is dead man"}, {"id": "eqquy6y", "author": "texasplumr", "body": "Alex is gone so just move on and save yourself. It doesn’t matter now what is down there as long as you’ve locked it in."}, {"id": "eqr3j93", "author": "badboydarth", "body": "Dont blink."}, {"id": "eqr3mjh", "author": "shadder6", "body": "And once again another goverment mess that tvey left to be released on the world"}, {"id": "eqr5wb1", "author": "Metcan117", "body": "Guys im worried OP hasnt replied I hope he's ok and that the russians dont take us all out as witnesses."}, {"id": "eqr6hi0", "author": "fabmarques21", "body": "yes, go back and bring us more story right now"}, {"id": "eqr7j6g", "author": "Awesomianist", "body": "Hate to break it to ya, but you've just entered a decoy zone of Site 17.\n\nThe real place is much scarier."}, {"id": "eqr9gic", "author": "AmyEffy", "body": "You have to update us when he gets here!!! Did they release the nuclear blast so it wouldn't get out?? Or was there never one in the first place?"}, {"id": "eqra8n9", "author": "biswayan", "body": "Maybe that thing was just lonely?!?............"}, {"id": "eqrcgto", "author": "memesmemes69420", "body": "subject 28 was probably talking the language the monster spoke. and also because they experimented on teleportation, they probably opened up an inter dimensional portal to a hellscape."}, {"id": "eqre7qd", "author": "TheRealTawa", "body": "So ... They actually just exchanged things with an alternate reality? Holy shit please stay safe and wait OP"}, {"id": "eqrgdax", "author": "eipeidwep2buS", "body": "Congratulations, i no longer want to step on the floor for fear or something grabbing my ankle,"}, {"id": "eqrim5n", "author": "mageakeem", "body": "you gotta go back and tell us what happen!"}, {"id": "eqrjboc", "author": "emsykay", "body": "Alex is dead. Whatever is in there is definitely not him. Seal the doors and leave"}, {"id": "eqrmjx2", "author": "kccnhrts", "body": "I'm not saying you should go back.. but I really want to know what that thing was."}, {"id": "eqrqybm", "author": "ShrimpMee", "body": "Move your ass out of there and meet the guy to learn more about the project and publish the GPS coordinates and any relevant info online. Never come back for you may not be lucky the next time."}, {"id": "eqrtrkq", "author": "Someguy12378", "body": "Alright I'm gonna say this and you gotta listen.\n\nFuck Alex. He dead, so just go home."}, {"id": "eqsxc2t", "author": "Heavenli", "body": "Please do update."}, {"id": "eqt26ps", "author": "NightmareGats", "body": "I wish it happened on Mars, so they could bring demons to our dimension. That happening on earth is really scary ;-;"}, {"id": "eqwd45r", "author": "SarahH28", "body": "I neeeeeeeed an update! 😫😫😫"}, {"id": "eqyxz8z", "author": "southstrandsiren", "body": "I don't know if you should trust Anatoliy... maybe let him tell you what he knows before letting him know that you went into the bunker. \n\nJust out of curiosity: You said this was in Pripyat near Chrenobyl; is it slightly to the north, close to that wall of satellite dishes/ radio transponders that we thought were being used by the Soviet Union for mind control? It would make some sense for it to be a teleportation device instead. \n\nEdit: The Duga Radar; here's a link for anyone interested:\nhttps://en.m.wikipedia.org/wiki/Duga_radar"}, {"id": "eqqw89h", "author": "Hadabaday", "body": "I think the entity is from [DATA EXPUNGED], but then again we have [REDACTED]."}, {"id": "eqqhoky", "author": "darealdrtraybloxian", "body": "Alex has been oofed"}, {"id": "eqq9in4", "author": "jay33d", "body": "I think these are humans with super human strength and no mind whatsoever. they just sense humans and feed on them? or kill them? maybe they got affected by the radiation? who knows? anyway just go back home don’t trust anyone."}, {"id": "eqr2jh0", "author": "3MLG5UM8", "body": "Hah! Poor slavic spy can't even handle a bloodsucker"}, {"id": "eqq0lh9", "author": "Lalalalito", "body": "Brehh.... im scared"}, {"id": "eqqb87n", "author": "giantbewbs1", "body": "Yes it was."}, {"id": "eqqf5tv", "author": "artfulwench", "body": "I need to know more!"}, {"id": "eqqgksh", "author": "MasThomp007", "body": "This gave me chills or it was just the AC"}, {"id": "eqqp2j6", "author": "AlvinGT3RS", "body": "This that Dark Arts .. oh come owwnn"}, {"id": "eqqp2ol", "author": "Bige918190", "body": "How you going to leave your friend?"}, {"id": "eqqpu4e", "author": "ThrowawayDorkie", "body": "Ok imma need something more, I can’t live in suspense like this. WHATS IN THERE"}, {"id": "eqqqqhw", "author": "eduardovalencia123", "body": "Do not go back!! More than likely you're friend is dead... do not go back!! More than likely that thing killed him!!!"}, {"id": "eqqr094", "author": "xnukerman", "body": "What happened to object-13 ??"}, {"id": "eqr03nt", "author": "Jay-Dee-British", "body": "Sideways, Dimitri, Alex may have gone sideways (as well as down and back) - where the others wait."}, {"id": "eqr0dmg", "author": "hapygilmour57", "body": "I hope you find Alex but I doubt there is any point going back down. If you make it out let us know what happened, if you can."}, {"id": "eqr0m7d", "author": "TripleCaffeine", "body": "Need a large concrete truck to fill that vent as a plan B"}, {"id": "eqr66yu", "author": "KerbalTubeHD", "body": "And now we prepare for the conspiracy theorists"}, {"id": "eqr6m3j", "author": "shabeebhaque", "body": "Not really sure how dimensions work but is it possible for entities who utilise  higher dimension to actually make themselves visible or utilise themselves physically in our lower dimension (dimension of 3) ? And if possible will they be able to interact with the physical objects ?   Also all the dimensions exists simultaneously and it’s all very confusing to me now. Lol \n\nAren’t we all limited to seeing in two dimension and I’m just imagining how can we comprehend something utilising higher dimension and how does physics really work in such situation ?"}, {"id": "eqr6pjw", "author": "Pomqueen", "body": "I don't think alex is saveable, bro. You should probably call your honor texting you and ask wtf"}, {"id": "eqr6vm1", "author": "Vixxxyy", "body": "The spookiest thing for me is I just watched videos about the Romanov family (Anastasia) and the names here are giving me strong reference vibes.\n\nAlso your friend is dead. Sorry, pal."}, {"id": "eqraght", "author": "DaWeed1992", "body": "O-13 was my seat on the egzams. Creepy..."}, {"id": "eqrauy4", "author": "MatrixDDoS17", "body": "YOU FOOL, WARREN IS DEAD"}, {"id": "eqrd5ye", "author": "P1Tz0N", "body": "You’re delusional.. someone get him out of here!"}, {"id": "eqrd7zw", "author": "I_need_to_vent44", "body": "Before you go back, at least wait for Anatoliy \"Frost\" over here and explain what happened down there to him. It'd be good to at least have a record of the incident"}, {"id": "eqreich", "author": "Shadowyugi", "body": "> A week later, we packed our gear and went on with it. We brought some rope, heavy flashlights, glowsticks, Geiger counters, waterproof protective clothes, an oxygen meter and a small emergency scuba tank just in case. And yeah, we’re not stupid so we told our relatives and friends about our trip and when we’re expecting to return. \n\nEven after all this. \n\nI am sorry. \n\nAlex is dead."}, {"id": "eqripe3", "author": "VinnieVanilla", "body": "perhaps they had opened a whole new portal from another dimension, an inviting one to those who in need of \" transportation'.  \nall u have to do is to steer clear of it, and also pray for your friend   \ngood luck to you"}, {"id": "eqrksb0", "author": "Mimsk33t", "body": "Don't go back unless you have a weapon"}, {"id": "eqrru4l", "author": "DreaGraham", "body": "Don't go back down there! Your friend is probably dead. Wait and meet that guy and let him tell you what he knows. You need all the information you can get if you're even considering going back down there. Let us know what you find out!"}, {"id": "eqrv9yi", "author": "ishtechte", "body": "Unfortunately all you could do was leave him behind. I would talk to Anatoliy and find out if a rescue operation is viable before going back down there by yourself."}, {"id": "eqrzjvz", "author": "ProjectXS107", "body": "How do you know Alex is alive?"}, {"id": "eqvg1sc", "author": "hereneverthere", "body": "Putin is looking for you"}, {"id": "eqxf10t", "author": "kalimere1776", "body": "psssh... nuclear reactor? More like element 115. Group 935 Ukraine branch."}, {"id": "erxoq9r", "author": "duelpoke", "body": "Oh just in bunk o job I o b polo"}, {"id": "eryp7ub", "author": "burritodorit0", "body": "Ten thousand people used to live there"}, {"id": "esz8736", "author": "telegamer", "body": "Commenting for later"}, {"id": "eszkt0h", "author": "bensanna19", "body": "THE SUSPENSE"}, {"id": "et2xpx2", "author": "philliephxnatic34", "body": "\n.. Me mm mm mm mm mm mm mm mm mm\n\n... Mom. In be"}, {"id": "et5175c", "author": "Kenzie2916", "body": "did anyone else picture the monster as those creature from Avengers: Infinity War"}, {"id": "f3bfuqn", "author": "KayLender", "body": "I know this is old but im still downvoting this, people died and you make a creepy pasta out or this? Fuck off"}, {"id": "f8ddnn1", "author": "kecin25", "body": "One of the few stories that actually have me scared to turn around in my chair..."}, {"id": "eqqy6aa", "author": "SenatorTacoFace", "body": "OP, can we have an update? Are you safe and okay?"}, {"id": "eqs6ign", "author": "kittiem", "body": "Go back and update please"}, {"id": "eqqquo7", "author": "Ninjaloww12", "body": "Did you lock the door behind u when u went in? I pray to god you did. If not you fucked us all."}]}