{"id": "ci94do", "title": "The previous tenant of my new flat left a survival guide. I’m not sure I want to live here anymore.", "url": "https://www.reddit.com/r/nosleep/comments/ci94do/the_previous_tenant_of_my_new_flat_left_a/", "subreddit": "nosleep", "author": "newtotownJAM", "text": "\nI moved in with my boyfriend yesterday. We’ve been together for 5 years now and we’re old and wise enough to settle down and finally leave our parents houses. He just turned 24 and I’m 22. He’s the love of my life. His name is Jamie and I couldn’t be happier to be living with him. \n\nWhen we decided to make the leap we spent 2 months looking at flats and houses, we couldn’t afford to buy yet so renting was our only option but the prices were astronomical. For our budget we would have been lucky to get a box room and a stove.\n\nJamie works for a local 24 hour fast food restaurant and I’m training to be a teacher. The early stages of training don’t pay much and I owe a lot in student loans so finances are tough. \n\nWe had almost given up hope until we found our flat. It was nothing special, but to us it was a palace. A spacious 2 bedroom apartment with views of a city park, a balcony and local conveniences. It was in a tower block in a not so nice area, but neither of us had been wealthy growing up, we weren’t fussy. Just grateful to be together. \n\nThe advert was sweetened by the deposit free option and open ended tenancy. The landlord was happy to sign a five year contract if we wanted. That sort of thing never happens in the city. We were told that along with no deposit we would also have no inspections, but would be liable to pay for any damage when we ended the tenancy. I’d never heard of anything quite like it.\n\nWe knew that for our budget and location we weren’t going to get any better. We snapped the place up fast, not even bothering to view it. It felt like our only chance. \n\nMove in day rolled around quickly and yesterday we got the keys to our first home together, it was such a strange feeling. The day was chaos, getting our stuff in and up in the lift. We were flat number 42, on the 7th floor. The items we couldn’t get in the lift had to be taken up all the stairs by the removal men. I think they were grateful we weren’t any higher but I still wish we had been able to give them a better tip. \n\nIn the evening we settled down on our second hand sofa, given to us by a cousin of a friend and watched some tv. We smoked cigarettes on the balcony looking at the park and fell asleep on our mattress on the floor super early because we had no energy to put the bed together yet and Jamie had work at a hideous time of the morning. \n\nWe slept soundly last night, I felt safe and happy. I don’t think that feeling is coming back any time soon and it’s all due to the note I found this morning. \n\nI found it in the kitchen, having a coffee, hours after Jamie had left for his early shift at work. It was in one of the cupboards that were fixed to the wall, there were a bunch of useful items from the previous tenant. Spare keys to the flat, a set of tiny keys that locked and unlocked the windows (necessary for those with kids this high up), spare smoke alarm batteries and a folded up piece of paper. \n\nThe note was handwritten with “New occupier of flat 42” in beautiful cursive on the blank side. I opened it up and sat down to read. I can’t really describe it to you, so I’m going to copy it out below. \n\n*Dear New Occupier,*\n\n*Firstly, welcome to your new home. I lived here before you for 35 years with my husband. Unfortunately he had an incident at home recently that I’d rather not discuss that claimed his life. My sister has now decided I can’t keep up with the demands of the property and has insisted that I move in with her and her husband. I was reluctant at first, but the stairs do kill me at my age and without Bernie it’s filled with sadness.*\n\n*Anyway. When you’ve lived somewhere for as long as I have it feels like a person that you know. You understand it’s personality and what makes it tick. I thought it was probably pertinent that I impart some of that knowledge on you.*\n\n*It’s a wonderful home, honestly, I have lived through best and worst years and leaving it behind is very emotional but if you are to survive and get the best out of it then there are some steps you need to follow.*\n\n*1. The landlord will never bother you, he doesn’t visit, call or communicate in any way. But make sure to pay your rent in a timely fashion always. I have only dealt with him once in 35 years and let’s just say I never missed another rent day. Any repairs required you speak to the agent you rented the place with.*\n\n*2. DO NOT use the communal lift between 1.11 and 3.33 am. Just don’t do it. This step is vital if you are to have a happy life here. It really is life or death. Don’t do it. This has cost me and many others in the building greatly and I would rather not elaborate on why you shouldn’t do this. Just please don’t do it. I cannot stress this enough.*\n\n*3. When you hear the strange animal noises coming from flat 48 don’t question it, Mr Prentice lives there and he’s a lovely chap. Don’t be afraid to say hello to him in the corridor or on the stairs (he’s old school, so he never risks the lift) but whatever you do, don’t check on him when you hear the noises. You’ll know when you hear them.*\n\n*4. If you ever come across a window cleaner on the balcony ignore him. He may seem like the nicest fellow you’ve ever had trying to sell you something at the door but it really is best that you don’t engage. He will go away if you ignore him. But he tries pretty hard the first few times so you’ll need some resilience. Whatever you do, don’t offer him anything. No money, no hot drink.*\n\n*5. Don’t leave food scraps out. Bin or refrigerate them immediately. If you have small animals, it is imperative that you watch them eat and take away any leftover food immediately after they are done. This and rule 2 go hand in hand, the things forage all day and seem to really love animal feed. You don’t want them in your flat. I promise. You can leave what you want out between 1.11 and 3.33am so you may want to feed your pets then.*\n\n*6. Don’t communicate with any neighbours who claim to come from flats 65-72. These flats suffered a fire in the late 80s that devastated the whole floor, all the residents died in their homes. The building was mostly council owned at the time and they never bothered to renovate the flats. They’ve been empty ever since but every now and again someone will knock at your door claiming to live in one of these flats and ask to borrow some sugar. They will seem entirely average but you must shut and lock the door immediately. I installed two extra security bolts to avoid these fuckers. I don’t like to swear at my age but they really are fuckers.*\n\n*7. Simple one for you here, keep a weapon in each room. Sometimes you follow all these steps and something still slips through the net. Better to be safe than sorry.*\n\n*8. The building has a committee that will try and get you to join. It’s one of those neighbours groups about improving living conditions for all residents. It’s a nice group and the lady who runs it - Terri from flat 26- is a fantastic neighbour. By all means get involved. But I wouldn’t recommend babysitting Terri’s 2 children. She’ll ask you, because the poor woman needs a break, but if you accept don’t say I didn’t warn you.*\n\n*9. Stray hairless cats sometimes roam in the hallway. I know they’re supposedly a special, expensive breed, but they don’t belong to anyone. They’re mostly  harmless, but don’t pick them up. Not unless you see one of those neighbours that claims to live in 65-72. Then grab the cat and lock it inside with you. It’ll burn your skin a little but the cats are friendly and I wouldn’t want to see them hurt.*\n\n*10. There is no way to fix the damp patch on the ceiling in the bedroom. Sometimes it will turn a deep crimson and look quite concerning, but please try not to be alarmed, it doesn’t drip, it doesn’t get any bigger and it’s been there longer than I have. The landlord won’t budge on it, according the the agents. I flagged it many times, even called the police the first night it changed colour, but it was a waste of time and it will be for you too. It’s best to ignore it.*\n\n*11. You can trust the postman. His name is Ian Flanders and he’s been the postman since before I moved in. He has his own key to the main door and delivers post to the door every morning at 8.54. I can’t include everything here, or it would become a novel but if you have any questions Ian will help you.*\n\n*12. Finally, the first few weeks are the worst. You’ll feel like you’ve made a mistake, I’m sure reading this you already do, but if you can get through the first few weeks it really is a lovely block to live in. Every property has it quirks and this one is a little extra special, but you can be truly happy here if you just take my advice. I wish you all the best, I really do.*\n\n*Yours truly*, \n\n*Mrs Prudence Hemmings*\n\nI don’t really know what to think after reading the note. Hopefully it was some sort of joke but the agent had said the previous tenant was an elderly lady and I can’t see anyone named Prudence Hemmings attempting to play practical jokes on someone they’d never met. \n\nThere were also parts of the note I couldn’t disprove, there was indeed a large damp patch above the bed that me and Jamie had already discussed reporting. No crimson but it definitely existed. I had also commented on a beautiful Sphynx cat roaming the halls as we were moving in. I started to get seriously freaked out.\n\nOur dream, our beautiful little home had just become a source of fear and confusion. I checked the time and it was 9.14. Damn it. Out of time to catch postman Ian. When I opened the door to check, sure enough, two letters addressed to a Mrs Hemmings sat on the doorstep. \n\nAt about 11.15 my worst fears were truly confirmed when a friendly middle aged looking man carrying window cleaning equipment knocked on my balcony door. I ignored him. I didn’t want to take the risk until I’d spoken to Jamie and showed him the note. I’d texted him already to rush home. I felt bad as the man rapped his knuckles against the door for over 10 minutes, but honestly the longer it went on the more I was terrified. \n\nMy windows were sparkling, and due to our lack of curtains I couldn’t even hide from his gaze. I felt so exposed. He stayed for a total of 30 minutes exactly and never once did he stop looking at me or knocking. He shouted the occasional ultra friendly line or humble request for a beverage in the heat through the door but I did my best to avoid eye contact. \n\nWhen he finally left I looked outside every window in the flat, but I couldn’t see him on any of the other balconies or see any equipment suggesting he was around. He had vanished completely. \n\nJamie still hadn’t text me back, he must have been having a rough shift, it was a Friday and they were always busy. It wasn’t often that he didn’t reply. He was due home in around an hour anyway.\n\nI read the note probably hundreds of times over, I tortured myself reading it for the next hour. Desperately waiting for Jamie to come through the door to tell me it was all crazy and I should relax. \n\nI hoped for that so much.\n\nBut Jamie never came. His shift should have finished around midday but by 2pm he still wasn’t home. I panicked, I cried, I left over 100 voice messages on his phone but got nowhere. I finally decided it had been long enough that calling his work wouldn’t embarrass him and his boss told me that he had never turned up for his shift. \n\nI thought about it, what could have happened?  And then it hit me. Jamie’s shift started at 4am today. He would have left the flat at 3.15 and taken the lift down the stairs. \n\nI don’t know what to do. I’ve tried to convince myself it was all just a big joke. Maybe Jamie wrote the note and got his boss in on it. A voice in my head kept telling me that he couldn’t write like that if he tried but I had to attempt to fool myself. It’s getting late and he still isn’t home, what if it’s all true? I think we made a big mistake.\n\n\nMy next steps : https://www.reddit.com/r/nosleep/comments/cinu8u/the_previous_tenant_of_my_new_flat_left_a/?utm_source=share&utm_medium=ios_app\n\nAnd what happened after that: https://www.reddit.com/r/nosleep/comments/cj2g4k/the_previous_tenant_of_my_new_flat_left_a/?utm_source=share&utm_medium=ios_app", "comments": [{"id": "ev2mph5", "author": "NarcissusWho", "body": "Wait for the postman OP. Ask him if there’s any way to help Jamie."}, {"id": "ev3q5u6", "author": "Booyahman", "body": "Perhaps there is hope for the man since it sounds like Mrs. Hemmings had a run in with them once and while it wasn't pleasant she clearly lived to tell the tale."}, {"id": "ev36zuv", "author": "BitfyPro", "body": "I was reading the cat thingy and then, it's 3am, I heard a cat basically scream meow. My heart is now dead."}, {"id": "ev38pqo", "author": "Zathured", "body": "Usually weird shit like this happens in rooms 13. You're in room 42, but on the 7th floor, so 4+2+7=13. I thought it was neat. Good luck to ya!"}, {"id": "ev2mtgx", "author": "NarcissusWho", "body": "Also do NOT investigate the elevator before you do. You might want to research the building online - maybe look up Ms Hemmings and try to get in touch."}, {"id": "ev3h7wu", "author": "sourlizard86", "body": "Window cleaning guy is a vampire and animal noise man is a werewolf! Least they can be avoided without too much trouble."}, {"id": "ev3cvsc", "author": "Restryouis", "body": "Contact your local ghostbusters, if they are not available, run like hell.\n\nAlso, you might not wanna look up left behind you between 5.02 and 6.03 just in case."}, {"id": "ev3eyuu", "author": "Jintess", "body": "I know ignorance of the law is no defense but still..\n\nA heads up before Jamie left for work would have been nice, Prudence."}, {"id": "ev3qbzr", "author": "kieran4u2c", "body": "Seriously, I need an update on this. I'm worried about poor Jamie. Can't you just ask for a do-over? He hadn't been given the rules yet so..."}, {"id": "ev3qtf0", "author": "Delfishie", "body": "Have you ever read the book \"14\" by Peter Clines?  Some buildings look so normal on the surface, but have completely bizarre dynamics on the inside.  \n\nI wonder what would happen if someone put a camera on the lift?"}, {"id": "ev2u31y", "author": "ZimmyDod", "body": "Based on the cup of sugar, the time the elvators are deadly and the cats, i think its safe to say your dealing with witches."}, {"id": "ev3jb2u", "author": "Noire_Raven", "body": "I think talking to Ian is your best bet, OP. Keep us posted."}, {"id": "ev3lpb7", "author": "OGSHAGGY", "body": "God damn it. Usually the posts on this sub don't get my hackles up to much and this was the last post on reddit I was gonna look at before going to bed. Figured it wouldn't be too bad, but now the name of this sub is truly coming back to bite me."}, {"id": "ev4bg0d", "author": "PixieChick72", "body": "The hairless cats are the pets which belonged to the fire victims from flats 65-72 and those people are trying to lure them back..."}, {"id": "ev3125w", "author": "Thiefintheshadows", "body": "let us know what happens next!"}, {"id": "ev31k8i", "author": "WishLab", "body": "I'm so scared and sad for you, OP. Is there a way to contact Mrs. Hemmings and find out what, if anything, can be done? I really wish you all the best with this, OP. Stay safe and let us know how you're doing, yeah? We're all pulling for you."}, {"id": "ev4ir58", "author": "djsourmilk94", "body": "Why the fuxk did I read this in the middle of the night"}, {"id": "ev3muap", "author": "AlienRouge", "body": "Rule 13: Leave this note with the next tenant, plus any additional rules you may discover?"}, {"id": "ev37h1x", "author": "WhatDoYouWantNowKid", "body": "I would love a follow up to this."}, {"id": "ev4euxx", "author": "LU90", "body": "I think your partner is now a cat you need to figure out which one"}, {"id": "ev55ec1", "author": "laurelannlucy", "body": "I was just thinking, yeah I'd put up with this for a two bedroom apartment in London with a balcony. \n\nBut the fact that Jamie didn't have time to read it and probably used the elevator during the witching hours... that's shit. Really awful luck. \n\nI'd say use the time until Ian's next rounds to prepare. Unpack all your food ASAP and put it in in the fridge.\n\n\nThen go out shopping. Buy some extra Tupperware to put away your food. Get those weapons in every room. The suggestion of cast iron is a good one, lots of occult and supernatural things can't stand iron, and you can get a cast iron skillet or fire poker for every room easily enough. Get some curtains as well so you can ignore the window washer. Read the note over and over until you've committed all the rules to memory. It's going to be a rough 23 hours but talk to Ian. He'll help you out and if anyone knows how to save Jamie it will be him."}, {"id": "ev5ksci", "author": "miltonwadd", "body": "A-hole neighbours could at least put an \"out of order\" sign on the lift knowing there's fresh blood in the building!"}, {"id": "ev3aryh", "author": "xattentionwhorex", "body": "Please keep us updated with what happens :)"}, {"id": "ev3jhvo", "author": "Rowan0301", "body": "Ooohhh, P.O.!! Thank you SO much for detailing this all out!! I’m dying to know what’s happened... and is yet to come!!! \n\nMy advice: hunker down for a long night, and make certain you’re there to talk with the postman!! Thank heavens for that helpful tidbit!!\n\nGood luck tonight!! I’ll be anxiously waiting to hear more!!"}, {"id": "ev3b31u", "author": "emeetea", "body": "Breathlessly awaiting an update!\nI would follow the suggestions to the letter until you have more information.\nAnd invest is some serious anxiety medication."}, {"id": "ev4cmle", "author": "Redcole111", "body": "Good luck! I hope you find your husband! Hemmings didn't say explicitly that people always die in the elevator at that time. There's still a chance. And besides that, there are other, more... unique ways to bring him back.\n\nI hope to hear much more from you about this fascinating apartment building, and all the interesting phenomena you experience while figuring out how to survive there.\n\nHonestly, I'd be quite happy with the situation if I were you, except for what happened to your husband (seriously, good luck with that btw). With that survival guide, you should basically be all set and not encounter any issues."}, {"id": "ev5hrpd", "author": "UnferledDread", "body": "I don't know if there is a significance in the time 1:11, but I do know that 3:33 is the witching hour, when demonic activity is at its peak. I wonder if the reason why you can't take the elevator between those times is because it sends you straight to hell."}, {"id": "ev7qmed", "author": "SlytherinSilence", "body": "“Old and wise enough” ...... “I’m 22” hmmmm...."}, {"id": "evbeh5o", "author": "GreatBigSteak", "body": "Hi Katie! My name is Samantha, I live in flat 68. Just let me know if u need any help or if you have any spare sugar. Hope to see you around!"}, {"id": "ev3rlyq", "author": "NXTangl", "body": "Ok, ok, you're dealing with the Gentry if anything. You will need a frying pan, cast iron. NOT TEFLON. However I think this is more than them so get a priest (it doesn't matter what religion or denomination, but one who is respected and devout) to bless some water. After that, a rock salt shotgun, a bag of beans, and a silver knife ought to be enough to deal with anything."}, {"id": "ev42vjs", "author": "Elibaby", "body": "Yooo we need an update on this shit, sound spooky as hell"}, {"id": "ev46lz9", "author": "58__", "body": "Buy a wireless security cam, put it in the lift at 12:30, and watch the camera from your phone. Good luck OP."}, {"id": "ev5z6pd", "author": "Phoenix-91", "body": "So, I'm currently in the middle of trying to move house.. \nLet me just say; it's been a while since I've been spooked.\n\nI hope you have more to tell us soon.\nGood luck, sounds like you might need it."}, {"id": "ev9bnn6", "author": "spiritofdjinn", "body": "Sounds like there are dark spirits living in that building with you. Here's a short list of things you need to do.\n\n1. GTFO\n\nSeriously."}, {"id": "evoaq78", "author": "spacemartiann", "body": "when i was reading “someone will knock on your door” (rule 6) my mum knocked on the door at the exact same time i read that line and i scared shitless"}, {"id": "ev4btoe", "author": "Aninternerloser", "body": "Your boyfriend is dead, OP. Obey the note's imperative instructions and you may yet live. And worry not! The building will return him to you, piece by piece. A tooth in the cereal you just opened, some blood trickling out of a faucet, a squeak of a door hinge that sounds like his agonized cry... You just have to put him together!"}, {"id": "ev3gzl1", "author": "birdwithblackwings", "body": "Please, don't leave us hanging. If you kept a journal, I'm sure it would be very interesting for everyone!"}, {"id": "ev4dlqt", "author": "sourlizard86", "body": "1.11-3.33 That is awfully coincident. Perhaps it is the witching hour(s)!\n\nEdit: words."}, {"id": "ev5kgbi", "author": "indiware", "body": "I'm sorry, I'm so sorry. RIP Jamie. Maybe keep a few of the cats?"}, {"id": "ev32d1s", "author": "silvercreek18", "body": "Sounds like the cats come precooked! Nice!"}, {"id": "ev3h9co", "author": "Meowimak10", "body": "Oh man, please do a follow up on this!"}, {"id": "evbo8ut", "author": "Ohhsaam", "body": "You should napalm the whole building and let it all burn to ash."}, {"id": "ev3hsqi", "author": "legsuptothere", "body": "You haven't checked the lift?"}, {"id": "ev3hom0", "author": "smokesrus07", "body": "Let us know what the postman says! Or maybe ask the housing committee?"}, {"id": "ev4hc7p", "author": "dedeadguy", "body": "We need a follow up, please do update us with how it's going on \n\nLove and support from entire Reddit"}, {"id": "ev4qi7k", "author": "DeathToIslamGamer", "body": "Ok since it's safe now, go check the elevator for signs of trouble. If there's a button to stop it, do so.\n\nGet someone to keep the door open otherwise and investigate the shaft. If there's no hints install a camera in the elevator and on top of it. Leave some food there as well."}, {"id": "ev5gclm", "author": "Oliver2381", "body": "We. Need. Answers."}, {"id": "evb8he8", "author": "Chocospider7", "body": "IF the previous tenant survived long enough to know exactly what times to not take the elevator, then Jamie should be ok."}, {"id": "evbl3fu", "author": "MolotovCockteaze", "body": "I wonder is the lady who runs the neighborhood watch thing. If her kids are gnomes or fairies,  some kind of mischief makers."}, {"id": "ew8i2m5", "author": "soldeagua", "body": "Looks like op is a newcomer in nightvale"}, {"id": "ev34j8a", "author": "arya_ur_on_stage", "body": "Oooh I'm so intrigued! I want to know about each rule as you encounter the reason!"}, {"id": "ev4w881", "author": "TobyTheArtist", "body": "Ask Terri and as well as the postman, OP. Given they're both good people it cant be the first time someone has tried taking the lift."}, {"id": "ev3fi7a", "author": "e-by-the-sea", "body": "Go ask Ian!!"}, {"id": "ev4smt3", "author": "Anhmoii", "body": "If i was her, after reading the note i would GTFO. I've been watching too many horror to be prepared for this kind of stuff"}, {"id": "ev5asvs", "author": "WaylonJenningsJr", "body": "Torch it, OP! Leave now and burn that fucker right down to the ground! And good riddance to everyone in there! Including Terri and her bratty kids. Then you can search for Jamie, although I think you might better just start looking for a new boyfriend."}, {"id": "ev5bt4n", "author": "sweetbutdeadlygirl12", "body": "What if the postman too is dangerous and placed the letter in the flat somehow, just to make sure that he hunts down the new tenants and no one/ nothing else. Can't trust anyone, can you?"}, {"id": "ev5ggdk", "author": "blueblueberrypie", "body": "Might want to get out of there while you still can."}, {"id": "ev5vsaa", "author": "errorAnomalyDetected", "body": "Truly frightening. You'll just have to wait for the postman."}, {"id": "ev63jx0", "author": "theproliar", "body": "Track down Prudence Hemmings. She's still alive and living with her sister and she has answers."}, {"id": "ev692ct", "author": "mynamesmarch", "body": "Get a lead testing kit for the paint splotch. Trust the postman"}, {"id": "ev6ga5b", "author": "Ledhabel", "body": "Fucking incredible. Just absolutely, fucking incredible."}, {"id": "ev7v0wz", "author": "Sokocime", "body": "RIP OPs man."}, {"id": "evc12at", "author": "sam_xxnatxx", "body": "Its blackwood who changed her name as Hemmings"}, {"id": "evz8d5i", "author": "MistahTree", "body": "/u/misustree"}, {"id": "ew65jg9", "author": "Comodorefluffy", "body": "Is your flat in Nightvale? This seems like some Welcome to Nightvale shit and I love it."}, {"id": "ewtz9jz", "author": "Jonathonbridgeman", "body": "Yeah not sleeping tonight. Almost remind me of a Thomas Ligotti story"}, {"id": "ev3pv83", "author": "Couldnotthinkofname6", "body": "talk to the postman about it, he seems like a nice dude"}, {"id": "ev4d7do", "author": "LunDeus", "body": "Make sure to look into loan forgiveness for teachers OP if you're in the US :)"}, {"id": "ev4g683", "author": "Fredd8", "body": "I hope Jamie is okay, but also even if you didn't really believe the note, THANK YOU for following it. Most people in horror movies rarely ever follow instructions. Maybe ask Ian when he comes in tomorrow and see if he can help you get Jamie back from the elevator."}, {"id": "ev512hd", "author": "aldguton23", "body": "The window cleaner is a vampire, don't invite him in, animal guy is werewolf, the 55-74 flats are witches and the cats are theirs"}, {"id": "ev3f6og", "author": "somethingaccountuser", "body": "Hes def in the elevator"}, {"id": "ev3mb0g", "author": "priscillamarie1113", "body": "Wow please update us!"}, {"id": "ev3ulxn", "author": "Notdat", "body": "Hello, I suggest you to throw that letter, and to stop thinking about it. \nEven better, do the exact opposite of what is written on it. \nYou and Jamie have chosen this flat to live together peacefully, so don't let this ''survival guide'' spoil your pleasure. \nThink about how you felt before you read it."}, {"id": "ev3v1j2", "author": "Reira_valentine", "body": "Really good! Can't wait for more."}, {"id": "ev4m1fx", "author": "poetictrashe", "body": "Keep us updated! Hope you find Jamie soon!"}, {"id": "ev4sj0i", "author": "luvbrownskinnn", "body": "well shit."}, {"id": "ev5d8mf", "author": "hann9520", "body": "I would love to read more on this, just hold in there and listen to the commenters, they oftenly say clever things!"}, {"id": "ev5w4qm", "author": "Jewels1327", "body": "Omg OP, it's been hours now! Is there any sign of Jamie yet???"}, {"id": "ev618r7", "author": "potatoman8712", "body": "Nah you got this."}, {"id": "ev62z81", "author": "AlmostFearless90", "body": "Can we talk about the damp spot in the ceiling??? What does it mean?"}, {"id": "ev66crz", "author": "EX1TK1D", "body": "1:11 is the angel hour while 3:33 is the devil's hour, coincidence? I think not."}, {"id": "ev6c4mn", "author": "yongjen91", "body": "You ded"}, {"id": "ev6ezwc", "author": "Amilia_nikz", "body": "I guess it would be an idea to try and find out more about Prudence... but wtf happened to Jamie??? Come back soon OP!  Please! 😰"}, {"id": "ev6kyca", "author": "LordRevanish", "body": "jamie ded"}, {"id": "ev782fe", "author": "ddta99", "body": "Wonder if the elevator is a portal to hell, that opens between 1:11 and 3:33 a.m.? Maybe that's where all the strange little demons that eat food scraps and pretend to be the deceased tenants come from?\n\n42, 48, 66 and 72 are divisible by 6. 26 is divisible by 13.\n\nSince the cats are hot, wonder if they're the burned tenants?\n\nOther redditors have likely nailed the vampire and werewolf."}, {"id": "ev7gp85", "author": "Ryos_windwalker", "body": "Well at least you know whatever the lifts do is survivable, if incredibly unpleasant EDIT: nvm."}, {"id": "evb1j5y", "author": "Leafy81", "body": "Damn. I thought the apartment block in movie High Rise was messed up. Now I'm more thankful than ever with my shitty townhouse."}, {"id": "evdrznn", "author": "Gibranies", "body": "Since when is 22 old and wise lol? Girl I’m 22 and I don’t know what you’re on"}, {"id": "evl0hxg", "author": "clovercakes_", "body": "Seems like your place is haunted. A lot."}, {"id": "evssz7x", "author": "Gohiogloriami", "body": "Omg I need to read the rest before I try and input. But I’m already worrying about you and you husband"}, {"id": "evu12bq", "author": "leopardRus", "body": "Ooooh, this juicy"}, {"id": "evvxcmb", "author": "Mike-Hunt12345", "body": "Well if there’s a survival guide you should be find"}, {"id": "ewwvsd8", "author": "Shinningfire7", "body": "when you realize he was 19 and she was 17 when they started dating.\nMonkaS"}, {"id": "exb0urs", "author": "clevo_1988", "body": "I read the entire thing, very recommended."}, {"id": "exh2bpe", "author": "joeyblast", "body": "its an elevator to hell. if this is a true story you can summon me. the cats will let me know"}, {"id": "eyfs9is", "author": "AlvinGT3RS", "body": "Someone make proper links to the other parts"}, {"id": "eyft7ve", "author": "AlvinGT3RS", "body": "Lmaoo what? These kids are young"}, {"id": "eyu52qu", "author": "jessiehinter0313", "body": "I am laying in my bwd in complete terror right now!  I am on NoSleep every single day and have  yet come across any reading that yas freaked me out as much as this has!  I cant wait to keep reading.  Stay safe OP and follow the orders in that letter"}, {"id": "f4k5t85", "author": "Mrjmoople", "body": "Which link do I go to???"}, {"id": "f7zyawm", "author": "hezzler", "body": "Sounds like the beginning of a hella good mini series."}, {"id": "facjbnd", "author": "OnlyTheForum", "body": "commenting for later"}, {"id": "fdddffz", "author": "cocoline", "body": "THIS SHOULD BE A MOVIE"}, {"id": "ev3m6b7", "author": "validpeach", "body": "any updates??"}, {"id": "ev4b5d7", "author": "iwillhauntuwhenidie", "body": "I think you need to try to get in touch with Ms. Hemmings!!  At the very least touch base with the postman so you can get some answers about what happened to Jamie ... He might know.\n\nPlease update us when you can!"}, {"id": "ev4h5kw", "author": "DrHark", "body": "Where do you live? Maybe you don't need to worry depending on the state of daylight savings at this time of the year?"}, {"id": "ev4m08p", "author": "mia_elora", "body": "I would seriously suggest investing in some salt for your door..."}, {"id": "ev4qq6y", "author": "Daegog", "body": "GTFO, im shocked you stayed long enough to type all this."}, {"id": "ev5pjws", "author": "Billib2002", "body": "Sooo when you started dating he was 19 and you were 17?\nFBI OPEN UP"}, {"id": "ev40y7x", "author": "thisbrokenlife_", "body": "I think maybe you should just obey the rules. I mean she was nice enough to warn you and write some stuff down! So as long as you follow the rules I’m sure you’ll be fine! \nAnd I’d also ask Ian about what to do about your husband and where he could be. Stay safe OP! And update when possible"}, {"id": "ev3mum8", "author": "Summere143", "body": "The postman may be able to help; don't miss him tomorrow!"}, {"id": "ev3qtm0", "author": "angeluchia", "body": "im so intrigued! pls update"}, {"id": "ev3t2k1", "author": "whereismyhairbrush31", "body": "Need an update soon!"}, {"id": "ev3xi9e", "author": "deluxe-vegan-lmfao-", "body": "try and get into contact with the old lady and ask some questions!"}, {"id": "ev458ej", "author": "TwirlingInTheRain", "body": "OP, I hope you and Jamie are safe"}, {"id": "ev4s7ly", "author": "Kaydeeward1984", "body": "He left for work too early....she said 1:11 to 3:33....he should have waited a little longer, but stay safe"}, {"id": "ev5vflr", "author": "Itsalongstory_001", "body": "Do you have any way of contacting Prudence? She said she had used the elevator and paid greatly, maybe she can tell you what to do. Maybe the agent you used to rent the building has a forwarding address for her mail or a contact number? If not, try to relax and catch the post man in the morning. Best of luck!"}, {"id": "ev5xocx", "author": "caa21701", "body": "Ghosts.  just sayin.  The fire people and cats."}, {"id": "ev6dinn", "author": "mjxii", "body": "Eat a can of cat food,  huff some glue. Problem solved!"}, {"id": "f2pu6kx", "author": "modernisedtypewriter", "body": "Make sure when you go investigating to take an egg. And a second if you like."}, {"id": "f7vffjl", "author": "Edawg649", "body": "oh no, Jamie took the lift before 3:33am :/"}, {"id": "few2y1j", "author": "Aceze", "body": "Damn, Granny knows what's up"}, {"id": "ev4c10p", "author": "Chelle8847", "body": "This is awesome. But I'm also scared for you, and I truly hope there's a way to help Jamie! I have a feeling though that even if there is, it won't be easy. Please let us know ASAP what happens next! Will you be able to cope on your own?? Or should you get a friend or someone to move in as well?? All the best OP"}, {"id": "ev54ykh", "author": "kaize_kuroyuki", "body": "Oh thanks, I'm never using my bathroom in the middle of the night again."}, {"id": "ev59s7g", "author": "Oshni", "body": "I dunno. It seems like a relativly nice place if you get past all that. Im sure the post man knows someway to help Jamie. The guidelines dont seem too dificult to follow, i wouldnt be too worried."}, {"id": "ev5eju9", "author": "LynnBawss", "body": "Talk to Ian and have him help!"}, {"id": "ev5v24u", "author": "indistinct_shadow", "body": "I'm not sure if anyone has said it or if it's just plainly obvious, but it seems that, by your timings, Jamie used the lift within the 1.11 - 3.33am time zone. I assume whatever effects the lift got to him before he could even get to work."}, {"id": "ev7t9u4", "author": "PedoSa", "body": "I have a friend and he likes paranormal stuff we were playing terraria and talking mostly other games stuff life and jokingly insult ourselves  and a while ago he vaguely mentionated the screams on floor 48 and the guys on the floors that don't exist copuled with the fact that they are just a flat roof \n\nI need to log onto fortnite he is playing right now \nI will inform you all what he says"}, {"id": "ev4jfqd", "author": "therealrandy01", "body": "You left 100 voice messages? You sound insane"}, {"id": "ev3pr1m", "author": "iBeavy", "body": "Uh maybe call the police?\n\nThe note said nothing about involving the authorities.\nCall them because your dude is missing.\nQuit wasting precious hours on reddit."}, {"id": "ev4nwjg", "author": "gossamer_bones", "body": "prudence hemmings...? thats just bad."}]}