{"id": "cinu8u", "title": "The previous tenant of my new flat left a survival guide. I think I’m going to need more than a guide.", "url": "https://www.reddit.com/r/nosleep/comments/cinu8u/the_previous_tenant_of_my_new_flat_left_a/", "subreddit": "nosleep", "author": "newtotownJAM", "text": "How it started: https://www.reddit.com/r/nosleep/comments/ci94do/the_previous_tenant_of_my_new_flat_left_a/?utm_source=share&utm_medium=ios_app\n\n\n\nSo much has happened in the last 24 hours. I’m so stressed and I’ve barely slept since I discovered that Jamie was missing. It’s starting to make me feel a little twitchy. But I thought I’d better update you guys. \n\nI was overwhelmed by all the suggestions you gave me and have taken more than a few of them on board. I’m definitely going to be getting a huge planter full of sage for the balcony and I did spill a little salt in my doorway. I’m sorry to disappoint but that didn’t help at all. \n\nThere’s nothing I’m following quite like Mrs Hemming’s rules. I’ve followed them to the letter so far, and lo and behold I’m still alive. That’s not to say it hasn’t been tough. Il start from the beginning. \n\n\n\n\nI was going crazy. And a few hours after my last post Jamie still hadn’t returned. He had been gone for almost 24 hours. His work have called me multiple times. I don’t know what to say so I just keep ghosting the calls. \n\nI was bang in the middle of the danger time when I decided checking the lift had to be my first step. But I wasn’t going to break that rule. \n\nI waited. I waited desperately for 3.34 to come and I’m ashamed to say that when it did I remained paralysed to our sofa for almost half an hour before I found the nerve to leave the flat. It was 4.02 when I finally reached the lift. \n\nThe lift in this building is old and rickety. It hasn’t been updated in a very long time and has likely been here as long as the building. It’s big, clunky buttons stared back at me as I glared at them, hoping for some sort of answer or clue. My heart thumped and I was overcome with a feeling of dread but nothing came of any of it. It was hopeless. \n\nI stepped inside the lift, rode it up and down a few floors and searched the entire perimeter with a phone torch for anything I could find. I found nothing. Jamie had completely disappeared. \n\nSobbing and exhausted I rode back to floor 7 and turned my key in flat 42, the perfect home that felt anything but home at that point. \n\nI sat at the cheap flat pack dining table we’d managed to put together on move-in day and cried. My hands shaking as I held my phone. \n\nI was flitting between reading all your comments and contemplating calling the police for an hour. But I decided to call my friend Georgia instead. I needed a real person here, things were so crazy I wasn’t sure the police would be able to help with what little information I had. But I knew I needed to sound it out with someone.\n\nIl spare you the details again, but I told her everything. She promised she’d be with me in the late morning, she had to take her younger brother to school. \n\nI waited anxiously. Not before arming every room exactly as advised. Before I knew it I looked at the clock and it was 8.23, I had around half an hour until the postman was due to show up. \n\nThere was no way I was missing him today. I stood by the door looking vacantly at the wood, like someone in a film who was possessed. The exhaustion was really setting in but Jamie was all I could think of. Pure adrenaline was keeping me standing. \n\nAt 8.52 I opened the door. The next two minutes were the longest of my life but when I saw him a wave of relief swept my entire body. \n\nRight on cue, 8.54 the postman, Ian Flanders stood in front of me, a smile that barely hid his concern covering his younger than expected face. He didn’t look old enough to have been the postman for over 35 years but I was too  distracted by the answers that I needed from him to care.\n\n“You must be the new tenant.” He stated, but in a way that it sounded like a question. I struggled with my answer, so I got straight to the point.\n\n“Mrs Hemmings left me a note, she said to speak to you if - “\n\n“Can I come in dear? I think we need to chat.”\n\nI ushered Ian in, my hands still shaking as I flapped them in the direction of the sofa, gesturing for him to sit down. I shoved the now slightly crumpled note into his lap and waited. \n\n“I’m glad Prue still thinks that highly of me. I will miss that old girl.” He said with a coy smile as he reached the end of the note. \n\n“Can you help me or not?” I had no time for his ego trip over a moved on neighbour. \n\n“I can help. But I can’t stop for long so it’ll have to be quick. I’ve walked these halls delivering the post for 40 years. I’ve seen it all, everything Prue’s mentioned and more. What do you need to know?” He said.\n\nIan was nothing like what I expected. The note made me feel like he was going to be a kindly, old grandad type figure, but I couldn’t have been more wrong. Postman Ian spoke with a thick city accent, and wore a heavy gold chain around his tattooed neck. He had dyed his greying hair boot polish black.\n\nHis demeanour was thankfully non threatening but extraordinarily cocky. He was the sort of man I imagined in a betting shop, rubbing his grubby hands on notes as he bragged over a win. \n\nHe didn’t ask as he lit a cigarette in my living room. I didn’t question it, we would usually smoke outside but I wasn’t going to argue over technicalities. I grabbed a bowl for the ash and lit one too. \n\n“Let’s start with the things in the lift. My boyfriend is missing and he took the lift at quarter past 3 over 24 hours ago. We hadn’t got this note yet. I haven’t heard from him since. I need to get him back.” I barked at him as if the louder I spoke the more I could influence his answer. But nothing prepared me for what he said. \n\nHis skin turned pale and his harsh looking face became more sympathetic as he explained. \n\n“He’s dead, love. Forget about him now. Only one person has ever come back from the lift at that time of night and it was Prue herself. After witnessing it. Those creatures ripping their victim apart. Poor Prue was traumatised. Your boy is gone, let go and follow the rules.” He was blunt but I could tell he felt sorry for me. \n\n“There must be something I can do!” I pleaded.\n\n“There are things I’ve heard to bring back those who are lost but I’ve never seen solid proof they work. It would be irresponsible of me to tell you to do something that might get you killed too. It’s nice here, honest, just get over him and live the status quo. Sorry if I sound harsh, I don’t mean to, but you seem like a decent young lady and I don’t want to see you go too soon.”\n\nI asked about what Mrs Hemmings had seen in the lift and if they were sure it happened to all who entered it. I refused to believe that Jamie was dead. There had to be something I could do and if I knew what I was dealing with I could be better prepared. \n\n“It was awful what happened. I wasn’t there, but this is what I was told. \n\nLittle Lyla was such a cute kid. She used to open the door and give me a tip when I delivered the post. She was Prue’s granddaughter. Lyla was her sons little girl and that night She was staying over for the first time. Prue finally felt confident that she could protect Lyla from all the strange things that happen here...\n\nShe was wrong. Little Lyla had a problem with sleepwalking. And she took a trip into the hallway at half 1 in the morning, Prue took a little too long to notice the sound she had heard was the front door and by the time she reached the lift she saw the creatures dragging Lyla’s limbs away from her body. She tried to fight them, even killed one, but she couldn’t save the little girl.” \n\nI was hysterical, imagining Jamie’s fate.\n\n“What are the creatures? Have you ever actually seen them.” I asked.\n\n“No one really knows what they are love. They’re something to do with the building and all its quirks, no ones ever seen them elsewhere. We don’t know where they came from, just that they’re here. \n\nI’ve seen them a few times over the years, usually when new neighbours have left biscuits down for their cats and dogs or haven’t disposed of food waste properly. \n\nThey’re curious little creatures. Mostly harmless out of the hours Prue warned you about, but if they’re fed they can become quite viscous looking for more food. \n\nThat’s why you have to bin all your scraps, or hide them or pack them or whatever. Just don’t leave them out and don’t use the lift at those times and you’re safe from the creatures. \n\nThey’re a little smaller than humans, but they’re a similar shape, they come with grotesque rodent like features, and are far larger than any rodent could be. Like rodent children I suppose. They have two sharp rows of teeth per jaw and are consistently hungry. \n\nWhen they eat they crunch down in a violent and disgusting way, dripping spittle everywhere, Prue said she could hear her granddaughters bones shatter in those jaws.” He went pale at the thought of that, but continued.\n\n“When they first arrived in the building there were hundreds, it caused pandemonium amongst the residents. We lost the residents of more than 30 of the individual homes. But the residents fought back and managed to kill all but the strongest minority of them. \n\nThe creatures left over were incredibly dangerous and seemingly impossible to eradicate, so the residents struck a deal. A deal that they will be left unharmed and allowed to live in the building in return for the residents safety at all times, but if anyone wanders into the lift between 1.11 and 3.33am they are fair game. \n\nThis timeframe is the period the creatures are at their most frenzied and restricting them to the lift was safer for all parties. God help anyone who encounters them during those hours.\n\nThey’ve been here ever since, claimed lots of unsuspecting people avoiding the stairs, but nothing like when they first arrived. A few got put down for not holding up their end of the bargain but we haven’t had an incident outside the lift in years. Count yourself lucky you missed that crisis. \n\nEverything here’s pretty peaceful right now. I’m sorry about your boyfriend. I really have to go, I’m late for my round.” He scrawled his phone number on a bit of paper and handed it to me. “Emergencies only, I don’t like to be bothered.”\n\n“You can’t go! The note said you would help me!” I exclaimed.\n\n“And I will!” He snapped back, “when there’s something I can help with. I can’t resurrect your boyfriend and I don’t like to be late delivering the post. I will see you soon love.”\n\nI was in shock, I couldn’t believe what I was hearing, and I couldn’t believe he was leaving me after the information overload and the small ray of hope he had lit inside me and then squashed. \n\n“I’ll call the police!” I shouted, desperate to feel as if I was solving this somehow.\n\n“You can try if you want.” Ian sighed, as he opened the door to leave. “It just aggravates the creatures, and it isn’t going to bring your boy back. Mr prentice hates it when police come too, if you want to get any sleep in the next week then I’d avoid it. Wait a week, report him missing and learn to adapt to life here love, or you’ll be dead in days.”\n\nAnd with that he shut the door behind him. I opened it again, I had so much more to ask, but he was gone, no sign of him anywhere in the corridor. \n\nMaybe it was me losing my mind, I might be imagining all these things. But no matter how much I willed it the note was still there. And Jamie still wasn’t.\n\n\n\n\nGeorgia arrived not long after Ian had left. I, of course, asked if she had seen him in the corridor, to try and affirm to myself that he was real, but she hadn’t. She looked at me worried, and held me as I sobbed and told her what the postman had said about Jamie and the creatures. \n\nI wasn’t sure she believed me. Even as she read the note she looked skeptical. If she was skeptical I wouldn’t have blamed her, but she had always been supportive. She sat with me for hours while I just sobbed, heartbroken. I was so conflicted as to what do to. It felt insane that I hadn’t contacted anybody, but this note had turned out to be accurate so far and if the postman was to be trusted then I should wait. \n\nGeorgia had been my best friend for many years, she stuck up for me when I was too scared to do it for myself and had always been the brave one of the two of us. I felt safe around her, so after hours of crying and despairing at the way my life had changed in a matter of days I finally decided to take a nap. It was early evening and Georgia was watching some tv. Just there for me if I needed her.\n\nDespite the deprivation, I struggled to fall asleep, I tried to imagine Jamie’s arms around me but it became a more painful reminder that they probably never will be again. Eventually, after what felt like an eternity of staring at the damp patch on ceiling I drifted off. \n\nAbout three hours ago, I woke up, staring at the goddamn damp patch on the ceiling and could hear chatting in the living room. I jumped out of bed and walked towards it.\n\nGeorgia was on the sofa, with a middle aged looking woman, both nursing a cup of tea in the matching mugs that Jamie had got me as a move in present. My blood boiled but it wasn’t their fault, I cleared my throat to get their attention. \n\n“Oh Katie! This is Natalia, she lives upstairs. We got chatting so I made her a cup of tea. I hope you don’t mind.” I looked at the dark haired woman on the sofa, drinking tea from my cup and nodded. Georgia was a sociable idiot with no understanding of when to not be herself. I wasn’t going to lament her for it right now. It was her coping. \n\n“Of course. Hi Natalia, what flat do you live in?” I tried my very best to be polite. I would have to discuss not bringing people into my home mid tragedy with Georgia after she had left but until then I would be neighbourly.\n\n“Flat 71. It’s so nice to meet you, you have a lovely home.” Natalia responded, her lips curled at the corners into a smile that wasn’t replicated in her eyes or the rest of her facial expression. She looked at me smugly, with full knowledge that I was aware of the implications of what she had just said.\n\nThe rules...\n\nThe flat number....\n\n*every now and again someone will knock at your door claiming to live in one of these flats and ask to borrow some sugar. They will seem entirely average but you must shut and lock the door immediately. I installed two extra security bolts to avoid these fuckers. I don’t like to swear at my age but they really are fuckers.*\n\nPrue’s warning echoed in my mind and I couldn’t take my eyes off Natalia. Something really was off about her. I looked at Georgia sat on the sofa next to her and noticed her sweating. Anyone in the uk knows that it’s been a hot for few days but this was beyond just the ambient temperature. Her entire body was dripping. \n\nSuddenly, she began to pant. Natalia’s eyes were locked to mine just like the window cleaners had been. Nothing happened before with the cleaner, except this time the rule had been broken. She was already in the flat. \n\nGeorgia started to scream as her skin blistered and charred. Her hair fell from her scalp as the skin flaked and melted away from every inch of her. She was being burned alive without a flame in sight. She scratched frantically at her own melting face, digging into the exposed raw flesh. The sound a person makes when they burn alive is like no other. That will never leave me. \n\nI screamed and screamed but no one came to my door. I tried to grab my phone to call postman Ian but the wooden surface I had set it down on burned my fingers to the touch and forced me to recoil. She was going to set the whole flat alight. \n\nMy actions needed to be quicker than a phone call. \n\nI grabbed hold of the large knife I had set down on the side earlier when weaponising, the handle blistered my fingers instantly but I didn’t care, I needed to get her out now and help Georgia if I could. I ran towards the dark haired lady, sweat dripping from my brow the closer I got and plunged the knife into Natalia’s throat. She gripped it and fell to the floor. \n\nShe didn’t bleed like a normal human. Her insides were black, she was still moving, and I figured it probably wouldn’t be long before she stood right back up and tried again. So I dragged her into the hallway ready to bolt the door. \n\nAs we reached the entrance of the corridor one of the cats was waiting, hissing at her semi conscious body, I caught her eyes fixate on it as I dumped her on the floor. I grabbed the cat, pulled him inside, wincing as it’s skin caused more burns up my lower arms, shut the door and watched through the peep hole. She got up and held her hand to the wound, cauterising it and walking off towards the lift. As if she hadn’t been injured at all. \n\nI’d dropped the cat by that point but every bit of naked skin it had touched throbbed and burned for at least an hour. \n\nGeorgia hadn’t been as lucky as Natalia with injury recovery. I anonymously called an ambulance for her. I couldn’t believe it but she was still breathing. She was badly burned and her life wouldn’t be the same again but she was alive. And for that I was grateful. \n\nIt sounds awful but I left her at the park across the road from the building. With no phone or i.d. She’s my best friend and I want to be there but if I own up to involvement in injuries that bad they’ll suspect me, and I lose the already slim chance that Jamie might be saveable. It doesn’t mean I don’t care about Georgia, but she’s alive. I won’t believe Jamie isn’t until I see it. \n\nSo now I’m alone again, in the flat, conflicted about what to do. \n\nI want to leave. So badly. But this was mine and Jamie’s first home together. If he’s alive, and I can save him then I want it to be here for him to come back to... and if he’s dead, and the postman is right then I don’t know if I can leave his memory behind. \n\nThere’s only one person I think could help me right now. So tonight I’m going to do some research, hunt down an address and tomorrow morning I’m going to visit Prudence Hemmings.\n\nHow it went: https://www.reddit.com/r/nosleep/comments/cj2g4k/the_previous_tenant_of_my_new_flat_left_a/?utm_source=share&utm_medium=ios_app", "comments": [{"id": "ev7z4w4", "author": "NoSleepAutoBot", "body": "It looks like there may be more to this story. Click [here](https://www.reddit.com/message/compose/?to=UpdateMeBot&subject=Subscribe&message=SubscribeMe%21%20%2Fr%2Fnosleep%20%2Fu%2FnewtotownJAM) to get a reminder to check back later. Got issues? Click [here](https://www.reddit.com/r/nosleep/wiki/nosleepautobot). Comment replies will be ignored by me."}, {"id": "ev8eevu", "author": "karichar", "body": "Fuck the second you said Georgia let someone in my blood ran cold, at least you know what will happen if you let those neighbors in in the future"}, {"id": "ev83e5e", "author": "Kuroshitsju", "body": "I was waiting for you to give us an update! \n\nHoping Jaime is okay! Please...be safe trying to find Prudence!"}, {"id": "ev8hyae", "author": "smudge93", "body": "I had such an intense feeling of anger when I read that your friend let that woman into your flat after you showed her the rules"}, {"id": "ev8cvhx", "author": "ironbattery", "body": "You need to find out why anyone actually chooses to stay and live there. Find some neighbors to talk to (assuming you’re not the only regular person there) and find out what’s really going on. I’m afraid there might be something about this place that’s drawing people in..."}, {"id": "ev8ame5", "author": "starchild74", "body": "I hate to say Georgia got what she deserved because that seems incredibly harsh but... She saw the list, saw Jamie is missing, saw how hysterical you were, and even if she was skeptical herself, she must have been able to see you believe there's SOMETHING to all of this and she should have been more respectful. \n\nHowever, this also led me down a new avenue of thinking. The building itself must be connected to these creatures or it has the ability to influence those inside. Mrs. Hemmings witnessed her own granddaughter being ripped limb from limb and decided to remain even after that? More than a little suspicious. You also keep being told about the building's quirks and how you'll grow to love it. I would investigate the construction of the building and the history of the land OP. At least after you get in contact with Mrs. Hemmings.\n\nStay safe, good luck"}, {"id": "ev8o15e", "author": "Cobiuss", "body": "Seems to me that space/time might not work in your building. The \"rats\" either live in the ventilation system or only partially manifest in your reality at a given time. If you want to go on the offensive, as dangerous as it may be, you could buy a nice roast and fill it with poison, and chuck it in the lift shortly before feeding time. It might pick off one or two of the buggers. (I'm assuming there are less that 20)\n\nAlso, if possible, get a gun and carry it at all times."}, {"id": "ev8bfox", "author": "_Machine_Girl_", "body": "Wow no need to be so rude to the postman"}, {"id": "ev8het8", "author": "WishLab", "body": "It's you and Jamie's first home together but do you have a single good experience or memory associated with it? I don't think I could stay if I were in your position.\n\nWhy in the Hell have they not just boarded up and disabled the lift?"}, {"id": "ev8jwes", "author": "justanotherpewsfan", "body": "From what i remember, there was supposed to be a commitee group with their leader named Teri, join the group immediately and ask if they can help, They're the only people that will believe you and will help you survive"}, {"id": "ev8nrvy", "author": "bugscuz", "body": "Fuck sake Georgia, you read the fucking note"}, {"id": "ev83zi5", "author": "SShonix", "body": "Why don't you try and ask around the neighbourhood. Wasn't there like a group? Maybe they can tell you if Jamie is still alive or at the very least help you through this traumatic experience."}, {"id": "ev8a7z4", "author": "AzraDoesThings", "body": "... yeah Jamie’s probably dead lovely. I’m sorry. \n\nAlso, get the hell out of there."}, {"id": "ev8fy0s", "author": "Kana88", "body": "How can these people be more attached to their apartments than to their lives? Being willing to jeopardize their own safety and sanity to accommodate a bunch of bloodthirsty creatures just to stay in the building? And they were apparently able to negotiate with them?\n\nNah, something seems off. The creatures seem far too violent to content themselves with scraps. And we have just heard about your neighbor's quirk because he's your neighbor, but I'm betting everyone there has one."}, {"id": "ev90s7h", "author": "MooxLaMenoox", "body": "I feel like the people in the building don't age... \n\nThe postman having worked 40 years In a building but looking \"younger than expected\"\n\nBut what got me is, \nPrue told you not to babysit the commitee chairman's children, the thing is, this Is a list of things she had to have learned pretty early on in her move to give it as advice, but she moved in 35 years ago, and it sounds like the children are still babysittable, so they must have not aged.\n\nSince she's an elder, I'd be wary of her recall and her attention span, and ask pretty precise questions.\nHow did her husband die, how did she manage to kill on the super strong rat kids that murdered her granddaughter, if Jamie was hypothetically still alive, where would he be kept in the building? Since the monsters Donc stay in the lift 24/7, there must be a place where they go to the rest of the day, Jamie could be there. My guess is it's probably the unrenovated flats the flaming hot cheeto ghosts come from.\n\nI'd definitely ask her what the dangers of trying to find Jamie in those areas are what the best ways to protect you are. Good luck Kat."}, {"id": "ev8ar7x", "author": "ItsARuby", "body": "Fuck Georgia,she read the rules and still let her in. Next course of action,lure natalie into the elevator at 3 am and see if either she or the creatures die?If the creatures die off you can probably find more info on jamie and if she dies its solid payback for what she did,so it's a win-win situatiom"}, {"id": "ev8csw9", "author": "SafetyJosh4life", "body": "Do you have an app like find my iPhone? Even if they ate him his phone might still be charged enough to get a general location. Plus if they are keeping him alive you and prudence might have a better shot of getting to him faster."}, {"id": "ev85e4y", "author": "Dbz_the", "body": "Yes you updated now what you must do is lock doors for awhile and follow the rules"}, {"id": "ev8ts3q", "author": "50CaLEDGE", "body": "I know i might be wrong, but i think you have no real neighbours.The postman is a good guy, but he is a spirit too, limited to time frames you told about."}, {"id": "ev8idts", "author": "uhcanihavearefill", "body": "I wonder why the skin of the cats burn? Could they have been in the fire too?"}, {"id": "ev8gbgu", "author": "laurelannlucy", "body": "Good gracious what a day and a half you've had!\n\nYou said you just moved out of your parents' place? Any chance of going back there, at least while you sort all this out?\n\nSo careless of Ian to mention that spell that would likely get you killed. Prue will know all about it. And will talk you squarely out of it if you have any sense left at all.\n\nI feel you may find you and Prue are more alike than you ever imagined.. like looking at yourself through the sands of time...."}, {"id": "ev86awg", "author": "Rochester05", "body": "Umm, these people keep saying hoe nice your building is but I do not believe that."}, {"id": "ev8fps0", "author": "Jaermit", "body": "What about CCTV cameras? Do you think can install some in critical areas? Also, please avoid being a suspect at all costs. :("}, {"id": "ev8gdg4", "author": "olivetalife", "body": "OP I love this story so much and I NEEEEED MORE. Also, stay safe, put antibiotics on those burns and get Miss Prue!"}, {"id": "ev8h149", "author": "Anhmoii", "body": "I don't want to be harsh but i think u need to accepted that your bf was dead, move out of the building cause staying at there will only make u feel more miserable."}, {"id": "ev8hqz5", "author": "Sammm21www", "body": "Visiting prudence should have been your second thought, right after visiting the postman."}, {"id": "ev8qg3n", "author": "muffinstuffin23", "body": "If the past tenants struck an agreement with the rat creatures in the lift maybe there’s a way to reason with them? Or maybe they just see blood. Either way your mans is gone. Keep us updated! Ask Ian why you should save the cats from the upstairs neighbors!"}, {"id": "ev8cqg1", "author": "reetlongtoe", "body": "Here's hoping Jamie took the stairs and we just don't know it yet :)"}, {"id": "ev8cwry", "author": "norrain13", "body": "How terrifying, I can't imagine how scared you must be.  Keep us up to date."}, {"id": "ev8rovt", "author": "0wlSaysHoot", "body": "OP, thanks so much for the update. So sorry about Georgia, but I’m glad she’s at least alive. \nThere’s a few things I’d prioritize. \n\n1. Ask the postman what he meant by “only a few ways I’ve heard about bringing people back to life”. Seems like everything anyone says around here has something behind it. \n\n2. Try and contact Prudence as you said, but be ready to not like what she says. It’s likely you won’t get the answers you’re looking for. \n\n3. No more friends over. It’s gonna be tough enough for you to follow the rules exactly on your own, much less teach someone new and convince them you’re not crazy. \n\n4. Get something more effective than a kitchen knife. You can get 12 gauge shotguns for cheaper than you’d expect, and you should never underestimate a .45 pistol with 12 or 13 rounds. Get yourself a few different firearms for the different rooms and keep them loaded. No reason to not have them ready to use if it’s just you alone. \n\n5. I’d also ask the postman about why the creatures haven’t been eradicated completely. He mentioned some of them being killed, so why haven’t they been finished off? Seems fishy to me and worth investigating. \n\nLooking forward to the next update. \nGod Bless"}, {"id": "ev8pepv", "author": "sourorangeYT", "body": "The damp spot likely has something to do with the creatures. I’d say just burn the whole building down if you can"}, {"id": "ev946b9", "author": "Akvela", "body": "Theory:\nThe Tennant's of the flat cause things to burn without a flame, theyre stuck in their flats still either due to the complex or due to not being put to rest\n\nHairless cats were also part of the fire, hence why they're all hairless and also burn to the touch\n\nWindow Cleaner may have something to do with the fire, whether he caused it or was trapped outside on the balconies as it was ablaze\n\nI don't really have anything on the creatures yet, I'll come up with more theories as the rest of this tale is told. \n\nMay God be on your side, dear."}, {"id": "ev8nidb", "author": "DemonicSymbol", "body": "That woman is what I suspect to be a demon or a vampire . If there’s a demon, there’s a conduit that she’s using, you might want to destroy it. Ian seems to be an Errant soul that’s disguising as a mailman to help people. It was a good idea that the previous tenant told you to pick up the cat. Cats deter evil spirits from entering your home. There’s no good way to keep your home safe, all I can think off as of now is to get a priest to cleanse the, and even I doubt that’ll work. My advice to to follow all of the notes directions, don’t trust anyone, not even Ian or your friends. Try to ride it out. Oh, and bless at least one room that’s devoid of windows and mirrors. Good luck in your stay OP. May god bless you."}, {"id": "ev8vk3f", "author": "loxagos_snake", "body": "Am I the only one was imagined the events happening in Room 302 from Silent Hill?"}, {"id": "ev8y6ka", "author": "pocketrocket-0", "body": "I have a feeling that OPs gonna end up finding out he's dead and the monsters are \"good security\" no one ever gets robbed or shot or whatever and the place will \"grow on her\" she'll decide to stay because \"it's a really good place\" and it just has its \"quirks\" but in reality she can't afford anything else and she's holding on to jammies memory she'll get used to it and be basically numb to the shenanigans. She truely will start to believe it's a good place.\n\nDon't fall into that trap OP. Just freaking leave don't try to kill the monsters let the already accustomed neighbors live their peaceful lives don't anger the monsters or break the deal they have struck, just nope the hell out of there. Before it's too late."}, {"id": "ev87xbj", "author": "guardiancjv", "body": "you should call in somebody that can help with these sort of things and not just some Waco"}, {"id": "ev8sbww", "author": "ImChz", "body": "So I know the whole witches/vampires connection was made, from various users, yesterday. Something’s been bothering me since then, though. What is the landlord in this situation? What about the postman, Ian?\n\nThis whole situation gives me the creeps! Can’t wait for more updates! Good luck with Prue tomorrow, and maybe ask if she knows anything about mythical creatures!"}, {"id": "ev8yl8q", "author": "sarahwestcoast", "body": "Pru is for sure dead and gone"}, {"id": "evc70yn", "author": "Shrenegdrano", "body": "It's a well known fact. \n\nUsing the stairs is better than elevator for your health."}, {"id": "evjeo5q", "author": "hauntedone38", "body": "Wait a minute so y'all are telling me that everyone is just okay she just dropped her BEST FRIEND off and I'll park and just DIPPED OUT ??? Are you guys for real right now?! Boyfriend or not you don't do that to your friends!! And spontaneous human combustion is a real thing why would you  be suspected for that OP? I'm sorry but to me that's just heartless! And quite selfish!"}, {"id": "ev962ak", "author": "TheMaStif", "body": "OP, those rat creatures sound *incredibly* familiar!! I believe I saw a couple documentaries about 2 incidents involving creatures similarly described! One involving an incident in the town of Kingston Falls, NY, and another infestation in an office building in New York city. \n\nIf these really are the same creatures then you do need to make sure you and your neighbors are not leaving food out, especially after midnight!!\n\nAnd if they're the same creature, it is VERY IMPORTANT: **DO NOT LET THE CREATURES TOUCH WATER!!!!**\n\nTrust me, it will just make matters many times worse!"}, {"id": "ev8tlpg", "author": "lilithmunster", "body": "I hate to say it but I don’t think your out of the woods with those flat numbers now one has been let in, please be extra vigilant OP!"}, {"id": "ev8tqju", "author": "alecgood17", "body": "OP, I know you are having a tough time dealing with your loss (believe me I’m in a relationship and that would be terrible) but I think your efforts are futile. \n\nIf they really signed an agreement with those creatures, and Jaime used the lift between those designated times, then there is no way he is still alive. That’s the only time that they are allowed to do what they want to do, and so they would revel at the chance to hurt anybody that uses the lift at that time. \n\nUnless they have another motive for keeping him alive, which is highly unlikely, he is dead and you need to move on."}, {"id": "ev8uftd", "author": "SteinKrieger", "body": "Prudence must be nuts to stay so long"}, {"id": "ev8wani", "author": "peltonwheel", "body": "Viscous creatures! I am curious to know where they come from, how they got there and why they stay."}, {"id": "ev8xnfv", "author": "DeMagmaMug", "body": "If those rats could be killed in the past, They can be killed again. Enlist those who fight the supernatural, and kill them. Kill them all. \n\nNothing bullets cannot cure."}, {"id": "ev9wmch", "author": "mob19151", "body": "This is some fucking killer writing OP, I haven't been this caught up in a series since the Park Ranger stories."}, {"id": "evbmwa0", "author": "drakebalrog", "body": "I know you're in shock and everything sucks right now cause you're worried about Jamie but I think you should have impressed upon Georgia, the rules of the place. Basic don't let anyone in at all would have been nice before you crashed."}, {"id": "evdfhp1", "author": "GreatBigSteak", "body": "Hey! It’s me Samantha, from flat 68. Just stopping by to say hi! Anyways let me know if you need anything or if you have any sugar spare. See you around!"}, {"id": "evhz97u", "author": "TrundlingArmadillo", "body": "How did you manage to get her to the park without anyone noticing you carrying a burned-alive person?"}, {"id": "evixda6", "author": "ZaraBanana", "body": "your situation, makes my butt cheeks clench. please be okay!"}, {"id": "ev9cudm", "author": "angelass3", "body": "Well done!! I am very seriously looking forward to the next installment!! Look into getting published if you haven’t already!!"}, {"id": "ev9i8a6", "author": "A_Third_Past_Four", "body": "Don't get to thinking everyone who offers advice will tell you the whole truth..."}, {"id": "ev9u3ue", "author": "Sarikiller26", "body": "But Georgia read the rules"}, {"id": "eva106z", "author": "josephanthony", "body": "I would take up being a hit man.  If all you need to do is get your target into the lift at a certain time....."}, {"id": "evac2ij", "author": "AtmosSpheric", "body": "How you gonna read the note that says not to do the thing and then just do the thing"}, {"id": "evbo8ck", "author": "MolotovCockteaze", "body": "Creatures might be wererats.\nAnyway sorry about your friend."}, {"id": "evcf4mm", "author": "painterly123", "body": "Seems like anyone dying an “unnatural death” there doesn’t truly leave, and some are able to still able to interact with the present and with the living. Although that makes me wonder what happens to the spirits of those who die in the elevator, if anything... \nit’s like the spirits there are stuck and can only interact within the imprints of their own horrific ends.\n\nAlso I don’t know what I’m talking about, and it doesn’t explain everything yet, so...\n\n(removed the last bit of a comment that sounded  like a spoiler- when in actuality I haven’t the faintest idea what to think!  I’m pulling for you, OP, stay strong)"}, {"id": "evfxaod", "author": "LemonMonster21", "body": "OP. Here is how you proceed.\n1. Investigate that spell and see if another could be useful.\n2. Buy a 12 gauge shotgun from a pawn shop and some slugs. Put those rat fuckers 6 feet under.\n\nGreat Story!\nI'm hoping that the bf Is just hiding in the walls of the block, avoiding the rats but wounded."}, {"id": "evv1vti", "author": "OutsideTheServiceBox", "body": "Man... As soon as you said Georgia had let someone in I literally put my hand to my mouth and said “Oh no” out loud."}, {"id": "ew6fu6q", "author": "DeadBloxxEpic", "body": "Idk...I feel like explaining the horror killed this story."}, {"id": "ev96fqt", "author": "ShortchangeParamecia", "body": "I don't buy it.\n\nIan said himself that the creatures chomp through limbs and slobber everywhere, so am I to be lead to believe these little gremlins also deep clean the lift after a late night snack? Where's the blood and slobber? Voracious little vermin do not eat without making a mess. Or leaving a trail.\n\nI don't give a damn what Ian says, unless you see his mangled corpse or any actual sign he could be dead, you can't just give up.\n\nOP, you gotta talk to this Prentice guy. The letter said he's a good guy when not late at night, see if he's able to do anything.\n\nOtherwise quit freaking involving people you're close to."}, {"id": "ev8zy35", "author": "bbbonquishaaa", "body": "I have a feeling that everyone in that building is not normal. Like they’re all ghosts or something. I mean, disappearing into thin air, that’s just weird and you saw it twice. Also, what if the building isn’t actually there. Like, physically it is, but the residents and staff or whatever aren’t actually real but they are physical only to those who decide to fall for their tricks(except for the postman dude. He’s a good ghost man)"}, {"id": "ev9ayku", "author": "missinat", "body": "Please update us soon!"}, {"id": "ev9cc8j", "author": "spiritofdjinn", "body": "Seriously. Stop trying to save Jamie. He's gone. Get out of that place and never look back. It's your only hope."}, {"id": "ev9de8x", "author": "W2BJN", "body": "Telling ya right now... Mom and Dads basement is sounding like a good place to move back into! Youre young, youre beautiful, youre smart... Sux about Jamie but shitty things happen to good people every day. Take Ian's advice and move on (and mine to move out)"}, {"id": "ev9knnl", "author": "wetturrnips", "body": "This is so good OP!!"}, {"id": "ev9ofhi", "author": "AkosMaster", "body": "This would make a good comedy horror movie."}, {"id": "ev9on7z", "author": "The_Jerriest_Jerry", "body": "I cant get the remind me link to work, so please ignore my bookmark. :)"}, {"id": "ev9pgaq", "author": "KaiserNazrin", "body": "Can't help but imagine the postman as Constantine from CW show."}, {"id": "ev9qrs2", "author": "bobsmitten", "body": "Yo, this story is absolutely fucking awesome!!!"}, {"id": "ev9thyo", "author": "crackedtooth163", "body": "Hoooooly shit."}, {"id": "ev9vb0j", "author": "Arkhyna", "body": "A Real pleasure to read"}, {"id": "ev9ycmu", "author": "Missycobbler", "body": "I feel bad for Georgia but I think she should have took the note more seriously even tho it sounded silly and who just invites strangers into their friends home while they are asleep."}, {"id": "eva05de", "author": "quotestoliveby", "body": "Its great i love it. \nThe part where ur friend let in the women from flat 71. Breaking the rule was predictable still I liked that twist. Great writing."}, {"id": "evajqp2", "author": "killurz", "body": "Omg... thats all i can say. Gonna wait for the next update"}, {"id": "evblyw6", "author": "Chiisora", "body": "Stay strong!"}, {"id": "evc76lm", "author": "Shrenegdrano", "body": "Maybe the house is hacking your mind, convincing you that you have sound reasons to stay and to not flee. If not, why so many people chose to stay in such a nightmare to begin with?\n\nBe careful about it!"}, {"id": "evctmzc", "author": "indiware", "body": "Oh my goodness! Living there is hell... While reading there was a strange sound outside my window, I almost jumped out of my skin! Now for the third part."}, {"id": "evdo40a", "author": "jerry_of_the_day", "body": "I'm literally shaking"}, {"id": "eveyo7c", "author": "qball8600", "body": "So Critters have taken over the lift and Constantine is a post man."}, {"id": "evy2syk", "author": "ladainia4147", "body": "Yeeaahh, something tells me that if OP would find Jamie alive, I highly doubt he'd be interested in staying"}, {"id": "evyc9ib", "author": "henribarbosa23", "body": "Wow"}, {"id": "evz3xc0", "author": "Tubbie0204", "body": "Does anybody else get a John Constantine vibe from Ian"}, {"id": "exs1ny1", "author": "BrandonAT", "body": "I thought this was a kidnapping story (taking girl to apartment, giving ghost stories and then kidnapping the boyfriend to isolate her until we hear about Georgia and the lady"}, {"id": "f7c5hkq", "author": "Anxious_Tomato13", "body": "Sorry not to be rude when you are going through so much, but Georgia read the rules right? So is she just stupid or is there something else going on?"}, {"id": "fb7d4hq", "author": "min-chocolat", "body": "What if when the things kill you in the lift, you become one? What if Jamie and the little girl are one of the monsters? What if the monsters ars like rapid dogs but calm down once you befriend them. I would go into the lift everyday other than the times and would talk to them, even if I was sure they couldn't hear me. Give them compliments, tell them about my day, just like talking to a friend. Maybe you would get on their good side?"}, {"id": "fcwz609", "author": "ani_and_reddit", "body": "You should go back to your parents, shit ain't safe."}, {"id": "ev94gpd", "author": "MummaGoose", "body": "Who the F is Mr Prentice and why does he care when the police get called! Huh!? \nCheck if he lives ABOVE YOUR BEDROOM!"}, {"id": "ev96rmq", "author": "GreenLedbetter", "body": "You’re a sociopath"}, {"id": "evijtoj", "author": "olympianfap", "body": "Spread brickdust at the threshold of every entrance to the house"}, {"id": "f47ybug", "author": "BigWeenie45", "body": "The inquisition believes you have a skaven infestation."}, {"id": "f4hmbuz", "author": "GatitosBonitos", "body": "Worst friend ever."}, {"id": "f4phmu4", "author": "caffeineleen", "body": "Seems like the building has a gremlin problem..."}, {"id": "f60off2", "author": "G0HomeImDrunk", "body": "I can't be the only one wondering why people still live here and they didn't just burn the whole place to the ground, right?"}, {"id": "fadlwm5", "author": "myblueheavenx", "body": "Me loll\nP"}, {"id": "fah7cqc", "author": "AlitaBattlePringleTM", "body": "The lady from flat 71 seems to be manifesting the events of her own demise.  The letter said that the flat was burnt up in a fire, likely during the war with the creatures.  I'm still on the fence about it, but it seems that the resident is cursed...There was a deal made with these rodent creatures, and it is possible that the residents of the burnt flats were a sacrifice.  The lady has mass, so she's no ghost..."}, {"id": "ev93gb4", "author": "here_2_downvote_u", "body": "haha they are all deaf"}, {"id": "evbyek9", "author": "Babbjerry651", "body": "It's called a flashlight. It works differently from a torch.\n\nFucking British"}, {"id": "evg3ayf", "author": "stjees5223", "body": "So, so far I'm confused on 2 things.\n\n#1- The note specified 1:11 and 3:33 AM, not PM. Jamie started work at 4 PM so therefore he should have been safe....\nAnd #2- You said you showed Georgia the note. Soooo, why, after reading that and even if she was skeptical, would she let someone into the apartment? \n\nJust doesn't make sense to me....onto Part 3, I guess."}]}