{"id": "cj2g4k", "title": "The previous tenant of my new flat left a survival guide. Today I finally met her.", "url": "https://www.reddit.com/r/nosleep/comments/cj2g4k/the_previous_tenant_of_my_new_flat_left_a/", "subreddit": "nosleep", "author": "newtotownJAM", "text": "How it began \nhttps://www.reddit.com/r/nosleep/comments/ci94do/the_previous_tenant_of_my_new_flat_left_a/?utm_source=share&utm_medium=ios_app\n\nAnd what happened next\nhttps://www.reddit.com/r/nosleep/comments/cinu8u/the_previous_tenant_of_my_new_flat_left_a/?utm_source=share&utm_medium=ios_app\n\n\nI didn’t get much sleep last night either. The lack of sleep is making me wonder whether all these things happening are in my mind or not. But I’m reminded every time I see that damn note that it’s all real. \n\nI spent hours last night searching for anything I could about Prudence Hemmings. If she had lived in a big creepy mansion I imagine she would have been easy to find. But us folk who live in tower blocks aren’t so well documented. No one cares about our lives, no matter how extraordinary.\n\nI found an article about missing person Lyla Hemmings. It suggested that she went missing under the care of her grandmother while playing in the park opposite the flats early in the morning. Interviews with her parents stated that they had both disowned Prudence. \n\nDespite the many years that had passed since Lyla’s death/disappearance her parents appeared to have remained unforgiving of Prue. There was no mention of her on either of their social media accounts and she appeared to have no involvement with the children they had acquired since. \n\nSearches for the Hemmings family in the local area were equally dead ends, I looked at link after link, desperate to find something but they all started to blur into one. Until finally I saw something. \n\nAn obituary for Bernard “Bernie” Hemmings, who had fallen from the tower block in unexplained circumstances after being diagnosed with dementia months before his death. I was surprised it hadn’t made bigger news. It had only been about a year. There were no details of where to find them, but his wife Prudence and her sister Bridget were listed as contacts to get find out details of the funeral. \n\nIt’s scary what you can do with the internet these days, but just with those phone numbers I was able to put them into a reverse directory and find an address for Bridget and Tony Bishop, the sister and brother in law that Prudence was supposedly living with.\n\nAbout 4am I managed to get some sleep, not much though, I was back up and wide awake at around 7am, planning my route and working out my day. I saw a post on social media from one of her relatives that Georgia was identified and is stable. This loosened the knot in my stomach that has been present since I found the note somewhat. \n\nAt 8.50, I opened the door to my flat hoping to see postman Ian. 4 minutes passed and instead of the postman an elderly gentleman made his way down the corridor. He had a walking stick and kind eyes. In his free arm he carried a small plastic bag containing a newspaper and milk, he smiled and said “good morning” as he passed.\n\nI smiled back. He reminded me of my grandad. I imagined him pulling cola cubes from his pocket for his grandkids and shushing them when their parents weren’t looking. A little further down the corridor the old man stopped and turned. He looked me dead in the eyes with a sympathetic expression and spoke.\n\n“No post on a Sunday, if that’s what you were waiting for.” He smiled knowingly and turned to unlock a front door that until shut I couldn’t see the number of. When I saw the door close and the number 48 boldly displayed above the peephole I understood what Prudence had meant. Mr Prentice did seem to be a lovely chap. \n\nI sat back in my flat and sighed, staring at the various tabs open on my laptop. At about 9.15 the knocking on the balcony door started.\n\nThe window cleaner was back.\n\nI didn’t feel half as terrified as I had the first time, if anything, I was just angry. It took every ounce of restraint I had in my tired body not to engage with him, if only to tell him to fuck off. His genuine seeming requests just irritated me. After about 20 minutes of being watched the knocking started to give me a headache, so I grabbed a bag and left the flat.\n\nI decided there was no time like the present. If I was going to turn up on the Bishops’ doorstep looking for her sister because of the freaky flat she’s left behind then I had to get it over with. If the address was old, or the bishops weren’t the people I was looking for then I was going to look stupid whatever time of day I went.\n\nAnd I couldn’t take the window cleaners eyes anymore. There was something about them, they really do make you want to open that door. \n\nI looked at the lift as I entered the communal hallway and decided today I would take the stairs. I couldn’t stand to be in a small box that my partner probably died very painfully in. My heart dropped into my stomach just at the sight of it.\n\nThe stairs were as grotty as the lift. We’d taken them multiple times on move in day but I hadn’t really taken it in the same way I could now. I thought about the rules and all the strange things happening in this building. I looked at the badly painted numbers on the walls as I reached each landing.\n\nNothing in this building is simple.\n\nI looked at the numbers. 7, 6, 5 ... 5, 4, 3, 4, 2, G. Maybe it was the sleep deprivation but my legs were in agreement with my mind that I had definitely just descended more than 6 flights of stairs. They’d glitched. \n\nI looked at the dusty and poorly lit stairwell from the bottom. It seemed dark despite the sun pouring in from the glass panel in the main building doors. The note never mentioned glitchy stairs, maybe I really was losing my mind. \n\nAs I turned to exit the building a woman walked in. She was in her late thirties to early forties and had 2 small children in tow. One boy and one girl. I guessed that they were twins, they were both incredibly blonde, with deep brown puppy dog looking eyes and couldn’t have been any older than 6-7. They were as close to identical as it gets in twins of different genders. I’m not a fan of kids, but they were super cute. \n\nThe lady had a short bob haircut that got longer at the front, it was uniform and dyed a perfectly even auburn colour. I knew it was dyed because her roots were blonde like her kids. She looked as tired as I felt, but she pulled herself together when she saw me, running fingers through s part of her hair that she must have missed how ever early she left this morning. \n\n“Hi, are you here visiting?” Who opened with, trying to make small talk. \n\n“No, I just moved in to flat 42, on the 7th floor, I was just leaving actually. Whereabouts are you?” I was desperate to go, I had feared myself up to see Prue but I didn’t want to be rude.\n\n“I’m flat 26, my name’s Terri. This is Eddie and Ellie.” She gestured to the two small children hiding shyly behind her skirt. “Welcome to the block. If you ever need anything please feel free to give me a shout.”\n\n“My name is Katie but people call me Kat too. That’s really kind of you, thank you. I will.... hey, is there something wrong with the stairs?” I stopped myself before going into detail.\n\n“Nothing wrong, they just skip sometimes.” She answered, shrugging. \n\n“Well I’d love to stop and chat but I actually really need to get going. It was nice to meet you Terri.” I tried to work out what was wrong with the children as I stepped forward to walk away. Still baffled by the stairs.\n\n“By the way, we have a residents committee, you should come to one of our meetings, they’re every Tuesday in alternating flats. This Tuesday is at Molly Jefferson’s place in flat 31, come along. We’d love to have you!” Terri suggested, waving me off. \n\nI walked out the doors after my encounter with Terri feeling sick. Every minute in this place made the note more real. Every word jumped off the page and into my life. Made it more likely that Jamie was really gone. \n\nI rode the bus from a stop not far from the flats. It felt like it took and eternity to reach the little suburban area I was looking for. A five minute walk away from the bus stop I got off at and I was staring at a quaint little bungalow, belonging to Bridget and Tony Bishop. \n\nI knocked on the door. The lady who opened it was unsteady on her feet, she was probably in her 70s, with wispy white hair neatly scraped back into a bun, two strands left hanging that just softened her wrinkled face. She wore a dusty rose coloured dress that hung just below her knees and smelled of stale cigarette smoke. \n\n“Can I help you?” She asked bluntly.\n\n“My name is Kat. I’m looking for Prudence Hemmings.” I answered, stuttering slightly. \n\nHer eyes widened slightly.\n\n“Why?” She asked, bizarrely. \n\n“Is she here? It’s private.” \n\nThe lady ushered me into the house, and sat me down on a sofa, within minutes there was a cup of tea in front of me. She didn’t say anything to me for a while, we just looked at each other. Then she finally broke the silence. \n\n“I wondered if you’d try and find me. It took me a long time to decide whether to leave that note or not but I decided that you deserved a head start. That’s more than I ever got.”\n\nThe woman was Prudence, she was nothing like I had imagined. She seemed tough and hardened and spoke with a mostly blunt tone, she contributed before I could answer.\n\n“Terri called me not long ago. Told me that she had met the new tenant. She said you looked shaken up, and said that my note may not have been enough. I did say I couldn’t fit everything on there. And the stairs didn’t seem too important. The committee wanted to organise a meeting with you on your moving in day but I told them that was intrusive. The whole committee thing always seemed a bit excessive to me anyway.” She spoke flippantly, like it was nothing. \n\n“It may have been intrusive, but we needed a warning, we spent a night in the place before I found your note! My boyfriend had already left for work at 3.15 and taken the lift.... he didn’t know.” I broke as I told her what had happened. Her face dropped. And so did my hope for Jamie. \n\n“I’m so sorry... I really don’t know what to say. I thought my note would reach you in time.” She mumbled, her face to the floor, refusing to look at me as tears streamed down my face.\n\n“He’s gone isn’t he. I didn’t want to accept it but I spoke to the postman and your face says all it needs to. The postman said there might be a way I can have him back.” I bit at her, devastated and angry.\n\n“He’s gone. You can’t have him back. What Ian is referring to isn’t what you think. There’s a way to get people back from the lift. But not as themselves. Trust me, I learned the hard way. Once they’re back you can’t reverse it. I’m sorry about your man. But he’s gone forever. Don’t dig into the other way, to be gone forever is luckier than that alternative.” She still wouldn’t look up from the floor.\n\n“What do you mean...”\n\n“I don’t want to talk about it. I said in the note that there are things I’d rather not discuss and I need you to respect that or I won’t be speaking to you at all. Now move on and ask what you need to ask.” Prudence cut me off, I decided not to push the topic further, and moved on to some other things I needed to know.\n\n“What’s the deal with Terri’s kids? They seem sweet and normal.”\n\n“Those little demon creatures are anything but normal.” She answered, wincing slightly at the though of them. “When she went into labour Terri never made it to a hospital. They were the first children ever to be born inside the building and with everything that goes on it’s like something’s rubbed off on them. They’re average children in the daytime, but they never sleep, ever. Poor Terri hasn’t had a days rest since they were born. They also really love to steal birds and rats they find the cats playing with and torment them. Really annoys the cats.” \n\nAs she finished speaking a small hairless cat strutted out from behind an armchair across the room, meowing softly. It brushed its head up against Prue’s exposed legs, leaving scorch marks where it touched. She didn’t react, she reached down and stroked the top of its head, smiling as it purred. \n\n“And those?” I asked, eyes stuck to her now badly burned legs. \n\nShe chuckled, pulled out a box and lit a cigarette, tapping the top layer of ash into a small silver dish in front of her. She offered me one and I took it gladly. \n\n“They’ve always been my good friends. I couldn’t leave the building without bringing a part of home with me. This little guy is Damon. He’s seen some things.” She gushed, not taking her eyes off the cat. \n\n“But where did they come from, why are they everywhere?” I asked, watching in disbelief as her burns subsided. It seemed impossible, but I looked at my arms where I had picked up the cat the night before and there was no evidence it had ever happened. They didn’t even appear sunburnt. \n\n“No one really knows. They started to appear after the fire, a few years after I’d moved in. It was rumoured that they were the pets of the residents that burned, and that was why they had no fur. But I don’t think that’s true.”\n\nI interrupted.\n\n“I met one of those neighbours last night. She said her name was Natalia. She almost killed my best friend. You’re crazy if you think your note was enough of a warning!” I ranted emotionally.\n\n“Look, girl. If I had made a song and dance about warning you, then you’d have thought me crazy and challenged the rules. You’d have been dead already. Be grateful you got anything. I didn’t. I had to work it all out. Your generation are so spoiled.” She tutted in frustration at me. I was angry, but she was probably right. An elderly lady telling me rat like creatures would kill my boyfriend in a lift would probably have got some laughs from me a few days ago. I stayed quiet and waited for her to calm down, after a while she sighed and started again.\n\n“I think the cats are the neighbours that burned. They’ve never meant any harm and they hiss and run from the imposters that roam the building. Besides, there’s no way there were that many cats living on one floor. \n\nThe imposter people don’t even match up with the residents that died in the fire, none of them look like, or claim to have the same name as the dead. They just claim to live in their flats. I’ve met Natalia before, she left a bad scar on Bernie’s leg from an incident we had, nasty girl. \n\nBefore the fire there was cctv and there was a recording saved of about 15 people marching into the flats and up to that floor about half an hour before the fire started. It was the only evidence found. CCTV wasn’t great in the eighties so they were never identified. And the flames melted the relevant cameras so nothing ever came of it. \n\nI think the people that entered that night are the ones that ask for sugar. I don’t know any more than that but if you avoid them like I said you don’t need to know more. They hate the cats. I hope your friend survives, but I’ve seen what those people can do so maybe she was better off dead.” Prue carried on stroking Damon. I watched the skin of her fingers melt and twist as they made contact with him.\n\n“What happened to your husband?” \n\nI asked the question so fast I didn’t have time to consider that this was a topic she had explicitly said she didn’t want to discuss in the note. But I had to know. \n\nShe scowled at me. “I said I didn’t want to talk about that.” She hissed.\n\n“I just lost the love of my life. I need some answers.” I begged.\n\n“What happened to Bernie won’t help you. I know you’d think any deaths in that building would be down to the quirks but this wasn’t. For the most part anyway.\n\nDon’t forget that we had lived there for 35 years, Bernie knew the rules, we knew how to take care of ourselves and have a happy life there. It was our home.”\n\n“I don’t doubt that’s Mrs Hemmings, I’m sorry” I interjected.\n\n“Bernie had dementia. It started about 6 months before he died and he deteriorated very rapidly. Towards the end he started wandering, the doctors said it was common, but in our position it was incredibly dangerous. More times than I can count I pulled him away from the lift just in time.\n\nAlong with wandering he was forgetting the rules. He let that smug awful window cleaner in 3 times, thank lord for the big metal pipe I kept by the balcony door, chased him out a treat. Not that anything stops him from coming back. I’m sure you’re already acquainted. \n\nAfter all the dangerous situations Bernie was in, by the end he made the smallest and most fatal of errors. \n\nHe left a bowl of food out for Damon at 10am. I was out shopping with Terri and a few of the girls from the committee and when I came back I found one of those awful creatures...” \n\nPrudence started to cry. I put my hand on her shoulder in an attempt to comfort her, after all, I truly knew how she felt. \n\n“It was eating him.” She sniffed and steadied herself to continue, moving my hand. “I chased the creature away with the same metal pipe I had the window cleaner and pushed Bernie off the balcony. He was heavy but I didn’t want anyone to know what really killed him. It’s teeth..” she shivered “...they made such an awful noise. It reminded me of -“\n\n“Lyla.” I finished her sentence. I hadn’t meant to. I was so invested in her story I couldn’t help it. \n\n“I gather you spoke with Ian then.” She said sounding resigned. “I never meant to hurt that little girl. I loved her so much.” Tears rolled down her wrinkled cheeks. Damon, who was now sat next to her on the sofa, shuffled closer as if to cuddle her. \n\n“Haven’t you ever been curious about getting her back?” I asked, my mind turning back to the methods hinted at by both Prue and the postman. “I miss Jamie so much. I’d do anything to get him back.”\n\nHer face filled with a look of horror and shame. “Of course I have.” She answered, “which is exactly why I’m telling you not to.” \n\nBut I couldn’t let it go. \n\n“Surely anything must be better than gone forever?” I pestered. I wish I hadn’t.\n\nPrudence, frustrated, stood up and gestured for me to follow, she lead me outside to the back garden of the bungalow. At the back was a large shed, the kind people used for a man cave or a summer house. It was pretty, the sun shone down on it lighting up the few cobwebs in the corners and making them twinkle. \n\nMrs Hemmings was careful to look into both neighbouring gardens to ensure there was no one around before she unlocked the door to the shed. We stepped inside and the first thing to hit me was the smell, it was putrid, like rotting meat. I looked at the floor and covered my nose with my hands, staring back at me was a pool of blood.\n\nI followed the blood with my eyes as Prudence locked us in the shed. Then after I made it past the animal bones I finally saw it.\n\nJust like postman Ian had described.\n\nOne of the creatures was watching me, from a heavy duty metal dog cage in the corner of the shed. It looked reinforced but still the metal had chew marks. Their jaws had to be strong to cause that.\n\nThat didn’t surprise me looking at it, it’s rodent like nose and beady, yet somehow human like  eyes were nothing compared to the two very visible rows of jagged sharp teeth that lined each gum. Despite its small stature, it was terrifying. \n\nPrudence opened a drawer in a dusty cupboard across the room and pulled out a can of dog food, she poured the contents into the bowl  and passed the bowl through the feeding hatch. The cage had a safety feature meaning the animal couldn’t access the food until the hatch was locked from the outside. I was grateful for this.\n\nPrue turned to me and spoke. She brushed one of the two strands of hair framing her face behind her ear. Gesturing to the hideous creature she said;\n\n“Kat, I would like to introduce you to my granddaughter, Lyla.”\n\nHow the conversation went on : https://www.reddit.com/r/nosleep/comments/cjintp/the_previous_tenant_of_my_new_flat_left_a/?utm_source=share&utm_medium=ios_app", "comments": [{"id": "evaomru", "author": "NoSleepAutoBot", "body": "It looks like there may be more to this story. Click [here](https://www.reddit.com/message/compose/?to=UpdateMeBot&subject=Subscribe&message=SubscribeMe%21%20%2Fr%2Fnosleep%20%2Fu%2FnewtotownJAM) to get a reminder to check back later. Got issues? Click [here](https://www.reddit.com/r/nosleep/wiki/nosleepautobot). Comment replies will be ignored by me."}, {"id": "evari61", "author": "sillysimmuz", "body": "OP I know you miss Jamie but it really doesn't sound worth it to have him back like that... What is interesting is the stair loop. Time travel. Might be nice to look into that to get Jamie back"}, {"id": "evas4et", "author": "PhantomsBabe", "body": "It hurts my heart that Prudence didnt mean for all that to happen to lyla, but the son and wife still disowned her. If prudence lived there as long as she said she did, that must have meant that her son grew up there too. Then again, even if he knew the real fate of Lyla, i guess he can blame Prudence all the same for not watching her enough..."}, {"id": "evaueyg", "author": "DeathToIslamGamer", "body": "Lyla proves two things though.\n\n- They can be caught and condemned.\n- They probably need to eat.\n\nWhat if you catch all of them and leave them in a confined space together?\n\nLike, in a freshly built concrete cellar, encased with several inches thick steel. After some time you'd have to check on them though. So probably you'd want to install some kind of door/hatch.\n\nIf that doesn't work, invite one of the burner neighbors into your new \"tea room\". Open the hatch, push her in and see what happens."}, {"id": "evav8ts", "author": "starchild74", "body": "OP listen to Mrs. Hemmings. Sometimes dead is better.\n\nHowever I don't think you're willing or able to just leave this alone. Continue your research but for the love of God LISTEN to Ian and Mrs. Hemmings.\n\nEdit: Terri's children seem to confirm my theory that it's the building itself that causes the quirks. When you see Ian tomorrow, please ask about anything and everything he knows about the building/land. Investigating the fire victims and the fire in general may also prove useful. \n\nPoor Mrs. Hemmings, she's probably caring for that demon as a way to repent. I hope she can find peace."}, {"id": "evayrx7", "author": "Tristanbaker", "body": "Maybe I'm CRAZY. But I think you should talk to the little demon rats. It was mentioned that they agreed to certain rules like staying in the lift for certain times. So they must be able to communicate with people somehow. Ask them what happened. Straight to the source."}, {"id": "evazdiu", "author": "Ravenwight", "body": "I kinda want to capture one of those toasty upstairs neighbours and turn them over to the government for experimentation, \nIf they can give off that much heat indefinitely, they might just be the solution to the energy crisis."}, {"id": "evaqrof", "author": "iheartatari", "body": "Wouldn't the police or medics have seen the bite marks on Bernie when they found him? Do you think the police are involved with what goes on in the building?"}, {"id": "evapt9k", "author": "Dbz_the", "body": "I think you should listen and join the community to get more help maybye there's another way"}, {"id": "evat8sr", "author": "DemonDarlin", "body": "Loving the story OP, but so sorry for your loss. Have to agree with others, you should join the community. I also think Prudence is right and Jamie is better off gone than being one of those thing."}, {"id": "evar47e", "author": "CasaDeStark", "body": "Omg! Poor Lyla. She really was better off dead."}, {"id": "evasqos", "author": "xfxtas", "body": "I kind of figured whatever came back would likely be one of those things. Sad that Prue brought back Lyla just to have to take care of a demon."}, {"id": "evb0o70", "author": "Huperman1", "body": "Bro have you seen pet sematary? If someone is dead = they dead."}, {"id": "evarl7p", "author": "nddragoon", "body": ">I had to work it all out. Your generation are so spoiled\n\nOk she's an ultra boomer, got it"}, {"id": "evavi0n", "author": "iwillhauntuwhenidie", "body": "I am so invested in this."}, {"id": "evaxq6t", "author": "sourlizard86", "body": "There must be more history to that building. Something else is happening to attract all of this insanity. Perhaps there are other unexplored alternatives to get your SO back. The cats are suspected to be dead tenants after all.."}, {"id": "evaukkg", "author": "I_am_number_7", "body": "\n\"The committee wanted to organise a meeting with you on your moving in day but I told them that was intrusive. The whole committee thing always seemed a bit excessive to me anyway.” She spoke flippantly, like it was nothing.\"\n\nWaa? Having your boyfriend murdered and best friend in the hospital is rather intrusive too! I don't think I like Mrs. Hemmings much."}, {"id": "evaqgol", "author": "dlsandwich", "body": "I heard something move and now im shitting myself"}, {"id": "evatg2r", "author": "cbusta167", "body": "Do not bring him back."}, {"id": "evaufb1", "author": "lisasimpsonfan", "body": "Poor Lyla.  \n\nI understand is very cheap to stay there but all these horrible things running around would push me out of that apartment building.\n\nI can't wait to find out if OP tries to bring back her BF."}, {"id": "evb2fvq", "author": "SaltyWitch1393", "body": "How hasn’t she thought about the fact that she can’t afford this place on her own & will have to move out soon (I’m assuming.)"}, {"id": "evaq9qp", "author": "name_which_is_unique", "body": "That took a turn!\n\nCan't wait for the next part!"}, {"id": "evav6gb", "author": "Biki911911", "body": "I'm on the edge of my seat OP. This is crazy! I can't wait to find out more at the meeting!"}, {"id": "evbd91w", "author": "0wlSaysHoot", "body": "Ok ok, I’ll continue my string of advice from last post:\n\n1. Ask Prudence about the stair skipping. It could be nothing, but if that is a skip in time you could try to exploit it to get Jamie back. It’s a long shot but maybe worth it. \n\n2. You really really need to get some firearms ASAP. Preferably in the next day or so. Again, a 12 gauge is ideal for anything 1-30 yards with buckshot shells. Also, don’t underestimate a .45 pistol. Cover a doorway (hopefully still locked) from a safe spot. \n\n3. Make sure you don’t try to explore and stretch the rules too much. You’re still new and you will definitely miss a rule and make a possibly deadly error. Prudence managed to live for over three decades, practice makes perfect. \n\n4. Allow yourself to mourn Jamie. That simple. Let yourself accept it, as horrible and tragic as it is. I feel for you immensely, that’s why I want to see the best for you. \n\nStay as safe as possible!\nGod bless"}, {"id": "evb4hqg", "author": "OhCai", "body": "No post on Sunday!"}, {"id": "evaxtcp", "author": "Ravenwight", "body": "Honestly, this place still sounds better than some of the places I’ve rented."}, {"id": "evb1935", "author": "crlcan81", "body": "Holy fuck, those creatures are actually...?!?! They never just invaded the building, they are better off dead...."}, {"id": "evb1sjk", "author": "katevade", "body": "PLEASE keep updating us. I’m SO intrigued by the mystery of the tower and Lyla. Prudence’s hypothesis on the cats is terrifying, but makes total sense."}, {"id": "evbtkcc", "author": "Ladyjinxalot", "body": "I think the cats are a protection. Look up Bastet. \n\nFrom Wiki with my thoughts in brackets:\n\nBastet was originally a fierce lioness warrior goddess of the sun (hence the heat maybe?) worshiped throughout most of ancient Egyptian history, but later she was changed into the cat goddess that is familiar today, \n\nAs protector of Lower Egypt, she was seen as defender of the king, and consequently of the sun god, Ra. Along with other deities such as Hathor, Sekhmet, and Isis, Bastet was associated with the Eye of Ra.\n\nBastet was also a goddess of pregnancy and childbirth (The twins like to play with the cats “offerings”)\n\nImages of Bastet were often created from alabaster (pale, hairless?) \n\nBastet was also depicted as the goddess of protection against contagious diseases and evil spirits (hence why the appeared after the “residents” of the burned flats arrived?)\n\nWhy an ancient Egyptian goddess would show up in London however....? \n\nAlthough.... the things that ate Lyla, that she had now become... they do sound like Jackals, which in Egyptian mythology were do with Anubis, the god of Death... which in turn leads to his daughter, the serpent goddess Kebechet... who is the enemy of Ra and Bastet... \n\nWow, bit of a stream of consciousness there!"}, {"id": "evb4540", "author": "eduty", "body": "Wow. Urban housing must be a true crisis if living in the haunted death flat is worth the low rent."}, {"id": "evbk4sn", "author": "ParanoidCrow", "body": "Ah, so the boyfriend is also one of those things now, roaming the building?"}, {"id": "evaxnfm", "author": "Lily_Lackadaisy", "body": "I may be absurdly optimistic, but Jamie is a smart guy. If Prudence got away from the creatures, Jamie could have gotten away from them, too. You should ask her where they lurk outside of their elevator-time. Maybe the basement?"}, {"id": "evbjg7g", "author": "uhcanihavearefill", "body": "I think OP will try to bring her partner back even after seeing Layla thinking she can make it work."}, {"id": "evbm6h1", "author": "Kiicin", "body": "Hi all,\n\nI'm new to the sub, speak English as a first and I'm on my phone; so, not sure what that'll do to the formatting 🙂\n\nThe rat/goblin creatures remind me of the critters from the movie \"Gremlins\". Wasn't there a rule in the movie about not feeding them, ever, otherwise they turned into these terrible creatures? (correct me if I'm wrong please 🙂)\n\nI'd be curious if Op could actually talk to one of them when they're not feeding, of course. The residents were able to negotiate a stalemate with them; so, they must also posess a certain degree of intelligence. How did they get there? Who is the boss/leader? Is there a way that they'd release Jamie, unharmed, as a show of good faith to the new tenants?(I know that's a reach 🙂)\n\nI believe Natalia is a demon. Prue said that the CCTV footage had shown 15 people approaching the floor that went up in flames. In life, the residents of the floor were evil. In death, because of the, as of yet, unknown power of the building, they became the supernatural equivalent of what they had been in life.\n\nThe \"skip\" with the stairs: Possibly where the creatures reside when they aren't feeding. \nBut, it seems like there should be some place that might be considered a central focal point/ a power point, as it were. It could be located in what seems to be \"dead space\" between floors.\n\nOh and when did the window cleaner get killed? Was he one of the fire floor residents?\n\nWhy is Ian stuck in the same apparent time warp?\n\nI hope Op decides to take up residence elsewhere. \n\nKii\n\nEdit: typo"}, {"id": "evbn9kd", "author": "jonnyocean", "body": "This is absolutely riveting stuff. It's 2am and I want more. Can't wait for the next chapter, like a tasty snack that leaves you craving more"}, {"id": "evbnbl3", "author": "creepypgirl79", "body": "Fuck. You cant try to get Jamie back especially after hearing this. No way. Good luck Kat, and stick to the rules"}, {"id": "evdbg7x", "author": "A13xCoding", "body": "Favourite series tbh. Keep us updated! And please, OP, don't bring back your husband."}, {"id": "evb0rvo", "author": "SnowiiYT", "body": "Poor Lyla. \nI agree with prudence, dead is better than taking care of a demon rat. I honestly want to hear more about how she takes care of Lyla the demon now. Sounds so interesting."}, {"id": "evb6krc", "author": "heart_of_lyon", "body": "OP should go to the committee meeting if she wants to get more answers. Also, based off what Prudence said OP should invest in a metal pipe."}, {"id": "evb7rz8", "author": "Shadow_Road", "body": "This series reminds me of 14 by Peter Clines. I've been craving something similiar to that story and this is doing it quite nicely. Keep up the good work!"}, {"id": "evbdws3", "author": "ZeroSaurusRex95", "body": "The more I read this the more these creatures sound like the ones from the movie \"Don't Be Afraid of the Dark.\"\n\nThey even reproduce by turning their victims into one of them..."}, {"id": "evbki9u", "author": "Sammysamsterofthesam", "body": "THIS IS WILD OP. You’re messing with my head, I don’t like it! \n\nBut seriously, great series!"}, {"id": "evbmtqq", "author": "Chiisora", "body": "Curiosity killed the cat."}, {"id": "evbqq93", "author": "Zmanwarrior", "body": "If I am to be perfectly blunt it sounds like you need to buy yourself a shotgun and put Jamie out of his misery."}, {"id": "evcwgbw", "author": "indiware", "body": "It would be so fantastic if you could rescue Jamie anyway. \\*sigh\\*\n\nBut now I have the ending of \"Shaun of the dead\" in my head. Ed chained up and playing video games. \\*g\\*"}, {"id": "evddt1q", "author": "Hard_AI", "body": "Man Georgia knew it was hot and didnt even  think about moving. And how did you throw the fire heat lady out without melting yourself?"}, {"id": "evaytbd", "author": "Watermel0wned", "body": "Was waiting impatiently for another part and I have to tell you it was definitely worth it. Especially liked the part with the stairs and the other tenants phlegmatic reaction to it. \n\nI really hope you continue your story."}, {"id": "evaxwa1", "author": "DemonsNMySleep", "body": "I don't even want to know what's needed to bring someone back as one of those things.."}, {"id": "evba7x2", "author": "ddta99", "body": "Wonder if an exorcism would help Lyla?"}, {"id": "evc955s", "author": "mokaloka", "body": ">\tmeetings, they’re every Tuesday in alternating flats. This Tuesday is at Molly Jefferson’s place in flat 31, come along. We’d love to have you!” Terri suggested"}, {"id": "evdgu2x", "author": "The_Jerriest_Jerry", "body": "Where are you?!\n\nI'm starving for more of that phonetic food!\n\nI need those vitamins of verse!"}, {"id": "evv74r9", "author": "mattroom", "body": "The conversation between the two is terribly unnatural and unpersonalized."}, {"id": "fbcl0zx", "author": "paige2296", "body": "I think what makes Jamie’s disappearance/death so hard for Kat to grasp is the absolute and total lack of closure. He was there one minute and gone the next. She didn’t get to see a dead body in his place. I wouldn’t be able to accept it like that either."}, {"id": "evbsmon", "author": "Redeemer206", "body": "Wow what a twist, OP!\n\nGiven what's happened to Lyla, I'd say this is a real \"Monkey's Paw\" situation. Don't bring Jamie back. He'll just be an abomination.\n\nAlso I would be suspicious of Prudence... You're right to feel weird that she didn't come across how she did in the letter. The two completely different tones sounded like two very different people.\n\nEither Prudence is lying, or she was enthralled by the building or the demons that inhabit it,and they used her to help convince new tenants to stay. It would make sense then that the further away she got from the building, the more her normal self returned. But either possibility mentioned above is legitimate. Other than the Lyla reveal, I wouldn't trust her with much else. Didn't she also say not to join the committee or do specific things for members?\n\nBe careful, OP"}, {"id": "evcgcpg", "author": "youjustcanthackett", "body": "OP, have you ever considered that Jamie might not be dead? He could have taken the stairs and got caught in some kind of loop? Or journeyed into another flat and is being held captive? I don’t want to give false hope, but just maybe?"}, {"id": "evb4n4t", "author": "undertheblunt", "body": "I know its hard OP but you need to bring jamie back so you can kill him. If you love him he deserves peace in death not trapped as one of those awful creatures waiting to harm someone else."}, {"id": "evb2g9v", "author": "aminastar", "body": "Out of all the places there are to live in...."}, {"id": "evbcfj3", "author": "SteinKrieger", "body": "Good stuff"}, {"id": "evbisms", "author": "BarusVarg", "body": "So, I suppose these creatures are something like were-beavers?\n\nI hope everything turns out to be good in the end and you get Jamie back"}, {"id": "evbrsy3", "author": "Kana88", "body": "I knew what was coming, but I wish it didn't come. Poor Lyla. I'm really curious about how Prue managed to get her back as a creature, though. Did she take the lift and go wherever it is those creatures go to? Because if that's the case, then maybe there might be a way to kill them in their nest; though it definitely sound very dangerous to try alone."}, {"id": "evbww6n", "author": "jmsk_", "body": "IMO OP should get the HELL out of there!!! Probably write an exsposé and earn couple of bucks from a newspaper. Relocate to a different country or continent. Live in a library."}, {"id": "evc09fm", "author": "Tandjame", "body": "You gotta go to that resident committee meeting."}, {"id": "evc2glq", "author": "KateCantSk8", "body": "Wow...I cannot stop reading"}, {"id": "evc5crc", "author": "fatsexynakedguy", "body": "OMG please OP don't tell me Jamies loved you so much that part of his brain is still drawn to you and creepy-vicious-mutated-rodent-Jamie will soon begin to roam your air vents and stalk you with his sharp teeth and his hunger for you."}, {"id": "evc698c", "author": "Ankita_16", "body": "Towards the end I thought that Prudence was involved with the creatures and actually tamed them for some psychotic reasons. But she is the only one you can trust rn. Hope you do good!"}, {"id": "evc7ntk", "author": "Anhmoii", "body": "Hm... Lylia can come back but i think just like some movie she would like be undead or something"}, {"id": "evc8jtb", "author": "Emissary1711", "body": "I hope everything goes well for you in your new home...I'm sorry about Jamie"}, {"id": "evc9rbo", "author": "DemonicSymbol", "body": "If they can find food, maybe you can lead them to an old fallout shelter and trap them in there. Once their down there, lock up the shelter and put down some sod to hide the shelter. They’ll eventually starve to death. But even then, I don’t know if that’ll work. We don’t fully understand them yet. If their anatomy resembles a rat’s, maybe you can poison them with rat poison?"}, {"id": "evcjzwt", "author": "layingblames", "body": "OP, did you catch the postman this morning?"}, {"id": "evd10ty", "author": "mysticaltater", "body": "Dude, let him go. You're not going to want a feral demon rat boy as your boyfriend. I'm sorry for your loss but it's not worth it"}, {"id": "evd185d", "author": "sistercereal", "body": "When she said the beast was her grandaughter, I got mad FMA flashbacks."}, {"id": "evd827f", "author": "ChickenInSpace", "body": "You could have some issues with the dark gods. Those fellas sound eerily similar to Skaven, the servants of the Great Devourer; the Horned God.\nHopefully the rest of that pantheon will stay the fuck out... but the kids sound pretty devoted to Slaanesh and the whole building reek of Tzeentchs work, so outlook is pretty bleak."}, {"id": "evd8v9s", "author": "ilivetofly", "body": "Prudence is old. She made sure her husband didn't die within the bounds of the building and now seems to be ensuring that she does not die inside of there either. \n\nI'm guessing you really don't want to die in there. If needs be at least you could take the balcony dive. Imma guess Mr mailman is dead too"}, {"id": "evd94ww", "author": "BodaciousBoxers", "body": "This series is seriously so intriguing and I can't get enough of it. Great job OP. 👍"}, {"id": "evi5lxu", "author": "Tzaman1985", "body": "All I can think about is the creatures looking like a demented Rattata from Pokemon GO :D"}, {"id": "ew8l2at", "author": "HereToPatter", "body": "Any artists out there that can draw these creatures based on the description? I'm very interested to see what they look like."}, {"id": "fdnsago", "author": "ValkyrieValor", "body": "This us one of the most intriguing stories I've ever read! Please keep em up!"}, {"id": "evavnp1", "author": "WishLab", "body": "Oh NO. Wasn't expecting that.\n\nI'm so disappointed that Mrs. H is so salty, I really wanted her to be more of an ally. Sorry if you wrote about this and I missed it, but why did she move out after all that time? Too many memories I think? About Bernie etc.?"}, {"id": "evbp9t5", "author": "DaGoldenpanzer", "body": "This gave me Until Dawn vibes. Remember how when certain characters died, they turned into those weird creatures? This is similar to it."}, {"id": "evc63o4", "author": "Ankita_16", "body": "No OP, please find Jamie. As other commentor mentioned, you can look into the stair glich and possibly time travel to save Jamie. \nBut you have to be prepared to fight, I was so proud when you fought off Natalia. I can see the potential of a fighter in you. Find your man!"}, {"id": "evb39if", "author": "annahtml", "body": "It's been intriguing following this from the beginning - but man oh man today's update was chilling."}, {"id": "evbfmqh", "author": "Ifidieyoungburnme", "body": "What if Mrs Hemmings is actually tied up with the whole thing? I’d definitely not join the committee, it may cause unneeded connections with the tenants. You’re stronger by yourself"}, {"id": "evb497t", "author": "Bradthediddler", "body": "Love these kinda world building series, just binge read them all and am waiting for more!"}, {"id": "evbcisl", "author": "Kagenlim", "body": "Ok, can someone explain to me where on earth is the police?\n\nYou would think with so many deaths occcuring in the building, a police officer would have been dispatched there at least once."}, {"id": "f4uzaax", "author": "BusyWritingHeartOut", "body": "B"}, {"id": "f7epce0", "author": "megatron-megatron", "body": "Could turn this into a short tv series"}, {"id": "ffbfu2m", "author": "no-ur-mum", "body": "Well Ian said Prue killed one so my big brain idea. Get a gun licence. Get big shotgun. A striker 12 will prove helpful because of the fast firing speed. Go to the 7th floor and place c4 in the elevator. When the monsters are in there be at the bottom floor. And explode the c4 while elevator is at the top floor. It will kill most of the rodents and the elevator will drop to the first floor where they can easily be killed and disposed of"}, {"id": "evaqpma", "author": "NoKn0wnAlias", "body": "Cover your apartment in gasoline light a match drop it and run downstairs and forget it ever existed"}, {"id": "evbsuzq", "author": "hjjbffs", "body": "In the previous part, I thought that the creatures might have been gremlins, but now I'm not very sure."}]}