{"id": "ckw07c", "title": "The previous tenant of my new flat left a survival guide. I might need some help.", "url": "https://www.reddit.com/r/nosleep/comments/ckw07c/the_previous_tenant_of_my_new_flat_left_a/", "subreddit": "nosleep", "author": "newtotownJAM", "text": "How it began \nhttps://www.reddit.com/r/nosleep/comments/ci94do/the_previous_tenant_of_my_new_flat_left_a/?utm_source=share&utm_medium=ios_app\n\nAnd what happened next\nhttps://www.reddit.com/r/nosleep/comments/cinu8u/the_previous_tenant_of_my_new_flat_left_a/?utm_source=share&utm_medium=ios_app\n\nWhen I finally caught up with Mrs Hemmings herself\nhttps://www.reddit.com/r/nosleep/comments/cj2g4k/the_previous_tenant_of_my_new_flat_left_a/?utm_source=share&utm_medium=ios_app\n\nAnd when the trouble really started \nhttps://www.reddit.com/r/nosleep/comments/cjintp/the_previous_tenant_of_my_new_flat_left_a/?utm_source=share&utm_medium=ios_app\n\nWhat I learned \nhttps://www.reddit.com/r/nosleep/comments/cjzfky/the_previous_tenant_of_my_new_flat_left_a/?utm_source=share&utm_medium=ios_app\n\n\n\nI sat all morning thinking about everything, cup after cup of coffee in front of me to keep me awake. Once the postman had left and I was alone with my thoughts they just continued to get louder. \n\nI thought about Natalia and the cult. About the kids and their nighttime antics. About the committee meeting. Jamie and how much I missed him, Georgia and my burning guilt and Mr Prentice, who was finally making those aforementioned animal noises.\n\nMost of all I thought about the note left for me on move in day. How it had changed everything. My whole life was different now, I was alone and it felt like my new home was attacking from every angle. \n\nI re read the note a few times over my coffee. I worried about my rent, it was tight but manageable. School is currently out in the uk but as a training teacher assigned to a school I still get paid a small amount through the summer. The rent is low and with a second summer job I can just about make it without Jamie. \n\nIt sounds strange. But it felt nice to worry about something normal for a minute; even if I should have been worrying about my survival and the many entities currently trying to kill me. \n\nI didn’t get to stew for too long, I had to get ready for the committee meeting. After the events of the night before and my growing mistrust of prudence it was imperative that I got the neighbours on side if I was going to achieve anything like my goals of eradicating the imposter/cultist neighbours. \n\nThe meeting was at noon in flat 31, there was a poster on a communal notice board by the entrance that I was glad to spot, Terri hadn’t mentioned the time when we met and all our meetings since had been a bit hectic to discuss it. The poster promised tea and cakes and my stomach rumbled at the thought, I hadn’t eaten properly in days.  \n\nAt 11.55 I left the flat, and wandered out into the corridor. I’d never seen so many neighbours. Mr Prentice, however, was still making that awful noise and I watched in disbelief as every single person in the corridor walked past his door as if it was silent. \n\nI did my usual deliberation on whether to take the stairs or lift but yet again the stairs won. I still couldn’t bear being where Jamie died and all these extra flights were keeping me fit.\n\nFlat 31 belonged to an older lady named Molly Thompson and her husband Eric. She had a blue rinsed head of curls attached to her head and had gone to the effort to make homemade batten-burg cake. Other neighbours had bought along baked goods as well. It reminded me of a school fair.\n\nThe flat itself was decorated for the 70s, with plenty of china cat ornaments littered around. I sat down on a dusty plastic garden chair, one of many that Molly seemed to have acquired and laid out for the residents pouring in. I hadn’t seen community spirit like this in my life. \n\nI smiled as I saw Terri, Eddie and Ellie wander in. It was nice to see some familiar faces. I had noticed people looking at me, wondering who I was. It probably wasn’t often they got new neighbours. Eddie came running up to me, swung his arms round me and sat down in the rickety garden chair next to mine. It was so sweet. Terri smiled at me and took a seat the other side of mine, Ellie sat next to her brother. The brown puppy dog eyes were back. No claws.\n\n“I’m glad you came!” Terri said to me, loud enough to hear over the voices of the other neighbours. “I really want you to see the good side of the block. We don’t bite really!” She laughed nervously as she realised the irony of her statement. \n\n“Terri I need help, we need to stop those people from coming back again and from terrorising people. The block can’t go on like this.” I wanted to make the purpose of my attendance clear to her, it was time for things to change. \n\n“But if you don’t let them in then they don’t bother you. I’ve spoken to the kids, they know not to do it again, that those people are dangerous.” She paused for a moment and sighed. “Although them running away didn’t help, the kids think they’re indestructible now. They’ve been telling me all morning that they’re going to kill the bad guys.” \n\nShe looked so resigned. But it was true, they did run away from the twins. Maybe there was something in that, I knew they could die I just had to work out how. But as the thought crossed my mind and I looked at Eddie and Ellie, I couldn’t imagine taking the risk.\n\nI could’ve flat out gone back and asked Prudence. But to be honest I didn’t want anything to do with her. She gave me such a bad feeling. I was doubting everything she told me.\n\n“It doesn’t matter if you can keep them away. We can’t all live in fear. Yours aren’t the only kids in this building.” I knew this from surveying the room. “But I bet not all the kids here are as ... special ... as yours. What if another family burns to death because their kids were hyper one night.”\n\nI could see this struck a chord with Terri. She looked at me with glassy eyes as if on the verge of tears. \n\n“You’re right. Molly’s the chairwoman and she can be a little strict but you can bring it up under any other business.” She spoke with a lump in her throat. “Here you go by the way.” She handed me a piece of printed paper. \n\nAny other business felt a bit lacklustre but it would do. As long as it got discussed. \n\nI turned my attention the the piece of paper, it was the agenda for the meeting. For something written so formally it appeared farcical. It seemed other flats and floors had different but equally strange issues to mine. \n\nThere were only 6 items on the agenda for the meeting with AOB as the 7th. They were as follows. \n\n*1. Welcome and introductions with apologies for absence.*\n\n*2. Replacing of the flickering lights on floor 11, it seems to incite vicious behaviour from the pets and elderly of that floor.*\n\n*3. Serving a formal residents letter of concern to the man who doesn’t move from the bottom of the stairwell on floor 5.*\n\n*4. Finances - budgets for general maintenance and the annual barbecue.*\n\n*5. The stairs with no grip leading up to floor 14 at the very top and the health and safety hazards this presents.*\n\n*6. Soundproofing of Mr Prentice’s flat, number 48.*\n\nI was comforted to know that I wasn’t alone in dealing with all these strange occurrences. I was also chilled to the core to know for certain that it was the entire building that was more than a bit odd. \n\nWhat really struck me as odd is that when I thought about it, I had seen that man on floor 5 when going down the stairs. But I’d never noticed that it had been every time, or that he had never moved, until this moment. \n\nThe meeting begun with a loud and dissatisfying clink. \n\nBy this point the tiny, 70s themed flat was packed. Garden chairs had all ran out and people were standing. Molly Thompson stood up from her floral patterned arm chair and bashed a teaspoon against the outside of her cup. \n\nShe reminded me of a very strict, disciplinarian school teacher I had worked with during my university placement. She commanded quiet in the room. \n\n“I think we should get started everyone!” She shrilled, her voice growing louder with every word until the crowd came to a silent hum.\n\n“Right, firstly, we are not going to skip the introductions today. Apologies have been given by Jo and Steph of flat 2 and yet again by Mr Prentice. We have a new face in the room as I’m sure many of you have noticed.” She gestured to me and looked in my direction but didn’t really make any eye contact. She was just talking about me as I sat in the room. Eventually she addressed me directly. \n\n“Stand up dear, introduce yourself. We’re pleased to have you here.”\n\nI was deeply uncomfortable. I could feel some sort of panic coming on. I never liked standing in crowds very much. But I stood up anyway. \n\n“Ermm, hi. My name is Kat. I live in flat number 42, I moved in with my boyfriend Jamie but he was killed in the lift by the weird rat creatures you people have living here. The people that claim to live in the burned out flats won’t leave me alone and one in particular seems to want me dead. Oh, and that window cleaner outside my flat makes me want to scoop my own eyes out with a spoon every time he knocks on the door. Nice to meet you all.” The crowd had gasped a little.\n\nI sat down. Instantly mortified, I don’t know what happened, the normality and structure of the meeting overwhelmed me. There’s something about a sense of order and normality amongst chaos. It does something to your brain, and for me, for the first time in this whole journey, it sent me into a meltdown. \n\nI sobbed as I hit the chair, both in pure mental exhaustion and disappointment that I had blown my chance at building any sort of army against Natalia. Terri rubbed my shoulder. Molly broke the awkward silence that had blanketed the room. \n\n“Nice to meet you Katherine, I understand life in this building can be a little overwhelming. We did ask the previous occupant to let us intervene when you moved in but she was insistent. In hindsight we may need to review our policies on new tenants. I am so very sorry for the loss of your partner. The lift is a most unfortunate situation.”\n\nShe had been in positions of power in her life for certain, she responded professionally but coldly, there was no feeling in her condolences. She came off like a corrupt politician digging themselves out of a hole. She did decide to skip the introductions after my outburst.\n\nI also hate it when I’m called Katherine. My parents named me Katie and I shorten it to Kat. Her presuming it was Katherine added to her school teacher demeanour. \n\nShe carried on with the proceedings pretty swiftly and interesting characters present at the meeting started to emerge. \n\nMy favourite was a large middle aged Caribbean woman named Precious St Fluer who would not accept Molly’s claims that there was not enough in the budget to replace the lighting on floor 11.  \n\nShe got up and lifted her shirt to reveal a large deep bite mark across her stomach caused by her dog after a long episode of the lights flickering. When that didn’t change Molly’s answer she lifted her trouser leg to reveal a smaller, but still noteworthy bite mark on her leg, from her elderly mother who lives with her. Molly didn’t budge.\n\nIt took what felt like an eternity to get to any other business. If I weren’t so focused on my goal I would have enjoyed hearing about the quirks of the other floors, maybe tried to engage a little, but I just couldn’t concentrate. \n\nWhen the chairwoman asked if anyone had any other business she scanned the room quickly. I stood up from my chair and she locked in on me with her eyes. \n\nMy hands were shaking and I could feel a cold sweat forming all over my body.\n\n“Katherine, what can we help you with dear?” She asked in a patronising tone. \n\n“I want help in getting rid of the people pretending to be from the burned out flats. I can’t be the only person that doesn’t like living in fear.” I stated boldly, trying not to break down again.\n\n“Dear we have had this discussion multiple times and it’s been taken off the agenda. I am aware you’re new here but there is nothing we can do about certain problems within this building and for this particular issue we would appreciate you not letting them into your home and ignoring them like the rest of us.” She snapped back. \n\n“But that’s not good enough! Terri’s kids answered the door last night, they’re children, it’s easily done, what if someone else’s child does it and aren’t so lucky to survive. One burned my friend so bad a few nights ago that she’s still unconscious in hospital.” This I knew from social media. \n\nA few people called out in agreement with me from the crowd. \n\n“The only one who has ever been able to deal with them is Prudence. And that difficult woman never revealed her methods. Don’t think we didn’t try. You’re suggesting a suicide mission. You’d do well to remember you are new here.” Molly hissed through her teeth. \n\nDid she have to mention I was new so many times. It was grating on me. \n\n“Well I’m willing!” Shouted Precious. She seemed stronger than the rest in her earlier rant. I was glad to have her on side. \n\nWhere she came forward, a few others followed. Soon I had 5 people plus myself willing to form a sub committee to get rid of the cultists. Molly didn’t like it but she agreed to let us do it.\n\nThere was me, Precious and Terri along with lady named Shanti who lived a few doors from me. \n\nA man named Anton and his friend Leo from floor 8 made up the group. To be honest they just seemed keen to get involved with any kind of battle. Leo was the loud one, Anton was mostly silent. \n\nI invited them to my flat after Molly swiftly adjourned the meeting. Inviting anyone into my home made me anxious now. I found myself studying each of their faces to ensure they’re weren’t too average and I hadn’t invited the wrong people in. I was fairly certain I hadn’t. Eddie and Ellie settled in front of my tv in the bedroom so they didn’t hear our conversation. They may only be kids but I felt safer with them there. \n\nWe discussed for hours how we could bring the imposter people into one place and kill them all. \n\nLeo was particularly creative, he came up with weird and whacky ways to end them; from locking them in a room and blasting with fire extinguishers until they freeze, to herding them into the lift between 1.11 and 3.33 am.\n\nThe whole time I waited nervously for a knock on the door, for them to come for us. But they didn’t. We got time to plan. But despite the time it never really took off, no idea seemed feasible. \n\nI shared everything I knew. My conversation with Prue, the night before in Terri’s flat... everything. Precious listened to my tales intently before speaking.\n\n“Derek would have helped us. He was a great man, he used to turn up at my door in the dead of the night just as those lights started and take my dog for a walk.” She spoke of the gardener with a fondness. \n\n“Prudence told me about Derek. She said he’s been gone since the garden was demolished.” I replied flatly. \n\n“It was awful when he left. That woman that used to live here was nasty to him. I watched out my window as she tore up the garden. I know she was grieving for that little girl but I know Derek only ever wanted to help.” Shanti spoke up from the corner. She had been pretty quiet the whole time. “He was the whole reason we don’t have those awful creatures from the lift all over our homes anymore. My brother was killed by one before the agreement. He was 4 years old.”\n\nI twitched as she told her story. Shanti has such sad eyes and speaking about her brother only filled them further with sadness.\n\n“This is another thing I don’t understand. Why have any agreement, if you managed to kill most of them, why not all?” I asked, feeling anger over Jamie burn through my throat as I spoke. \n\nPrecious laughed. Terri shot her a look from across the room. \n\n“No ones told you the whole story have they?” Shanti asked, a single tear running down her face. \n\n“What do you mean?” This was driving me insane, nothing was simple, how could I trust anyone. \n\n“When Prudence and some of the others killed the creatures they killed a large group of them in one hit. They had started to work out that food scraps and pet food were attracting them and they gathered all the pet food in the tower block into one empty flat on the floor the fire had happened. They creatures came in droves just like expected and they set the flat alight. Again.\n\n“The flat was burned to ash on top of preexisting ash. Nothing could survive that.” Shanti was interrupted after this by Leo. \n\n“And then 3 giant rat motherfuckers literally rose from the ashes, triple as smart and strong and fucked shit up!” He said, a look of excitement on his face. \n\nShanti rolled her eyes and continued. “So all Prudence did was cause a quite literally bigger problem. She didn’t kill them, all she did was help them evolve.\n\n“There was only three of them but they learned to sneak attack. More people died than during the original infestation. They were more intelligent but not in the way it comes across when the agreements spoken about. We couldn’t speak to or reason with them.”\n\nTerri was looking at the floor. \n\n“Only Derek was able to do that, he spoke to them like he spoke to the garden. He made it safe for everyone again, I wasn’t there. I was too young but there we were told he didn’t even have to use words. They understood just a series of movements and eye contact. \n\n“Derek explained the rule with the lift. He told us it was a gesture of goodwill. The creatures needed a home and seemed attracted to the building and we would let them live there and stop killing their kind if they would stop killing ours. But to show them some respect we would allow them a small time frame where unleash their instinctual nature. But only if someone came to them.\n\n“There are only 2 left now. Prudence killed the other during what happened with her granddaughter. But that only made them 2 stronger. Like they absorbed the 3rd.” \n\nI tried to take in all the information I was receiving but I couldn’t. It was too much. \n\n“Derek isn’t coming back, it’s been years, this is pointless!” Terri finally erupted. Precious laughed again.\n\n“How do you know?! You speak to dear old Prue all the time, know something we don’t?” Precious spoke sarcastically but I think she meant what she said. It was becoming clear that Prudence Hemmings wasn’t too popular in this building. \n\n“I don’t speak to her all the time! We just keep in contact, she was always nice to me!” Terri tried weakly to defend herself.\n\n“That’s because you’re naive and a pushover! She used you because no one else would give her the time of day!” Precious was about to launch into a full rant on Terri. I was glad Eddie and Ellie were in the other room and couldn’t hear. I wondered if she’d seen them at night. \n\nI decided to stop the rant. This was becoming counter productive and we were getting nowhere with our plans. I interjected and told them all I needed them to leave so that I could sleep. Partly true, although I knew I couldn’t sleep. I had other things to do. \n\nThey all filed out of my flat, Terri and the kids were the last to leave. She gave me a hug as she left and told me to get a proper nights rest, telling me she was always there for a cuppa and a chat. It was sweet. I felt sorry for Terri. The kids hugged me too as they left. \n\nI know she spoke to Prue, but I was certain that it really was entirely innocent. \n\nI sat in the empty flat disheartened that my assembling of an army had turned into a bickering shit show with no real suggestions on how to kill the imposter neighbours. \n\nI felt totally alone. I couldn’t trust Prue or Ian or pretty much anything I thought I knew. Maybe Prue didn’t even kill those neighbours. They only told me half truths about the creatures after all. \n\nI was left alone with my thoughts again. And after a few hours, a good one finally struck me, but I needed supplies.\n\nI left the building and went to the nearest shop to gather the items I needed. For what I needed and the time of night I had to travel to a 24 hour supermarket. It took half hour each way on the bus. But I stayed focused. My bags were heavy and awkward on the way back to the block but if it paid off this was going to be worth it. \n\nI trudged up the stairs. It took me 2 trips and 24 flights of stairs instead of 14 to get everything in my flat and organise myself. \n\nIt only took 16 and a large gym bag that was much easier to carry on the way back down, thankfully. \n\nI passed the man on floor 5 twice. Now I’d noticed him, he made my skin crawl a little. \n\nI walked through the downstairs corridor, diverting away from the main entrance and passing all the ground floor flats to the door at the back of the building.\n\nThe door at the back lead to a small concrete area with a grass strip along the side and a bench decorated with a memorial plaque. This was the blocks outside space. As is typical in the city the whole bench was covered in graffiti. The memorial was unreadable. \n\nI got to work. I dug the strip of grass, turning soil with my new equipment. I had never been green fingered and to be honest the shrubs I had bought had been so heavy I had grown to resent them a little. I worked for an hour and a half. I was sweating and night had come, it was pitch black and I was using my phone torch to see. \n\nI had almost given up until I got up from my crouching position to stretch my knees. I reached my arms out, put down my shovel and took a seat on the bench. \n\nI hadn’t seen him arrive but the man was already sat there. He wore a flat cap and a jacket, despite it being the middle of summer and a beautiful night. He just smiled warmly at the shrubs for a moment without a word. Eventually he spoke. \n\n“I’ve missed this place. Names Derek.”\n\nOur journey: https://www.reddit.com/r/nosleep/comments/clvga9/the_previous_tenant_of_my_new_flat_left_a/?utm_source=share&utm_medium=ios_app", "comments": [{"id": "evr5b3g", "author": "NoSleepAutoBot", "body": "It looks like there may be more to this story. Click [here](https://www.reddit.com/message/compose/?to=UpdateMeBot&subject=Subscribe&message=SubscribeMe%21%20%2Fr%2Fnosleep%20%2Fu%2FnewtotownJAM) to get a reminder to check back later. Got issues? Click [here](https://www.reddit.com/r/nosleep/wiki/nosleepautobot). Comment replies will be ignored by me."}, {"id": "evr9ssd", "author": "Jaermit", "body": "I've been thinking that there has been some sort of mistake/ malicious intent into allowing normal humans into those apartments. Like, it was especially built for the supernaturals trying to pass off as humans to fit in.\n\nAlso, maybe you should consider talking to Prue one last time to demand what the hell is wrong with her for stopping the committee in prepping you and your boyfriend when you guys first moved in. \n\nLastly, please be kind to Derek this time. :( That is, assuming he's as good as other tenants made him out to be. \n\nGoodluck!"}, {"id": "evr7bf7", "author": "corazontex", "body": "I am so invested in your life that I literally need with every fiber of my person to know what is happening!!!"}, {"id": "evraqx4", "author": "CoffeeBeanx3", "body": "I appreciate the thought of blasting the burning cultists with fire extinguishers being brought up. Tell Leo that I love him. Pretty sure we're soulmates.\n\nAlthough I quite liked my idea, I love the fact that Derek is back even more!! I'm super excited to hear what will happen now. \n\n(Still think Natalia's ass could use a little highly pressurized CO2.)"}, {"id": "evrhx3n", "author": "iSaeryth", "body": "This story is a true game of kat vs rat"}, {"id": "evrfjm9", "author": "smoked_salmon_jpeg", "body": "The dude's been waiting decades behind a bush waiting for someone to plant a flower so he can come back"}, {"id": "evrfg44", "author": "Tristanbaker", "body": "Molly sound like professor Umbridge from Harry Potter. Hate her already."}, {"id": "evrd3l9", "author": "Jechtael", "body": "I'm so glad that Derek's back. He seems good. Good-with-a-capital-G, even, despite his retribution upon Prudence probably getting her granddaughter caught in the crossfire. Make sure something protects the garden from Molly deciding that the unauthorised change to the grounds must be reverted.\n\nSpeaking of Molly, I really wish you'd pointed out that Kat is, in your case, not actually short for Katherine. Now people think that her assumption was correct."}, {"id": "evr7ufd", "author": "motionoftheocen", "body": "YES! Brilliant plan OP, Derek’s garden will bring Jamie back! But for the love of god, make sure everyone knows it’s sacred! And screw Prue, what a jerk!"}, {"id": "evrabv7", "author": "CupOMoJo", "body": "Totally agree Prue is sketch - but why did OP suddenly change her mind about her? Also when is someone gonna ask Terri who her baby daddy is??"}, {"id": "evr4xop", "author": "Mertensiavirginica", "body": "Derek!!"}, {"id": "evr5ak2", "author": "Arkhyna", "body": "Get someone well versed in dark arts !"}, {"id": "evre1xn", "author": "lettiestohelit", "body": "But WHY hasn't anyone from the real world noticed Jamie's disappearance? His coworkers? His boss? His family?"}, {"id": "evr9hcm", "author": "glocksngots", "body": "I got scared OP, I was waiting at my computer this whole time for the next update. I thought something happened to you."}, {"id": "evrbjgt", "author": "mediocrelifts", "body": "The craziest thing is that you get paid a stipend as a teacher over break... dang"}, {"id": "evrjwya", "author": "Reaperlock", "body": "I knew it... I was thinking the same thing.. that you should plant some trees.. Derek sounds like the God of nature or plants, or some angel of nature.. Freshly plated shrubs will summon him for sure and with him will bring some solution to our problems.. Yes, these are our problems now.. We are just readers but with you in this nevertheless... All the best..."}, {"id": "evsa7n8", "author": "HeavenDraven", "body": "Well done on planting the garden! This is probably going to get lost, but try cleaning the memorial plaque. Also, does anyone else think the flickering lights possibly have something to do with the Rat People? \nCouple of other things I noticed - none of the residents seem to know who the man on floor 5 is. That, coupled with him being listed as a new problem, would point to him being Jamie :(  \nIt's interesting that Precious and Terri commented that Prue wreaked \"the garden\", when Prue only mentioned one flower bed. Maybe there's more to that, too.\nMore strangeness, I'm not sure if anyone's mentioned this. Looked up the name Lyla, one of the meanings is \"night\", or \"one who was born at night\". Another is \"one who weakened or impoverished another\". Prudence is \"good judgement\". Katie is \"pure\", but also links to a word meaning \"to purge or cleanse\" - whereas Katherine can be \"martyr\". Derek is \"gifted ruler\". Precious is \"of great worth\". Anton is \"priceless\". Molly, interestingly enough, is \"bitter\". I'm not going to go through all of them, but the names are very....interesting.\nEdited to correct a name which auto corrected and gave the wrong definition, albeit a rather fitting one!"}, {"id": "evsar9c", "author": "Regicide_Only", "body": "So I’m guessing the way that Prue “killed the two people from the burnt floor” was that she let them in her room and fed them to Lyla. It seems like it would work, and would explain why only Prue could do it. It would also explains why she’s never told anyone. She doesn’t like to tell people she brought back Lyla in monster form."}, {"id": "evr986t", "author": "lisasimpsonfan", "body": "Thank you for updating us.  I have been worried about that meeting and the fire cult people showing up and trying to hurt everyone."}, {"id": "evrd14y", "author": "Fitz516", "body": "Omg is Derek dead? Will Jamie come back to life? Is prue the landlord. Leaving me with so many questions OP!!!!!!!!   update asap"}, {"id": "evt4a7w", "author": "logannull", "body": "when i read this one i thought\n\n*if youre going to be up all night, offer to take the kids from terri, she needs a break and they can help you work this out.*\n\nI JUST FEEL SO BAD FOR HER"}, {"id": "evra80v", "author": "in-a-coma", "body": "You are an inspiration in fortitude and resourcefulness, my friend! We are all rooting for you, even if it seems bleak. I've been checking for an update all afternoon. Hopefully Derek will have some help for you..."}, {"id": "evrm484", "author": "WhatUpWorld352", "body": "I've been anxiously waiting for an update on what's been happening since the incident in Terri's apartment. It's great to hear that you aren't taking all of this on stride and just accepting the life they all live there. Truly a great person to want to think of all the other tenants that could/will be harmed by the fire starters. I'd advise asking around carefully about Prudences granddaughter. It sounds to me as if nobody knows about what happened exactly. She may be a key way of f igg thing off the neighbors since Terri's children could as well. Also regarding the man in the stairwell, kinda strange that nobody seems to recognize him... Maybe someone that got caught in the stair skip? It seems like you have your hands full and I wish you the best with figuring out a way to get rid of the imposters.  Please keep us updated!"}, {"id": "evrs9e5", "author": "Cinderstock", "body": "The amount of times Kat says she can't trust anyone but then completely trusts Terri makes me a bit suspicious. Maybe Terri DOES know something and is hiding it? I don't think she has any malicious intent but at this point I wouldn't be surprised if her liaisons with Prue are important for whatever reason..."}, {"id": "evr7h8z", "author": "cbusta167", "body": "Things are heating up!"}, {"id": "evrnnan", "author": "ManLiterallyOnFire", "body": "Part of me wonders if selling off the green space surrounding the building was an intentional effort to get rid of Derek. If so, I worry for the fate of the new garden."}, {"id": "evsxfp6", "author": "jensees", "body": "Derek is some nature-entity bound to the ground beneath the building and only has got the power to manifest itself if there's enough nature?? I dig that guy, hope he can help you OP!"}, {"id": "evrb8b2", "author": "Poker5ace", "body": "Kat added Derek to the group!"}, {"id": "evrhknl", "author": "AnadyranTontine", "body": "Ah, I see you've finally met Derek. He's...erm...special. Ask him about Flat 093. Don't go near any mirrors in the meanwhile."}, {"id": "evrjkb8", "author": "cthulularoo", "body": "Dereks back.  I wonder if his story will mesh up with Pru's.  Like, did he really give her the spell to retrieve her niece?  Or did Pru trick him somehow."}, {"id": "evrim0n", "author": "allhailsmoothie", "body": "Ahhh. So happy to hear your update OP! \n\nAlso. What if the man on the fifth floor IS JAMIE. But like reincarnated or something worse. Might also be the window cleaner who scares me."}, {"id": "evrc7h1", "author": "LoveHers36", "body": "Derek's here to save the day!!!"}, {"id": "evrecbf", "author": "morning-ti", "body": "Great thinking with remaking the garden OP! I hope with Derek’s assistance that you can finally get your Jamie back!"}, {"id": "evri4ki", "author": "agentperry007", "body": "I hope Derek can help you & the other tenants out OP. And yeah, ppl were right, maybe keeping up w the garden helped bring Derek back."}, {"id": "evrkda6", "author": "AmberRose_Ashe", "body": "Derek is def some kind of spirit that is attracted to flowers and gardens and I'm so glad that she caught on to that and gave him what he wanted back."}, {"id": "evrzyj4", "author": "OnyxPanthyr", "body": "Respect is earned. You're on the right path with Derek, Kat. Treat him well because he seems to be the only one you can really trust! (Although I don't think Terri is malicious, just a poor tired soul trying to keep her kids safe.)"}, {"id": "evs1462", "author": "chromatyyk", "body": "What if Prue has some sort of deal with the building to bring back her granddaughter properly if she gives it a proper offering? Maybe she needs to feed it a certain number of people.  Could explain why she's so selective about what information she gives OP and the other tenants."}, {"id": "evs9pyq", "author": "KataLight", "body": "Good job figuring out Derek. However as much as you don't like Prue Derek still tricked her into doing something horrible out of anger. Though with the revelation of the type of being he is the anger makes much more sense now."}, {"id": "evsru1s", "author": "Tzaman1985", "body": "Question: can you ever run into the fire controlling cult members in the hallways or do they only approach tenants by knocking on doors in order to be let in? I think Natalia mentioned something like needing to be let in. Anytime you walk out into the corridors I feel panicked - I'm like \"don't run into one!\". So just curious if that's a possibility ever."}, {"id": "evtt4e2", "author": "Iluxsio", "body": "Pretty sure the twins are the children of the window cleaner. So maybe...maaaaaaybe he could help? \nNow that Derek is here anything IS posible! Maybe the 2 rodent Monsters that are left will join the fight as it seems the hot-but-average spirits are really the problem here."}, {"id": "evrcl54", "author": "Haru825", "body": "Why hasn't anyone tried to find a middle ground between the fire people and the normal people...? The fire people could protect the normal people from the evil bug things.... and the normal people could help the fire people with tasks...."}, {"id": "evrgkyr", "author": "benzene88", "body": "YES! DEREK'S BACK!!!"}, {"id": "evrgybm", "author": "Synkage", "body": "I fucking knew it."}, {"id": "evrlg0t", "author": "BlakersGirl", "body": "Why hasn’t anyone asked about Derek?\n\nWhy don’t you just move out or try to? Why hasn’t anyone tried? No one has given a reason why they have to stay there. Especially that Molly lady. I would say she’s poor but you said her entire flat was decorated? I don’t trust her, and if she thinks Derek is good I wouldn’t trust him either.\n\nSeriously, try to move out and then show someone that rat creature in the shed. Just have the whole building shot up or something. If one person can kill a rat it’s probably not hard to kill the remaining two, even if they are enhanced. Like, you can’t kill a tiger by yourself but a good shotgun to the right place still would kill it. I’m not sure what’s stopping the government from just quarantining the place, or getting military personnel from just swarming the place."}, {"id": "evru69o", "author": "lumiosengineering", "body": "Perhaps the man stuck at floor five is Jamie, but something happened and hes frozen in time.  Take time to notice everything, even the odd stuff.  Observe and learn!  Great strategy to bring Derek, ask him the purpose of the building!"}, {"id": "evsse2v", "author": "Vincentbloodmarch", "body": "Ahhh, was just going to suggest making a little garden for Derek! I'm glad he's back he seems to be a sort of nymph, the apartment complex seem to be filled with all sorts of spiritual beings, hope to hear from you soon, kat."}, {"id": "evtc42s", "author": "AuroraBorealish", "body": "Surely this all leads back to Mr Prentice somehow? What's with animal noises? I think he's the root of all this.\n\nAlso, the spot on the ceiling that turns to blood?! Thats got to be relevant?"}, {"id": "evtet73", "author": "epic_bro_100", "body": "I can't help but wonder if Prue used her reincarnated Lyla to kill the people from the burnt out flats."}, {"id": "evvkmsr", "author": "ramblingdrunk", "body": "She needs to level with Prue. Otherwise she'll blindly throw away lives. There's something very dark about what the old lady knows, but it's pivotal. The residents have already shown her that, but the gardener can't be the savior, he is also summoned by actions happening within the buildings confines. He's not their disciple. He's a mechanic of the building. It's time Prue was honest. No matter how disgusted the main character is by this women, she needs to break everything down. Even if it leads to Prues death, it's reconciliation time."}, {"id": "evxqo23", "author": "allineedispizza", "body": "Hoping you’re fine OP, i keep checking every couple of hours!"}, {"id": "ewe80u3", "author": "la_saia", "body": "OP you’re in a coma, it’s time to wake up.."}, {"id": "evrslo3", "author": "DerekLouden", "body": "My names derek too lol"}, {"id": "evryioz", "author": "Ravenwight", "body": "Anyone else thinking Derek might be Michael?"}, {"id": "evryq3k", "author": "SpikefallSteve", "body": "Good thinking op, maybe derek can help you. I'm really enjoying this story so far btw."}, {"id": "evs2ehu", "author": "Redeemer206", "body": "Hmm... Very interesting...\n\nSo was Derek just constantly walking past every day until he'd notice someone rebuilding his garden, or did OP's attempts to recreate the garden \"summon\" Derek?\n\nI'd be very curious to hear opinions on either case. That seems like a good question in the lead up to the next installment."}, {"id": "evsg5t7", "author": "EchoDog715", "body": "Okay so Derek might be a nature nymph. I'm cool with that. Cant wait for the next update."}, {"id": "evsoc1k", "author": "JennIsFit", "body": "This could be a book. Holy bananas. I’ve been following since the 4th update and I’m glad Derek showed up. I’d just be wary of how much you trust him, and that Molly lady is a piece of work! She pissed me off."}, {"id": "evsqwl2", "author": "PresentlyFan", "body": "I literally hearing exciting rock music at the ending..."}, {"id": "evtvq55", "author": "poloniumpoisoning", "body": "i'm so glad you brought derek back! i've been thinking, tho, maybe your boyfriend isn't dead? i mean, he left at an ungodly hour and is still missing, but no one actually saw or heard him entering the lift and being devoured, so there's a little hope."}, {"id": "evv10sk", "author": "vc_", "body": "I am loving this so much!"}, {"id": "evraoj5", "author": "crlcan81", "body": "The building is alive, the creatures are former tenants, any time you kill them you simply make the ones that revive stronger. All the going ons that are separate from the building are attracted to it. Why the cult was so fascinated by the place even if the one floor was burnt by them. The entire place needs demolished and replaced, not just the building but the ground it stands on."}, {"id": "evr7w75", "author": "nowyouceeme", "body": "Derek's back!!!!!!"}, {"id": "evrdwqn", "author": "emoverhere", "body": "DEREK IS HERE YESSSSS"}, {"id": "evrg9rj", "author": "EpiCxOmega", "body": "Everyone's ganster until Derek arrives"}, {"id": "evrj7cb", "author": "ladyhallow", "body": "Yes!!!! I have been hoping for Derek's return!!"}, {"id": "evrkqrt", "author": "aadhu-fayaz", "body": "Woohoo.. I knew you could bring darek back this way"}, {"id": "evrnrie", "author": "savage__Prawn", "body": "What's dead stays dead, it's always been the way. No amount of wishing and gardens will change that. But I am glad you found a friend. Best of luck dear."}, {"id": "evrp2uc", "author": "GozackGo", "body": "Such a good idea for getting Derek back!"}, {"id": "evrp31m", "author": "acdol2", "body": "Ahhhh you thought about Georgia and your BURNING guilt? \n\nI'll show my self out."}, {"id": "evrsjb6", "author": "lil_lexa", "body": "I want to know more about the other floors too!"}, {"id": "evruhgo", "author": "iwillhauntuwhenidie", "body": "Yessssss.... I was hoping Derek would come back if someone planted a garden. Good thinking, OP!\n\nThe description of Molly reminded me of Mama from Mama's Family, lol. I totally pictured her livingroom and everything."}, {"id": "evrwi9t", "author": "Boonski705", "body": "Oooh, Shit's about to get real!"}, {"id": "evrwryc", "author": "crit-mass", "body": "DEREK YEAH WOO great idea!!"}, {"id": "evrz83q", "author": "johnsgurl", "body": "Am I the only one that keeps imagining Derek as Derek from The Good Place?"}, {"id": "evrzctr", "author": "Oshni", "body": "Hes back! All it took was a show of good faith and Derek would show up again. Nobody else wanted to step on prue's toes, clearly"}, {"id": "evrzlwk", "author": "UnstoppableChicken", "body": "YES!!! DEREK!!!"}, {"id": "evs00al", "author": "beautyiscruelfree", "body": "Yessss I was waiting for Derek to return... I wonder why Prue really pushed her husband from the building...."}, {"id": "evs08l4", "author": "Eibrab22", "body": "I’m glad you made the garden, I had a feeling that would make him come back. Good job 🙂"}, {"id": "evs0nxc", "author": "Chiisora", "body": "And now we meet Derek."}, {"id": "evs0v0s", "author": "itsodarkhere", "body": "Woohoo,,,,Derek’s back! Good job!"}, {"id": "evs0vhk", "author": "uhcanihavearefill", "body": "Wouldn’t never even thought of the garden!!! I have a feeling Prue is behind all this mischief."}, {"id": "evs4fn9", "author": "8corrie4", "body": "Just found this ....op I hope you derek  helps you keep us updated"}, {"id": "evs4s9f", "author": "taeoh666", "body": "Starting to think Derek is some kinda fairy elf with his association with plants and random disappearing reappearing acts"}, {"id": "evs55xo", "author": "Courtney_under-urBed", "body": "Omg omg. Yes! That was a good idea. Oh crap now I have to wait for the next part! Shit I can’t wait to see how this is gonna go. Also, I think chair lady head of committee whatever knows more than she lets on"}, {"id": "evs61el", "author": "kieran4u2c", "body": "Maybe the window cleaner can help in some way? Is there any way to have a conversation with him through the glass? I'm thinking Terri might be the one to talk to him, considering I think him and her did more than just talk before... if he's the twins dad, or something like them, we know the cultists are afraid of the kids, so are they afraid of him too?\n\nAlso the cultists are waiting for their leader to come back, right? See when he's up for parole or if he is already out and maybe he can get through to them for you guys. \n\nIf killing the rats makes those left evolve does that mean lyla evolves as well?"}, {"id": "evs6r41", "author": "114Silverstar", "body": "Derek is deadass Mother Nature."}, {"id": "evs8f7t", "author": "Intaragate", "body": "He came back!!"}, {"id": "evs9r1m", "author": "Lionowlfox", "body": "I knew... I knew Derek would be back"}, {"id": "evsb6gm", "author": "daddydki", "body": "Tell the landlord you need a rent reduction due to the change in your circumstances. Maybe it works"}, {"id": "evslolr", "author": "hellobelloWEENI", "body": "What an incredible series!!! \n\nScrew Prue. Love those neighbor-clawed children. Can’t wait to see how Derek plays a role. Will he be able to strike a new deal with the creatures? Or even, perhaps, a deal with the “burnt neighbors?” \n\n& I LOVE how much I absolutely despise Natalia. It’s gonna feel so good when she’s demolished, frozen, or eaten.\n\nAs much as I want you to have Jamie back, if there’s a risk of him being a rat is it even worth it?\n\nBUT. What if rat-Jamie could make a new deal with the other rats? Or maybe the rats could somehow kill the “burnt neighbors?”"}, {"id": "evsu2px", "author": "spacetstacy", "body": "Good thinking.   But...if Prue trusted him,  can you?"}, {"id": "evsx4nr", "author": "HereForTheLolz21", "body": "I binge read all of this and it's just so good."}, {"id": "evt1npc", "author": "M0n5tr0", "body": "I was waiting for the green thumbs to show up"}, {"id": "evu04z8", "author": "raviolioliveoil", "body": "yay! we still have to know why people decide to stay in the complex for years"}, {"id": "evurs1j", "author": "conundorum", "body": "> She had a blue rinsed head of curls attached to her head\n\nY'know, I honestly can't tell if that's a typo, or if Molly just plain has two heads."}, {"id": "evv9sea", "author": "stopfuckinstalkingme", "body": "I'm confused about how the rat things are connected to the cultists. If they're not, and Derek can communicate with them; any way to set them on Natalia and her Band Of Deadly Weirdos?"}, {"id": "evvs6zm", "author": "i_am_sam_i_am_91", "body": "Derek's here! Enough said."}, {"id": "evxz8dx", "author": "dchambers_0156", "body": "All of this now has me wondering if Pru's husband really died like she said.  We know that he fell off the building, but she has told so many half truths that it makes one go uuummmmm.   Stay safe OP and glad you had the idea to get Derek back!"}, {"id": "evyx8ug", "author": "disc0cat", "body": "Did anyone else crack up over the “burning guilt” about Georgia thing?"}, {"id": "f2vsvqw", "author": "JoseEBM30", "body": "OP, be careful. We all love you so much. Be very very cautious with your choises and the people you trust."}, {"id": "f9ht81s", "author": "Aloe_83", "body": "Lmaooo I love how she was just straight to the point when Kat introduced herself. I can just imagine the look on everyone's faces."}, {"id": "fb3q5kg", "author": "Echoes_Act_0", "body": "i legit everytime they talk about the \"rat muthfuckas\" i think about sableye + ratata fusion"}, {"id": "evre15s", "author": "XVll-L", "body": "More down fall. She hasn't fell deep enough for my taste."}, {"id": "evrsrfi", "author": "kmae1028", "body": "YESSSSSS DEREK!!! \n\nEveryone else in the building has been there too long to think straight. OP is the catalyst in getting things taken care of again. We need Derek back? We rebuild the garden. Excellent! Can’t wait for the next installment!"}, {"id": "evrgnyw", "author": "ptorr45", "body": "Thank God! I’ve been checking for an update all day long. I’m very excited that you got Derek to come back. Good fucking job! Can’t wait for the next update."}, {"id": "evrmr5v", "author": "ayeehayden", "body": "FUCK YEAH DEREKS BACK"}, {"id": "evrqfrg", "author": "sdipert", "body": "I've been anxiously waiting for this next part. I was hoping you would plant a garden, I figured that was the only way to bring Derek back."}, {"id": "evsbi62", "author": "Aquilae7", "body": "yay derek!! I have been waiting for himm <3"}, {"id": "evsc5tt", "author": "Bangorondeebe", "body": "...if you are determined to stay and fight these things I think you need to dig a little deeper into the origins of the building... why are these creatures attracted to that site?... Why so much supernatural activity?... and why is the damned landlord so elusive?"}, {"id": "evsd1wl", "author": "CliMacsMemetown", "body": "What I think you need to do, is pour some cold nitroglycerin on their asses"}, {"id": "evsd982", "author": "Baracco_Baulo", "body": "I knew they would rebuild the garden!\nNow my theory is that they will use the window cleaner to kill Natalia and the cult."}, {"id": "evsgy7n", "author": "WNERWIONY12", "body": "From the start after i Heard about derek going away after the garden massacre i thought so creating a new garden would BRING it back?"}, {"id": "evsi9zb", "author": "indiware", "body": "This is my new favorite here. I can not wait for the next entry. Goosebumps of anticipation literally. =8-0 \\*gasp\\*"}, {"id": "evskvyc", "author": "helpo_0", "body": "Is* Derek the physical manifestation of mother nature?"}, {"id": "evsmp4r", "author": "maruyama_akira", "body": "The badass Derek has come"}, {"id": "evsry2q", "author": "Biki911911", "body": "The garden is back!! More! More!"}, {"id": "evstkwa", "author": "DroidWaller", "body": "WOOOT! Green-Thumby McSaviourPants is BACK!!!!!"}, {"id": "evsumon", "author": "kate9871", "body": "I know how you feel about being called katherine. My name’s Kate. It’s on my birth certificate and I despise being called anything else. Katie or Katherine really get on my nerves especially."}, {"id": "evsvjjs", "author": "EvMurph01", "body": "Bet she dies while walking down the stairs or something. Not the people on the burned floor, or the rat creatures, or sleep deprivation. She’s gonna fall down the floor and die."}, {"id": "evtl4va", "author": "BlankVR", "body": "How convenient"}, {"id": "evv2yyx", "author": "aaaaiiiss2", "body": "Meanwhile the landlord watching all of these happening on surveilance and having a laughter like \"keh heh heh heh. Got 'em\""}, {"id": "ew7i0z6", "author": "Nurse_Nameless", "body": "You are amazing"}, {"id": "ewngnr0", "author": "aeinos", "body": "i need to read more"}, {"id": "ewqd95r", "author": "Viitawa", "body": " W,anión m  \n hhc\n>of mye\n\nnn8sh bbb\n \n>previousb hhh s\nEa\n: s"}, {"id": "exkgegd", "author": "_pirategold_", "body": "I feel like the reason why prudence didn’t tell anyone how to kill those fire cultist fake neighbours was because she struck a deal with them, in exchange for letting her husband Bernie live. Very selfish of her, yes, but I’ve got to admire her tenacity and will to protect her loved ones."}, {"id": "f46fctc", "author": "zenzeron2", "body": "0"}, {"id": "f6yklfk", "author": "damekoi27", "body": "I am late to the party but if these rat monsters take food scraps, why not just put rat poison on the scraps?"}, {"id": "faj4mof", "author": "AlitaBattlePringleTM", "body": "The old lady from flat 42 lied about Lyla?  She had no reason to do so, and it sounds like the whole \"go into the lift and chant this\" was a way to get rid of the pesky new tennant who is asking questions.  I highly doubt that the creature she has all locked up is Lyla, and likely she captured it.  The residents seem to believe she killed it, but I think otherwise.\n\nThis Michael is certainly amysterious fellow, and likely was responsible somehow for trapping his cult in the fire, but that's just speculation.\n\nI like how Derek reappears.  That was a clever twist."}, {"id": "evrsko1", "author": "AmbiguouslyEthnic", "body": "Wow! Was just thinking halfway through this that your best shot would be to possibly summon Derek by way of planting or fixing some growth outside. For the love of God though stick to helping the garden forever and don't piss him off!"}, {"id": "evrsowh", "author": "Mom_of_2_boys", "body": "Thank goodness you are ok, Kat!!  I was getting really worried about you!!"}, {"id": "evt7h3u", "author": "50CaLEDGE", "body": "Rats : **Exist**\nOP: *I am gonna end this shirt's whole career*"}]}