{"id": "cokl1l", "title": "If you’re armed and at the Glenmont metro, please shoot me", "url": "https://www.reddit.com/r/nosleep/comments/cokl1l/if_youre_armed_and_at_the_glenmont_metro_please/", "subreddit": "nosleep", "author": "sarcasonomicon", "text": "Make it a head shot. Shoot me in the temple, aiming slightly downwards. I need the bullet to travel the shortest possible distance through my brain before it hits my hippocampus. If I’m lucky, the sensation of the gunshot ripping through my skull will only last a few decades.\n\nAs awful as this sounds, you’ll be doing me an enormous favor. Death by a headshot, AS SOON AS POSSIBLE, is vastly better than the alternative.\n\nMy ordeal started over ten thousand years ago, at 10:15 this morning. I earn extra money by participating in drug trials. I’m a so-called “healthy subject” who takes experimental drugs to help assess side effects. Once it was a kidney drug. A few times it’s been something for blood pressure or cholesterol. This morning they told me the drug I took was a psychoactive substance intended to accelerate brain function.\n\nNone of the drugs I had tested so far have ever done anything for me, in the recreational sense. In other words, none of the drugs I’ve tested have given me a killer buzz, or mellowed me out, or anything. Maybe I’ve always ended up the placebo group, but nothing I’ve tested had affected me at all.\n\nToday’s drug was different. This shit *worked*. They gave me a pill at 10:15 and told me to hang out in the waiting room until they called me back for some tests. “Only about thirty minutes,” the research assistant told me. I flopped onto the waiting room couch and read a few articles from a copy of Psychology Today that was sitting on the coffee table. They hadn’t called me back when I finished the Psychology Today so I picked up a US News and read it cover-to-cover. Then I read an old Scientific American. *What was taking them so damn long*?\n\nI sluggishly turned my head to look at the wall clock. It was only 10:23 am. I had read all three magazines in eight minutes. I remember thinking this was going to be a long day. I was right.\n\nThe waiting room had little bookshelf with some used hardcovers on it. When I stood up to walk to the bookshelf it felt like my legs barely worked. It’s not that they were weak. They were just slow. It took a full minute just to stand up off the couch, and another minute to take two steps to the bookcase.\n\nI scanned the old books on the shelf and picked out a copy of Moby Dick. My arms had the same problems as my legs. Just reaching one foot in front of me to grab the book took a long time. I actually got bored just waiting for my hand to reach the spine of the book.\n\nI slogged back to the couch and collapsed onto it in a slow-motion fall that reminded me of the low-gravity hops of astronauts on the moon. I opened Moby Dick (slowly) and began reading. I started with *Call me Ishmael* and got as far as Ahab throwing his pipe into the sea (which was all the way to friggin chapter *thirty*) before they called me back.\n\n“How are you feeling?” the research assistant asked me.\n\n“I feel slow,” I said.\n\n“Actually, it’s the other way around. Everything seems slow because you’re so fast.”\n\n“But my legs. My arms. They’re moving in slow motion.”\n\n“Your body seems like it’s moving slowly because your brain is fast. Your brain is running ten or twenty times faster than normal. You are thinking and perceiving reality at an accelerated pace. But your body is still constrained by the laws of biomechanics. Frankly, you’re moving much faster than a normal person,” she pantomimed a jogging motion. “But your brain is running so much faster right now, that even your fast walk seems very slow to you.”\n\nI thought about my slow-motion flop onto the waiting room couch. Even if my muscles had slowed down, my body would still react to gravity the same way. But in the waiting room, I even *fell* in slow motion. Slow muscles couldn’t explain why gravity seemed weaker. My brain was going at warp ten. That’s how I managed to read three magazines and the first thirty chapters of Moby Dick in fifteen minutes.\n\nThey ran a series of tests on me. The physical tests were fun. They made me juggle three balls. Then four. Then six. I had no problem keeping six balls in the air because they seemed to be moving so slowly. It was boring, frankly, waiting for each ball to move through its arc so I could catch it (with my slow-motion hands) and toss it back into the air. They threw cheerios in the air and I caught them with chopsticks. They dropped a handful of coins and I counted the total value before they hit the ground.\n\nThe cognitive tests were less fun, but very illuminating. Finish a fifty-word word search (three seconds). Solve an intricate maze drawn onto a poster-sized paper (two seconds). View a slide show projected at ten images per second and answer detailed questions about what I saw (95% correct).\n\nThey told me I measured over 250 on the Knopf scale. Apparently, that’s deep into the superhuman range of thinking speeds.\n\nThen they sent me home. “It’ll wear off in a few hours,” they said. “Which will seem like days to you. Try to use the residual effects to get some work done. Catch up on work emails while you’re still in high-speed mode!”\n\nThe ride home was *horrible*. It was only three metro stops, and in real-world time, it only took about thirty-five minutes. But in my drug-accelerated hyper-time, it felt like days. *Days*. Just walking out of the medical research suite to the elevator seemed like it took an hour. I sprinted out of the office, willing my legs to push me faster. But, the laws of biomechanics held me prisoner. As accelerated as my brain was, I couldn’t do anything to make my legs work faster.\n\nThe huge disconnect between my body and mind made it extremely difficult to judge how and when to slow down, turn, or rotate my body. I had basically turned into giant, slow-motion spaz. I misjudged my speed and rammed into the wall by the elevator button at a pretty good speed. Even though I could see the wall coming at me, I couldn’t make my finger, outstretched to hit the elevator button, move away fast enough and I jammed it against the wall. Hard. The pain was intense. If my brain had been running at regular speed, it probably only would have hurt for thirty seconds or so. But in my accelerated state, the intense pain seemed to last for half an hour. Forty-five minutes maybe.\n\nThe elevator ride was horrible. It felt like I spent four or five hours just descending seven floors, with nothing to look at but the interior of the elevator car.\n\nI sprinted to the metro station. I have to admit, this part was almost fun. Even though my body moved at, what seemed to me, super-slow speed, I could still carefully choose how and where to place my feet, swing my arms, and turn my torso. It only took a block or two to getting used to having a brain that ran two dozen times faster than my body. Then I basically sprint-danced the rest of the way, twisting and juking between people on the sidewalk and dodging moving cars with inches (a.k.a. minutes) of clearance.\n\nI spent an hour, in my time frame, descending into the subway and running to the platform. Endless tedium waiting the six minutes for the red-line train to arrive. Although there was more to look at on the metro platform than inside the elevator, it was still intensely boring. I should have stolen that copy of Moby Dick.\n\nThe red-line train roared into the station in slow-motion. The normally high-pitched squeal of its brakes was frequency shifted by my high-speed mind to a long low tone, like a monotone Tuba solo.\n\nIt wasn’t just the squealing subway train that was three octaves lower than normal. All sound was slowed to the point of near inaudibility. Voices were gone, shifted below the threshold frequency of my hearing. I did manage to hear a screaming baby on my subway car – her shrieks slowed to sound like whale songs. Sharp sounds like a car horns and trucks bouncing over potholes were low, muddied roars like distant thunder.\n\nBack at the research offices, I could still hear and communicate with the research staff. But now verbal communication with anyone would be impossible. The effects of the drug were still intensifying.\n\nI spent what seemed like days on that fucking red-line train. Days. Listening to the whale-song of the screaming baby and the Tuba solo of the brakes. Where ordinary voices were frequency-shifted out of my audio range, smells didn’t seem to be affected. I never became nose-blind to the body odor, the stench of the train’s brakes, and mélange of farts and other smells wafting through the metro car.\n\nI *finally* got back to my apartment. Sprinting through my open door and into the front hall at full speed was like a slow, relaxing drift down a lazy river.\n\nI was relieved to be home. At least I had stuff I could do there. I picked up the book I was reading – One Hundred Years of Solitude – and finished it. Despite turning the pages so quickly that I tore many of them, it seemed like most of the time I spent finishing the book was spent on page turning and not actually reading. Three minutes had passed since I got home.\n\nI tried surfing the Internet (my GOD it takes a long time for computers to boot these days) but it was too frustratingly slow. Hours (seemingly) to load each new page, and a fraction of a second to read it. A hundred articles in my news feed read and just three more minutes done.\n\nI dipped into my pile of yet-to-be-read books and finished two more. Four more minutes had passed.\n\nI decided to try to sleep off the remaining effects of the drug. Unfortunately, whatever part of my mind is responsible for perception, the part that’s been accelerated to hyper speeds by the drug, isn’t the same as the part that governs sleep. Despite being awake for what I perceived as days, my physical brain still thought it was 1:25 pm. It was not ready for sleep.\n\nNevertheless, I *tried* to sleep. I walked to my bedroom (a slow 45-minute drift through my apartment) and flung myself into bed (lazily falling like a feather onto the mattress). I closed my eyes and lay there for hours and hours (10 minutes of reality time) before giving up. Sleep would not come. I was facing what was going to feel like days, or maybe even weeks of being trapped in a slow-motion prison.\n\nSo I took an Ambien.\n\nThe sensation of the pill and the splash of water I used to swallow it sliding my throat was sickening. A lump that blocked my breathing, moving like a slug down my esophagus.\n\nI read a book. Ten minutes had passed. I read another. Eighteen minutes since I took the Ambien. I threw the book across the room in disgust at my situation. The book slowly pirouetted and spun through the air, like a leaf blowing in a breeze. It hit the wall with a long, faint rumble – the only sound I had head for what seemed like hours – then drifted to the floor like a flip-flop sinking in a swimming pool.\n\nThe force of gravity hadn’t changed since I took the pill. The laws of physics were the same. It was just my perception of time that had gone wackadoo. This meant I could use the speed things seemed to fall as a way of judging the effects of the drug. Based on how long it took the book to drift to the floor, I estimated the effects of the drug were *still* intensifying.\n\nI read a magazine. I turned on the television – I clearly saw each frame of video like I was watching a slideshow. Frustrated, I turned the television off.\n\nI read some more. The first two books of *Churchill’s A History of the English-Speaking Peoples*. Not exactly a light read. Frankly, I hated it. But given the hours of tedium it would take to go get another book off my bookshelf, just sitting on the couch and reading Churchill was better. Or at least less worse.\n\nIt had now been thirty-five minutes since I took the Ambien. I lay down on the couch and closed my eyes. Time passed. I inhaled – a hours long process. Time passed. I exhaled for more hours.\n\nSleep. Would. Not. Come.\n\nI needed a new plan. I decided to go back to the offices where they gave me the drug. Maybe they would have something that could counteract its effects. Or at least something to knock me out until it wore off.\n\nI exited my apartment as fast as possible – taking hours in my time-frame to do so. I didn’t even bother locking the door. It would have taken too long.\n\nDown the stairs (it’s faster than the elevator if you run), through the lobby, out the front door and onto the street. These few things felt like a long day at the office.\n\nSprinting down the street, dancing and weaving between pedestrians with, what must have looked to them, superhuman dexterity. Down the first flight of stairs at the metro. Across the landing. Another hour. Then on to the second flight of stairs. That’s when the Ambien hit me.\n\nThe Ambien didn’t make me sleepy. Not at all. Instead, it must have had a severe cross-reaction with the experimental drug I took this morning. I was bounding down the second flight of stairs, moving in slow motion, but still making perceptible progress. Then, wham – everything stopped.\n\nThe dull roar of the street and metro noise ceased, replaced by the most perfect silence I’ve ever experienced. My downwards motion seemed to completely freeze. Before the Ambien kicked in, my perception of time was maybe a few hundred times slower than real-time. After the Ambien took effect, time moved *thousands* of times slower. Every second seemed like days to me. Even just moving my eyes to focus on a new point was like an impossibly slow scroll across my visual field.\n\nOver the course of the afternoon, I learned how to walk, run, and jump when my mind ran hundreds of times faster than my body. But with another four or five orders of magnitude of slow-down caused by the Ambien, body control was almost impossible. I fell on the stairs. Even though I was all-but-frozen in mid-step, controlling my muscles was impossible. I commanded my foot forwards for hours, then backwards for hours more when it seemed like I would miss the next step. Hours attempting to adjust the angle of my ankle, then re-adjusting when it felt wrong.\n\nDespite these efforts, I rolled my ankle on the next step. The pain wasn’t at all mitigated by the slowness. Hours of increasing strain on my bent ankle. The nerve signals that send pain into the brain must work differently than the nerves in my ear. Sonic energy was spread out over time, diluted until it was imperceptible. Pain flowed into my brain undiluted by the change in my perception of time. Hours and hours of increasing weight on my turned ankle turned into hours of increasing pain upon increasing pain.\n\nI pitched forwards, my high-speed mind completely unable to control my low-speed body. I drifted downwards for days, managing to rotate my torso enough to keep my head from impacting the ground first. I eventually landed on my right shoulder. At first the impact wasn’t even noticeable. Then I felt a slight pressure in my shoulder as it came in contact with the ground. The pressure grew, bringing increasing pain, for hour upon hour. My shoulder finally gave out, popping out of its socket with an endless sickening tug.\n\nI came to a stop days later, crumpled onto the ground, staring at the ceiling. The pain in my shoulder still screaming with the intensity of a fresh violent injury. I had plenty of time to think during that fall. If every second seemed like days to me, then each minute of real-world time would be like *years*. Even if the drug cleared out of my system in the next two or three hours, this nightmare would seem to last *centuries*.\n\nBy the time I hit the ground, I had a plan. I would somehow get to the platform and throw myself in front of a train.\n\nI twisted onto my hands and knees. Days of my dislocated shoulder crying for relief. I misjudged my rotation and rolled onto my back. I tried again, collapsing onto my face as I tried to figure out how to control a body that moved slower than grass grew. *Weeks* of effort were finally rewarded with success – I stabilized on my hands and knees.\n\nIf just getting on all fours was this difficult, I figured that walking or running was completely out of the question. So I crawled. I crawled through the metro tunnel. The dumb looks on the faces in the crowd lingered on me for weeks. I crawled under the turnstyle and onto the escalator.\n\nThe escalator spilled the rush-hour crowd onto the platform at the same speed a glacier spills ice into the sea. I looked out over the crowded platform during my interminable downward ride. The train status sign said the next train wouldn’t arrive for *twenty minutes*. Twenty minutes was like a year to me. I’d have to spend a year on the metro platform, waiting to die.\n\nI crawled off the escalator, enduring days of stupid expressions on the commuters’ faces. I crawled a few feet to a concrete bench and curled up next to it, trying to find a position to lessen the pain in my shoulder. Then my problem with time got worse. Impossibly worse.\n\nThe massive slowdown on the stairs was just the beginning of the interaction between the experimental drug and the Ambien. It fully hit me while I was curled up by the bench. I blinked. Years of darkness followed. Sound was already gone, and with my blink, sight was gone as well. All that existed was the pain from my fall.\n\nMy hyper-accelerated mind wasted no time compensating for the lack of sensory input. Voices spoke to me. They sung to me in languages that never existed. Patterns and faces and colors came and went in my mind’s eye. I recalled my whole life, and imagined living another. I forgot English. I settled into a profound despair. I spoke to God. I became God. I imagined a new universe and brought it to life with my thoughts. Then I did it all again. And again.\n\nMy eyes opened with geologic slowness. A faint glow. Weeks. A slit of light. Weeks. A narrow view of the metro platform – ankles of the commuters near me and an advertisement on the opposite wall.\n\nI extracted my phone from my pocket. A project that spanned decades. How can I even explain the boredom? The pain in my shoulder is nothing compared to the boredom. Every thought I can think, I have thought hundreds of times already. The view of ankles and advertisements never changes. Never. The boredom is so intense it’s tangible – like a solid object of metal and stone wedged into my skull. Inescapable.\n\nWhat are my options? If I crawl and fall onto the tracks without an oncoming train to crush me, I won’t die. I’ll experience even more pain from the four-foot fall, but I’ll most likely be rescued by some do-gooder on the platform and unable to act when the train finally does arrive. My suffering in that scenario will be endless.\n\nSo I wait for the train. So I can throw myself under it. When it finally hits me, I will experience the pain of being ripped to pieces for centuries until finally, the light of life leaves my brain, and my experience ends.\n\nI’ve lived hundreds of lifespans at the foot of this bench. I am far older, in spirit, than any human who has ever lived. Most of my life experience has been a snapshot of pain huddled on the floor of a subway platform, with an unchanging view of ankles and advertisements.\n\nThis post is my plan B. My Hail Mary. My long-shot. I’ve spent lifetimes typing and posting this message in the hope that someone will read it and become convinced that my suffering must end. Someone on this platform right now. Someone who will find the man curled under the bench, the man who crawled down the escalator, and kill him as swiftly as possible. A bullet to the temple.\n\nIf you’re armed and at the Glenmont metro, please shoot me.\n\n\n[pfd](https://www.wattpad.com/user/peterfdavid)", "comments": [{"id": "ewizx2m", "author": "strexpet-b", "body": "Nothing has ever stressed me out more than reading that, OP. Hope someone close by can help you out"}, {"id": "ewjclft", "author": "LampWithNoShade", "body": "If your metro has a 3rd rail DO NOT touch it without getting your hand wet. With a wet hand your resistance will be 1/100th of a dry hand and touching the 3rd rail (tallest) will kill you within a fifth of a normal second."}, {"id": "ewkuk5c", "author": "Sheeporoth", "body": "If you can feel pain for days, then you can also feel pleasure for days. Go squeeze the hog buddy."}, {"id": "ewj7fe0", "author": "miracleylee", "body": "Glenmont metro? Too close for home to me."}, {"id": "ewjj95y", "author": "HawkofDarkness", "body": "I'm by Shady Grove so just take the red line down over and I'll take care of it for you."}, {"id": "ewjrlsq", "author": "Hunter727", "body": "Maybe try to find a way to knock yourself unconscious? If you're knocked out for like 2-3 hours in real time that would be a huge amount of rest for your thoughts. Plus, by the time you're awake the drug may be worn off, or at least closer to it."}, {"id": "ewji3aw", "author": "chzits", "body": "Moral of the story: be careful with edibles"}, {"id": "ewjmjtc", "author": "akashy12", "body": "So is your brain just fast or has your IQ also increased?"}, {"id": "ewjj0bw", "author": "Skyhawk_Illusions", "body": "This is truly a painful way to die. I've heard of a minor anime villain killed this way and your description is quite accurate"}, {"id": "ewjgivx", "author": "calypso263066", "body": "That was agonizing to read. Very good, but very horrible. You know?"}, {"id": "ewjo1va", "author": "HEILALLAH", "body": "alright I'm coming"}, {"id": "ewjsmvz", "author": "AwakenFromComa", "body": "The amount of unimaginable horror this read has been is indescribable. I do not even like to think about what you’re dealing with. I know the thought is unbearable, but, shit, I hate asking this, but in the name of Science, can you endure this for the whole time? Somehow make peace, you have so much to offer to the world of Psychology. You’ve already been there for centuries, what’s a millennium? Or a few? Keep your eyes closed, and just lay there. You will be reborn, infinite in mind.\n\nI think you will regret choosing to die, as you watch everything end. Further, the Ambien likely hasn’t fully released yet, your death my last far beyond the time you think it to."}, {"id": "ewjxoqu", "author": "LexonBee", "body": "Is this what hell feels like?"}, {"id": "ewjoyft", "author": "TRES_fresh", "body": "Man, I take the red line to shady grove every day, not glenmont, so I'm sorry I can't help you."}, {"id": "ewjpzqd", "author": "fckEAgames", "body": "I have never been so horrified. Poor soul. I hope someone will grant you that sweet swift death of a few decades."}, {"id": "ewk0rh2", "author": "Soupbuoi420", "body": "Well, it's been 4 real-world hours, i hope the drugs finally wore off and your millenia of suffering ended :)"}, {"id": "ewjsiur", "author": "FKbuki", "body": "Such anxiety reading this..I feel for you OP..good luck..."}, {"id": "ewjyoh2", "author": "AshRavenEyes", "body": "This is why you dont mix and match drugs."}, {"id": "ewl01ed", "author": "ButtFucksRUs", "body": "I once had a dream where I woke up within my dream. Sat straight up in bed with a gasp and looked at the alarm clock on my nightstand. The numbers were jumbled and that's when I realized I was dreaming. Then this happened again, and again, and again...I stopped counting at 75 times. I realized that these wakenings were happening within a fraction of a second and I could live a thousand lifetimes lost in my own mind. Would I even know when I actually woke up? I don't know how long it went on before I legitimately woke up not too long after I'd originally fallen asleep. Maybe 5 minutes?\n\nSuffice to say, I wasn't the same person for quite some time after that. Good luck OP."}, {"id": "ewl452o", "author": "Aaron_Is_Err-n", "body": "One of the most complete and terrifying versions of Hell I've ever read. The most chilling part?....Posted 13 hrs ago."}, {"id": "ewln1ha", "author": "Jangalit", "body": "Mr David! I am so glad we finally found you! We tried to call you all morning but it looks like you don’t have your phone with you.\n\nWe sent out a equipe of  doctors to take care of you but I am sorry to inform you that we mistakenly gave you a bigger dose than you should have received. The effect should last 3 hours top because of the half-life of the compound, just be careful to not mix it with any non benzodiazepines because we think that the effects could be amplified and last much more\n\nBut don’t worry after just a couples days you will feel way better"}, {"id": "ewjy4am", "author": "LooneyBin17", "body": "Was saving this bullet for myself,but I'm coming.Hang in there,mate,salvation is at your doorstep"}, {"id": "ewkckpm", "author": "Mooliana", "body": "Well, with a brain working at this speed, it must use a lot of energy, like A LOT. \n\nSo it's just a matter of time till you collaps from exhaustion? \n\nAnd there's still the shock reaction from the fall / the shoulder injury that will probably kick in too at some point. Pretty life threatening afaik, but I have no clue how long that takes. But at least that's another chance of losing consciousness. \n\nWell, at any rate: Good luck, guess you'll need it."}, {"id": "ewjltp9", "author": "HapticSloughton", "body": "Question: If the drug made everything seem slow, how could you understand what the research assistant was saying at normal speed? Wouldn't their verbal communication sound like whale song at that point?"}, {"id": "ewkcy0q", "author": "HurricaneX31", "body": "Golden Experience's primary ability cranked up to 100 be like."}, {"id": "ewjye9c", "author": "AlexanderP04", "body": "That is terrifying on a whole new fucking level."}, {"id": "ewkf056", "author": "barreirobust", "body": "This is the scariest thing I've ever read. And can you imagine that someone finally shoots him but it's one of those cases in which the person takes long to die? That'd be the closest thing to hell."}, {"id": "ewjosb3", "author": "surprise_b1tch", "body": "Can you call the doctor's office?  Have them knock you out until the drug wears off?  It would take ages, but they might be able to help you."}, {"id": "ewkuzyz", "author": "Snakefoxbox", "body": "Today on fears I never knew I had: this"}, {"id": "ewjx7lx", "author": "CountryBoi69", "body": "I'm glad you dont live near Wheaton, home to the longest escalator in this hemisphere. This one hit way too close for me."}, {"id": "ewkyctn", "author": "SamediB", "body": "Good god, he posted this *11 hours* ago."}, {"id": "ewlksr0", "author": "Cat_Amaran", "body": "Even if the drug wore off at this point, what broken husk of a man would it have left behind? No, there's no mercy in trying to save him. The only kindness left is to kill him. He's seen too many lifetimes, suffered for an infinitely long time. He deserves the sweet release of death in the most compassionate way possible."}, {"id": "ewkjgfd", "author": "qwaszx937", "body": "Glenmont metro... red line... washington dc?"}, {"id": "ewjtvir", "author": "DerekLouden", "body": "I'm so sorry. How long has it been for you now since you posted? A century? A millenium? A universe? I hope the drug wears off soon."}, {"id": "ewjyc5d", "author": "kleevia", "body": "*sweet dreams are made of this*"}, {"id": "ewkbjc0", "author": "wishfulwarnings", "body": "reading this while waiting for the ambien to drop is scaring me out"}, {"id": "ewko5ab", "author": "Smash_Nerd", "body": "I have some cloreiform wipes. Don't even ask why. I can knock you out and take you back to the office. Don't worry. We can make it through this. I on my way. Hold tight, man."}, {"id": "ewlr6wz", "author": "_theglobetrotter_", "body": "This may be the worst thing I’ve ever read. Not in terms of actual writing, obviously, but in how stressful it was to try to comprehend. I can’t even begin to imagine how this has been for you, man."}, {"id": "ewn1kq8", "author": "Sablemint", "body": "Okay, so, I tried. Problem: No one can see you. You probably saw me staring for quite some time. All I saw was like... the way things look all wavy and distorted like when you see something above a very hot heat source only a LOT more subtle. If I didn't know something was there, I never would've noticed.\n\nOn the plus side, no one will rescue you if you jump onto the tracks. But at this point Im not even sure if anything can touch you."}, {"id": "ewk5x3o", "author": "AthiestLoki", "body": "I'm very confused as to why absolutely no one tried to help him before he got to the bench?   Surely someone saw him fall down the stairs?"}, {"id": "ewki4s4", "author": "Deigo_Brando", "body": "I have no mouth but I must scream."}, {"id": "ewkj4xl", "author": "Tendy777", "body": "How do you get to chapter *thirty* of Moby Dick without thinking something is seriously wrong?"}, {"id": "ewkzz6c", "author": "W2BJN", "body": "Damn OP, you shoulda just stayed in your apartment, pulled out a Hustler n rubbed one out... A 1 hour orgasm is hands down better than where you're at now. Unfortunately I am neither armed nor in your town... Best of luck to you!"}, {"id": "ewl4aof", "author": "CKColonel", "body": "Bro just drink milk then the effect goes away"}, {"id": "ewjnuod", "author": "WastelandHound", "body": "That's what you get for going to Ma-Ma's Mega City One Biomed."}, {"id": "ewkbrby", "author": "Monachopsisauruss", "body": "I’d think you need a blood transfusion ASAP to end this. I’m so sorry!"}, {"id": "ewkoviv", "author": "wolfboy180", "body": "Fuck you. Fuck you. Fuck you. Why did I read this."}, {"id": "ewk8y7h", "author": "JonnyThr33", "body": "I travel red line as well as metro buses sometimes. You see ads all the time for “test subjects”. Could never get myself to do it because of something like this."}, {"id": "ewkbzd0", "author": "dontcareitsonlyreddi", "body": "Thoughts and prayers"}, {"id": "ewkkepr", "author": "raine0227", "body": "I took too many edibles once and had no perception of time. It felt like this, and was absolutely terrifying when I thought about it and peaceful in between"}, {"id": "ewkri49", "author": "colddeadsoul", "body": "I was addicted to meth many years ago. What you’re describing g is exactly what it feels like when you’ve been awake for 10 days straight on that devil drug. I hope your suffering ends soon OP."}, {"id": "ewlaxw6", "author": "StarrySkye3", "body": "I'm so sorry dude. I totally understand this. One time I got waaaaay too high, and my tolerance is really low. It felt like I was high for like three years instead of four hours. I had a literal ten second memory. I was anxious the whole time. Worst experience ever."}, {"id": "exv9bxw", "author": "RyanJitsu", "body": "BREAKING NEWS: Homeless men under benches in subways continue to be found shout dead."}, {"id": "ewkpeqt", "author": "RogerInNVA", "body": "I’ve been firing this Glock from across the station at the back of your head ... if only you could know that I have come at last to end your suffering. The more I hope for your speedy passing, though, the slower the bullet spirals in its rush to your skull."}, {"id": "ewkvt27", "author": "nicholastaii", "body": "This was written in 10,000 spiritual years; 5 seconds real time"}, {"id": "ewlsca2", "author": "xbrent07", "body": "Orgasming in this state will feel so much better though, you should try it."}, {"id": "ewmo2ir", "author": "Point_bleak", "body": "This is so scary, it hurts my brain. I slept after reading it and kept waking thinking it is happening with me."}, {"id": "ewq717r", "author": "Silvermoon424", "body": "This sounds like literal hell."}, {"id": "ewqty7d", "author": "justasmalltwngirl369", "body": "And today i discovered my worst nightmare. Absolutely anxiety inducing"}, {"id": "ewz2vm5", "author": "Banner-Man", "body": "Why the fuck would you take Ambien while under the effects of an experimental drug????  Thats like rule number 1 dude dont mix drugs."}, {"id": "ewk0k00", "author": "Oshni", "body": "This is awful. I wish for nothing but your release from this curse."}, {"id": "ewk15ev", "author": "Cavelli", "body": "Damn, what a fate. I wish I can shoot you man!"}, {"id": "ewkmgwi", "author": "j_memes", "body": "Are you in the DC area I wanna know where you got this drug"}, {"id": "ewkmq6j", "author": "Principatus", "body": "Before you took the Ambien I was thinking, a motorbike would have been your best friend. Too bad that never happened"}, {"id": "ewkmxt1", "author": "gabbyzay", "body": "This was so stressful to read. Someone please put this person out of their misery."}, {"id": "ewkp42j", "author": "rjkelly31", "body": "Jesus, this is really scary. I was reading this too and felt like my brain was moving in fast motion and the rest of the world was in slow motion. I hope I didn't take any of that drug too."}, {"id": "ewkxb3e", "author": "Icalasari", "body": "Hmm, if a depressant did that, then wouldn't an upper like ritalin or amphetamines counter it?\n\nAlso, how can I sign up for this trial? So long as I don't use it with sleep meds, I think I could handle the slow speeds for a while. Might actually get some fucking work done..."}, {"id": "ewl33g8", "author": "PrincessDaisyDoll", "body": "I’m not sure how you did it, but you managed to make my existence feel slower as well. Very well done."}, {"id": "ewm7u5i", "author": "KingVecchio", "body": "Good luck OP hopefully some crazy serial killer doesn't read this and decide to seek you out and torture you because they know your death will take 1000s of years from your perspective."}, {"id": "ewmbiis", "author": "Freakin_Jedi", "body": "God this is possibly one of the scariest or worst experiences I have read here.  As someone who gets bored too easily, this is pure nightmare fuel."}, {"id": "ewmlqup", "author": "quesojacksoncat", "body": "truly terrifying. feels like a bad, eternal psychedelic trip."}, {"id": "f65rn5y", "author": "the_flying_blo", "body": "Due to the frequency shifting, can you hear ultrasonic noises you normally wouldn’t be able to hear?"}, {"id": "ewk6t92", "author": "kebabyy", "body": "I'd assume OP might die pretty soon from their brain being so overstimulated.\nHow could normal braincells survive so much activity?"}, {"id": "ewkhmsz", "author": "phantom3199", "body": "OP, by any chance was your story influenced by psychedelics?"}, {"id": "ewkb2ti", "author": "emptyfiel", "body": "I too take the Glenmont train, they don’t call it the dread line for nothing."}, {"id": "ewkfr9t", "author": "Eugene1206", "body": "Someone should contact the office, so they can bring the cure to him, even if it takes decades."}, {"id": "ewkl5ok", "author": "virgo911", "body": "Wow, I have a new fear. And I was just about to try shrooms for the first time too."}, {"id": "ewkmbg8", "author": "PiperSecrets", "body": "I will have a nightmare like this tonight."}, {"id": "ewkob8q", "author": "Mephil79", "body": "This sounds like the worst possible fate."}, {"id": "ewktax7", "author": "Mail540", "body": "I have ADHD. I would go insane"}, {"id": "ewktdfv", "author": "Jimmyrunsit", "body": "Imagine carrying him to the drug place for treatment and you get there and it says \"closed for the weekend\"."}, {"id": "ewkuw16", "author": "BigGayHomoDC", "body": "OMG at least you didn’t take the Wheaton escalators."}, {"id": "ewkw1na", "author": "Harut02", "body": "I wouldn’t mind having time seem like taking 10 times longer"}, {"id": "ewl2c7l", "author": "daddydonald69", "body": "I like to imagine that since this was posted hours ago he is sober now and doing much better even though he has lived for eons."}, {"id": "ewleod7", "author": "JPTheOwlBlacksmith", "body": "Even though time is passing this slowly for you, you still used correct grammar. I applaud you."}, {"id": "ewlg0kb", "author": "isabelladangelo", "body": "They let you out of NIH in that state?  Really?"}, {"id": "ewmpink", "author": "Buy_The_Stars", "body": "In other words, his time slowing powers is just the feeling of being at work.\n\n\"It felt like an eternity though it was only a few minutes.\""}, {"id": "ewna3fk", "author": "Leafy81", "body": "Damn. For some reason I read this very slowly, like my mind sympathetically slowed down or something."}, {"id": "ewxxipx", "author": "iamrobotguy", "body": "This gave me so much anxiety. My mind is melting."}, {"id": "eyc48vx", "author": "hunterc1310", "body": "Probably the scariest story I’ve read on here, simply because the thought of being trapped in my own head for thousands of years sounds terrifying. BTW, OP you good now?"}, {"id": "eydyykw", "author": "vagamund00", "body": "It is clear you have lived many lifetimes, for this passage is a masterpiece."}, {"id": "eyebk3q", "author": "Scottsman2237", "body": "It’s been 18 days. Dead yet? How’s life if you’re not?"}, {"id": "eymym23", "author": "venusmud", "body": "OP managed to remember and relate a story with no typos (why would they go back and correct) or autocorrect mishaps and ALSO maintain a consistent written style.\nFeel like it should be just:\nHel0nmsemhshsbshwkssjsosbzjxosj"}, {"id": "eyxgvtd", "author": "NOT-A-THOT", "body": "Got hit by golden experience"}, {"id": "f4r8j2j", "author": "HugeRickk", "body": "Thankyou OP, this is one of the best short stories I've ever read and you have made a lifelong fan out of me. Nothing has ever made me so anxious while reading in my entire life lol"}, {"id": "f5m9ebg", "author": "kayellemenope", "body": "If you begin to speed-up, if the effects begin to wear off, just so that you won't spend those centuries alone, I will spend the time with you. I can't type very fast, but maybe 45WPM I'll make my messages short, but frequent and ask you Y/N questions, so you only have to touch two keys to send messages. I'm nowhere near Glenmont - it would take me a million of your lifetimes to reach you. Hopefully, these drugs, even combined will not last longer in my time than they ordinarily should, (not that it would much matter to you at this point) but, if you need help electrocuting yourself... \n\nI hope whatever the best scenario is, it works out for you and when this is over, if you can that you sue that company until you own their asses, no matter what \"agreements\" or \"waivers\" you signed. If you do decide to spend the infinite time on it, feel free to tell me the name of the company, the location of that office and yours and I'll call 911 for you. I'll report them, as well.  There is a drug that counteracts benzos, it may work on the ambien and there might be something to counteract the other drug you took. I'd suggest activated charcoal, or induced vomiting except it seems the meds are already in your bloodstream. Maybe caffeine? ...A century to get a coffee, though?   \n\n\nIf you are still sane and able to function when this over, please lmk. I'll be sending whatever hope and love and good thoughts I can at the speed of thought. Good Luck, OP. Reply Y for messages. Reply 9 for 911 Reply E for instructions on electrocution."}, {"id": "ewlb2tv", "author": "mfiasco", "body": "Jesus Christ.\n\nOne of the first horror stories that scared the shit out of me when I was young was The Jaunt, and this is exactly what I imagine it was like for that kid. An eternity. That story haunts me and so will this."}, {"id": "ewkkd71", "author": "OrangeAcidd", "body": "This was so insane and intense and crazy and nuts and amazing. Holy shit."}, {"id": "ewkpepu", "author": "Poot-dispenser", "body": "Dude imagine having a mind literally faster than the flash’s first lightspeed footstep"}, {"id": "ewkq8ef", "author": "allicekitty13", "body": "I truly hope you're able to be cured and go on to make a film about your experience."}, {"id": "ewktcz5", "author": "Kamon0253", "body": "Don't mix drugs fam especially expiremental ones. Im sure you can no longer truly fathom panic but a shot to the head would case one hell of a panic in a Subway station."}, {"id": "ewkxh8r", "author": "Bruce_Ring-sting", "body": "Ill hit your hippocampus."}, {"id": "ewkznx8", "author": "Adra1481", "body": "OP, I live in DC, too. I’m coming for you, just hang on."}, {"id": "ewlhrf7", "author": "CherolesDankster787", "body": "Imagine being strangled or set on fire. You'd feel every capillary vein in your eyes pop and the air draining out of your body like mud going down a dry hill. If set on fire you'd have to feel your white meat sizzle and smell everything burning. The smell mix of burnt hair with your body fat bubbling like hot oil on a frying pan and your blood running through your veins start boiling as your veins start to clot and expand due to heat at the same time that everything liquidy in your body starts to solidify and what doesn't solidify start to drain through your porous areas which is all your skin. Imagine feeling all those things, and every thing that happens to a burnt body, all individually and at the same time as time passes. Wow! Now I can't unthink any of this."}, {"id": "ewli9py", "author": "MundaneTranscendant", "body": "This man got to test some experimental extended-release salvia."}, {"id": "ewlpxvm", "author": "360Turn", "body": "Just drink milk it gets rid of poison"}, {"id": "ewlqvcy", "author": "Zrin-K", "body": "At first I thought \"you could join an eSports team and never lose\" and now I really want you to die. Please someone kill them."}, {"id": "ewlvpwz", "author": "manu6287", "body": "Talk about no sleep"}, {"id": "ewlw2bi", "author": "indecisive_maybe", "body": "This is important for the medical people to know. \n\nMaybe a friendly masseuse will come by and massage your sore joints for a few millenia. Would that help? This has to wear off sometime. \n\nAnd they can probably make special equipment for you. So much technology is limited just by what normal humans need, but they can make internet that loads much faster, maybe keyboards that are guided by thoughts or eye direction rather than mechanical touching, so you won't need to be bored again. \n\nYou'll have a million lifetimes to do whatever you want. Be strong, now, and I hope you make it through."}, {"id": "ewmy5to", "author": "10yearsofsolitude", "body": "Shiiiit this stressed me out just reading it. Took me right back to a crazy bad trip I had in Amsterdam after taking some shrooms..damn OP good luck"}, {"id": "ewt7h9i", "author": "dvzn", "body": "That's why you don't take one substance to cancel out the effects of another, let alone experimental one. Should've waited for it to wear off, OP"}, {"id": "ewtngyv", "author": "n0ledge1", "body": "Hold your breath until your unconscious. It's probably going to speed up time if your mind is switched off. Do this until the effect wear off or until you are in a better position to do what you gotta do."}, {"id": "ex0tfj5", "author": "PlanetVagina", "body": "How I feel stuck in Seattle rush hour traffic."}, {"id": "exbkkgm", "author": "Somebloke_", "body": "This made me feel so uncomfortable"}, {"id": "exrgqwu", "author": "Lucky_Island", "body": "I would love to help you but a drive there would take me like a whole 2 hours. Sorry!"}, {"id": "eyq87oc", "author": "Pomqueen", "body": "Never envying my friends who get to take drug trials again. They get to get high and stay in a hospital setting for like 2 weeks and be fed and taken care of while they take pain killers or get high and chill out send play video games and shut and walk or with over 5 grand. \nNo amount of money would be worth this type of hell. Reading it made me feel how awful that would be. Hopefully someone helps you SOON. Like under a decade or 5.."}, {"id": "eysxzj2", "author": "Ummah_Strong", "body": "Bad bad bad trip"}, {"id": "eyws61s", "author": "chandlerinyemen", "body": "This gave me an incredible amount of anxiety."}, {"id": "eyxwrf5", "author": "cunthtml", "body": "whoa....first time something like this was happening near my area...what can i do to help\nother than shoot"}, {"id": "f4o8d8g", "author": "jodi5315", "body": "Fake an overdose & when the emts arrive (centuries later), they will administer Narcan. That should throw your body into withdrawals. OR try in whatever way you can to find something similar, like suboxone. It will also eliminate the drug from your system.. hopefully. If I were closer, I would help. I'm so sorry. \nTry texting 911."}, {"id": "f4ymxmx", "author": "SpiderStratagem", "body": ">My ordeal started over ten thousand years ago, at 10:15 this morning.\n\nWhat a spectacular turn of phrase.  Bravo."}, {"id": "f6b1qyi", "author": "DeArctic", "body": "imagine having sex or wanking in this state"}, {"id": "f9akzra", "author": "notubutme2", "body": "Imagine having sex tho"}, {"id": "f9bp5k7", "author": "varungupta3009", "body": "This was an excellent read!\n\nI'm not at all criticisising any line of this story, but I'm curious, just from a scientific point of view: Due to the biological nature of the brain, doesn't it process information as fast as it can? And can a drug change the biology in such a way that it could process information faster than these mortal bounds? Also, could someone notice the clock rate of the brain in this situation? Could the frame rate of the eye be recorded? Can a person endure decades of 0 human contact or just this kind of \"out-of-reach\" infuriating situation?"}, {"id": "fbt85hr", "author": "GrumpusMcMumpus", "body": "The answer to the Fermi paradox is of this nature. Advanced life develops the ability to exist at a much higher degree of frequency. It doesn’t try to communicate with us for the exact reasons you articulated in this piece. \n\nGreat story. Really enjoyed it."}, {"id": "ewkkbpk", "author": "mypolarbear", "body": "Man OP I live right by there. I dont have any guns though, so sorry. Besides Im on vacation at rue beach righy now! I hope you die soon! <3"}, {"id": "ewkgc83", "author": "Imthepumpkinpossey", "body": "Ya need my help my dude???"}, {"id": "ewkkwm0", "author": "glitter_hound", "body": "This was epic, and terrifying!!"}, {"id": "ewkwnpr", "author": "legsuptothere", "body": "I was there this morning"}, {"id": "ewky7rm", "author": "kool_dildo", "body": "Op, I think your best option right now is to sit there with both of your middle fingers in air and hope some chad would get mad enough to knock you out.\n\nAlso I think that if you do throw yourself under the train you should leave a note (similar to this post) describing the drug, so that they know not to give it to anyone else.\n\nBonus: since you have so much free time you could learn another language (or two).\n\n[Edit]: downloading Duolingo would probably take a bit of time."}, {"id": "ewl03wg", "author": "adeiner", "body": "I used to take the Metro from Glenmont to Eisenhower Avenue. Somehow your train ride was longer."}, {"id": "ewl0c9h", "author": "memesmemes69420", "body": "while reading this i felt like *my* time was slowing down"}, {"id": "ewl16m8", "author": "Mamabat67", "body": "And I'm supposed to sleep now? I am so stressed and totally wigged out bu this amazing story that my hubby will have to pry me off the ceiling...oh, and I don't think I'll complain about things taking too long for a while!"}, {"id": "ewl2h1h", "author": "Thefatpug512", "body": "I felt physical pain reading this. Well, one thing is clear you experiencing centuries really made you an amazing writer. Sorry for your suffering"}, {"id": "ewl4euk", "author": "pussycatbrat", "body": "The irony of you reading 100 Years of Solitude. My favorite book, but an unfortunate irony."}, {"id": "ewl5yba", "author": "ElyssaisDead", "body": "you just gotta accept it mate, learn not to be bored and do some fun shit or somethin, count your breaths, idk. have fun with what you have"}, {"id": "ewl7swf", "author": "ch017", "body": "This is how the top athletes feel playing sports"}, {"id": "ewl94c2", "author": "randathrowaway1211", "body": "Jesus Christ.."}, {"id": "ewla7lo", "author": "Pokorro", "body": "Well OP... good thing you didn't need to go to the bathroom that entire time."}, {"id": "ewlcn18", "author": "ClassiestRobin", "body": "What company  did you drug from? Maybe someOne on here can contact them for you. Maybe find a counteractive drug."}, {"id": "ewlder5", "author": "Kylo-The-Optimist", "body": "One of the best worst things I've ever read."}, {"id": "ewle1ne", "author": "vadepade", "body": "This legitimately sounds terrifying. Great job, OP."}, {"id": "ewlevil", "author": "letmegoletmego", "body": "I'm coming."}, {"id": "ewlgupq", "author": "IntergalacticAssClap", "body": "Not gonna lie, I'm a little hesitant about going to sleep now... I always have really intense dreams. I'm definitely going to suffer tonight."}, {"id": "ewlittw", "author": "LexLuthorIsGod", "body": "I'm at Clarendon, don't think I can get to you anytime soon. Good luck!"}, {"id": "ewljgtb", "author": "jenSCy", "body": "Op, copy and paste this into a text and send it to the researchers."}, {"id": "ewljmxa", "author": "Zivano_", "body": "It's been 19 hours since you writed this, is your nightmare finally over?"}, {"id": "ewlkxvp", "author": "mockingblue_dabird", "body": "And the million dollar question... where can I get some of that stuff?"}, {"id": "ewlldf2", "author": "fallout_predator", "body": "Is this me or i also experience a slowed state of mind."}, {"id": "ewlmm4v", "author": "LunaticRonin", "body": "You should have tried morphine or other anesthetics first. It could have take you out"}, {"id": "ewlnb2v", "author": "MeowMyOvaries", "body": "Jump in front of a train?!?! What are you waiting for!?!"}, {"id": "ewloh72", "author": "pinguxxx", "body": "this sounds like he perfect hell"}, {"id": "ewlp0jd", "author": "InkSpiller333", "body": "This was the most terrifying account I have ever read on nosleep."}, {"id": "ewlp6ym", "author": "Worsehackereverlolz", "body": "I'm 15 minutes away from Glenmont! I'm bringing the Shotgun!"}, {"id": "ewlpi5t", "author": "RZRHED", "body": "Had to come back and post this. Went to watch porn after reading this and I swear this gifs were moving a lot slower! Your story is fucking with my head, OP!! God speed..... or your speed, I guess...."}, {"id": "ewlqh06", "author": "NoahiscoolBOI", "body": "Is a shotgun good?"}, {"id": "ewltydw", "author": "IcyMastodan", "body": "Man, this must suck for you OP. At least now we know how Szayel felt when \nKurotsuchi used his mega drug on him. Who knows, maybe this drug testing place is just a front for the 12th Division of Soul Society to test drugs and such and you got the same drug."}, {"id": "ewlzhmn", "author": "M0n5tr0", "body": "You will have to watch the bullet creep towards you and handle all the pain of it burrowing into you until it hits a vital spot.  \n\nYou don't have to reply op butim wonder if there isa faster way to end it without the length of torture a bullet would cause?"}, {"id": "ewncuvc", "author": "Broadsider_", "body": "Aye man just pop a benzo"}, {"id": "ewpjtv9", "author": "scarlettbrohansson", "body": "This is unbelievably horrifying to read because I've had a somewhat similar experience.\n\nThe first time I ever got high (just weed, my body is weird), I got too high too quick. I felt awesome and like I could think really fast and efficiently. I thought of and thought through so many things. But my body was really slow and I swore I could feel every bit of muscle moving slowly as I tried to move. Things were good for 15 minutes or so, what felt like an hour or more to me. But then I realized I wasn't able to communicate because I thought the words faster than I could speak them, so they came out mostly garbled. Then my panic disorder kicked in full gear. I had a meltdown and convinced myself that my voluntary and involuntary muscles switched control and that I had to think to breathe and have my heart beat, but my legs and arms would not stop moving beyond my control. Then I convinced myself that I had locked in syndrome and needed to be killed while I could still somewhat communicate. My sister shoved an Ativan into my mouth and made me swallow and I passed out 30 minutes later. All of this happened over the course of maybe 90 minutes, but it felt like hours and hours or even days. Something similar but less intense happened to me years later, too.\n\nI figure that the high I get is typical, but the way my fucked up, anxiety prone brain experiences and processes it makes it a living nightmare for me. So yeah, this fucked me right up lol"}, {"id": "ewqjtbw", "author": "YodaVsRudolf", "body": "Wait this is a joke right"}, {"id": "ewskner", "author": "leafthatshithomie", "body": "It must have worn off by now. I hope he lived, he has a hell of a part two to tell.."}, {"id": "ewsxcst", "author": "Ixolus", "body": "I wonder what would have happened to OP if he DID manage to fall asleep. It would probably have fucked him completely mentally. He would eventually learn to lucid dream and then just be a GOD for EONS... Really interesting concept..."}, {"id": "ewwj5zu", "author": "Abastula", "body": "Dummy quicc"}, {"id": "ewz25h0", "author": "flcwerings", "body": "its been a couple of days. You good dude?"}, {"id": "ewzbcjh", "author": "AlanTheAlien1442", "body": "op, i’m coming. it’ll be as quick as i can make it"}, {"id": "ex0v19e", "author": "Fredd8", "body": "Congratulations. You discovered ADHD."}, {"id": "ex19h0j", "author": "Hojothepro", "body": "So it’s been 5 days for us... how’s it going for you man?"}, {"id": "ex3wx11", "author": "jennyg1313", "body": "Reading this just gave me a massive trip. Well done."}, {"id": "exh5kaa", "author": "Mix_Romney", "body": "Just read this OP, hope someone helped before the week it took me to see this"}, {"id": "ey9toqi", "author": "life_of_stich", "body": "I need what you took"}, {"id": "eyooxkn", "author": "Marnav_the_Sad", "body": "Basically Mayuri's poisonous gas"}, {"id": "eyrpjy8", "author": "Zoinksssssssssss", "body": "Hi, I saw you are online again, what happened?"}, {"id": "eysacl4", "author": "Paxite", "body": "I want it"}, {"id": "eyy3ipf", "author": "robynanna", "body": "So its been awhile now... I'm just wondering if you died or if the drug ever wore off or what?"}, {"id": "ez31ahx", "author": "DDsLaboratory", "body": "OP, it’s been 25 days now. Are you alive? How long have you been in existence?"}, {"id": "ezn01vl", "author": "boppaboop", "body": "Helium and balloon over the head. I hear it's a pleasant painfree way to go. That's what i'd choose."}, {"id": "ezqvfp8", "author": "DashJumpBail", "body": "\"mélange of farts,\" was my favorite part"}, {"id": "ezxmi2l", "author": "MarsNirgal", "body": "So... how's it going?"}, {"id": "f0acwqr", "author": "ReblQueen", "body": "If you forgot English how did you type this?"}, {"id": "f0lrcos", "author": "NoRagretsMaybe1", "body": "u/thebettertwin123"}, {"id": "f1gn1mv", "author": "avliam", "body": "Made a short film based on this guy's experience. Check it out right here: https://youtu.be/pkTNhn2wClY\n\nAnd btw OP, i hope you've recovered by now. i know the drug has worn off, but the everlasting psychological effect must've been horrible..."}, {"id": "f1kzb99", "author": "Maliagirl1314", "body": "This is difficult.... Very stressful to even imagine. I have no ideas for you but I can only hope the meds wear off soon.  \nAlso, I hope no one kills some poor guy who took a nap on the ground. Better make sure it's you before they shoot 🙂"}, {"id": "f1mb03f", "author": "throwaway-person", "body": "This... This is my phobia... This is also the first time I started panicking enough during a read here that I had to stop..."}, {"id": "f2ojis9", "author": "JLW2710", "body": "This was so excruciatingly  stressful to read. I felt like I was about to have a panic attack just reading about the hell you are in. I hope by now someone took care of you, or the drugs wore off!!"}, {"id": "f327lqb", "author": "Ashenveil29", "body": "This shit is what happens when you cross darkseid. \n\n\"Behold...an endless death.\""}, {"id": "f3u8lej", "author": "smuushi", "body": "This whole story had me STRESSED"}, {"id": "f4ogg3i", "author": "EPIKGUTS24", "body": "korega... requiem da."}, {"id": "f4v4bwg", "author": "Rookie117117", "body": "I mean... I'd just get comfy in bed and have some 'me' time, all the time."}, {"id": "f5kn563", "author": "znels04", "body": "umm OP how am i supposed to explain that i straight up just murdered someone though?"}, {"id": "f5lwx5x", "author": "coldycat", "body": "I don't envy you living an Ito Junji story!"}, {"id": "f7xg6l8", "author": "CollegeStudentTrades", "body": "The styling of the intro reminded me of borderlands"}, {"id": "f98n720", "author": "MacFyver", "body": "This is officially my second favorite nosleep (close second to search and rescue). Beautifully written!"}, {"id": "f9aikar", "author": "ifoughtpiranhas", "body": "fuck i NEED to read the rest of this, but if i throw it in my saved posts it’s gone forever. sooo good so far."}, {"id": "f9ewbei", "author": "Rinkushimo", "body": "IS THIS ACTUALLY REAL WTF?"}, {"id": "f9ufw57", "author": "eteague30", "body": "Holy shit this was amazing"}, {"id": "fa4ugts", "author": "Tolkienside", "body": "Ah, the good old Jaunt effect. There's not much scarier than that."}, {"id": "faokhvf", "author": "hangslampshade", "body": "Hmm... could you tell us what doctor or researcher it is you went to for the testing, maybe? It's not going to help your situation now\\*, but somebody reading this post could surely forward it to them- and if they did, at least the research team would be able to better council the other people in your experimental group about the medicine's side effects and they could call off the entire trial- or at the very least, make an antidote, or caution other people to avoid combining Ambien or other meds with it.\n\n\\*speaking of... if you experience a second as centuries, does that mean you have no concept of \"now\" anymore, or that your now is endless?"}, {"id": "fbtdvow", "author": "christrage", "body": "That’s some true old timey no sleep and I love it. Rare"}, {"id": "feq0l0c", "author": "forevergallifralone", "body": "hey man it’s been a while. how are you doing now?"}, {"id": "ffkuch8", "author": "Ultimateace43", "body": "I'm late as all fuck op, but if you are still there and happened to have some Stephen king books in your apartment when things turned to shit... Your story reminds me of \"The Jaunt\"  this story and that story are the only two stories to ever fuck with me this hard.  \n\nTime slowed for ME as I was reading it."}, {"id": "ewk2nfw", "author": "k3vanwong", "body": "OP you should consider a career in professional esports"}, {"id": "ewk4kij", "author": "Bot_number_1605", "body": "Your post didn't evoke a normal fear in me, most posts don't anyway. Your post made me feel so incredibly bad for your suffering that it was much worse than anything on here."}, {"id": "ewk5r1d", "author": "fossil_insurance", "body": "Tbh that's how I feel waiting for a train at the Glenmont metro, too"}, {"id": "ewko47x", "author": "Jroolin", "body": "SUPERHOT is the most innovative shooter I‘ve played in years."}]}