{"id": "declk8", "title": "Spacegirl", "url": "https://www.reddit.com/r/nosleep/comments/declk8/spacegirl/", "subreddit": "nosleep", "author": "HeadOfSpectre", "text": "We called her Spacegirl.   \n\n\nHer real name was Megan Daniels, but nobody actually called her that. She’d been Spacegirl since Grade 2. She was the kind of kid who stuck out in the crowd with her long red hair, ghostly pale skin and coke bottle glasses. For as long as I’d known her, Spacegirl had been quiet. She didn’t like to be around us. She didn’t play with us when we were kids, she didn’t even talk much.  \n\n\nMost of the time, she’d find somewhere to sit, far away from everyone else. Then she’d open up her little notebook and scribble inside of it. Sometimes she wrote poems, sometimes she drew. But she was always off on her own little world. Nowadays, I understand why we targeted her. She was different, and she was alone. That doesn’t justify any of it, but kids can be cruel. I remember that it was Sasha Brown who told me that Spacegirl was retarded because her Mother was on drugs. She probably just made that up. But we all believed it. She had always been the worst towards Spacegirl, and she kept that up until the end.   \n\n\nIt all started in Grade 5 when Sasha took her notebook.\n\nIt had been raining that day, so we’d had an indoor recess. Spacegirl sat in the corner at her desk, eyes focused on her notebook as she methodically worked on a drawing. Sasha and I had been sitting nearby at our desks, and we simply just watched her do her thing.\n\n  “I can’t believe they let that retard sit in with us.” Sasha murmured, “Look at her… Why do they even let them in schools? They aren’t gonna learn anything.”  \n   “Better than leaving her at home with her crackhead Mom.” Said Tanya Evrett. She and I weren’t exactly friends, but she sat close to Sasha and I. “My Dad says he sees a different car in front of her house every day. He says that she lets boys come and they pay her so they can have S-E-X.” None of us could actually say the dreaded S word at the time. Sex was still a terrible unknown thing, and we all had been raised to believe that nobody decent would ever do it.  \n\n\nSpacegirl paused, and her eyes darted away from her book, to look at us. I can only imagine she’d heard us. Sasha just stared right back at her.   \n\n\n  “What? Do you have a problem, Spacegirl?” She asked. The Teacher was out of earshot, and that gave her carte blanche to say whatever she wanted. Spacegirl didn’t respond. She just looked back down at her notebook, but Sasha had been challenged (or at least she thought she’d been). She looked over to the Teachers desk to make sure she was busy, then she got up and moved closer to Spacegirl. \n\n  “What are you even doing in there, retard?” \n\nShe’d reached out to snatch the book before Spacegirl could stop her. \n\n  “What even is this? A Unicorn? What are you, five?” \n\nShe handed the book to me, and I took it on instinct. There was a brightly colored drawing of a Unicorn inside. The artwork was actually pretty nice, but I would never have said so. The book was passed on to Tanya next, and Spacegirl could only look at us helplessly. \n\n  “Wow. You can’t even draw. Look at this?”\n\nShe tore the page out of the notebook, and Spacegirl let out a startled whimper, as if she’d been struck. The picture was crumpled up and the book was thrown on the floor by Spacegirls desk.\n\n  “Draw something that isn’t trash next time.” Tanya said, and Sasha just giggled as if it was anything other than being mean spirited just for the sake of it. \n\nSpacegirl slowly picked her book up off the floor, avoiding eye contact as Tanya and Sasha turned away from her. I continued to stare. I remember that the way she moved was so defeated, as if she were shrinking in on herself. She looked up at me, but only for a moment and I felt bad for her. I really did. But I didn’t do anything about it. I just left her to rejoin the others.\n\n&#x200B;\n\nAfter that, Spacegirl became an easy target for Sasha and Tanya. Every chance they got, they’d harass her and I regret to admit that I was usually right there with them.\n\nDuring the days where we could go outside for recess, Spacegirl would always sit beneath the same tree, always working in her notebook. When she did, we would always lean on the trunk and look down over Spacegirls shoulder.\n\n  “Wow, that’s really good, Spacegirl.” Was how most of her comments would start, “Did you mean to draw it like it got hit by a truck, or is that just your style?”\n\nThere was never a compliment. She would always find something to needle.\n\n  “Can you draw me?” Sasha asked once, “I heard that retards were always like, art geniuses or something. Maybe it’ll even look like a person!”\n\nSpacegirl didn’t look up at her. She seemed to be trying not to acknowledge the insults. I won’t pretend like I was blameless either. I never stopped them, and there were plenty of times where I was right there, making fun of her because that was what we did, and we weren’t the only ones. More or less everyone hurt her in some way or another. But she never complained. I think she was too scared to.\n\n&#x200B;\n\nIt was late December in 7th grade where things got even worse. I don’t know all the details, and I don’t know just for how long things had been boiling over, but I’d heard a rumor that James Hardy had it out for Spacegirl.  \n\n\nJames had only been in my class a few times, and he wasn’t in my class that year. He was a small, mousy looking kid who was convinced he was the world's toughest gangster. The rumors said that someone had seen his Dad going into Spacegirls house. Naturally there had been speculation that they'd been having sex. Someone told me that James’ parents had been divorcing because of it. Somehow all of these rumors had mutated into claims that James and Spacegirl were dating and I think that was what had rubbed him the wrong way.  \n\n\nWe were coming in from recess when some boys decided to pull a little prank on James. The whole prank had been set up by Brian Jordan and his brother Mike. They had some mistletoe for the Holiday season, and had set it up in the hall leading back to our classroom. Mike had grabbed Spacegirl during recess and were holding her behind the door where the mistletoe was. When James walked through, they pushed her at him and snapped a picture. I’d been just behind James when it happened. I watched as Spacegirl came flying out of seemingly nowhere, eyes wide and afraid, then slammed into James. They both hit the ground, and I could hear the other boys laughing.  \n\n\n  “LOOK! She wanted to give you a kiss!” One the boys said. Spacegirl was trying to crawl away from James and pick up her notebook, but somebody had kicked it out of sight. I remember that she looked back towards James, and there were tears in her eyes. She must have been terrified with everything that was going on. She clearly hadn’t wanted any part in this, but there she was at the center of it.\n\n “You fucking faggot assholes!” James yelled as he picked himself up.\n\n  “Hey, she just wanted to give you a smooch!” aughed Brian, “Come on, give her a kiss!” \n\nSomeone pushed Spacegirl towards James, and he glared at her as if all of this was her fault. She tried to stand and run, but he was angry and he wasn’t thinking straight. I watched as he grabbed her and hit her. A square punch to the jaw. Then he tossed her to the ground and went after Brian next. A teacher had to get in to pull James off of him. He, Spacegirl and the Jordan Brothers ended up getting suspended right before the Christmas holidays. We didn’t see Spacegirl until January… we didn’t see James or his friends ever again. \n\n&#x200B;\n\nOn Christmas Eve, there was a car accident on the highway outside of my town. Supposedly it had swerved off the road to avoid an animal of some kind, and gone into a ditch. Mike, Brian and their parents didn’t survive. On December 27th, James was killed while outside shoveling his driveway. My Parents told me that he’d been attacked by an animal. Probably a deer or something. But that seemed so unusual… I’d never heard anything about deer attacking people before. Especially not in my area.  \n\n\nI went over to Sasha’s house on the day before New Years. We’d both gotten some gift cards for Christmas and we were planning to walk to the mall together to use them. Her parents weren’t home, they both had to work. So it was just us when I got there.\n\n  “Hey! Kept me waiting!” She said when I knocked on the door.   \n   “Sorry.”   \n   “It’s fine. I’ll be ready in a bit. Come on upstairs, I wanna show you something!”\n\nI didn’t question what it was. I figured it was just something else she’d gotten for Christmas, so I went upstairs with her.\n\n  “You’re gonna love it.” She promised me, “It’s gonna be so funny…”\n\nShe led me to her bedroom, and as soon as she opened the door, I spotted a familiar notebook on her desk.  \n   “Where did you get this?” I asked, walking closer to it.\n\n  “Spacegirl dropped it when Brian and his Brother pulled that prank the other day, she dropped it. I may have grabbed it… Y’know. Just for safekeeping.”  \n\n\nShe cracked a wry grin, before opening the notebook.  \n\n\n  “Look at this… She’s been drawing the same damn Unicorns forever. She didn’t even finish this one!”\n\nShe paused at one small picture that was labeled ‘The Unicorn Prince’. It depicted an empty field with a blank space where the titular Prince should have been. Sasha flipped through the pages a little more until she got to the newer ones.\n\n  \n  “I figured since they kicked Spacegirl out for a little while, and her Mom is too poor to get her anything for the holidays, I’d step up! What do you think?” Sasha wasn’t anywhere near as good of an artist as Spacegirl was, but the simple detail in what she had drawn turned my stomach.\n\n  \nIn her first picture, Spacegirl was hanging from a rope. Her tongue was hanging out, and her eyes were closed.   \nIn the second one, Spacegirl had a gun in her mouth.   \nIn the third one, she was standing on the edge of a building. \n\nSasha giggled as I flipped through her crude depictions of suicide. There were pages of them.\n\n  “What do you think?” She asked with a grin, “I’ll bet she’ll lose her shit!”\n\nI closed the notebook and looked over at Sasha.\n\n  “A-are you out of your mind?” I asked. Sasha’s grin faded.\n\n  “What do you mean?”\n\n  “You stole her notebook, just so you could draw these? Sasha, that’s really messed up!”  \n   “It’s Spacegirl, who the hell cares about Spacegirl, Jane?”\n\n  “You just… drew her killing herself over and over again!” I took the book off her desk, “Do you not understand what’s wrong with that?”\n\nSasha just stared at me like I was crazy.\n\n  “Fine. Sue me for trying to be funny.” Sasha said, “Just give it here…” She outstretched a hand to take the notebook, but I pulled back from her. \n\n  “No. You’re just going to put something else in there.”\n\nAnger flared in Sasha’s eyes.\n\n  “Jane, just give me the book.”\n\n  “No!”  \n\n\nI opened the book, and I started to tear out those pages of Spacegirls suicide. Sasha lunged for me, trying to grab at the book and stop me, but  pushed her back. I didn’t mean to push so hard, but I did and she fell, landing hard on the ground. For a moment, Sasha looked up at me, wide eyed and shocked. I don’t think anyone had laid a hand on her like that before. Then I saw something in her eyes… Not just anger. Something worse. It was the same thing that had prompted her to draw those horrible pictures of Spacegirl. I turned and I ran, bolting down her stairs and out her front door, back into the snow. I clutched Spacegirls notebook to my chest the entire time and I didn’t let it go until I got home.\n\n&#x200B;\n\nI spent the rest of the Christmas break terrified that my parents would get a call from Sasha’s. I’d pushed her, and that seemed like such a big deal at the time. In hindsight, I doubt Sasha would have told her parents what had happened. They would have asked why I’d pushed her, and I would have told them about the notebook. On some level, she must have known that what she’d done was wrong. She was a cruel person, but there was a limit. Part of me hoped that she’d realize that I was right and we could patch things up when School started again, but honestly I wasn’t so sure.   \n\n\nI remember looking through Spacegirls drawings. The ones that she’d done. I remembered the ones I’d made fun of the most. There was one with a mermaid on a rock, combing her hair. Her eyes were closed in a relaxed bliss. I remembered saying how stupid her facial expression had looked, but honestly, I kinda liked it. I flipped through the pages some more, through Unicorns, Fairies and Castles. But I paused at the page depicting the Unicorn Prince. Back at Sasha’s place, it had been blank, but at my house it was finished. The Unicorn Prince stood proudly in his field, looking skywards with his horn proudly displayed. Maybe I had been thinking of a different picture?  \n\n\nI brushed it off and flipped to the back where Sasha’s pictures were. One by one, I started tearing them out of the notebook and tossing them in the trash. It was a waste of paper, but I refused to give it back to Spacegirl with those images still in it. \n\n&#x200B;\n\nOn the first day back to school, I was up early. I made sure the notebook was packed into my bag and was out as early as I could be. The snow on the ground was almost pristine as I walked to school, but I remember seeing some tracks on my lawn, headed down the side of my house. Deep U shaped indents that looked like they’d been made by hooves. A deer perhaps? I didn’t dwell on them and made my way down the freshly shoveled sidewalk and back to school.   \n\n\nI wasn’t entirely sure if Spacegirl would be back yet, but she was. She was alone in the classroom, sitting at her desk and drawing in a brand new notebook. She paused briefly when I walked in to join her, and I could see her sideying me. She didn’t say a word as I drew nearer, but I thought I saw her shoulders tense up ever so slightly.\n\n  “Hey.” I said, “I’m… I hope you had a nice Holiday.”\n\nShe didn’t respond.\n\n  “I’m sorry about what happened the other day. I didn’t know anything about it, but it just seemed really mean spirited.”\n\nStill no answer. I reached into my backpack, taking out her old notebook. I put it on her desk in front of her. She stared at it, still silent, then back at me.\n\n  “Sasha took it. I was over at her house the other day and she showed it to me. I had to take some pages out, but she drew some really awful things in there. I didn’t think it would be right to give it back with those things in there…” I paused, feeling smaller as Spacegirl stared at me. She didn’t seem angry or thankful. She didn’t seem anything at all. Just stoic.\n\n  “I’m sorry if I wasn’t all that great to you before.” I said, and then I shuffled off to by desk. Spacegirl waited until I sat down before she opened her notebook and inspected it. Then she closed her new book, and started something new on a fresh page in her old one. \n\nIt wasn’t much. But it made me feel at least a little good for what I’d done.\n\n&#x200B;\n\nWhen Sasha got in, she didn’t talk to me. She didn’t even look at me. Neither did Tanya or any of our other mutual friends. I knew from the moment they walked in that I’d burned my bridges with them. But I still wanted to try.\n\nThe Teacher hadn’t come in yet, so I figured it might be worth it to try and talk to Sasha. I got up to move closer to her and she gave me a look of utter disgust.  \n\n\n  “What do you want?” She spat. \n\nNow it was my turn to be silent.  \n\n\n  “Fuck off and leave us alone.” Tanya said, “You’d obviously rather hang out with the fucking retard than us, and I really don’t want you spreading your retard germs to us. It’s a quarantine issue.”   \n\n\nI stared at both of them, and I could’ve sworn I knew how Spacegirl felt… What was I supposed to say to any of that? Instead, I just returned to my desk without a word. Spacegirl stared at me the entire time. Her pencil rested over her notebook, but she didn’t write anything. She set it down, tore out the page she’d been writing on and jammed it into her pocket. I later saw her toss it into the trash during lunch.\n\n&#x200B;\n\nI didn’t really have anyone left… So I thought that maybe it might be a good idea to pull it out. Maybe it was something she wasn’t happy with? I’d never seen her throw a drawing out before. I was thinking that maybe I could use it as a peace offering of sorts, or something along those lines. When I saw what she’d written on it, I almost threw it back into the trash.   \n\n\n**Your Words**\n\n*There is a land where your sorry may go.*\n\n*A sickening land where it always snows*\n\n*The snow is putrid in color and smell*\n\n*It's substance- filth and things I won't tell.*\n\n*Only your Father has been there before.*\n\n*One day your boyfriend will visit once more.*\n\n*This place in your carcass this humanoid hell.*\n\n*Your sorry can go there to this hole in your shell*\n\n*My unsubtle message, this subtextual jazz.*\n\n*Is take your apology and stuff it up your ass.*  \n\n\nThis was unlike anything I’d ever seen her write. It was so crass and spiteful… This was as close to hatred as she could have gotten. I understood why she’d thrown it out. It didn’t fit with everything else she’d done. Those things had been beautiful, despite what people had said to her. This was angry and ugly… This was something she’d written for me. I put it in my pocket. I wasn’t going to give it back to her, but I wanted to keep it. I wanted to remember the way I’d made her feel. \n\n&#x200B;\n\n&#x200B;\n\nEighth grade wasn’t fun for me. \n\nI had very few friends left, and Sasha never forgave me for turning on her. Her version of the story was slowly warped as time went on. First I’d punched her and stolen the book. Then I’d tried to kiss her, punched her when she’d refused, then stole the book to try and get her in trouble. Rumors of me being a dyke spread pretty quickly, and hot on their heels came the rumors that I was dating Spacegirl. I tried not to let them bother me too much. I knew the truth and at the end of the day, I’d done the right thing.\n\n&#x200B;\n\nBy the time High School rolled around, I was hoping for a fresh start. There were new faces, and I figured I could make friends with them before Sashas rumors spread. I had a bit of success in that department. I fell in with a better crowd at least.   \n\n\nSasha stuck with her same old clique. It grew ever so slightly, but she was determined to live out the movie Mean Girls and most people didn’t pay her any mind.   \nSpacegirl barely changed at all. I didn’t see her much when High School started. She was in a few of my classes, but I rarely saw her outside of them. Whenever she had a moment, she’d be in the library, usually in one of the corner cubicles, working on her drawings. Sometimes I thought about talking to her and trying to strike up a friendship… but it never felt right.   \n\n\nSasha’s bullying never let up of course. Of course she stalked Spacegirl to the library where she’d pull the same old shit she’d been pulling since the fifth grade. She’d leer over her cubicle and comment on her drawings. Picking them apart just like she always had. I stopped her whenever I saw it… but I didn’t always see it.\n\n  “Coming to her rescue again, huh Jane?” Sasha asked once when I’d interrupted her. Tanya leered at me from behind her, chewing gum with her mouth open. \n\n  “What’s she ever done to you anyways?” I asked, “She’s just minding her own business.”\n\n  “Oh? What’s she done to you, dyke?” Sasha hissed. She leaned down over her cubicle and looked down at the notebook.\n\n  “Unicorns… Unicorns, unicorns, fucking unicorns… When are you going to grow up Spacegirl?”  \n   “Hey! I told you to stop.” I rounded the cubicle and I saw Sasha recoil. For a moment, I saw a bit of fear in her eyes. It vanished quickly and was replaced with a familiar rage.  \n\n\n  “Fine.” She said, “Tan, let’s leave the happy couple to their alone time.”  \nShe pulled away from the cubicle and disappeared with Tanya nipping at her heels like a faithful terrier. \n\nSpacegirl remained hunched over her notebook, her long red hair spilling over her shoulders. She seemed impossibly still.\n\nI turned to leave her when I heard:\n\n  “Thanks.”\n\nI looked back at her and saw that she was looking at me.\n\n  “Um… You’re welcome.” I said, “Let me know if she bothers you again, alright?”\n\n  “I will. But… you’re usually there anyways.” \n\nHer voice was soft and low. I’d heard it before, but I don’t remember her ever speaking directly to me.\n\n  “Yeah, well. It’s just not right. She’s such a child. One of these days she’s going to have to grow up.”\n\nSpacegirl just nodded, looking over towards the library door, then back down at her notebook again. \n\nFor a moment, I thought about asking her about what she was drawing. I thought about saying something else, but… No. I didn’t want to make her uncomfortable. I left her alone again. \n\n&#x200B;\n\nIn tenth grade, I took art as an elective. I wasn’t much of an artist, but I figured it would be an easy course. To the surprise of no one, Spacegirl was there. I actually asked her to work with me on a few group projects. I think the prospect of being asked to work together was foreign to her. She looked at me suspiciously when I did it, but when she smiled, it was the biggest smile I’d ever seen.  \n\n\nI went to her house for the first time to work on a portrait project with her once. We were supposed to take turns drawing portraits of each other and I’d volunteered to let her draw me first. Rumors of her Mother had always surrounded Spacegirl, so I wasn’t entirely sure what to expect when I got there. I certainly wasn’t expecting the quiet, neatly kept house that I found.  \n\n\nThe Woman who answered the door looked like an older version of her daughter, sans the coke bottle glasses.\n\n  “You must be Jane.” She said. She wasn’t smiling, but she didn’t sound upset either.\n\n  “Yes ma’am…”\n\n  “Come on in. Megan's upstairs. She was just getting ready for you.”\n\nThe house was warm with plenty of knick knacks on the walls. Plates and porcelain dolls mostly. Her Mom sent me upstairs and I didn't waste any time. On the landing leading up to Spacegirls room, I could see a mural of family photos and paused to look at them. I could recognize Spacegirl and her Mother in most of them. Spacegirl never seemed to be smiling. I only saw her Father in a few of the very early pictures. Spacegirl looked like she was only a young child in the few pictures I saw him in though. I didn’t dwell for long and headed towards what I assumed was her room. The cardboard stars and planets on it gave it away.  \n\n\nSure enough, she was inside waiting for me. She sat facing the door behind an easel in the center of her room. Her bed was neatly made and tucked away in the corner. She had a clean little desk that she’d clearly been working on and had set a chair out for me to sit on. I hadn’t expected something so overwhelmingly formal and I almost started laughing… But then I noticed her walls.  \n\n\nThey weren’t just covered in drawings. The art pieces on them were full on paintings. They were the same fantasy depictions she usually did, but the colors were so vivid. The clouds looked like fluffy pillows and the castles seemed great and infinite.\n\n  “Holy shit, are these yours?”\n\n  “They are.” Spacegirl said softly. She stood up and took the plate of cookies from me, then moved it to her desk.\n\n  “It… it’s soothing.” She said after a while, “Painting, I mean. I pick the drawings I like the most and… I finish them.”\n\nShe spoke slowly, like she was carefully choosing her words. I almost felt like there was something that she was trying to avoid. I spotted a painting on the floor that looked like her Father. The style was the same but the content was different. He was surrounded by awkward scribbles, and he looked completely and utterly terrified. Spacegirl looked down at it, but she seemed to disapprove of it. She turned it around so I wouldn’t have to look at it.  \n\n\n  “We should get started.” She said, “Sorry…”\n\n  “No, it’s alright!” I said. I sat in the chair for her. “I’d like to hear about it.”\n\nSpacegirl watched me from the corner of her eye for a moment, as if she doubted I was being serious. But eventually she sat down behind the easel and started to draw… Soon after that, she was talking too. I stayed long after she’d gotten what she needed for her sketch, just to talk. She told me that she’d always liked fantasy, and how she liked Unicorns because they were simple but pretty. I hung on to every word, and I could’ve sworn I saw her smiling shyly as she talked.   \n\n\nThe portrait she’d done of me was something else entirely. Her work had always been beautiful… but this made me look transcendent. I wasn’t entirely sure that I was looking at myself at first. There was something about the look on my face. There was a small, almost content smile there. The warmth it conveyed was almost disney-esque.\n\n  “I love it.” I told her, “That’s incredible Spa… Megan… That’s really great!”\n\n  “You can call me Spacegirl if you want.” She said, “I don’t mind the nickname… Not as much as I mind the people at least.”\n\nMy awe quickly turned to shame, but Spacegirl didn’t look upset… She just stared at me blankly like she so often did. No… not blankly. Her face might not have conveyed much emotion, but there was definitely some emotion there. \n\n  “I wish… I wish I’d been nicer to you, when we were younger.” I said.\n\n  “Is that why you’re here right now?” Spacegirl asked.\n\n  “No! I… I’m here for the assignment. I mean… the art assignment. The portraits…” \n\nShe continued to stare. \n\n  “Did you pick me because you felt bad for me?” She asked. \n\n  “No! I just thought it would be cool to work with you.”\n\nSpacegirl didn't react for a moment, but then she just nodded. \n\n  “Okay.” Her flat tone made it hard to know what she meant by that. She stood up and walked over to the portrait. \n\n  “Mom can drive you home if you need a ride.” She said. I opened my mouth to say something else. I wanted to apologize, but I didn’t know what.Had I offended her? Had I said something wrong?\n\n  “Alright. Thanks.” It was the only thing I could think of. “See you tomorrow.”\n\nWith that, I left her.\n\n&#x200B;\n\nI was almost afraid to see Spacegirl the next morning. I drifted through my classes that day until I reached art… and when I did, I wasn’t expecting what I saw. She had clearly been up late… but what she’d brought in stole my breath away.  \n\n\nIt was my portrait, but she’d done more with it than I thought possible. She’d painted over the sketch, turning me into something beautiful. Flowers bloomed around my brown hair and a crown of daisies, lilies and chrysanthemums adorned my head. The colors were so vivid, and I looked so at peace in it. Spacegirl was looking right at me as I came in, as if she was gauging my reaction. But all I could do was stare wide eyed and in awe. When I looked back at Spacegirl, she was smiling at me. Her project single handedly netted us an A on the project and got the privilege of being hung up outside of the art classroom. Of course I told her how much I loved it, and I remember the way she smiled when I did. I remember thinking that it was the cutest smile I'd ever seen.\n\n&#x200B;\n\nMy portrait was up for barely even a day before Sasha had to make a comment. I’d been on my lunch, and had just gotten some fries from the cafeteria when she and Tanya ambushed me.\n\n  “Where’s your flower crown, dyke.” Sasha said, \n\n  “Leave me alone.” I said, brushing past them, but Sasha was out for blood.\n\n  “I always knew you were a little dyke. But now you’ve posted solid proof of it! We’ve gone and cracked the case, haven’t we? So what happened? Did you go to her house and lick her retarded little snatch? You must be a real good dyke because she went and drew that for you!”\n\nI tried to walk away from her, but Sasha and Tanya just kept following me.\n\n  “What’s wrong? Am I not pretty enough for you Dyke?” She snapped at me.\n\n  “Maybe she only fucks retarded girls.” Tanya said, “I’ll bet Spacegirl squealed like a pig when she came.”\n\nI stopped dead in my tracks, and I heard Sasha stop behind me. I don’t know what it was about what she’d said that pissed me off so much. But those two had finally struck a nerve. I spun around, swinging my lunch tray as hard as I could. Fries were scattered everywhere, but although I was aiming for Tanya, I hit Sasha. She went down hard, and I’m not sure if she was even still conscious when she hit the ground. Tanya was on me in an instant. She slammed me back against a wall, and kept me pinned. She had size and strength on me, and there wasn’t a thing I could do to stop her. Several other students grabbed at us. A teacher finally got involved and all three of us got escorted to see the Principal. As we left the cafeteria, I saw Spacegirl in one of the halls, just staring at me.   \n\n\nNaturally I got a three day suspension, but Tanya and Sasha were fine. Both of them said they’d just been walking and I attacked unprovoked. It was their word against mine. Sasha had a familiar shit eating grin on as she left the office with only a bruise on her forehead to show for her troubles, but there was a familiar look in her eyes. That same anger I’d seen last time I’d laid a hand on her… and something about it scared me.  \n\n\nWhen I came back to school, I realized that I had every reason to be afraid. My portrait was missing. I wondered if they’d taken it down because I’d attacked Sasha, but the truth was a lot worse.\n\n  “Someone took it.” Spacegirl said. She was sitting in her usual spot in the library when I found her, sketching flowers in her notebook.\n\n  “When?”  \n   “The day after you hit Sasha… I don’t think anyone’s found it yet.”\n\nShe didn’t look up at me. Just stayed focused on her art. She didn’t need to say it for me to know who she blamed. Who else would it be? I had half a mind to confront Sasha about it, but I didn’t know if that would be a good idea or not. Sasha could easily just cry wolf. I wouldn’t put it past her. In the end, it didn't matter.  \n\n\nBy the time I was headed to art class, the painting was back. But there had been some modifications made to it.\n\nThe words:\n\n***Retard Fucking Dyke***\n\nHad been painted across my portrait in bright red. I saw it from down the hall and could see some other students whispering amongst themselves beneath it. I didn’t know what to say or do… But this felt like too much.  \n\n\nThe picture was taken down quickly… but the damage was done. Sasha had gotten her revenge, and it didn’t stop with just the painting. Spacegirl looked different than when I’d seen her in the library. She seemed uneasy, and her eyes were red like she’d been crying.\n\n  “I’m sorry about the painting…” I said softly. She looked at me, before sighing.\n\n  “I knew she’d do something like that…” She said, “I’m so used to it by now, that it doesn’t bother me anymore. I’m sorry she wrote those things about you, though.”\n\n  “But you worked hard on that.” I said, “I’d be upset too.”\n\nShe just shook her head.\n\n  “That’s not it.” She said. She reached into her pocket, pulling out a crumpled up piece of paper then slid it over to me. \n\nSlowly I uncrumpled the paper, and my eyes widened as I recognized what was on it.\n\nIt wasn’t the same drawing… but it was close enough. It was a depiction of Spacegirl hanging herself, and me beside her. A caption read ‘*Retard Dyke Wedding’.*\n\n  “There were so many in my locker…” Spacegirl said.\n\n  “This is what she drew in your notebook… when I returned it to you… This is what I had to take out.”\n\nSpacegirl looked down at the picture again, before averting her eyes. She didn’t pay much attention during class. Instead of taking notes, she sketched in her notebook. I looked over a few times to see her drawing another Unicorn. This one seemed so similar to the one I’d seen before. She must not have been quite happy with it though… When I looked back at her notebook, the Unicorn wasn’t there anymore. She must have just erased it… but it seemed so clean. Like it hadn’t been erased at all. \n\n&#x200B;\n\nTanya was following me on my walk home that evening. I didn’t know what she had in mind, but I didn’t want to put up with it. When I was in the middle of a small walking path that cut behind some of the houses on my street, I stopped and looked at Tanya as she kept approaching.\n\n  “What do you want?” I asked.\n\n  “It’s a surprise.” She said, “Sasha and I just want you to know how much we love Dykes in this town… Oops, I’ve said too much.”\n\nI wanted to hit her. Dear God I just wanted to hit her, but we both knew she could overpower me. Whatever Tanya had in mind… it wasn’t anything good. She drew closer to me, unafraid of anything I’d do.\n\n  “Come on, Dyke. Go home.” She said. “Let’s go check out your surprise.”\n\nIn a sudden horrible moment, I realized that Tanya was threatening me. I also realized that I couldn’t outrun her… I couldn’t fight her off. I didn’t really have much of a choice but to do as she asked. Slowly, I turned and walked towards my house, with Tanya at my heels. It wasn’t far, and up ahead I could see Sasha sitting on a park bench. From a distance, I recognized the red gas can beside her, and I stopped dead in my tracks.\n\nTanya seized me by the arm and pulled me towards the bench. Sasha just watched with a wide, manic grin.\n\n  “Hey Jane.” She said, “How’s it going?”\n\n  “What the fuck is this?!”\n\n  “Just wanted to chat.” Sasha said with a cold chuckle, “You think you can get away with pulling the shit you did the other day. No. You’ve been treating me like garbage for years, and for what? Because of Spacegirl? You know who you’re fucking choosing, right? Right? God… I hate that retard girl. But you know what? I hate you even more. Acting like you’re better than me just because you feel bad for her.”\n\n  “You’re crazy.” \n\nSasha just laughed.\n\n  “I’m not the one who clocked someone with a fucking tray just for a little bit of teasing. You’re absolutely fucking psycho!”\n\nOn the bench behind her, I saw the portrait that Spacegirl had painted of me. Sasha picked it up and tossed it in front of me, then picked up the gas can and dumped it onto the canvas.\n\n  “You wanna be a Dyke, I don’t care. But I’m not letting you and your retarded whore put your shit up! So say goodbye to your little project, slut!”\n\nSasha reached into her pocket and took out a book of matches. Her grin widened, before suddenly vanishing outright as she looked at something behind us.   \n   “What the hell?” Tanya said, and I craned my neck to try and see what they were seeing. As for believing it… that was another story entirely.  \n\n\nStanding on the path behind us was a Unicorn… but the way it looked was all wrong. This was nothing like a regular horse. Its body was plain white and almost textureless save for the many thin blue lines that ran along its body. It looked like it had been cut out from a sheet of lined paper but… that was impossible… It had to be impossible. Neatly done grey lines defined the shape of the horse. In fact, the lines reminded me of the ones Spacegirl used. This Unicorn looked like it had walked out of one of her notebooks!\n\nTanya let me go and stumbled back a few steps, wide eyed as she stared at the advancing Unicorn. It let out an angry noise before charging straight for Tanya. She panicked and tried to run. In her desperation to escape, she bolted down the path. But she couldn’t outrun the paper Unicorn. It lowered its head as it drew nearer to her, and in one swift movement, the horn pierced Tanya’s back, impaling her straight through the chest. She screamed as she was hoisted off the ground and the Unicorn circled back to fix Sasha in a murderous glare.   \n\n\nTanya looked down at the massive spike sticking out of her, her eyes clearly wide with horror and her body twitching its last spasms as the life quickly drained from her. The Unicorn lowered its head to let her slide off of its horn and she hit the ground in a bundle of limbs.  \n\n\nSasha and I stared in silent horror as the Unicorn reared up on its hind legs and brought its hooves down upon Tanya’s body. She didn’t scream. She didn’t fight. She simply lay there as she was trampled again and again. I can only hope she died quickly.  \n\n\nSasha dropped the unlit match and took a slow, terrified step back before toppling over. I stumbled back and looked down to see the portrait of me at her feet. But it had changed. That beautifully painted version of me was now leaning out of the canvas, invading the real world and clutching Sasha’s leg tightly.\n\nStill with that look of contentment on her face, I watched as the Painted Me slowly slipped back into her panting, and she took Sasha’s leg with her.\n\n  “FUCK, FUCK, FUCK!”\n\nSasha desperately swatted at the Painted Me, but she couldn’t overpower it. She couldn’t escape. Her nails tried to dig into the pavement as she was slowly dragged into the canvas. She looked at me in horror, silently begging for help but all I could do was stare back at her in silence.\n\n  “JANE! JANE HELP! PLEASE! PLEASE!\"\n\nThe hands of the Painted Me reached up, seizing Sasha by the hair and forcing her down into the canvas. It was like watching something pull her underwater. One minute she was there, the next she was gone. I stood silent in the park, staring at the painting, then at the paper Unicorn. The Unicorn huffed before retreating off into the woods and then I was alone.  \n\n\nSlowly, I approached the painting and I looked down at it. It had changed and now it depicted Sasha, her mouth open in a horrified final scream. After some hesitation, I picked up the painting. I could return it to Spacegirl in the morning. \n\n&#x200B;\n\nThey chalked Tanya’s death up to an animal attack, and nobody ever found Sasha. I never asked Spacegirl about what I saw. I don’t think even she knew the answer, although she certainly knew much more than I did.\n\n&#x200B;\n\nHigh School was ten years ago though, and I’ve chosen not to remember as much as I can. I’ve got my own life to live now and I try not to ask so many questions. Sometimes I see paintings move, but I don’t bother with a second glance and I never ask my wife about them. She doesn’t like to talk about it and I won’t ever force her. The painting of Sasha hangs in her studio at home, right beside the painting of her Father. Sometimes I look at it and I wonder if maybe things could have been different… but I don’t feel too guilty about it. I wouldn’t feel too guilty if I heard another story about a suspicious trampling or animal attack either but to my knowledge, there’s been nothing of the sort. I guess I shouldn’t be too surprised. I do my best to make sure nobody hurts my beautiful Spacegirl.", "comments": [{"id": "f2wbmkv", "author": "NOSjoker21", "body": "> *My unsubtle message, this subtextual jazz.*  \n>  \n>*Is take your apology and stuff it up your ass.*\n\nYIKES. Bravo, but yikes."}, {"id": "f2uex3j", "author": "teamgingersnap", "body": "So beautiful!!! Wholesome as hell, it warmed my cold heart"}, {"id": "f2uw5k2", "author": "Taupe_Poet", "body": "Holy hell Sasha was a cold hearted be-och good riddance to her and Tanya and i hope you and your wife have an amazing life, her paintings sound wonderful"}, {"id": "f2vjfni", "author": "Nutelladela", "body": "So on that day when Jane took the notebook from Sasha, was the unicorn prince meant to be coming for Jane, but then changed its mind when she took the notebook?"}, {"id": "f2uxhkz", "author": "Bigbubblybob", "body": "Aw that was a great story. The way you described her throughout was beautiful I’m glad you guys worked out. Was her mother actually a sex worker ?"}, {"id": "f2ukuxr", "author": "Keyra13", "body": "Good riddance to bad garbage. And so happy you and Megan worked out!"}, {"id": "f2ynquc", "author": "spacegirlmadds", "body": "this was cute, but i was kinda horrified after opening it. my name is maddi daniel, i use the handle spacegirlmadds, and i have red hair and big glasses. took me aback for a while."}, {"id": "f2v1ya2", "author": "Fredd8", "body": "This story. -chef's kiss- I love me a bully's redemption arc. And I'm so glad you and Megan got together! It must have taken her so much self control to not just summon unicorns randomly to get rid of her bullies. Maybe she felt bad when she did it to the boys at first, and tried to give Tanya and Sasha as many chances as she could?"}, {"id": "f2unkkj", "author": "Machka_Ilijeva", "body": "Aww, I’m so glad you and Megan had a happy ending :) \n\nBtw I couldn’t help picturing Nicoletta Elmi as young Spacegirl haha"}, {"id": "f2v4m3t", "author": "completeoriginalname", "body": "I love that you married megan but I just love the irony that she was actually a lesbian after all the teasing."}, {"id": "f2upr42", "author": "artfulaneurysm", "body": "I WAS SHIPPING YOU GUYS FROM THE GET GO YOU ARE SO CUTE i’m so glad you guys got married and are happy! i’d love to see some of megan’s art one day. i can only imagine how beautiful it is"}, {"id": "f2vv19x", "author": "I_Am_Nazgul", "body": "I think Sasha and Tanya actually got to live a few more extra years because of the kindness you showed. You saw hoof tracks outside your house so i think Megan was going to send the Unicorn to attack you the the other girls then but she decided not to after she saw you had changed and maybe thought those other two could change too."}, {"id": "f2v64l4", "author": "Strawberry4168", "body": "Now *this* is quality lesbian content right here"}, {"id": "f2v08pv", "author": "doogiebone", "body": "That was really beautiful op.  I do hope one day see Megan’s painting. The way you describe it is phenomenal."}, {"id": "f2wikhd", "author": "Lanoman123", "body": "School rules are bullshit how the hell was \"Spacegirl\" suspended for literally being punched?"}, {"id": "f2uw37l", "author": "buttholepretzel", "body": "i was seriously hoping that you would date spacegirl throughout the story. Now you guys are married! amazing"}, {"id": "f2uuuxc", "author": "Treestan101", "body": "My guess is her father is inside the painting of him, that's where he disappeared."}, {"id": "f2v537p", "author": "johnsayles1", "body": "I honestly didn’t think you were going to be nice to her but you pulled through! I’m so happy you became friends!"}, {"id": "f2vipup", "author": "roccotheraccoon", "body": "Honestly, the world is better off without people like Sasha and Tanya. Who knows what they would have grown up to be like. Probably some horrible Karens."}, {"id": "f2xs4w0", "author": "xyrion_kyrel", "body": "This just melted my cold dead lesbian heart, holy fuck— especially since I was just like Megan when I was little (I was reclusive and just drew in my notebook all day), this hit me hard\n\nAlso from my experience people who make fun of others for being gay do it because they’re gay themselves and they’re ashamed of it. That doesn’t excuse Sasha’s actions at all tho, what a bitch"}, {"id": "f2uz5ue", "author": "Eminemloverrrrr", "body": "Love this! She should have trampled those girls years ago! And don’t ever piss your wife off"}, {"id": "f2vnv6y", "author": "cr1smc", "body": "Now this is a great story, took a longer break at work just to read it all.\n\nGlad to see you and Spacegirl worked out, really such a heart warming story."}, {"id": "f2uyxks", "author": "ponninja", "body": "ANYWAY, STAN JANE AND MEGAN"}, {"id": "f36qweo", "author": "epicstoicisbackatit", "body": "wow... As a former awkward, lonely kid who found solace in drawing, your story did strike a nerve OP. Many stories use bullying as a way to move the plot, but yours goes a bit further. \n\nI particularly appreciated the way you described your own \"go with the flow\" attitude (at first). The vast majority of my bullies weren't little sociopaths. They were perfectly normal kids who acted extra-shitty to me for the longest time, because that served their own social lives. Remembering that bullying is a pretty \"natural\", socially accepted behavior helps you keep your actions in check. It also helps you remember that this doesn't make you an irremediably bad person if you do ; just that you need to correct your behavior asap.\n\nBullying gets more attention these days, and that is SO necessary. But from my personal experience, I can't think of any solution implemented by adults that would actually work. Inclusion has to come from your peers - and, of course, as you described, that's not easily done. Whoever sides ever so slightly with the bullied kid risks loosing their own social status. \n\nI have to tell you though, inclusion does make all the difference in the world. It really, really does. \n\nIt wasn't before the last year of high school that I met my first friend. At first, she had to go out of her way for me to open up, and I don't think she even truly realizes how her doing so changed my life. She helped me gain confidence I terribly lacked, just in time. Fifteen years later, I have built a loving, diverse, evolving group of friends - I could never have imagined that when I was at school. Last year, my first friend was a bridesmaid in my wedding.\n\nAlso, there are still people around you who need you to start including them. In my early twenties, when I was finishing university, I met an awkward girl at a party. She was a bit isolated too, had some elocution issues, and clearly had a hard time connecting with people. Even I felt awkward around her - and boy do I have a high tolerance. But she is intelligent, and curious, and fierce and sassy in her own way, and very loyal. I decided to invite her to my own parties. \n\nI didn't do it because I felt bad for her, or because I expected some good karma or anything. Despite the awkwardness, I genuinely enjoyed her company, even then. I could just tell that she needed a little support. \n\nMy friends were a bit standoffish for a while. But, a few years later, people really connected with her. She truly has bloomed too - she is so much more confident and joyful than when I first met her !! Of course, I would never dream to take credit for her \"transformation\" - that all her. But I do hope that I gave her a nudge when she needed it. And, you know what, just one year ago, she was diagnosed as partly deaf. The whole time, part of her communication troubles were because she was reading on people's lips, and she herself wasn't completely aware of it. She has a brother with a severe case of autism, and I guess her parents didn't realize that she needed special attention, too.\n\nAnyway, thanks for your story OP. I'm just going to end with this : you might want to talk to your wife about her revenge fantasies. Her dad and Sarah's actions were f\\*\\*\\*ed up, but you can't fight fire with fire. The unicorn murders and drawing traps are pretty psycho too. All I'm saying is, understanding and sincerely forgiving my bullies was absolutely determining for my mental health. Maybe your psychologist MIL can help ?"}, {"id": "f2uz1f9", "author": "jiminpng", "body": "wow!! spectacular!!! amazing!!!! sasha deserved it, that bitch. and you two deserve your happy ending."}, {"id": "f2w7shj", "author": "PlasticBrooke", "body": "Awww, this was so cute and heartwarming!!! I'm glad you and Megan found eachother, you always protected eachother, and I'm glad you respect the fact that she doesn't want to discuss her abillities. This is true love❤️❤️❤️"}, {"id": "f2uxux5", "author": "KingGrahampa", "body": "I was so happy when you hit her with the tray, I was really hoping that would happen."}, {"id": "f2v447b", "author": "maxyall", "body": "Man. Fuck Sasha."}, {"id": "f2uvlo2", "author": "sophgallina", "body": "oh how wonderful, congratulations to you and spacegirl :)"}, {"id": "f36zyix", "author": "JesusIsMyAntivirus", "body": "\"Bad people being bad to good character, good character gets revenge.\" is a painfully cringy cliché taking hold of nosleep that has little to do with the premise of the sub,  but the antagonists were demonised so incredibly well in this post that it was a pleasure to finish."}, {"id": "f2wdhu8", "author": "ScentedSweetsPizzer", "body": "I wanted them to end up together the whole time and I’m so happy they did!"}, {"id": "f2vbf6f", "author": "I-Have-An-Alibi", "body": "Son of a bitch I loved this and congratulations to you and SpaceGirl!!!!!!!"}, {"id": "f2vsia4", "author": "Xx_H3nta1Kn1ght_xX", "body": "That was beautiful"}, {"id": "f2winek", "author": "RatKiley", "body": "WOW CRYING LOVE YOUR BEAUTIFUL LOVE STORY AND YOUR BEAUTIFUL ARTIST WIFE. Congratulations on finding each other and surviving how shitty school is as a team. Good riddance to entitled garbage."}, {"id": "f2xmhxj", "author": "Rkluk", "body": "I started smiling when Sasha was being dragged into the painting but seeing you two together in the end is what really made me feel something good"}, {"id": "f2z7ps1", "author": "helen790", "body": "OP out here living her best lesbian life with a beautiful wife that paints magic unicorns and I’m so happy for her."}, {"id": "f302iol", "author": "BabbluForReddit", "body": "I may sound silly but how many years were you two into marriage?"}, {"id": "f44zt7a", "author": "TheSepticOutlaw77", "body": "Everyone else: great warmed my heart.\n\nMe: How did I get this story from searching how to draw hands.\n\nBut still great story."}, {"id": "f2uztql", "author": "SatomiMurano", "body": "That was wonderful, thank you for posting your story, I hope you and Spacegirl are doing great together"}, {"id": "f2w0a0q", "author": "RLYoshi", "body": "This was amazing! I won't lie, I feel bad for those girls - I hope Sasha is at least dead, not trapped and unable to escape. But I felt for you and Megan even more. I hope everything works out, and there's no more... \"animal attacks\" or the like. You two deserve a calm life."}, {"id": "f30bqm0", "author": "Rainbowgaming555", "body": "This is so cute and wholesome! She really t o r e them a new one huh?"}, {"id": "f2v1tua", "author": "weeidkwhatsgoingon", "body": "wow, lesbians AND a happy ending? this is beautiful"}, {"id": "f2uxwbj", "author": "jojocandy", "body": "Aw that's so sweet that you ended up married"}, {"id": "f2wvwrp", "author": "QueerOfRock", "body": "Bless, nothing like a magical space girl and her knight in shining armor"}, {"id": "f3u8mme", "author": "Cake-Fyarts", "body": "Sasha was a fucking psychopath."}, {"id": "f2v4rbo", "author": "Juedoobie", "body": "Goosebumps!!!!!"}, {"id": "f2vtmtr", "author": "Thisrandompreseon", "body": "Aweeeeee!! I ship. Megan x Jane!!!"}, {"id": "f2wj4vi", "author": "MissCherrySpoon", "body": "I am an avid lurker and rarely comment... but this was absolutely amazing!  Thank you for sharing!  Seriously, THANK YOU!"}, {"id": "f2wm17a", "author": "fireignition", "body": "I absolutely loved the ending, was not expecting that! What a beautiful story. I hope you two live out a long and happy life together, op!"}, {"id": "f2wwlij", "author": "schnazzlekitty", "body": "Hey what’s up I’m crying this is beautiful I’m so happy for you"}, {"id": "f2ynqug", "author": "SpaceWaste73", "body": "*tinfoil hat time* Does Megan’s poems have any power behind them much like her paintings or is she just a really witty gal with the pen?"}, {"id": "f3jrzki", "author": "zubatzo", "body": "Ah, my little gay heart T_T I’d love to make a comic about this"}, {"id": "f4z2qcw", "author": "Makmer2349", "body": "Dang that was a cute ending. But about halfway through I forgot what sub I was on and was super worried about when the twist would come and it would get dark. But I loved it. And it was sooooo fleshed our too with everything being explainable and foreshadowed such as your comment with the mother being a psychologist and james’s father seeing after a divorce."}, {"id": "f2vrp4a", "author": "BwackGul", "body": "You rock, bae....you rock."}, {"id": "f2xlbqq", "author": "megwildfire", "body": "So glad you 2 ended up together. Honestly that's all I was hoping for during the read (that and the bullies getting it of course)"}, {"id": "f32bw0g", "author": "DiatonicGenus", "body": "I always shut the curtains to annoying kids yelling outside my house and now realize I may have missed some unicorn massacre...dang"}, {"id": "fbrpgx9", "author": "RevFrenchie", "body": "when i read that Sasha had a gas can i legit thought she and tanya were gonna catch jane on fire. \n\nso good job capturing sasha’s psycho ass self, i guess"}, {"id": "fefh7ty", "author": "Unfamous123", "body": "So im supposed to \"not sleep\" after reading this? B*tch im sleeping tight and hoping that this is true so that bullies get what they deserve."}, {"id": "f2vivyr", "author": "Abby-N0rma1", "body": "Out of curiosity, does the painting of Sasha have \"awkward scribbles\"?"}, {"id": "f2vhhtt", "author": "soextremelyunique", "body": "This is beautiful."}, {"id": "f2wcdxh", "author": "Keeeyyyl", "body": "Ending got my heart unguarded. Congrats on both of you!! ♥️"}, {"id": "f2x9967", "author": "perplexedegg", "body": "I hope you and Megan are doing well!! She sounds so talented"}, {"id": "f2x9hor", "author": "m3tac0m", "body": "I like Spacegirl"}, {"id": "f32gj22", "author": "kblount29", "body": "Aw yay I knew you loved her."}, {"id": "f38xi4s", "author": "hey_vmike_saucel_her", "body": "If i could i would give you platinum"}, {"id": "f3s40vy", "author": "EndlessDespair", "body": "god i love this... a happy lesbian ending in nosleep?? more likely than you think!"}, {"id": "f4yhbio", "author": "thicchonk", "body": "I want to draw spacegirl"}, {"id": "fbz5ol8", "author": "ShimShamFimFam", "body": "I love me some magical murder lesbians"}, {"id": "fdr8ki6", "author": "Deecomposer", "body": "SPACEGIRL SAYS GAY RIGHTS"}, {"id": "f2wlqpb", "author": "TI72836", "body": "I was bullied throughout elementary and high school.  My brother was too.  I loved university as I was around the people I wanted to be around with.  We all had the same interests and hung out all the time.\n\nWhen I was younger there were days I wish I could do something like Megan did just to get them off of my back for a moment or two.  \n\nI'm in a much better place today and I'm glad you both are too."}, {"id": "f2wr0hx", "author": "queerkiora", "body": "Crying at work a little bit. You and your wife deserve happiness. She has so much passion for painting, it's only natural painting would return the feeling."}, {"id": "f2wr7tn", "author": "Numbah9Dr", "body": "This made me happy. Love and just desserts."}, {"id": "f2yryvz", "author": "ProfessorBats", "body": "I'm so happy y'all got married! I was highkey hoping that would happen throughout the story."}, {"id": "f32krf7", "author": "carbonatedchloride", "body": "No Nosleep story has truly filled me with so much emotion like this one. This left an undeniable impact on me, and I'm really glad you ended up living happily with your wife in the end. :) It's what you two deserve, after all. Thank you so much for sharing your story with us."}, {"id": "f3ztcay", "author": "TiddlyWonkles", "body": "The scariest thing here is how horrible children can be, Christ man"}, {"id": "f4bseav", "author": "amb-r", "body": "This is a cool story"}, {"id": "f4dx2pg", "author": "jayydit", "body": "That story was amazing"}, {"id": "f4izexr", "author": "Native_Thoughts", "body": "I loved this. I loved how they were married on the end as well."}, {"id": "f4k2nh4", "author": "speepeal", "body": "This is still the best nosleep story I've ever read."}, {"id": "f4ucugw", "author": "poolman42162", "body": "Incredible story and a little sexy"}, {"id": "f589efe", "author": "Crystal_Sparkle_Fire", "body": "yes gay i’m love amazing"}, {"id": "f5hudd9", "author": "I_am_a_pissoff", "body": "Dark af but also kind of wholesome. The ending is pretty cute tbh, and the main story gave me goosebumps"}, {"id": "f6gzu7x", "author": "zarrdii", "body": "This hit home for me. One of the most powerful nosleep stories I’ve read in a while ❤️"}, {"id": "f6mz6bv", "author": "casteela", "body": "Sasha and Tanya got what was coming to them. But what took so long though?"}, {"id": "f7kpoyv", "author": "HippieSoulPunx", "body": "I mean, I was bullied in school and it was miserable, but they were never that cruel to me. People kill themselves because bullies give them a push, so if it was between them dying or Megan dying? I wouldn't lose sleep over them lol. Frankly this is a strange but wholesome love story."}, {"id": "f92stm0", "author": "omnianadine", "body": "Please write about what happened to spacegirls dad!"}, {"id": "fcn7fb9", "author": "CreativeBobbles", "body": "im always happy to read about bullies dying but man i wish you could've beat the shit outta Sasha before she got dragged into the painting."}, {"id": "fk2ibkz", "author": "grodemonster", "body": "I loved this. I loved that they ended up together"}, {"id": "f2v84z0", "author": "SeniorPancake", "body": "FUCK YEAH. Those bullies deserved it."}, {"id": "f2x64tg", "author": "preorom", "body": "so you were a lesbian after all"}, {"id": "f2uzrq4", "author": "thisbrokenlife_", "body": "Awwww the ending made me so happy!!!! I love that you two got together."}, {"id": "f2w16ys", "author": "zombieelove23", "body": "I got happy chills at the end 😭❤️"}, {"id": "f2w2zjv", "author": "Pinktat", "body": "It takes a lot of courage to stand up to your friends as you did! Well done for doing the right thing, so pleased it all worked out for you in the end. Karma can be good as well as bad. I wouldn't upset the wife tho...lol."}, {"id": "f2w96s0", "author": "villanellerabies", "body": "amen"}, {"id": "f2wnx5v", "author": "throwawayhouseplant", "body": "Wow that's a lot to unpack. It's a huge shame that your school did nothing and allow yall to be bullied. I'm glad everything worked out in the end!"}, {"id": "f2wqe05", "author": "bigtittysusan", "body": "this was both beautiful and gruesome and i love it either way"}, {"id": "f2z3jm3", "author": "Kierlikepierorbeer", "body": "I’m speechless. This is just so beautiful!"}, {"id": "f2ztgc5", "author": "RiboZurai", "body": "This was beautiful in all ways possible."}, {"id": "f329a89", "author": "V3nt1ng", "body": "I'm very very late to comment, but oh lord do I wish Sasha got it *worse*.\n\nProps to you for getting an amazing wife, though. I can relate to both of your experiences unfortunately."}, {"id": "f3hblh3", "author": "UnculturedLettuce", "body": "This made my heart Happy tbh"}, {"id": "f3p1qfw", "author": "Natasya95", "body": "Awww i love this so much !!"}, {"id": "f3pg04d", "author": "Peter_Porker32", "body": "Yo Jane... Jane... This was so nice to read... Speechless... They had it coming :)"}, {"id": "f3qto7y", "author": "PyroGirl8", "body": "That was so wholesome <3"}, {"id": "f3takpw", "author": "LuigiGotBigToes", "body": "Make a fucking book i will buy it. It takes me about 35 minutes to get from home to school and i read this the whole time"}, {"id": "f3vgvu8", "author": "cgell04", "body": "Awwww. She married spacegirl💗💗"}, {"id": "f3wrnf4", "author": "pReTtYbAbYoHyEaH", "body": "congratulations on your marriage !! i hope everything goes well for you and megan"}, {"id": "f4oqyc5", "author": "Ninagotscared", "body": "I would not have hoped that Tanya died quickly."}, {"id": "f4xk18m", "author": "penumbraic", "body": "Why was Spacegirl's voice familiar to her? Did I miss something?"}, {"id": "f51hdgn", "author": "demon_bitch_", "body": "wow, i expected everyone to try to kill Jane or something, but WOW. this is so... beautiful. it actually made me cry"}, {"id": "f542qj9", "author": "rooztt", "body": "Man, I really love stories like this that are so cute and wholesome while at the same time being incredibly deep and messed up"}, {"id": "f572n6o", "author": "Fireghostwolf50", "body": ">I could only hope she died quick\n\nNa fuck that she was a sociopath.\n\nI only wish this was a movie so I could have the satisfaction of seeing those she devils pass.\n\n...these get me to hyped up..."}, {"id": "f5b33tv", "author": "Anthadvl", "body": "Aw they married !!"}, {"id": "f5m3klw", "author": "KingKurto_", "body": "Fantastic story."}, {"id": "f5pd1gm", "author": "SpaceRaceMenace", "body": "Bruh, this reminds me so much of Hepatica. That manga really has this feel of kids being assholes to another girl."}, {"id": "f5peiii", "author": "NotSoSourDiesel", "body": "That was freaking beautiful OP! I may or may not have teared up a bit near the end... Long live spacegirl and jane :)"}, {"id": "f85374u", "author": "zachlyh", "body": "I keep picturing Bonnie Wright as Spacegirl haha. Wonderful writing!"}, {"id": "f975oqk", "author": "gab4323", "body": "This would be great as a TV show/movie/short film I swear to God"}, {"id": "fa7shrb", "author": "SuperSoftPillow1273", "body": "holy fuck this is one of the best stories ive ever saw on r/nosleep and this isnt even that dark"}, {"id": "fb5ubyr", "author": "TheSpicyTriangle", "body": "Wholesome darkness. I have to say, I rather enjoy it."}, {"id": "fb7gamv", "author": "RockmachineRaks", "body": "Im interested about what her father did wrong..."}, {"id": "fcj3mg6", "author": "aertimus", "body": "I’m sorry but the ending of this story is cute as hell. I love it."}, {"id": "fdipeac", "author": "saggy-stepdad", "body": "called it :-)))"}, {"id": "fffxq40", "author": "Lopadopalis", "body": "Dare I invoke the Doctor Who episode 'Fear Her'?  \nAnyone else? Eh?"}, {"id": "fhgnhw1", "author": "flannelliz", "body": "Yay!!! Lesbians!!!!"}, {"id": "fjx6k4y", "author": "Pengwertle", "body": "Aaaaaaa thank you so much for writing this!! I was rooting for that ending ever since you started standing up for her, gosh this is too much for my gay little heart ❤️❤️❤️"}, {"id": "fkg7kd6", "author": "heyitskevdude", "body": "Oh wow glad that things ended up working out for you. Also, as great of an artist your wife is, she also is quite the poet that piece that she wrote for you is really clever."}, {"id": "f2ve4kd", "author": "RayRay_Hessel", "body": "I was bullied in school and I can understand ur younger reactions were based on fear. I don't feel sorry for Sasha and Tanya. U said wife. Did u marry Megan or someone else? ❤️ Love this story I hate school bullies. Some have a hard life they take out on school mates but Sasha and Tanya were something else. I'm glad u decided to protect Megan/Space girl and I was hoping her drawings would help. Not sure what she would prefer to be called, Megan or Spacegirl. ❤️ Good for u realizing it was wrong and protecting her. Much love."}, {"id": "f2v0ai8", "author": "neva12345", "body": "This is really lovely glad the bullies got what was coming to them and you and Megan got together in the end so sweet"}, {"id": "f2v0k6n", "author": "Teethtimee", "body": "One of the best posts here! Amazing! So happy for you:)"}, {"id": "f2v453t", "author": "kochemi", "body": "Yes spacegirl get them"}, {"id": "f39y0ia", "author": "obsessive23", "body": "I was honestly hesitant to finishing reading because I was scared something bad would happen to spacegirl. I'm glad it was a happy ending for you two."}, {"id": "f2vfug9", "author": "Princie33", "body": "Holy shit that's the best thing I've ever read"}, {"id": "f2wtr4p", "author": "spiderfalls", "body": "That was sooo INCREDIBLE!!!!  Wow!  And...I hope you two have a long beautiful life together."}, {"id": "f2yql9t", "author": "boomingsystembabe", "body": "this is amazing :0 thank you for sharing!"}, {"id": "f2yuobe", "author": "akaurr05_", "body": "Goosebumps."}, {"id": "f2zhnpt", "author": "roblox887", "body": "This was absolutely beautiful, although I can't help but wonder what happened to Sasha inside of the painting. Regardless, she refused to grow, and I can't imagine she'd have ever changed."}, {"id": "f31f2vj", "author": "fradd13", "body": "Man I'm never gonna sleep again after this 😱"}, {"id": "f332jyn", "author": "whoisinkontrolle", "body": "10/10 would read a sequal.\n\nPlease consider a part 2? Hell, I'm ready for a part 8.\n\n\nGreat work OP! Also fuck Sasha."}, {"id": "f3333nc", "author": "Daleks_Raised_Me", "body": "I love it when a nosleep makes me happy at the end!   I’m really happy for the both of you!"}, {"id": "f33kep8", "author": "DragonFlames72", "body": "I know it’s a long shot, but I’d love to see the painting"}, {"id": "f35dqjm", "author": "jennyg1313", "body": "Ahh I knew she would be your wife!! \nPs fuck Sasha.  \nPps 12/10 .... fantastic"}, {"id": "f35qwvg", "author": "AshRavenEyes", "body": "Im happy for you two truly"}, {"id": "f363j8w", "author": "arkaze", "body": "That was so kawai"}, {"id": "f386x0a", "author": "BridgetTheBee", "body": "op have u read the novel Stargirl by chance lmao"}, {"id": "f39droi", "author": "XxInsultToTheDeadxX", "body": "Hell yeah"}, {"id": "f3ar56k", "author": "Derping-McDerp", "body": "Please don’t deem me as the ultra dipshit but was the last part real?\n.o."}, {"id": "f3d8d38", "author": "CamronIsAFag", "body": "Wow that was good"}, {"id": "f3dt0v1", "author": "SlytherinQueen89", "body": "Wow,such a beautiful story...glad there's such a happy ending❤"}, {"id": "f3ei913", "author": "smithyy_04", "body": "Amazing story!! I’m so happy you two ended up together. But one question; do you know anything about Megan’s dad? The painting you saw seemed a little odd.."}, {"id": "f3feipk", "author": "Tricountyareashaman", "body": "Sasha is straight-up trash."}, {"id": "f3gre47", "author": "mepeeonu", "body": "Chills!"}, {"id": "f3zzcne", "author": "Looper17", "body": "This is a really nice short story, thank you for shairing it"}, {"id": "f41wane", "author": "PRKnife", "body": "This is amazing"}, {"id": "f559s0r", "author": "musicissweeter", "body": "I started crying at the last line, well done you."}, {"id": "f59tj48", "author": "taloolah1963", "body": "wow    awesome ... good for you guys"}, {"id": "f6bh330", "author": "Burritos_ByMussolini", "body": "This is about that nerd from Recess"}, {"id": "f7m0yh4", "author": "1RayOfSunshine", "body": "This is one of the stories that makes my heart clench when it's over. It was beautiful. Sending my love to you and Megan!"}, {"id": "fec0wb7", "author": "mellowlearner", "body": "Why were men visiting her mum???"}, {"id": "ffehovj", "author": "softbleep", "body": "So OP did have a crush on space girl! (In all honesty, who wouldn't)\n\nP.s, she's probably a Stand user, ask her about somekind of arrow, disk or maybe she had this power since birth"}, {"id": "fhgyyw7", "author": "Noxiel", "body": "As a queer, artistic individual who was also bullied throughout school... thank you for this story. I’m so happy you two made it out together. I could cry, this was beautiful"}, {"id": "fhmleoz", "author": "facepoppies", "body": "This should be published."}, {"id": "fjg0z6b", "author": "mrod35", "body": "Does she design t-shirts too? \n\nhttps://pbfcomics.com/comics/nice-shirt/"}, {"id": "fjklqzh", "author": "iamre", "body": "My heart... 😭"}, {"id": "fl4ozkt", "author": "Fudi0m", "body": "this was so fucking good, I want more now :D"}, {"id": "flcmliu", "author": "gruzzly-bear", "body": "I actually had two Megan Daniels in my highschool. One was bullied and called those names. It's crazy."}, {"id": "flfyfqt", "author": "time__for__crab", "body": "I love this so much! Incredible work!"}]}