{"id": "dlk100", "title": "I’ve Been Flying for almost Thirty Hours and The Flight Attendants Won’t Stop Crying", "url": "https://www.reddit.com/r/nosleep/comments/dlk100/ive_been_flying_for_almost_thirty_hours_and_the/", "subreddit": "nosleep", "author": "Worchester_St", "text": "Thirty hours ago I hopped on a late-night flight from New York heading to Los Angeles. After boarding I saw that I had an entire row to myself. Take off passed without incident, and soon I was stretched out for a nap across the row. \n\nI slept for a few hours, I don’t know how long, but I woke up to some severe turbulence. It’s possible that the lights in the cabin went out for a moment, but I was so disoriented that it’s hard to say.\n\nI checked my phone to see that it was 4:03 AM, which I figured gave me about an hour until we landed. When I looked out my window, I was shocked to see nothing but wide open ocean. My jaw dropped; there’s obviously no ocean between New York and Los Angeles. \n\nI hit the button to call the flight attendant and spent the next few minutes wracking my brain for a lake that could’ve been possibly been big enough to explain what I was seeing. I jumped when the attendant flipped off the light. She was grinning from ear to ear, and tears were pouring down her cheeks.\n\n“How can I help you sir?” she asked. \n\nI froze for a moment at her reaction before deciding to just ask my question. “Where are we? Why does it look like we’re flying over an ocean?”\n\nShe wiped her cheeks to clear the tears, still grinning wildly. “Sir, we’ll be landing in about an hour.”\n\n“I, uh, OK, thank you,” I said.\n\nAfter she left I checked the clock on my phone again. 4:03 AM blinked back at me.\n\nIt hadn’t changed. \n\nI had to have been waiting with my call light on for at least five minutes. How was it possible that it hadn’t changed at all?  \n\nI opened up my laptop and saw it too displayed 4:03 AM. I pulled out my phone, started a stopwatch in the app, and spent the next two hours looking back and forth between the clocks, waiting for them to change.\n\nThey never did.\n\nI tapped the shoulder of an older woman sitting in the row ahead of me. She looked back, an annoyed expression across her face. “Yes?” she asked. \n\n“Do you know how long until we land?” I asked.\n\nShe narrowed her eyes. “That flight attendant said it would be about another hour.”\n\nI shook my head in confusion. “That flight attendant? We talked almost two hours ago! We should’ve landed already.”\n\nShe stared at me as if I was crazy. I was going to continue trying to convince her, but I felt a hand on my shoulder. I spun to see a male flight attendant grinning down at me, tears pinging off his cheeks onto my shoulder. \n\n“Sir, I’m going to ask you to calm down, or I’ll be calling the Captain.”\n\nI told him that wouldn’t be necessary and sat back. He removed his hand and stepped away. \n\nThe flight attendants continued to stop by every few hours offering meals. My stopwatch continued to tick up and is now telling me that I’ve been on this plane for more than thirty hours. \n\nI’ve explored all of coach and tried talking to some of the other passengers, but they’ve all told me that they’re expecting to land in an hour or so. \n\nAround three hours ago I tried getting into first class. I made it past the curtain but was escorted back by two grinning flight attendants. Their grip on my arms were like iron. \n\n“Sir, the seatbelt sign is on,” one said. “Please remain in your seat with your buckle fastened. We’ll be landing in about an hour.”\n\nI’d just about given up hope when a woman came down the aisle dressed in a business suit. She didn’t look at me or slow down, but she dropped a piece of paper onto my tray as she made her way to the bathrooms at the back of the plane. \n\nI shot a look around before unrolling it. \n\nIt said, “Are you stuck too?”\n\nI pulled out a pen and wrote “Yes. It’s been thirty hours.”\n\nI folded the scrap of paper up and set it on the tray closest to the aisle. She left the bathroom and picked it up as she passed. \n\nIt’s been twenty minutes since then. I don’t know why, but I don’t think the flight attendants would like it if they knew we were talking. It doesn’t matter. I have to do *something*. I’ll update you all with whatever happens next.\n\n[Part 2](https://jamesworchester.com/tales/ive-been-flying-for-almost-thirty-hours-and-the-flight-attendants-wont-stop-crying-part-2/)\n\n[Support](https://www.reddit.com/user/Worchester_St/comments/fegg4z/you_probably_just_clicked_on_my_profile_from_my/)", "comments": [{"id": "f4rmfgt", "author": "frankado", "body": "Even if nothing paranormal was going on, a 30-hour flight still sounds like utter hell."}, {"id": "f4rnkfm", "author": "spartanwanderer", "body": "This is one of those situations where you should probably bite the bullet and pay for the WiFi."}, {"id": "f4r6wex", "author": "shadfly", "body": "This is such a horrifying concept, being stuck in time."}, {"id": "f4scpno", "author": "Thefatpug512", "body": "Maybe that turbulence that woke you up was you guys crashing and your now dead but since you didn’t realize you died your stuck and unable to move on"}, {"id": "f4sel1m", "author": "Anticlimactic__", "body": "I wonder why has the crew been smiling abnormally yet crying at the *same time*? That's creepy...\n\nOP please stay safe!"}, {"id": "f4r6cpn", "author": "Phailed30", "body": "Time bandits! Keep us posted"}, {"id": "f4s652t", "author": "MoyamoyaWarrior", "body": "So there is a show called Manifest on TV and I am wondering if the government or SOMEONE didnt get an idea from it, in the show the plane vanishes for 5 years but when it finally DOES land, no time had passed for the passengers. Its fascinating to watch and the first thing I thought of when I saw this. I am guessing you have in air wifi, maybe slip the other person who is aware of things your email/twitter/facebook/something so you can talk to each other."}, {"id": "f4rlp95", "author": "_crispy-bacon_", "body": "I hate being in a plane. I hate being in a plane over water more. Multiply that times 30 hours and you have me crying more than all of those flight attendants combined. \n\nI'm on my lunch break and my stomach is turning so much from thinking about this that I won't be eating."}, {"id": "f4so1ex", "author": "eletric_embryo", "body": "I’ve have seen a creepypasta very similar to this but like your version too my theory is the turbulence you experienced was actually your death and ever since you have been stuck in a purgatory like state or this is just a symbolism of not being able to except your death. Or maybe you are just stuck in time whatever the case is the flight attendants are freaking me out.\n \nEdit: looks like i have beaten to this theory but i stick with it."}, {"id": "f4r411i", "author": "TheMemesist", "body": "I'm not sure what's going on OP, But just stay safe."}, {"id": "f4sw8uq", "author": "W2BJN", "body": "Damn\nAs if being stuck on a plane for 30 hours itself isnt bad enuff, youve had to suffer thru multiple crappy airline food meals.\nI suggest to meet up with that chick in the handicap bathroom, become a member of the mile high club and then cause a fuss to get the captain to make an emergency landing."}, {"id": "f4rz18j", "author": "heidivonhoop", "body": "A row to yourself? 30 hours doesn’t sound so bad. Take a bunch of naps and catch up on work 👍🏽"}, {"id": "f4tnvh8", "author": "silverminnow", "body": "Maybe you and the other lady aren't being affected because you were asleep? There are usually a handful of people napping during a flight, so there might be one or two others who are also aware that you're all stuck.\n\nI agree with someone else who brought up the possibility that the flight attendants are also aware but unable to control their actions.\n\nI wouldn't want to be brought to the captain if I were you. Something about how the flight attendant mentioned that is off. Stay safe. I hope you escape before the food and drinking water run out."}, {"id": "f4u3axz", "author": "Alexx989", "body": "What's the big deal? You're landing an hour."}, {"id": "f4s7mlr", "author": "Nicosarea", "body": "Imagine this is how ghosts operate. Being stuck in time after meeting your own demise - not realizing you've actually died and are locked in a loop. Your only way out is through haunting."}, {"id": "f4rebbe", "author": "0rvi_13", "body": "Try contact the other person somehow but make sure no one notices"}, {"id": "f4s7lk3", "author": "baggins69", "body": "My wife reads this I will never get to go on a ✈"}, {"id": "f4uolmh", "author": "Ygomaster07", "body": "I can't wait for the next part of this story, it's really gripping. Is there a bot that allows me to get updates when you post the second part of your story?"}, {"id": "f4sbv5x", "author": "Evilnear", "body": "Seems your in purgatory son"}, {"id": "f4tje0e", "author": "enkaydee", "body": "The tears of the flight attendants makes me think they're being controlled but aware of what's going on somehow. Wonder if the pilots are crying too?"}, {"id": "f4s4qba", "author": "CthulhusWaifu", "body": "I will be waiting with bated breath, stay safe until then"}, {"id": "f4thj14", "author": "hippietravel", "body": "I'm sure you're just overreacting .."}, {"id": "f4uw8xz", "author": "TheMostCrypticCrab", "body": "Hey OP... Not sure what the deal is with the woman, but I think you may have died at 4:03. It might explain why you haven't landed yet, and it could be the reason the flight attendants are all crying. They could still be smiling because there's nothing they can do for you and they have to provide service for the other customers until they land."}, {"id": "f4sc18f", "author": "Daphoon231", "body": "Yes please keep us updated. This is very compelling. You should also see if you can get that passenger to join you."}, {"id": "f4sxku0", "author": "RindaC10", "body": "I'm loving this! Keep us posted!"}, {"id": "f4u5mwe", "author": "goatsanddragons", "body": "If it weren't for the fact that you're stuck in a plane that purgatory state would sound pretty fun. You can still use the internet so you can probably stream movies, play games and listen to music to your heart's content. If your body is also under its effect than you can also probably eat whatever you want. If not then you can easily work out and get some some serious gains.\n\nBut you're stuck in a freaking plane, so yeah, you're pretty much in hell."}, {"id": "f4ua5vp", "author": "one_lame_programmer", "body": "I think airplane crew know they are in trouble, that's why they are crying."}, {"id": "f4ubtpl", "author": "Fakeplantaccount", "body": "Is your phone battery decreasing"}, {"id": "f4urws8", "author": "UnknownCat13", "body": "Wouldn’t the plane have run out of fuel after 30 hours if it was only a New York to LA plane?"}, {"id": "f4urzei", "author": "The_Wright_Wight", "body": "Keep an eye out for nuclear meatballs that like to eat space and time.\n\nSafe travels."}, {"id": "f4us0yn", "author": "pharmaninja", "body": "Just read this waiting for my plane to take off. Fuck."}, {"id": "f5wvpzt", "author": "Myu_The_Weirdo", "body": "It coukd be worse, you could have a baby on the plane"}, {"id": "f4tt989", "author": "Folstaria", "body": "Good one, but you really should have waited till 4:03AM to post that for the maximum creep factor"}, {"id": "f4umezz", "author": "SkyrimMemesObserve", "body": "I can explain the ocean part but not the very long flight\n\n&#x200B;\n\nMaybe the flight takes a route by flying over the US and then making a turn towards the pacific ocean to align with the runway"}, {"id": "f4y6u5i", "author": "Hvvinylworks", "body": "Any updates let us know!"}, {"id": "fichrmc", "author": "Capn_Cornflake", "body": "I just read all four parts of that story on your site. That's some amazing work you've got there."}, {"id": "flo90yv", "author": "Raptor22c", "body": "I get that this is r/nosleep, but as an aviation geek it bugs me that a flight from New York to Los Angeles (a roughly 5 and a half hour flight) has enough fuel for 30+ hours of flight time.\nThe longest endurance airliner in service is the A350-900ULR and it can only fly for 19, maybe 20 hours tops."}, {"id": "f4s94o2", "author": "Yoscree", "body": "Maybe you are on a plane that disappeared like Malaysia Airlines Flight 370... You'll possibly find the answer to what happened."}, {"id": "f4sa9lb", "author": "tinglebell-rock", "body": "Oof, imagine being stuck forever with only airplane food to eat."}, {"id": "f4shj36", "author": "Matthias512", "body": "Stay safe OP"}, {"id": "f4sitlq", "author": "big_headass", "body": "This is terrifying"}, {"id": "f4srmey", "author": "Haru825", "body": "Dang!! I wonder what god these people angered..."}, {"id": "f4su2y2", "author": "F1shoustuna", "body": "At 31, I just took my first commercial flight this last week.  \nThis is appallingly frightening."}, {"id": "f4tm887", "author": "lolipopcorn", "body": "Stay safe  , n be carefull . Holy Shit ."}, {"id": "f4tm8db", "author": "trulymemed420", "body": "Maybe the plane is stuck in time its self and anything that boards the plane is to and maybe the flight attendants are previous people that have been on the plane and thats why they are crying."}, {"id": "f4tnnwv", "author": "LunarEdge7th", "body": "I'd get hooked on so many movies I missed out last year and more, before I finally realise I've spent too long on a plane."}, {"id": "f4tofpk", "author": "Drummer_23", "body": "I really want to know what happens with this."}, {"id": "f4tqdih", "author": "svartorbitus", "body": "Why on Earth are the flight attendants crying while grinning? That's crazy shit."}, {"id": "f4tqzx7", "author": "HardCoreRussian", "body": "Just dont close your eyes. Remember."}, {"id": "f4tvy9f", "author": "moonwitch2626", "body": "Such a good start to this"}, {"id": "f4twizz", "author": "Heliotrope88", "body": "Thank goodness you have a confidant. Hope nothing happens to her."}, {"id": "f4twt07", "author": "coolnoob19", "body": "Im going on a plane in 26 hours i"}, {"id": "f4txchl", "author": "webnetcat", "body": "The timekeepers of eternity...(c)"}, {"id": "f4tzdd6", "author": "nutsnurse", "body": "Now this is why I don't fly anywhere!"}, {"id": "f4tzw45", "author": "r4bbl3d4bbl3", "body": "And I still flew thirty hours..."}, {"id": "f4u1h7u", "author": "imakesubsreal", "body": "bro all it means is you have a timestop stand it’s the same types as dio and he’s busy doing stuff in his world just wait a bit you’ll be fine"}, {"id": "f4u1q8w", "author": "Kalayug27", "body": "This reminds me of the time I was on my first flight and it was a journey of 5-6 hours approx. I started to feel pukish and asked for motion sickness med and the air hostess denied saying after the flight starts no medication can be given. So I sat there puking bags after bags and the hostess almost close to tears attending me. I kept looking at her apologetically over the vomit bag . I limited my journey to trains after that."}, {"id": "f4u2bbs", "author": "sixlovessa", "body": "This reminded me of some sort of take on that Malaysian flight that went missing. As if the plane went through a portal and is stuck in some time warp"}, {"id": "f4u7mj3", "author": "UraganoGheronimo", "body": "I cant see more of this story. It said resource limited"}, {"id": "f4ubmh6", "author": "DaKing61313", "body": "YO! I'm going on my first flight ever in a couple of days and this low key got me spooked!\n\nAlso, I am utterly amazed that your battery has lasted 30+ hours. sometimes mine doesn't even last 3 lol."}, {"id": "f4ubruc", "author": "3op5me", "body": "There's wifi on the plane?"}, {"id": "f4ucg3z", "author": "Japjer", "body": "Are you able to reach any other outlets? You clearly have internet and are obviously posting on Reddit. Can you access Google Maps? Can you check any other website and see if time is flowing normally outside your crazy plane bubble?"}, {"id": "f4ucput", "author": "NorthernWolfKing", "body": "Uhh bro please update us. You okay?"}, {"id": "f4ud9aj", "author": "noldorinelenwe", "body": "You wouldn’t happen to be flying Santiago airlines would you...?"}, {"id": "f4uf48j", "author": "Sn0wland", "body": "The pilot has locked himself in the cabin, driving the plane over the ocean until it runs out of fuel and crashes. The attendants know their fate, but must keep the passengers calm until everyone surely dies."}, {"id": "f4uif64", "author": "LandedKnight", "body": "I am sitting in the airport, working on my (unplugged) laptop for ~20 minutes and my battery is still at 100%. Suddenly, I am afraid."}, {"id": "f4ujv48", "author": "SIrB3ar", "body": "Maybe somebody paid the airline for a massive, complex, and elaborate practical joke."}, {"id": "f4uky9s", "author": "OmniGear21", "body": "atleast the plane got wifi.."}, {"id": "f4umern", "author": "r9c2d9292", "body": "I've literally finished reading this at 4:01. I must admit that the two minutes are going to pass wayyy too slowly"}, {"id": "f4uo99f", "author": "papergirlme", "body": "If you jump out of the plane somehow will you be flying/falling for the rest of your life? High for realz"}, {"id": "f4urcwz", "author": "stillnotaswan", "body": "I shouldn’t have read this on the way to the airport."}, {"id": "f4urnej", "author": "dweebken", "body": "It takes me about 30 h to get from home in Sydney to the hotel in Chicago, for real."}, {"id": "f4usitb", "author": "NerdyNoot", "body": "You know what would help? Fake going to the bathroom. Try to get that woman to follow you, there you guys could talk in secret and find a way to figure this out"}, {"id": "f4v8ksq", "author": "Cory-Matthews-", "body": "I was think that the plane crashed and you might be dead.. but if you’re dead and you’re talking to Us then we all might be dead too."}, {"id": "f4vacy5", "author": "BeFlatLine", "body": "Have you tried time travel?  From personal experience, whiskey is great for time travel.... it just takes a copious amount for it to work."}, {"id": "f4w36fd", "author": "ZemTheMattress42", "body": "I know I'm late (haha) but I think your plane was abducted and these alien attendants have you in some kind of parallel dimension - maybe they're gonna eat you?"}, {"id": "f4z1wh3", "author": "chemtrail-pilot", "body": "Damn. My chemtrails must’ve leaked into the cabin again"}, {"id": "f58s5h0", "author": "Whatchagonnadowhen", "body": "This is absolutely my nightmare."}, {"id": "f592qxu", "author": "izthepuzz", "body": "Watched the Truman Show right before I read this. I feel some similarities to your story. Haven’t finished the movie or reading your story yet. So don’t attack me or spoil the movie please."}, {"id": "f59c41v", "author": "Jupitrion", "body": "Sure you weren't dreaming since you fell asleep?"}, {"id": "f5amc03", "author": "PeacefullyFighting", "body": "Make them call the capten, lit a cig or something to make them lamd"}, {"id": "f5czbem", "author": "richkidatarapconcert", "body": "Great set up cant wait for part 2"}, {"id": "f5gr1s1", "author": "GermanysDevil", "body": "Check if you can access internet with your mobile data if u have. See if you can go on maps/if maps can find you. Probably not but if it can’t it’s probably super natural and I’m sorry but I think you’re doomed if you don’t jump out of that plane. Try what happens if u ask to speak to the pilot."}, {"id": "f5unhvp", "author": "rklmm11", "body": "Is there no part 2?"}, {"id": "f6z4qtq", "author": "carliemoe4", "body": "Absolutely thriling to read."}, {"id": "f7e88ox", "author": "ChingchongIgotnodong", "body": "Great read"}, {"id": "f7gtz6j", "author": "Gummi205", "body": "Did you try talking to Mary after you were unstuck?"}, {"id": "f7inq1z", "author": "eteague30", "body": "The longest I've been on was 4 hours and it was HELL"}, {"id": "f857zq2", "author": "SaysSimmon", "body": "So you hopped on a plane to LAX"}, {"id": "f87t0av", "author": "airiSan", "body": "It’s been 29 days. Are you home yet?"}, {"id": "f97d0uw", "author": "BlobberBlubber", "body": "in part 3, did u find mary? did she have the same nightmare?"}, {"id": "fha6pvr", "author": "GravitySteal__", "body": "This was a great story. Thank you"}, {"id": "fk0cv2j", "author": "Koder1337", "body": "I just read parts 1 through 3, and I have only one thing to say.\n\n4:04 not found.\n\nGreat story by the way. Loved it!"}, {"id": "fkbnzdg", "author": "sani16", "body": "u/harold_hillenburg"}, {"id": "fkdecqv", "author": "liamturbop", "body": "I too think a 4 month long flight sucks."}, {"id": "fl5fbo3", "author": "HypingZombie-II", "body": "I hope it was just a nightmare!"}, {"id": "fms6goq", "author": "MissBarker93", "body": " He didn't start going crazy until the WiFi went out. That is such a mood."}, {"id": "f4sqc1g", "author": "ISmellLikeCats", "body": "I was thinking maybe an EMP pulse took out America’s infrastructure so that’s why no lights can be seen, but that plane wouldn’t still be flying unless they were low range attacks. That doesn’t explain 30 hours in the air tho, you should be out of fuel, and food. Also fun fact, when you are flying over nothing but the open sea at night, you still see lights, lots of them, from fishing trawlers. I fly to and from Japan a lot and it’s scary to look down and see crabbing ships lighting up the arctic sea, but welp, they’re there."}, {"id": "f4zh0zy", "author": "DeadSweeper", "body": "I just came home from a flight and i was also having the whole row to myself.. just next to the washroom.."}, {"id": "f4uav4y", "author": "astronautvibes", "body": "It’s an international flight. You get all the free food you want. Stop complaining"}]}