{"id": "dnsoza", "title": "I volunteered to sit next to a dead man on a plane, and deeply regret it.", "url": "https://www.reddit.com/r/nosleep/comments/dnsoza/i_volunteered_to_sit_next_to_a_dead_man_on_a/", "subreddit": "nosleep", "author": "diesindarkness", "text": "The man in seat 43-A died halfway across the Atlantic. I was sitting near the front of the plane, just behind first class, and couldn’t really see the commotion. But I could hear someone gasping and retching — loud at first, then quieter and quieter. A flight attendant got on the PA and asked for “any medical professionals among the passengers” to help. I guess there were none. \n\nAfter a few minutes, the man’s sounds deteriorated into a sort of gurgle, then silence, then it was over.\n\nHis name was Molyneaux, and he was old but not that old, and it was likely a heart attack, aneurism, drug reaction or God’s will, according to conflicting nth-hand reports that filtered down the plane from row 43, where a flight attendant simply buckled the newly deceased back into his window seat and covered his face with a complementary airline blanket.\n\nThe pilot got on the intercom and told us the plane would be turning back to New York “due to a tragic medical situation involving one of our passengers.”\n\n“Folks, we’re looking for a volunteer willing to sit next to the deceased while we return to our originating airport,” the pilot continued. “This flight is entirely full, and the person sitting there now isn’t feeling comfortable. It’s an aisle seat, and it will only be a few hours before we’re back over land.”\n\nI’m not sure why I volunteered — probably some combination of exhaustion, altruism and morbid curiosity. My vacation plans were shot anyway, I figured, so why not take the most interesting seat on the plane? The flight attendant thanked me profusely, as did a queasy looking teenager who took my original seat. I picked up my handbag and shuffled down the aisle to the very last row of the plane.\n\nMy only prior experience with corpses was an open casket funeral for my grandmother when I was a kid, but the idea of death had never particularly bothered me. It’s natural, after all. That said, I admit that I second-guessed my decision as soon as I saw my new seat mate.\n\nMr. Molyneaux, rest in peace, sat upright between the window and me, strapped around the waist, with a blue fleece blanket covering his torso and head. The blanket did not cover his hands, which were resting on his lap above his seatbelt — placed that way by a flight attendant as a sign of respect, I assumed. \n\nMolyneaux’s pale fingers were twisted into claws that betrayed the agony of his death. I couldn’t look at those hands without imagining what his face looked like under the blanket.\n\nI thought of asking for a second blanket, but the flight crew was still busy calming down other passengers and preparing for our u-turn around the Atlantic Ocean. So I tried to forget my uneasiness and closed my eyes, and slept.\n\nI woke — hours or minutes later, I don’t know — to the jostling of turbulence. The cabin lights were off and most of the passengers around me seemed to be sleeping. I looked out the window, trying not to look at Molyneaux as I did so, and saw only the uniform blackness of the night. I imagined the ocean miles below us, lightless and cold. The thought unsettled me and I reached across Molyneaux to close the window shade.\n\nThen I stopped myself. *Hadn’t the shade been closed when I sat down?*\n\nI realized there was something else off about the scene. Molyneaux’s posture had somehow changed while I slept. It took me a few seconds to pinpoint it. His gnarled hands remained on his lap, he was still belted at the waist, and the blanket still shrouded his upper body. But the fabric looked somehow twisted now, as if he had been fidgeting.\n\nVery slowly — knowing it was insane even as I knew I couldn’t stop myself — I lifted a corner the blanket. \n\nI uncovered his shirt, which the flight crew had unbuttoned while trying to save him. A patch of blue-grey skin sprouting white chest hair peeked out from it.\n\nI lifted the blanket higher. His collar was flecked with dried blood. I remembered his terrible gasping.\n\nFinally, I pulled the blanket entirely off, and stifled a scream.\n\nMolyneaux’s head was turned away from me, exactly as if he had turned to stare out the window. \n\nI could see his face reflected in the plexiglass. It was undoubtably a dead man’s face: pale, drawn, lips parted, jaw slack. There was no life in it.\n\nExcept his eyes. They were moving.\n\nI stared at the reflection for half a minute and I’m sure of it. In the center of that death mask, two pupils flicked back and forth, as if tracking something out there in the sky.\n\n“What are you doing?” a voice beside me interrupted. I whipped around and saw the woman seated across the aisle staring at me — not so much in fear as disgust. “Cover him back up! Give him his peace.”\n\n“He’s … I think he’s been moving,” I stammered. “His eyes. I think he might not actually be ….” \n\nBut I couldn’t finish the sentence; it was too crazy. Nor did I have to, because at that moment my stomach dropped ten feet along with everything else in the plane. \n\nCoffee cups and purses slammed against the ceiling. A man near the first class section nearly tumbled out of his seat. I heard call lights going off all over the plane as passengers were jolted awake in panic and confusion.\n\n“Passengers, please take your seats, buckle in, and secure any loose items,” the pilot said over the PA, sounding shaken himself. “The weather along our flight path is clear and no planes in the area are reporting turbulence, so I’m not sure what this is. But we should be through it momentarily.”\n\nEven as he spoke, the mild background shaking I’d felt since waking up became noticeably more violent. The woman across the aisle began fumbling for her seatbelt, no longer paying any attention to me or Molyneaux.\n\nI forced myself to look at him again. The jolt must have caused him to pitch forward at the waist, his head colliding with the seat in front of him. \n\nBut Molyneaux’s face was still turned toward the window — his neck twisted at such a sharp angle that I worried it had snapped.\n\nI looked at his hands again, and the pallor of his skin. Three flight attendants and a dozen passengers had witnessed this man’s death, and I could not rationally imagine they were mistaken. \n\nAnd yet in the reflection of the window, his eyes left to right, left to right.\n\nI had heard that strange reflexes sometimes kick in after death — limbs flailing, headless chickens running, nerves clearing out the last backlog of instructions from the brain. But the eyes? I had never heard of that.\n\nI made myself look past that unsettling reflection, at the sky itself. It was still dark, moonless and cloudless, but the atmosphere seemed to have taken on a strange hue — a very dark green, like pea soup fog. I thought I could see vague shapes swirling around in the murk, though it might have been an optical illusion. I recoiled.\n\nI desperately wanted to be anywhere else right then, but the rest of the cabin was approaching a state a pandemonium. Flight attendants were hurrying up and down the aisles, attending to spills and bruises, even as they tripped and staggered. The entire plane was shuddering like a barrel going down the rapids. \n\nA series of jolts sent Molyneaux’s upper body swinging back and forth like an upside down pendulum. He was thrown backward into his seat, then sideways into me (a horrible feeling I will never forget), and then the opposite way, his face slamming directly into the window, where it came to rest.\n\nThat was enough for me. I unbuckled, leapt out of my seat and locked myself in the bathroom directly behind me. I would cower on a toilet for the rest of this hellish flight rather than spend another minute sitting with Mr. Molyneaux.\n\nThis plan worked for a half hour or so. I braced both my arms against the bathroom’s walls and listened to the chimes of flight attendant call buttons, the whine of jet engines and the growling of the sky. I tried to calm myself by visualizing the skyline of New York, the JFK air strip, a calm descent.\n\nBut then I imagined Molyneaux’s window, his face mashed up against the glass like a little boy’s, his dead eyes searching the night.\n\nThe captain’s disembodied voice called me back to reality. He sounded outright scared now, and the PA kept cutting in and out.\n\n“ … extremely anomalous weather … need everyone in their seats in the emergency position … immediately … if we depressurize … ”\n\nThe turbulence stopped for four or five seconds, and then suddenly it felt like I was inside a washing machine. I bounced against the walls of the bathroom, landed on the floor, and could barely manage to get the door open and crawl on all fours into the aisle.\n\nAll three flight attendants were down, sprawled on backs and bellies between the seats. Some of the overhead luggage bins had burst open and spewed baggage out. Many of the passengers were weeping. A few prayed. And through it all, the plane would not stop shaking.\n\nI heard a series of small bangs above my head and felt something wet on my cheek. Every single soda can in the galley had exploded. I climbed into my seat and belted myself in, having briefly forgotten about Molyneaux in my terror.\n\nTHWACK THWACK\n\nBut he was still in his seat of course, whipping back and forth like a flagpole in a hurricane, head-butting the window so hard that I could see the plexiglass balloon outwards and rebound each time. \n\nTHWACK\n\nI became worried he’d crack the window, though that’s supposed to be impossible, so I overcame my revulsion and grabbed his shoulders. But I couldn’t restrain him. \n\nAgain and again, his head hit the window. I began to fear that it was not simply the motion of the plane that compelled him. \n\nTHWACK THWACK THWACK\n\nNo one else on the plane was watching this. Some of the passengers had rallied and were trying to pull the injured flight attendants out of the aisle. Others were whispering goodbye messages into their phones.\n\nTHWACK THWACK KRKRRRRR\n\nI heard something crack beside me, and hoped desperately that it was Molyneaux’s skull, and not the window. Outside I could see that the green fog was alive with swirling, amorphous shapes.\n\nTHWACK KRKRRRR KRKOOM KRKOOM\n\nAnother explosion. Not pop cans this time, but pressurized oxygen escaping into sky. Molyneaux had managed to smash out both window panes in one, final blow. Now his mangled head was hanging outside the plane, and the rest of his body was straining to follow it, restrained only by his seatbelt and the width of his shoulders.\n\nAn alarm went off in the cabin, and a jungle of oxygen masks fell from the ceilings. I put mine on at once, but heard other people screaming. Some passengers were trying desperately to get masks on the unconscious air crew, but the plane was shaking more violently than ever, and loose debris was flying up the aisles toward my row — toward the hole a dead man had made in the airplane.\n\n“… cabin breach…” said the pilot. “… limited backup oxygen, so I’m trying to descend to a safe altitude … but hard to do that in this storm, or whatever it is … God be with us.”\n\nOnce I was sure that I could breath and was no in danger of being sucked out myself, I took one last look at Molyneaux. His head might have torn clean off outside the window, for all I could see of it past the rest of his body. \n\nI pictured those eyes again, which had seen something in the sky that we had not seen — could not see, even as it now threatened to shake the plane apart. There was some connection between these events that I might never understand. But even without understanding, I could make the last move available to me.\n\nI reached over Molyneaux’s lap, lifted one of those cold, clawed hands, and unclasped his seatbelt.\n\nThere was an intolerable crunching noise as, I presume, his shoulders were squeezed and crushed to fit the window frame. And then in a split second he was gone — out the window, into the night, a pale old man falling end over end toward the black ocean.\n\n“Whatever you saw out there,” I whispered. “Whatever you were looking for, go to it and leave us be.”\n\nThe green fog lifted a few minutes later, and the plane descended until it was safe to breath without the masks. Less than an hour later, I really did see the JFK airstrip. A whole squadron of police and ambulances met us on the way down. The flight attendants and several passengers had to be hospitalized, but as far as I know no one suffered serious injuries. \n\nFederal investigators eventually concluded that we had flown through a localized weather anomaly — witnessed by no other plane in the sky that night. Some sort of debris must have been flying around up there with us and taken out the window at 43-A, they wrote in their report: “This event led to a sudden loss of cabin pressure, in which the body of a passenger who had died earlier in an unrelated medical emergency was ejected from the plane.”  \n\nI expected to hear a lot more about it on the news, but I suppose in the end it was just one of those things. The airline had no interest in publicizing the incident, of course, and the passengers had no desire to relive it. \n\nFor most people on the flight, it was simply a freak tragedy followed by a close call, and all’s well that ends well. I’m the only one that will dream for the rest of my life about Molyneaux’s eyes, and what they saw on the way to the ocean.", "comments": [{"id": "f5frybi", "author": "reddithashaters", "body": "They should have offered you a voucher for either money or a free flight. I mean jeez"}, {"id": "f5fyph4", "author": "Wikkerwoman11", "body": "I understand your regret in your seating choices, but just imagine. What if an idiot had chosen to sit there and now your plane was doomed? You were the hero we all needed."}, {"id": "f5fy36p", "author": "A_Piece_Of_Fluff", "body": "Surely there has to be some kind of policy or procedure for cabin crew to follow if a passenger dies? I wouldn't have thought they'd just put them in their seat?"}, {"id": "f5gf1tc", "author": "xslite", "body": "That man wanted to bring the entire plane down to hell with him, fuck that guy."}, {"id": "f5fpasj", "author": "roflolmaomgdi", "body": "I'm never getting the image of a dead man intensely flopping against a window out of my head thanks"}, {"id": "f5fod61", "author": "nikolaijinfu", "body": "Fright of flight:  \nSounds like some otherworldly force could have possessed Molyneaux's husk, claiming him for its own nefarious purpose."}, {"id": "f5hk3gx", "author": "Spartan-417", "body": "INCIDENT REPORT: NA-30k-0016\n\nAnomalous weather activity detected around plane at [REDACTED], MTF-Alpha 9 (Flyboys) dispatched to investigate. While en route, plane suffered an explosive decompression due to Item-4592-NA. [DATA EXPUNGED] then released Item-4592-NA’s seatbelt, leading to the item being released into freefall, and the anomalous effects dissipating. \n\nThe Item was retrieved by a Flyboy aerial capture system, and the Foundation are attempting to track down all passengers who witnessed anomalous events, to remove anomalous memories. So far, 8 █% of passengers have been successfully amnestied.   \nThe item is currently contained at Site-[REDACTED]"}, {"id": "f5g2z97", "author": "aykray", "body": "Did you find out who Molyneaux was? Did his family come forward? Maybe there's some connection between who he was in life and what happened after he died.\n\nBtw, what you did was commendable, OP. You saved many lives with your presence of mind."}, {"id": "f5h1lbs", "author": "NeonWaffle", "body": "This reads like modern day Poe. Love it. Sorry this happened to you, OP. They owe you like 5 meal vouchers lol."}, {"id": "f5gino9", "author": "drinkwater247", "body": "Kinda regretted reading this just before heading to bed. Now i can't sleep ): \n\nI wonder what the old man saw outside of the window.."}, {"id": "f5h32w3", "author": "TheTrueNarwhal", "body": "Great time to read this considering I’m getting on a plane to go home from a trip in 3 hours"}, {"id": "f5g1dls", "author": "killey2011", "body": "This is why you don’t fly Delta."}, {"id": "f5j1qno", "author": "meowmeowpaws", "body": "Isn’t reading so amazing? All of us have a different dead guy going Gumby against an airplane window. \nPaul Bearer for me."}, {"id": "f5imlkq", "author": "Nicky358", "body": "Maybe he saw something or there that caused his heart attack? Maybe whatever was out there wanted him?"}, {"id": "f5ff19q", "author": "DallySleep", "body": "Very creepy"}, {"id": "f5gg4qt", "author": "ChickenOnAStick", "body": "“Peter molyneaux is a liar, but also a genius”"}, {"id": "f5jg0ac", "author": "jodi5315", "body": "When my mother was braindead, I was convinced she could hear us talking to her, bc once we would, her eyes would go from looking forward, still, to back and forth. But, the neurologist said involuntary muscle contractions include the eyes during this process and death. So, it is possible the eye part could be explained. Head banging, though? Nah.."}, {"id": "f5jimx6", "author": "bobaoppa", "body": "Ah, a normal day flying with United"}, {"id": "f5i7wzs", "author": "ihgordonk", "body": "but what of Molyneaux’s unclaimed luggage?"}, {"id": "f5ntrj3", "author": "yaMomsChestHair", "body": "I imagined him waving around like those things outside of a car dealership"}, {"id": "f5il83y", "author": "bobbysteel", "body": "Reading this on in-flight wifi makes it 10x better now"}, {"id": "f5jlts4", "author": "Tsarius", "body": "I am sure you don't wanna hear this, but what if taking the cover off his head had put that series of events into motion?"}, {"id": "f5gzneb", "author": "that0neBl1p", "body": "One question: Was this over the Bermuda Triangle?"}, {"id": "f5jsp1j", "author": "anniekinshywalker", "body": "Thank you for flying spirit airlines"}, {"id": "f5h9yn0", "author": "insecure_insomniac", "body": "That was quite a read. What you did was definitely amazing!"}, {"id": "f5ibeso", "author": "69MasterBlaster-69", "body": "Lol so an airline didn't offer anyone an upgrade for the inconvenience? Sounds real."}, {"id": "f5ifjwy", "author": "awongreddit", "body": "Great, I'm flying in 12 hours sigh.... Why would I read this"}, {"id": "f5h7rjj", "author": "parallel-universe2", "body": "When I started reading I thought the dead guy was the same guy that was stuck on a flight for many days...\nMaybe these events are somewhat related?"}, {"id": "f5i777r", "author": "sphmlmn", "body": "don’t have a fear of flying, but you know what? next time i’m on a plane all i’ll think about is this, thanks i love it"}, {"id": "f5j26rh", "author": "Jacob29687", "body": "Good riddance, if it was Stefan Molyneux"}, {"id": "f5fzyt5", "author": "rocco3336", "body": "Awesome read. Bravo. I hope that experience doesn’t put you off from flying forever. Kidding."}, {"id": "f5gcqs9", "author": "Bboytunero", "body": "You saved everyone, that dead man was an agent sent to collect blood from all of you. Good thing you got rid of him quickly."}, {"id": "f5gkvha", "author": "SuzeV2", "body": "Voucher?  Discount?         No no. She gets first class round trip ticket once a month for the rest of her life!!!!"}, {"id": "f5hu29m", "author": "Callofthewind", "body": " sounds like cthulhu or one of the other ancient ones were calling him home."}, {"id": "f5jfg0p", "author": "wiggeldy", "body": "Molyneaux saw the wild hunt coming for him."}, {"id": "f5jtk96", "author": "xLaniakea_", "body": "Jeez dude. This sounds like a crazy nightmare. Condolences and well wishes for you and Molynauxs families, though. Am really curious to know what that weather anomoly was."}, {"id": "f7cfadf", "author": "nephesett", "body": "what the fuck"}, {"id": "f5ink7u", "author": "Gravydog_316", "body": "come to my hospital sometime... all this, PLUS \"loving\" relatives standing over him while they argue about his money"}, {"id": "f5jbfx2", "author": "pappazeuss", "body": "fucking molyneaux."}, {"id": "f5k1hn1", "author": "hfr6009", "body": "Literally reading this on a plane, although I'm in the window seat."}, {"id": "f8fihr0", "author": "thiccgo12", "body": "Probably spirit airlines"}, {"id": "f5fw9zt", "author": "xemile", "body": "I guess that's the end of flying for me ..."}, {"id": "f5htur3", "author": "Grimlock_1", "body": "Don't disturb my friend, his dead tired."}, {"id": "f5hysci", "author": "LunaAngelina", "body": "....and this is my stop. Thanks for taking me on this complete ride from hell. I won’t be sleeping tonight."}, {"id": "f5i3qgk", "author": "Vortilex", "body": "Mental image of the guy going out the window keeps turning into the scene from Curse of Monkey Island where you fling Charles de Goulasch's skeleton through the wall and he parachuted into the cemetery while cackling"}, {"id": "f5j366i", "author": "svartorbitus", "body": "You bid him well. That's so nice of you. You're a hero."}, {"id": "f5jhptq", "author": "SarahSmiles95", "body": "This made my fear of planes worse thanks"}, {"id": "f5jivb0", "author": "MoonlightandMystery", "body": "Like I didn't already have a big enough fear of flying... Damn."}, {"id": "f5jovuc", "author": "TheXGamers", "body": "I'm sorry you had to go through that... This is some Lovecraftian horror"}, {"id": "f6enbhp", "author": "psilocybecubensis666", "body": "Molyneaux seems like a nice guy"}, {"id": "f6plafk", "author": "jill2019", "body": "What did he see? Please, I need to know."}, {"id": "f8e8rtt", "author": "pjorgypjorg", "body": "This is why I don’t fly United"}, {"id": "fh48wkt", "author": "barber97", "body": "this is what happens when you try to out-pizza the hut"}, {"id": "f5jih0z", "author": "SantGamer", "body": "This - and I apologize for sounding uncaring, you obviously had a terrible trauma - reads like a really really good Junji Ito comic."}, {"id": "f5jrv84", "author": "shenanigans1978", "body": "This gave me too much anxiety!"}, {"id": "f5jt6vw", "author": "Aninternerloser", "body": "I'm pretty sure all of that was just swamp gas. Or Venus through the atmosphere, or maybe even weather balloons, OP."}, {"id": "f5jw9cq", "author": "Irredditant-Elephant", "body": "Molyneaux was just vibin"}, {"id": "f5jxlbp", "author": "Ghost_Couch", "body": "I'm honestly terrified of flying, so I'm gonna have to say congrats as you have officially kept me from ever getting on a plane 😑😐"}, {"id": "f5jylmz", "author": "FrostyPinky", "body": "I'm afraid to search his name and might start a new curse."}, {"id": "f5kaak7", "author": "blkgemini84", "body": "That was creepy, I could imagine every detail. I'm outside smoking a cigarette in the early morning which is still very dark."}, {"id": "f5mmi6e", "author": "Duct_Tape_And_Prayer", "body": "Extreme anomalous weather? At this time of year, at this time of day, in this part of the atmosphere, located entirely in that stretch of sky?\n\nOn a more serious note, OP i hope you never have to go though that again."}, {"id": "f60oyra", "author": "fradd13", "body": "[All I could picture in your description of the body flailing about](https://youtu.be/wBqM2ytqHY4)"}, {"id": "f6jeo0d", "author": "Athlynne", "body": "Hey, I never do this, but I heard Ripe read this story on YouTube, and I searched for it in order to tell you - BRAVO, this is amazing. If you're not a professional writer, you really should be. Thank you, it chilled me even in Ripe's familiar, calm voice. And hope you had a good Halloween and no recent flights that were terrifying. :)"}, {"id": "f76bwu7", "author": "Canyoudont69420", "body": "At least this had a happy ending and the dead guy got his (last wishes?)"}, {"id": "f7a6up5", "author": "jennyg1313", "body": "It’s like weekend at bernies. Instead of dancing to music this guy just wants to jump into the ocean."}, {"id": "fcov52c", "author": "mikeyboi6969", "body": "Scarecrow Corpse"}, {"id": "f5iklie", "author": "DemonsNMySleep", "body": "Damn, would have been eerier if, when Molyneaux was sucked out of the plane and disappeared, the window appeared back in place like nothing had ever happened."}, {"id": "f5hyjvq", "author": "SGTDaydream", "body": "Did this event influence your username by any chance?"}, {"id": "f5hqvk5", "author": "bint_elkhandaq", "body": "This is so disturbing. Great job OP"}, {"id": "f5iezzv", "author": "TobiasKG", "body": "Username adds up"}, {"id": "f5ild4a", "author": "taz93v", "body": "I would honestly take the seat of the most interesting seat on the plane. Sounds adventurous."}, {"id": "f5j1agf", "author": "SneakyVeg", "body": "Good read, making my plane flight being delayed a bit more entertaining"}, {"id": "f5j36kz", "author": "Noire_Raven", "body": "Gremlins, anyone?"}, {"id": "f5jhiiu", "author": "commissarinternet", "body": "(checks Twitter, ends up disappointed)\n\nOP had me hopeful for a moment there.  I hope everybody present has a nice week :)"}, {"id": "f5jnyzg", "author": "Klik23", "body": "Crazy chain of events."}, {"id": "f5jq6x5", "author": "sweeterman66", "body": "That is why I don't fly"}, {"id": "f5jvybz", "author": "Man_WhoSoldTheWorld", "body": "This airline deserves a bad Yelp review."}, {"id": "f5jyiuv", "author": "efallenone", "body": "Did you at least get to eat an extra share? Cuz you know, he's not eating."}, {"id": "f5jztj4", "author": "weezerwookie", "body": "I've been with a dog after it died. And it did some head bobbing that was kind of freaky. I think that's the real reason why they cover people's faces because you don't want to see them Undead, most of us find it very disturbing.\n\nNow I'm curious about the weather anomaly, how those things happen. If anything else like that has been recorded to have happened."}, {"id": "f5lekrh", "author": "qwerty8675309BR549", "body": "I guess it's good he had a window seat."}, {"id": "f5qm02j", "author": "PanPride", "body": "Hey, it could be chance! Maybe you randomly flew into a storm... and the turbulance opened the shade and moved his eyes... and he broke through the window....\n\n&#x200B;\n\nNevermind, it wasn't chance."}, {"id": "f5rn6p5", "author": "DrHaggans", "body": "This made me look out my window"}, {"id": "f5ywfve", "author": "omgnanna", "body": "what kind of pea soup are you eating if it's dark green"}, {"id": "f67l8l5", "author": "wablaman", "body": "Very nice story, thank you."}, {"id": "fbd6ge0", "author": "creamie99", "body": "Very creepy."}, {"id": "fjq2zjs", "author": "TheL00ter", "body": "I am reading this as I'm waiting for my flight to take off. Come on Mr Molyneaux part 2!"}, {"id": "fkldw26", "author": "urlocalartist", "body": "reminds me of the twilight zone movie!!"}, {"id": "fmcy02y", "author": "ColorfulVoid", "body": "You did a good job letting him go OP. \n\nI have been on planes a couple of times only, but I really didn't like it. \n\nIf I died in there, be sure I'd do anything to get out instead of staying trapped inside a big flying ugly metal box ! Especially if the great big ocean (and thus freedom) was waiting for me right outside of a dumb tiny window. \n\nImagine flying out like Superman ! Finally free of the unreclinable seats, crunched up leg room, squeezed beside a stranger, and cardboard food !"}, {"id": "f5gqm1t", "author": "not_grognak", "body": "Iowa vibes"}, {"id": "f5jhuk7", "author": "TheAltalio", "body": "Why did i read this!!! I have a flight later this week 😩😩😩😭😭😭"}, {"id": "f5jsx92", "author": "AlienTux", "body": "This read was truly disturbing... But awesome"}, {"id": "f5w0ffb", "author": "KaiserNazrin", "body": "Imagining a dead body moving like ragdoll in the plane is rather hilarious. Especially when he start smashing his head against the window."}, {"id": "f5jml2u", "author": "Sam_Atom", "body": "i thought it would be because he woulda shat his pants"}, {"id": "f5gcdsn", "author": "Cms40", "body": "It’s just a dead body.... like come on."}]}