{"id": "dyqd5e", "title": "Something walks whistling past my house every night at 3:03.", "url": "https://www.reddit.com/r/nosleep/comments/dyqd5e/something_walks_whistling_past_my_house_every/", "subreddit": "nosleep", "author": "Grand_Theft_Motto", "text": "Every night, no matter the weather, something walks down our street whistling softly. You can only hear it if you’re in the living room or the kitchen when they walk by and it always starts at exactly 3:03. The sound starts faint, somewhere near the beginning of the lane near the Carson place. We’re towards the middle of the street, so the whistling moves past us before fading away in the direction of the cul de sac.\n\nWhen I was younger, my sister and I would sneak into the kitchen some nights to listen. Mom and dad didn’t like that and we’d catch Hell if they found us out there but they were never too hard on us since we always stuck to the one Big Rule.\n\nDon’t try to look at whatever was whistling.\n\nMy neighborhood is a funny place. I’ve lived here since I was six and I love it. The houses are small but well-kept, good-sized yards, plenty of places to roam. There are a lot of other kids here my age, I turned 13 back in October. We grew up together and would always play four square in the cul de sac or roam around from back porch to back porch in the summer. This was a good place to grow up, I’m old enough to see it. And there’s only the two strange things here; the night whistling and the good luck.\n\nThe whistling never bothered me much. Like I said, I couldn’t even hear it from my bedroom. But mom and dad don’t like talking about it, so I’ve stopped asking questions. My dad is a strong guy, tall and calm. He has an accent since he moved to the US as a kid. His family, my grandparents, they’re from the islands. That’s what they call it. My dad, the only time he isn’t so calm is if the whistler comes up.\n\nHe talks a little quicker then, eyes move faster, and he tells us not to think about it so much and to always remember the one rule, the Big Rule: don’t try to look outside when the whistler goes past.\n\nNot that we could look even if we wanted. See, there are shutters on the inside of every window, thick pieces of heavy canvas that pull down from the top and latch to the bottom of the window frame. Each latch even has a small lock, about the size of what you’d find on a diary. My dad locks those shutters every night before we all go to bed and keeps the key in his room.\n\nMy mom…I don’t know what she thinks about the whistling. I’ve seen her out in the living room before at 3:03 when the sound starts; I could see her if I cracked my door open just an inch to peek. She’s not out there often, at least I haven’t caught her much, but once or twice a month I think she sits out there on our big red couch just listening.\n\nThe whistler has the same tune every night. It’s…cheerful.\n\n*Da da dada da dum. Da da dada da dum.*\n\nRemember how I said there are two odd things about where I live? Well, besides our night whistler, everyone in my neighborhood is really lucky. It’s hard to explain and dad doesn’t like us talking about this part much, either, but good things just seem to happen to people around here a lot. Usually it’s small things, winning a radio contest, or getting an unexpected promotion at work, or finding some arrowheads buried in the yard, you know, the authentic kind.\n\nThe weather is pretty good and there’s no crime and everybody’s gardens bloom extra bright in the fall. “A million little blessings,” I’ve heard my mom say about living here. But the main reason we stay here, why we moved here in the first place, is my sister Nola. She was born very sick, something with her lungs. We couldn’t even bring her home when she was born, only visit her in the hospital. She was so small, I remember, small even compared to the other babies. A machine had to breathe for her.\n\nWe moved into our house here to be closer to the hospital. As soon as we moved here, Nola starting getting better. The doctors couldn’t figure it out, they chalked it up to whatever they were doing but we all could tell they were confused. But my parents knew, even I knew, Nola getting better was just another of the million little blessings we got for living in our neighborhood.\n\nSo that’s why we stayed even after we found out that, for every small miracle that happens here every day, now and then…some bad things happen. But they only happen if you look for the whistler.\n\nSee, our neighborhood has a Welcoming Committee. They show up with macaroni casserole and a gift basket and a manila folder whenever someone new moves in. They’re very friendly. Four people showed up when we moved in seven years ago. The committee made small talk, gave me a Snickers bar, and took turns holding Nola. It was her first week out of the hospital so they were extra careful.\n\nThen the committee asked to speak to my parents in private so I was sent to my room where I still managed to hear nearly every word. The Welcoming Committee told my parents about how nice the neighborhood was, really exceptionally, hard-to-explain kind of nice. And then they told my parents about the even harder-to-explain whistling that happened every morning at 3:03 and ended at the tick of 3:05. The group, our new neighbors, warned my parents that the whistling was quiet, would never harm or hurt us, as long as we didn’t look for what was making the sound.\n\nThis part they stressed and I pushed my ear into the door straining to hear them. People who went looking for the whistler had their luck change, sometimes tragically. A black cloud would hang over anyone that looked. Anything that could go wrong, would. The manila envelope the committee brought over contained newspaper clippings, stories about car crashes and ruined lives, public deaths and freak accidents.\n\n“Not everyone dies,” I heard the head of the committee tell my dad. “But the life goes out of ‘em. Even if they live, there’s no light in them ever again, no presence.”\n\nMy mom, I could tell she wasn’t taking it seriously. She kept asking if this was some prank they play on new neighbors. At one point my mom got angry, accused the committee of trying to scare us out of our new home, asked them if they were racist on account of my dad being from the islands. My dad calmed her down, told her he could tell our new neighbors were sincere and they were just trying to help us. He explained that he grew up hearing these kinds of stories from his mom and that he knew there were strange things that walked among us. Some of those strange things were good and some were bad but most were just different.\n\nAfter the committee left went out to the hardware store, bought the canvas blinds, the latches, and the locks and installed them on every window in the house after dinner. That first night in our new house, I crept out of my room at 3 a.m. only to find my dad awake sitting on the living room couch, holding my baby sister. My dad held up his finger in a shh motion but patted the couch next to him. I sat and we waited.\n\nAt exactly 3:03 we heard the whistling.\n\n*Da da dada da dum. Da da dada da dum.*\n\nIt came and it went just like our neighbors said. The whistling returns each night and we never look and we enjoy our million little blessings every day. Nola breathes on her own and she’s grown into a strong, clever girl. My dad even joined the Welcoming Committee. We don’t get new neighbors often, why would anyone want to leave? But when a new family moves in, my dad and the committee bring them macaroni casserole, a gift basket, and the manila folder. I can always tell by the look on my dad’s face when he comes back if the family took the committee seriously or if we’d be getting new neighbors again very soon.\n\nNot long ago a family moved in directly next to us. The previous owner, Ms. Maddie, passed away at age 105. She’d lived a good, long life. Our new neighbors seemed like they’d fit in just fine. They believed the Welcoming Committee, took my dad’s advice about the locking shutters since they had a young child of their own. Whatever newspaper clippings were in that manila envelope, whatever evidence, my dad never let us see. But I imagine it must have been awfully convincing since our neighbors got along with no issues for the first month.\n\nOne night, when our new neighbors had to leave town, they sent their son, Holden, to stay with us. He was 12, a year under me in school. I didn’t know him well before that night but as soon as his parents dropped him off after dinner I could tell it was going to be a bad time.\n\n“Do you know who is always out there whistling every night?” Holden asked the moment the adults left the room.\n\nThe three of us were sitting in the den, some Disney movie playing idly on the television.\n\nMy sister and I exchanged a glance. “We don’t talk about that,” I said.\n\n“I think it’s that weirdo that lives in the big yellow house on the corner,” Holden said.\n\n“Mr. Toles?” my sister asked. “No way, he’s really nice.”\n\nHolden shrugged. “Must be a psycho killer, then.”\n\nNola tensed.\n\n“We don’t talk about it,” I repeated. “Let’s go in my room and play Nintendo.”\n\nWe spent the next few hours playing games, eating popcorn and then watching movies. A typical sleepover but I could see Holden was getting antsy.\n\nAfter my parents had wished us a good night, locked the blinds, and gone to bed, Holden stood up from his bean bag and walked over to where Nola and I were sitting on my bed.\n\n“Have you ever even tried looking?” he asked. “It’s nearly time.”\n\nLike most sleepovers, we’d conveniently ignored any suggestion of a bedtime. I was shocked to see he was right; it was almost 3 a.m.\n\nI sighed. “We don’t-”\n\n“See, I can’t, I can’t even try to look because my dad looks the blinds every night and hides the key,” he continued, ignoring me.\n\n“So does our dad,” said Nola.\n\n“No,” replied Holden. “No he doesn’t.”\n\n“You saw him do it,” I said, a little sharper than I meant to sound.\n\nHolden grinned. “Your dad locks the blinds, yeah, but he doesn’t hide the key. He keeps it right on his normal key chain.”\n\n“So?” I asked, worried I already knew what he would say next. Because I had noticed that my dad didn’t bother hiding the key anymore after all of these years. Because he knew we took it seriously.\n\n“So, after your dad locked up but before your parents went to bed, I went to the bathroom. And on my way I may have peaked into their room, and I may have seen your dad’s key chain on his nightstand, and I maybe went and borrowed the key to blinds.”\n\nNola and I stared and his grin only grew wider.\n\n“You’re lying,” I said.\n\nHolden shrugged. “You can check if you want. Just open your parents’ door and look, you’ll see his keychain right there on the nightstand.”\n\n“Stay here,” I told both of them. “Don’t move a muscle.”\n\nI hurried over to my parents’ room but hesitated at the door. If Holden wasn’t lying…my dad would be angry. Beyond angry. I was a scared thinking about it. But more scared of an open window with the whistler right outside. I opened the door, barely an inch, and looked in but it was too dark to see. Taking a deep breath, I walked into the room.\n\nTwo steps into the dark I froze. The whistling started. And I could hear it clearly…from my parents’ room. I never realized but they must have heard the sound every night since we moved into the house. They never told us. I don’t think I could have slept through it.\n\nI stood there, listening to the whistling come closer, unsure whether I should turn on a light or call out for my dad. Soft sounds from the living room brought me back to reality.\n\n“Nola,” I yelled, running out of my parents’ room.\n\nHolden and Nola were standing near the front door next to a window. Holden wasn’t lying. I could see him fumbling with the lock on one of the blinds. I heard a click. He did have the key.\n\nHolden let out a quick laugh. Nola stood next to him, hunched up, afraid but maybe curious. The whistling was right outside our house now.\n\nI think I made a sound, called out. I can’t remember. Time felt frozen, clock hands nailed to the face. But I found myself moving. I’m not fast, I’ve never been athletic. Somehow, though, I covered the space between myself and Nola in a moment. My eyes were locked on her but I heard Holden pull the blind all the way down so it could release. I heard the snap of it start to raise, and I heard the whistling just on the other side of the window.\n\nBut I had my arms around Nola and I turned us so she was facing away from the window. At the same time, I jammed my eyes shut.  The blind whipped open.\n\nThe whistling stopped.\n\nI felt Nola shaking in my arms.\n\n“Don’t look, okay?” I told her. “Don’t turn around.”\n\nWe were positioned so that she was facing back towards the hallway and I was facing the window. My eyes were still closed. I felt her nod into my shoulder.\n\nI reached out with the arm not holding Nola and try to touch Holden. My hand brushed against his arm. He was shaking worse than Nola.\n\n“Holden?” I asked.\n\nSilence.\n\nI reached past him and gingerly felt for the window, eyes still sealed shut. The glass was cold against my fingertips. Colder than it should have been for the time of year. I moved my hand up the window, searching for the string to the blind. The glass began to get warmer the further I reached and there was a gentle hum feeding back into my fingertips. I tried not to think about what might be on the other side of the window. Finally, I touched the string and yanked the blinds shut.\n\nI opened my eyes. In the dim light leaking out from the kitchen I could make out Holden, pale and small, staring at the now closed window.\n\n“Holden?” I asked again.\n\nHe turned towards me and he *screamed.*\n\nEverything became a flurry of motion. Lights sparked to life in the hall, then the living room. My parents’ footsteps thudded across the hardwood floor. I didn’t turn to look back at them, my eyes were glued to Holden.\n\nHe was pale, had bit his lip so hard there was a thin red line of blood running down his chin and he’d wet himself.\n\n“What happened?” my dad asked from behind me.\n\nI managed to swivel away from Holden and look back. “He looked.”\n\nI’d never seen my dad scared before but I saw it that night, in that moment, an old, ugly terror stitched on his face. A parent’s fear.\n\n“Just Holden?” he mouthed to me.\n\nI nodded yes.\n\nMy dad let out a breath. He looked so relieved I nearly expected him to cheer. But then he turned to Holden and my dad’s face changed. I wondered if he felt bad for feeling good that Holden was the only one that looked.\n\nThere was a knock at the door.\n\nWe all froze. Holden whimpered.\n\n“Don’t answer it,” my mom said.\n\nShe stood at the threshold of the hall. I’d always thought she was a skeptic and just humored my dad about the windows and the whistler but that night we were all believers. I noticed that both of my parents held baseball bats they must have taken from their bedroom.\n\nThe knock came again, a little louder this time.\n\n“Please don’t open the door,” Holden whispered.\n\nMy dad walked over to him, hugged him close.\n\n“We won’t,” my dad promised, still holding his bat. “Nothing is coming in here tonight.”\n\nThud thud thud\n\nThis time the knocking was loud enough to rattle the door. Holden screamed again and Nola clutched her arms around my neck. My mom came over and knelt down next to us, wrapping my sister and me close.\n\n**Thud thud thud**\n\n“Call the police,” my mom whispered to my dad.\n\nThe knocking instantly stopped. My dad looked over his shoulder at us.\n\n“Do you think-”\n\nHe was cut off by frantic knocking that trailed off to a polite tap tap tap.\n\n“*Police*,” something said from the other side of the door.\n\nThe voice from outside sounded exactly like my mom, like a parrot repeating the words back to her.\n\n“*Police*. *Call*. *The police*.” **tap tap tap** “*Police*.”\n\nMy mom pulled us closer.\n\n“*Police*. *Police*. *Police*. *Police*.”\n\n“Please stop,” I heard her whisper.\n\n“I don’t think calling them will help,” my dad said. “How will we know when they’re the ones at the door?”\n\nThe knocking came back harder than before. The door shook. Then it stopped. After a long moment I heard the knocking again but it was coming from our backdoor.\n\nWe all turned together towards the backdoor but the knocking immediately returned to the front door. Front to back, back to front, loud then quiet then loud again. Suddenly, the sound was coming from both doors at once, big, heavy blows like a sledgehammer. Then something started rapping against all of windows in the house, then the walls. It was like we were living inside of a drum with a dozen people trying to play at once. Or we were a turtle and something was attempting to claw us out of our shell.\n\n“STOP!” Holden yelled.\n\nThe knocking died.\n\n“I won’t tell,” Holden said, staring at the door. “I promise I won’t tell anyone what I saw. Just please go away.”\n\nWe waited for nearly a minute. Then we heard it, a soft *tap tap tap* coming from the window Holden had looked through earlier.\n\nHolden started to cry, sobbing like a prisoner watching gallows being built outside their cell.\n\nMy dad held him, brushed his hair but never lied to him, never told him things would be okay.\n\nThe tapping at the window went on for the rest of the night. We huddled together in the living room for I don’t know how long. Eventually, my mom tried to take us kids into my room while my dad stayed to watch the door. But the second we moved into my bedroom the knocking came back, so loud it was possible to ignore. I was afraid the door couldn’t take it.\n\nWe went back to the living room and the knocking stopped. Only the tap tap tap on the window remained. None of us slept that night.\n\nThe tapping stopped around 7 a.m. That’s about the time the sun comes up here. We waited another two hours before my dad opened the blinds from one window. He made us all go back to my parents’ bedroom first. I heard him open the door then come back in.\n\n“Okay,” he told us. “It’s done.”\n\nHolden’s parents came back around lunch time. My mom and dad walked Holden over to his house and they all went inside for quite a while. Nola and I watched from the window. She stuck to me the whole day, right at my side, sometimes holding my hand. When my parents came back they looked grim but wouldn’t tell us what they said to Holden’s family. It was a Sunday so we all spent the day together, ordered pizza and watched movies.\n\nThat night everyone slept in my room, Nola and my mom in the bed with me, my dad in a chair he’d pulled over. There was no knocking that night or any night since.\n\nWe didn’t see much of Holden or his parents for the rest of that week but by Thursday there was a moving truck in their driveway. Nola and I watched them packing up the whole afternoon after school. What sticks with me most is how tired Holden and his parents looked. All three had the same pallor, grim mouths and light-less eyes. Even from across the street I could tell something was very wrong. Holden and his family were gone were gone before sunset.\n\nI remember what the original Welcoming Committee said to my parents when we moved in. Not everyone who looks at the whistler dies, but even those that live have the light go out of them and the rest of their lives are full of misfortune. A million little tragedies.\n\nI think Holden’s parents must have looked, either to comfort him if they didn’t believe, or share the burden if they did. I watch Nola some days, happy and young and alive, and I wonder, if I’d been slower, if she’d looked out the window that night…would I have looked to? To comfort her? To share that burden? I’m glad I don’t have to find out.\n\nWe still live in that house, in that neighborhood. We still hear our whistler walking past every night. The blessings, the luck, the good things here are too good to leave. But we’re careful. We don’t have friends over to spend the night anymore. And my dad hides the key to the blinds very, very well. Not that I’ve gone looking. [Some things you just don’t need to look for.](https://www.reddit.com/r/Grand_Theft_Motto/)\n\n[Audio](https://youtu.be/X1zYYMQsJ3w)", "comments": [{"id": "f84mkhg", "author": "OnyxOctopus", "body": "OP has a wonderful way with words and has shared his experience with us so poignantly. We appreciate so many of you sharing your appreciation with him! However, please remember that OP is here to share a scary experience with us all, and we ask that all comments address the experience itself, and not OP’s ability to share it so well.\n\nThank you! \n\nPS. OP you are so unbelievably brave! You saved your sister’s life that night."}, {"id": "f83zz9h", "author": "ObligatedOstrich", "body": "I have a video doorbell... I've already lost this fight. Great Read!"}, {"id": "f847p4x", "author": "MasterOfReaIity", "body": "Maybe people who speak about what they saw are the ones who die?"}, {"id": "f85pedu", "author": "ShawtyUa10", "body": "Does the Whistler adhere to Daylight Savings?"}, {"id": "f843xz4", "author": "gotbotaz", "body": "You're one very wise kid to take it seriously and follow your dad's lead. Poor Holden, thinking it was a game or something, messing around with dark powers not of this world. I loved the telling of this story. Very well done mate."}, {"id": "f84an6f", "author": "all-out-fallout", "body": "Opened Reddit at exactly 3:02, saw the title, and just knew I had to read it. Best choice I’ve ever made—this was phenomenal. I hope your family keeps having a good life, and I’m so glad you saved your sister that night."}, {"id": "f83k6ol", "author": "Doctor_Craic", "body": "I don't know how you could not look out that window, I can only imagine whatever was outside looked like"}, {"id": "f840g1a", "author": "guardiandoggo", "body": "That was truly an \"edge of my seat\" story. Thank you for sharing, OP!"}, {"id": "f8489r2", "author": "snaptastica", "body": "Your dad is a very wise man to take this seriously. \n\nMy grandparents live in a village in Malaysia and we have similar stories. Whenever we go into the forest, we have a saying that asks the spirits to grant us safe passage and forgive our disturbance. Foreigners who do not say this have bad things happen to them quite often. It seems like too much of a coincidence that so many cultures have such beliefs if there isn't any truth to it."}, {"id": "f832teg", "author": "TheRakshaWolf", "body": "The song I was listening to had knocking sound-effects, I felt a shiver go down my spine and I now have goosebumps. Brilliant story!!!"}, {"id": "f84o77j", "author": "Cookienosebuttonface", "body": "Can we all commend the dad for believing? In so many stories people just have to mess with the supernatural. And I already thought I was the only superstitious person in the world. Well done that your family came out of this alright. Holden put your entire family st risk."}, {"id": "f84cqtd", "author": "sxyslmndrcvs75", "body": "My mom grew up with exactly the same situation when she was young, she lived in Upington, South Africa near an old angelo-boer concentration camp site (from the Angelo Boer war), the area they lived in was significantly better than the other areas around them, a lot richer, better properties and people seemed to prosper there, and every single night (I think around 2 or 3 am) without fault they would hear a whistler down the road, I don't think they had the same problem as you do in your street with not being allowed to look but my mom would always tell us how the air seemed to tense whenever the whistling started and the animals would start crying or growling. Very weird."}, {"id": "f840qr2", "author": "Sith_Destroyer_1138", "body": "My heart actually started pounding."}, {"id": "f83y978", "author": "cstaggs411", "body": "When you said something about the islands and the whistling, it made me the think of El silbon, which is a myth that is passed around in the Caribbean (though I think it originated in Venezuela) and he is a whistling spirit that can kill people, but after reading your story I can see there is no connection"}, {"id": "f84ht4s", "author": "Jenaucyde", "body": "I sincerely hope it’s not Tommy Taffy whistling his way through your neighbourhood."}, {"id": "f846x95", "author": "Matobar", "body": "You should have told your parents right away what Holden said when he first brought up the whistler."}, {"id": "f84hdr0", "author": "xd_Lolitron", "body": "After all, what Lovecraft said \"the greatest fear of man is the unknown\" or something like that..."}, {"id": "f84he2s", "author": "Erza88", "body": "This story gave me the heebie-jeebies because a few years ago, for about two or three weeks, someone would walk outside our house pulling on what sounded like beer cans on a string or maybe a a suitcase with bad wheels. At 4am, on the dot. I could hear it start from my living room window (sometimes I sleep on the couch because it's where the AC can blast me in the face lol) and it would continue past my sister's room, and then past my room... And then a little ways further it would stop. \n\nWhat's interesting about it is that it seemed to start and stop out of nowhere. I imagine if it was someone on their commute to work, I would hear them rolling along before they reached our house (we live on a sort of cul de sac) and then continue on rolling along long after they passed our house, since the bus stop is a good 5 minutes away on foot. But it always seemed to start right outside our living room window and stop just a little farther from my bedroom window. \n\nAnd one day it just stopped. I never did find out who (or maybe *what*) it was because I was too spooked to look out the window to see, lol. Freaky!"}, {"id": "f845502", "author": "atsaykilla", "body": "I wonder what Holden saw."}, {"id": "f84prfy", "author": "_the_misfit_01", "body": "I feel like looking isn't the extent of the consequences of The Whistler. Maybe Holden told his parents what he saw, that's why they looked grim too.\n\nPerhaps even KNOWING what The Whistler is like can have dire consequences."}, {"id": "f84q23h", "author": "Sicalvslily", "body": "Man I was so scared for your sister. Awesome job saving her! Then I was worried the bad luck would happen to your house because he looked from there. Thank goodness the whistler knew where Holden lived! \n\nAlso, just asking, are there any houses for sale? If so please send info!!"}, {"id": "f87kgvl", "author": "ddta99", "body": "Thank you for sharing your tragic story so eloquently. \n\nI wonder if the Whistler's similar to Dorian Gray's painting, taking the neighborhood's bad luck into itself so over millions of years of taking care of the area, has grown so hideous that looking at it, sucks the joy out of life. It whistles to forget its woes but seeing people, makes it realize how ugly it looks, hence why it becomes insane with rage."}, {"id": "f83q8gv", "author": "WhiteArabBro", "body": "I don't know why but I think the whistler is some kind of demon leprechaun."}, {"id": "f84dl6p", "author": "Gall09", "body": "Holden’s a little shit endangering your family like that.  \n\nSeems as though he got his comeuppance 🙂"}, {"id": "f84qh9h", "author": "Janeneedsadoctor", "body": "OP, has anyone ever recreated the tune of the whistling via piano or recorded it? Would it be dangerous for an outsider to hear it?"}, {"id": "f8436pe", "author": "spxne76", "body": "What freaks me out the most is not being able to talk a 3 am walk around the house"}, {"id": "f83tw57", "author": "ThenComesInternet", "body": "I would have to look. Like putting my tongue in the place where I bit my cheek or picking a scab. I wouldn’t want to at all but I would just HAVE to do it."}, {"id": "f84xfux", "author": "thekraken108", "body": "Based on the fact that it mimicked your mom's voice, it sounds like it could be the goatman or at least some sort of shapeshifting fleshgait."}, {"id": "f855dio", "author": "OriginalKyleBarrer", "body": "IM NOT EVEN KIDDING every night at about 1-1:30am (so morning), some dude walks down my street whistling. Middle of winter? Whistling. About to storm? Whistling. Slushy sidewalks on a cold night? Better believe the whistler is coming by."}, {"id": "f83x3ot", "author": "JessHas4Dogs", "body": "How very creepy!!!"}, {"id": "f84d8gy", "author": "coldnoods", "body": "This is pretty cool, not gonna lie. Not looking through the window for whoever/whatever is whistling is a small price to pay to get good fortunes, ya know? i could live with that."}, {"id": "f84hbqb", "author": "justanaccount80", "body": "Ok, now I'm freaked out. I literally just heard something yelling outside my apartment as I was reading this. \n\nI'm hoping it was a fox. Please let it be a fox. \n\nI'm not looking."}, {"id": "f84l43c", "author": "roccotheraccoon", "body": "Jokes on the whistler because I already won't look out the window at night!"}, {"id": "f94riz5", "author": "MandarinTea", "body": "What if the reason why Holden and his parents look so terrible is because the whistler keeps them up at night knocking on the windows and doors?"}, {"id": "f8ohsf5", "author": "thawacct2590", "body": "I wonder if that 105 year old lady just said \"fuck it\" one night and looked. She probably had the build and health of a 60 year old."}, {"id": "f849tkh", "author": "iBanished", "body": "It's 3:05am and I just finished reading this, I guess I'm safe tonight."}, {"id": "f844yjc", "author": "blacktrafficlight", "body": "Is there any history behind this whistling thing?? I really wanna know the backstory if there is!!!"}, {"id": "f85tjyp", "author": "otg85", "body": "\"I think Holden’s parents must have looked, either to comfort him if they didn’t believe or share the burden if they did. I watch Nola somedays, happy and young and alive, and I wonder if I’d been slower, if she’d looked out the window that night…would I have looked too? To comfort her? To share that burden? I’m glad I don’t have to find out\"\n\nDamn, this part in particular was so well written it made me cry..\n\nGreat story 💕👍"}, {"id": "f82y0v9", "author": "its_just_jojo", "body": "we’ve had similar things happen where i live it’s really weird"}, {"id": "f848zsc", "author": "Metalfacexxx", "body": "This was literally terrifying. \n\nI won’t hear whistling the same ever again."}, {"id": "f8470f7", "author": "lemonmelonlemonmelon", "body": "Please be careful. I had a brush with a whistler 20 years ago. Took me 15 years to shake it off.    \n\n\nPlease be safe."}, {"id": "f84zxhe", "author": "NerdyNoot", "body": "bruh   \n\n\nb r u h  \ni hear whistling sometimes outside at night but it's not around 3 am , more like between midnight and 1 am  \n\n\n  \n\n\n  \nbut i live next to a graveyard so I'm 100% not going to look out of the window."}, {"id": "f85hj8k", "author": "No1BTSstanAccount", "body": "Actually something similar used to happen in my neighbourhood too. But way less terrifying and had quite the farce of an ending.\n\nIt's a long story. I'd tell it if anybody's interested."}, {"id": "f83xqau", "author": "Nara_Rise", "body": "Thanks, i won't be sleeping tonight"}, {"id": "f85ipxl", "author": "RampantBeast", "body": "What town could be so perfect yet so scary at the same time?!"}, {"id": "f845dfp", "author": "FappingVelociraptor", "body": "Holy mother if all that is holy, this was awesome. I swear if I hear whistling I'm going to jump from my ninth floor window."}, {"id": "f83wrxh", "author": "aadhu-fayaz", "body": "This had me on edge the whole time.."}, {"id": "f86jz1w", "author": "firstson1125", "body": "As I was reading this, there was a knock on my window. I am currently hiding in an interior room with no windows. I plan to stay here for a couple minutes."}, {"id": "f8njjpg", "author": "VeryGoodNiceMan", "body": "Wow. That felt like watching a Japanese horror movie."}, {"id": "f844i0e", "author": "Canizales94", "body": "Gave me the chills..."}, {"id": "f84z0ow", "author": "BIG_CHUNGUS__2", "body": "Damn I could've almost hear the knocking and whistles."}, {"id": "f859ngj", "author": "dragislit", "body": "That was so good! I wish we got to know what it was but yesss"}, {"id": "f85j86u", "author": "MessyBarresi", "body": "WHAT WAS IT"}, {"id": "f85uguh", "author": "cr4cked_scr33n", "body": "What if you recorded outside and watched it in the morning"}, {"id": "f864sx8", "author": "arya_ur_on_stage", "body": "This was a good scare, I haven't had one in a while. Thank you!"}, {"id": "f8942yy", "author": "howlybird", "body": "This was absolutely brilliant. And good job saving your sister too, OP!"}, {"id": "f84c8lr", "author": "penisvagin", "body": "Why do I come across this at 3:03am, wow.\n\nWhat a read too."}, {"id": "f84ekcd", "author": "Rajarshi1993", "body": "Is it possible to placete the Whistler with an offering on your doorstep?"}, {"id": "f85sxh0", "author": "Revolvyerom", "body": "Holy shit. I haven't been this glued to my screen for a while.\n\nIt's time to move out, the law of averages alone says that some day you're going to get a glimpse. Even if it's just through a crack around the blinds.\n\nCount your blessings and go!"}, {"id": "f866edc", "author": "Innsmouth_Resident", "body": "This gave me shivers"}, {"id": "f89y2fj", "author": "Magena", "body": "Is it allowed to set up a camera and then look at the recordings?"}, {"id": "f8hm5z2", "author": "TrueNovak", "body": "I think I would of look I have no self control someone tells me I shouldn't do something I have to find out why so I would probably look think ya it's not that bad \nP.S great story actually creep me out a lot"}, {"id": "fa24qm5", "author": "Satoshi_Is_Here", "body": "First nosleep I've ever read. This had me terrified .I read it at night as well"}, {"id": "f84k4v2", "author": "123blahblahhh", "body": "I thought about my own little sister the whole time. Would I have been fast enough to save her? 😫😫😫"}, {"id": "f84afan", "author": "dpm259", "body": "I think a few claymores would put a stop to his whistling!"}, {"id": "f84ielj", "author": "peanutflutter", "body": "A smart kid! Kudos to you, my friend!"}, {"id": "f84jzbr", "author": "imkrakie", "body": "Must have been scary OP\n\nAnd good job not fighting the temptation to look"}, {"id": "f84mlfy", "author": "DudePerfectOk", "body": "Holl* Shi* Man"}, {"id": "f84paej", "author": "GabenTech", "body": "El Silbón"}, {"id": "f84pipi", "author": "_the_misfit_01", "body": "GREAT READ!!! How would it go with videos though? What happens if you see through video?"}, {"id": "f84x5c5", "author": "von_Roland", "body": "I would whistle along with the thing. As a musician I can help but mimic tones. Do you think it would like that or would it be annoyed?"}, {"id": "f86nyno", "author": "smolskitty", "body": "I'm so happy you and your family are safe Op!"}, {"id": "f86srt0", "author": "Ellybellyhadley", "body": "I swear to fucking god i heard a faint whistle last night"}, {"id": "f87m08z", "author": "SweetSue67", "body": "My lord, when you described the scene where you had to save your sister, I swear I wanted to cry.\n\nI really hope Holden and his family pulled through.\n\nHe said he wouldn't tell, so I wonder if that thing visited them every night after the incident."}, {"id": "f87vs14", "author": "MetalBroccoli", "body": "I read this when it was posted yesterday and just woke up from 2 consecutive nightmares about this. Must've affected my subconscious more than I expected. Good writing. Hate you for the nightmares."}, {"id": "f8i28qf", "author": "vuvuimp12", "body": "Oh man I started reading this at 2:50, always looking back at the time. at 3:03 I couldn't even read anymore, it was like time stopped and there was a sense of dread. I also have an open window with a clear view of the sidewalk"}, {"id": "f8x3kb7", "author": "jennyg1313", "body": "I wonder if Holden told you what it was, would that count? I’m so curious....\n\nThank you for sharing!"}, {"id": "f94n9lx", "author": "gator_feathers", "body": "Just have sleepovers with kids that arent assholes. \n\nI mean, even if he thought your tradition was silly, he stole from your parents, ready to break a house rule and lie about it. Get all yall in trouble.\n\nWho goes to someones house and does that? A little asshole that gets tortured by the whistler."}, {"id": "f97fpmz", "author": "Gojifan54-Cody", "body": "Dammit, Holden!!"}, {"id": "f9hs4f0", "author": "Miark082", "body": "This is my favorite story on here, thank you for an amazing read"}, {"id": "f9m5bgg", "author": "Ronskuzs", "body": "Very interesting!"}, {"id": "f9sc16o", "author": "Zerkron", "body": "I wish i had the ability/talent to write such great stories like you!!"}, {"id": "f9sl6ky", "author": "Not_Gonna_Laugh", "body": "This seemed like a book it was so good. I hope you guys are forever am safe though!"}, {"id": "fbstj78", "author": "rafaelvicuna2", "body": "Based on the fact that it imitated your mother's voice, I'm guessing when Holden looked out, he most likely saw this thing while it imitated how he physically looked like."}, {"id": "fckoql7", "author": "MejoMajonez", "body": "This is definitley the most amazing story i read on here so far. Well done, OP. If i had the coins, i woupd give your stiry an award definitley."}, {"id": "fcybjpk", "author": "prag1019", "body": "Whoa, this is super chilling! Great job, OP! Its probably just a coinicidence, but I find it so intriguing that your sister's name can be an anagram for the word \"loan\"."}, {"id": "fdam41r", "author": "stinky_poopi", "body": "F\\*\\*\\*\\*n hell OP. This was just amazing. My room has two windows and the whole time I was just nervous about someone tapping on it and whistling."}, {"id": "fdcd8tj", "author": "ghstrydr01", "body": "Thank you for sharing this. So happy you saved your sister, and maybe one day you can compile a book or some anthology of stories from your neighborhood. I'm sure we'd all love to hear more...."}, {"id": "fdfl9an", "author": "wonderlandfriend", "body": "Its just 3OH3 playing Starstrukk in the distance"}, {"id": "fe6dr04", "author": "Mandapanda35", "body": "That's terrifying! I think I'd take my mediocre luck any day over that. I'd be too curious."}, {"id": "feflqjq", "author": "Burkskidsmom5", "body": "There always has to be that one person who almost ruins it for everyone. \n\nGreat read."}, {"id": "fegf5bt", "author": "Ninjapanese", "body": "I see the ancestors of that town made a deal with an entity, and \"deals\" like that always have a bad ending."}, {"id": "ffhywze", "author": "ssslugs", "body": "Wow."}, {"id": "ffjsuy2", "author": "Error_404_Account", "body": "Still sounds like a pretty nice neighborhood. I'm a hard sleeper anyway."}, {"id": "fkuffqp", "author": "tlhrek2011", "body": "I know this is an older story, but I just wanted to say this was the first to disturb me. I couldn't read the entire thing because (my currently non-binary partner named Ray) had the name Nola for a long time."}, {"id": "f847lj0", "author": "z3bru", "body": "Maaan, what a great read.  \nId be the first one to see outside if something like that happened around where I live. Fuck my curiosity."}, {"id": "f84ht9l", "author": "icancountmybangs", "body": "Ill probably be asleep at 3am. If the welcoming party says it's not good to look,i definitely wont look. It's not everyday there's a welcoming party. Good people bringing food in your doorstep. Always listen to your parents!! 😉"}, {"id": "f875xe5", "author": "helen790", "body": "Your dad never had to hide the key because he didn’t raise any idiots. Sucks that Holden ruined that sense of comfort your dad had.\n\nHoldens parents should’ve just taken him with them if they knew he was such a little twat. I’m sorry but I have no sympathy for the boy, he put your whole family in danger to satisfy his foolish curiosity."}, {"id": "f856cal", "author": "Setinifni", "body": "But where is this neighborhood, I need the blessings lol"}, {"id": "f8busgo", "author": "rr13ss", "body": "So if you're out for the night (a party or whatever), you can't go back to your neighborhood between 3:03 and 3:05? What if someone from somewhere else is driving or walking by at that time? Honestly that'd be far too tempting, I'd rather just move away - not that I'm a big fan of looking out my windows at 3am, but still."}, {"id": "f8wdwck", "author": "tinybluesatan", "body": "Older siblings instincts!"}, {"id": "f9f8qnk", "author": "TheProGamerDan", "body": "That is a long fricking story, I am sure I wouldn't have the patience to write that. Bravo!"}, {"id": "f9ff0vs", "author": "trdor", "body": "There's some cool stories in this sub."}, {"id": "f9sr6qn", "author": "Phoenixpilot55", "body": "The scariest part of this story for me is imagining what The Whistler does if you open the door, or what he looks like. The fact that his appearance is left up to the imagination is the scariest part for me"}, {"id": "faisdd9", "author": "IntrovertedGeek101", "body": "Wow, this is the first story I’ve read here. It was a good one. Besides everything that happened of course. Hopefully the good luck keeps it from happening again to you or anyone else."}, {"id": "fax7mv0", "author": "Chardoggy1", "body": "Someone made a r/dogelore parody \n\n[https://www.reddit.com/r/dogelore/comments/eaijyb/le_whistler_has_arrived/?utm_source=share&utm_medium=ios_app&utm_name=iossmf](https://www.reddit.com/r/dogelore/comments/eaijyb/le_whistler_has_arrived/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)"}, {"id": "faxxjtl", "author": "mcfc1997", "body": "Now this is the type of content that made me love this place way back"}, {"id": "fb132jz", "author": "despacitospiderreeee", "body": "You know that time when you find the arrowheads in the yard and cut yourself and get a magic ghost"}, {"id": "fb15ktb", "author": "despacitospiderreeee", "body": "“Thanks for the gold kind sir”"}, {"id": "fb2hkg2", "author": "diablolamp47", "body": "Can we PLEASE get a short film for this? I searched YouTube and I was so disappointed to find there wasn’t anything on it"}, {"id": "fb9uyb0", "author": "_introvertttt", "body": "I was on edge the whole time reading this"}, {"id": "fbc7gsr", "author": "Salttpickles", "body": "It was 3.03 when i read this. FUCK THIS IM OUT"}, {"id": "fbkjbkf", "author": "Sussudio_psycho", "body": "I WANNA KNOW WHAT IT LOOKS LIKE DAMMIT"}, {"id": "fdytprt", "author": "raeumauf", "body": "I am so pouf of you for not looking."}, {"id": "feefjam", "author": "anastasia_oops", "body": "This is so well put together, OP, thank you!"}, {"id": "feejd2g", "author": "amruxiii", "body": "Dont tell me this is true.... great read though"}, {"id": "fefylti", "author": "The_MSPainter", "body": "I know I'm super late but is there any way you can recreate the whistling tune? I'm having a hard time voicing it and I'm curious what it sounds like"}, {"id": "feln90f", "author": "verycreativename321", "body": "It's 2:57AM and I feel like if I read it, I will hear the whistles, oh boy here we go!"}, {"id": "felyca6", "author": "Thotus_Maximus", "body": "Extremely well written and it's really scary what would come around every night, is it one entity? 2 or more? Or 1 giant entity?"}, {"id": "ffdrt7v", "author": "SorciereVerte", "body": "Does the luck work for visitors? Can I spend a night? I promise I won't look :)"}, {"id": "ffw5k1n", "author": "Gavanthino", "body": "I actually read this at night.  Idk if I’m gonna sleep"}, {"id": "fhs0dun", "author": "slickeryDs", "body": "This is an old story but i just read it its 304am!!"}, {"id": "fhvrf43", "author": "jessicaj94", "body": "I wish I could say I wouldn't have looked, but....."}, {"id": "fi3x5oy", "author": "Important_Bath", "body": "Amazing"}, {"id": "fk1jnzk", "author": "Flix0600", "body": "I wonder what happened if someone whistled along..."}, {"id": "fkg3ijy", "author": "heyitskevdude", "body": "Glad you had solid doors that sounds terrifying"}, {"id": "fkt4pys", "author": "Wheatles_BiteAlbum", "body": "If it weren't for the bit about the good luck in the neighborhood, this could all be explained by non-supernatural causes. The bad things happening to people could be explained by people being so horrified by what they saw that they commit suicide or can't think clearly so they crash their car or can't work. The light going out of people who looked could be that they were so traumatized that they can't possibly feel any positive emotion again."}, {"id": "flpf4fd", "author": "ItsAcmdblockling", "body": "Like the video and subscribe right now or this will be in your room tonight"}, {"id": "fm6vo41", "author": "darkytae", "body": "I still get chills from this"}, {"id": "fm98amo", "author": "coldestwinter-chill", "body": "But seriously, I think Holden saw Hell."}, {"id": "f859nuy", "author": "Catthewyo", "body": "I'd probably get ballsy after one too many pints and take a peak"}, {"id": "f85rchb", "author": "dead_PROcrastinator", "body": "In my (creepy) childhood home there was someone whistling outside in the early hours every single day. I was the only one who heard it.\n\nAlso heard some strange music some nights that sounded like it came from the really tall trees outside. Only me.\n\nYour story's super creepy OP. I'm glad your family is safe."}, {"id": "f84iroz", "author": "KrisszKhaos", "body": "Interesting..."}, {"id": "f84wc2j", "author": "lilybirdgk", "body": "The stories your dad used to hear back home. Do you think they could help explain this phenomenon? I'm curious whether this is a one of a kind type thing."}, {"id": "f84yitr", "author": "holdenayd", "body": "Cant lie i saw my name and got scared, is this a memory that i repressed??????"}, {"id": "f8bwlfn", "author": "BlazeIceFlame02", "body": "Don’t whistle at 3:03 AM!"}, {"id": "f8fwo77", "author": "brookybrookmiran", "body": "What if at that moment that it was knocking you guys let it in and shut your eyes close? What do you think it would have done? Abducted your friend? Hurt yall?"}, {"id": "f8tjoi2", "author": "bruh7361", "body": "I imagine the whistle monster as nyarlathotep, dunno why"}, {"id": "f8x2huw", "author": "Sillysocks-Realm", "body": "I always wonder in these horror story scenarios where terrible things happen to small groups of people, haunted houses, etc, what would happen if thousands of people were there. Would it still go down the street to whistle? Like, if it’s completely blocked with people could it even go through? Could it die if thousands of people shot at it?"}]}