{"id": "e1eyok", "title": "I was in prison for 15 years. There was a skinwalker in there with us.", "url": "https://www.reddit.com/r/nosleep/comments/e1eyok/i_was_in_prison_for_15_years_there_was_a/", "subreddit": "nosleep", "author": "InukShaken", "text": "A little background first. I was serving a 15-year sentence in a penitentiary in southern Arizona. What I was in there for isn't important. During my stay there, there were countless things that happened that no one could explain, and even more that no one wanted to know more about. \n\nIt all started with a prison legend. Supposedly, years ago something awful and unexplainable happened in the prison. Every morning we'd be woken up, and expected to stand near the front of our cells while guards visually confirmed we were present and accounted for. Apparently about a year before I got sent there, the most brutal and unexplainable thing happened during one of these routines. A man who had a cell to himself looked very off during this check. When a guard pulled over another guard to help him check it out, they found it wasn't actually the prisoner they were expecting at  all. It was a totally different man. This man, was wearing the skin of the other man over him. Loosely fitting, draped over him, apparently looked like a real monster. The scariest things were though, was the guy wearing the skin was NOT an inmate. They had no idea how he even got into prison, let alone a cell. Whats worse is that they couldn't even figure out who the hell he was. He wasn't documented anywhere. And whats worse than that? They never even found the body of the man of the skin he was wearing.\n\nPretty grisely stuff, I know. And I realize that's not the go-to definition of a skinwalker, but that's what the prison called him. The Skinwalker. Didn't help that the guy never talked apparently. Anyway, thats what started the whole skinwalker superstition around the yard. Apparently the guy got shipped to a different spot about a month after it happened, and just about everyone in genpop felt all the better for it. I heard about the story on the second day of my stay. Hell of a story to hear to place in your home for the forseeable future.\n\nNow onto the real shit though. Sure, that guy was The Skinwalker, but all he did in the long run was get an old lifer Navajo inmate to tell everyone about actual skinwalkers. It seemed like a lot of the prison culture actually revolved around them. \n\nNow, apparently, skinwalkers are tricky to point out on the spot, but if you manage to survive around one for more than a minute or two, almost everyone can tell the mannerisms are all off. They can mimic human speech but not replicate it. They twitch manically. They have an unnatural gait while walking. But apparently they got better with experience. The old Navajo guy - his name was Carl - said that he was sure there was an actual one among the prisoners. Slowly picking us off over the years. He called it \"The Grandmaster Skinwalker\" at one point. Apparently he thought it had human mannerisms down so well that you might not even be able to tell if it was your cellmate for a day or two. It had to be good he posited one night. He would expect a skinwalker to jump at any opprtunity for a kill. But this one realized it had a revolving door of people to kill coming to it, and masterfully bided its time, as Carl thought, for years.\n\nA lot of guys found humor in it. A lot more were really on edge about it. Every once in a while in prison, people snap. Sometimes you'll find your cellmate swinging in front of your bunk, strung up around the neck by his pant leg. Sometimes you just can't take it anymore. But in our yard, people tended to snap in a very special way. It wouldn't be an outburst at dinner, or a silent suicide in the night. Guys would just stop talking. Hunch over and shuffle around. Any friendships they had would be mostly out the window. They would turn into a loner during rec time, they would let their hair hang in front if their face. \n\nNo one liked to talk about it. Like if they did, it would happen to them next. I felt the same way. I didn't know if it was a skinwalker, or just people going crazy. But I didn't want to find out. It wasn't clockwork or anything, but every time someone snapped in this way, it wasn't more than a couple weeks before they were \"shipped off\" or \"transferred\" to God knows where without anyone else knowing beforehand.\n\nThen there was the nighttime occurances. Short, loud bursts of sound echoed through my cell block during all hours of the night on a regular basis. It sounded like a mix between a pigs dying squeels and nails on a chalkboard. Just another thing no one liked to talk about. Even scarier were the shadows and footsteps. The block was dimly illumanted in the night by a few lights hanging from the ceiling outside the cells. I myself saw shadows flit across my walls on a regular occasion, when there were definitely no guards near my cell. One time near the end of my sentence, I woke up, looked at my back wall and found a perfect silohuette of a person standing there, but when I looked, my bunkmate was asleep, and no one was outside my cell.\n\nAnd the footsteps. Everyone hated the fuckin footsteps. They were the scariest part. In the night, sometimes, more rarely than the shadows, you would hear ungodly fast footsteps. They sounded like wet feet slapping on tile floor. Whatver caused them would fly from one end of the block to the other in a dead sprint. Whatever it was, it was inhumanely fast. If you happened to be awake before it started, by the time you heard the footsteps on one side of your cell and whipped your head around to see the thing run by, it sounded like it was 3 cells past you. Everyone hated the footsteps. I agreed, I thought they were the worst.\n\nI was released from that place about a month ago, and I have more stories than I can count. I swear it was nearly my turn. About a week before I was discharged, my cellmate, and a good friend of mine \"snapped\". In the same kinda way. I didn't sleep for an entire week. Well I did sleep of course but never for more than a few minutes at a time. Never turned my back on the guy. The scariest thing? I woke up one night to him somehow snaking his body through the bars of our cell. For reference, I couldn't get anything past my shoulder through them. The worst part though, he was coming back in to our cell. \n\nOn the day of my release I didn't say a word to him. Just left. He seemed fine with it, so, so was I. I had made it through, 15 years of prison fights, gang disputes and for all I know, skinwalker abductions. I left through the front gates, a free man. As I walked along the fence for the rec yard, I spotted my cellmate, standing off on his own, like he had for the last week or so. I shook my head, not even really sure if it was him anymore. I took one last look over the yard, this time from the other side of the fence. I wish I hadn't.\n\nThere, standing off on his own, on the other side of the yard, was Carl. Slouched over, eyeing the other inmates, and twitching manically.", "comments": [{"id": "f8ok2l7", "author": "spnsuperfan1", "body": "The Skinwalker literally told you what he was doing and y’all were none the wiser"}, {"id": "f8p54di", "author": "EvieSilver", "body": "I like that the Skinwalker had so many choices of names but still chose \"Carl.\""}, {"id": "f8otf8c", "author": "22Kazoos", "body": "The time you caught your cellmate coming back into the cell was chilling"}, {"id": "f8ozoru", "author": "ragebagel2", "body": "I knew when you thought you were “a free man” that it would immediately backfire. Pretty much the epitome of a “Nope” situation. \n\nWell done."}, {"id": "f8pkutl", "author": "aaronemmanuel", "body": "Imagine being a scary Monster that everyone fears but still get named Carl 💀"}, {"id": "f8oipfx", "author": "Ineedsometitties", "body": "This literally sent chills down my spine,see you in hot brother"}, {"id": "f8p7l2a", "author": "now_you_see", "body": "Glad you got through your years mate. Would love to hear some more stories about your time there! \n\nWould especially love to hear what happened the night your cell mate snaked his way back into your room. Did his form seem to become loose to fit through, like an octopus, or was it more of a Star Trek style transporter from one place to another? Did anything happen in the jail that night? Any deaths or even anyone knew turning zombie like? \n\nThe prison must know what happens if they are transporting them all out of there. wonder where they keep them......."}, {"id": "f8oux86", "author": "PyroSnake141", "body": "Im a grown man and this almost made me snap! The sense of helplessness and the close call would've made me develop some anxiety for life. If *one* was in touching range... Where are the rest?.."}, {"id": "f8qvoql", "author": "dodong29", "body": "Varies from the traditional Skinwalkers I have learned about but there's a lot I don't know. From what I have learned (folklore can vary though), Skinwalkers are a Navajo tradition. They are humans who have performed a ritual (including killing a loved one; they carry the ground up bone of said loved one around in a pouch, etc) in order to gain abilities through dark magic. They are basically the antithesis of a medicine man in that they use their powers for evil. Their most notable power is the ability to transform into any animal. I learned a lot from the Skinwalkers episode of \"3am Podcast\" that had a guest who grew up on a Navajo reservation in AZ (really cool podcast with real scary stories from personal accounts)."}, {"id": "f8p2202", "author": "tbolinger76", "body": "Well you should probably do everyone a solid and call and tell the guards that Carl is the Skinwalker."}, {"id": "f8p9air", "author": "soupster5", "body": "I worked with a man who was a corrections officer (former sheriff deputy) in a prison, and he said they had one of the leaders of the hells angels in solitary confinement. He said one day he went to check on him, and the dude spontaneously combusted in front of him, and just stood there smiling, not even moving, while burning. \n\nHe told me he wasn’t a Christian when this happened, and he knew the only way it could have happened, was if he was demonically possessed (We both were working at a church when he told me this).\n\nI obviously have never forgotten that story."}, {"id": "f8ozd6q", "author": "missdeerest", "body": "Can you investigate further? We need to know where the inmates were being sent! Did the problem spread to other prisons?"}, {"id": "f8ozsya", "author": "SenpaiCaboose", "body": "Wait so were there 2 skin walkers?"}, {"id": "f8qyjo7", "author": "DAZL1", "body": "My uncle done 10 years what he said confirmed a lot of the noises and shit you hear in prison at night. He said easily the most haunted place he’s ever been with all the suicides and murders. It sounds like a “skinwalkers” or demons paradise too me."}, {"id": "f8pwjqp", "author": "GEazyxx90", "body": "Growing up in Arizona, we used to hear the skinwalker stories all the time. You can actually just google skinwalkers of arizona. Navajo people had some crazy shit bro."}, {"id": "f8p0scg", "author": "Gamerkid11", "body": "This prison sounds like a school with all the gossip. It's funny in a way. I guess school really is a prison"}, {"id": "f8p0423", "author": "saicho91", "body": "carl was your cellmate? or was there a second skinwalker?"}, {"id": "f8pac9n", "author": "Lemonta-rt", "body": "Wait so there were 2 skinwalkers"}, {"id": "f8xi3vn", "author": "SmolBeaver", "body": "For a good while I lived out in Huntsville, Texas,  which is one of the bigger prison towns in the state. The only good thing that came from living and working there was that I got to chat with a few prison guards every now and then, and holy shit some crazy things go down in some of those units. The Walls Unit has cell blocks where old Native American inmates just stand in the cells, staring at inmates. Sometimes the guards will talk about screams that go on and on for hours but it's  a voice  they're not familiar with. Another high profile inmate was able to make handcuffs disappear. More shit goes down in prisons than just gang disputes and general brutality"}, {"id": "f8p5033", "author": "Supsoup_", "body": "What were you in there for"}, {"id": "f8pcdb2", "author": "The_Little_Labowski", "body": "These inmates need to leave that mojo alone."}, {"id": "f8rut29", "author": "kishimi8", "body": "The return of luke skinwalker"}, {"id": "f8pizop", "author": "Magic_SkeletonGirl", "body": "aha I suspected Carl from the start. Well, I didn't know for sure, but I definitely thought of the possibility. Good story, crazy to believe something like that could happen."}, {"id": "f8qcouz", "author": "brookybrookmiran", "body": "If that was Carl HIS cellmate does that mean OP is the guy that was found with another inmate’s skin on him?"}, {"id": "f8rgjik", "author": "introverted-plant", "body": "I’m trying to decide if I should read this before bed 😅"}, {"id": "f8rl9wd", "author": "one_lame_programmer", "body": "I am not sure if I understand this at all. If everybody knew there's a skinwalker why the hell everybody was playing  around?"}, {"id": "f8rwq8y", "author": "shash270", "body": "The Skinwalker is you isn't it?"}, {"id": "fan1i73", "author": "TheOneWhosCensored", "body": "I saw it coming that Carl would be the Skinwalker, and it still creeped me out."}, {"id": "f8phy0w", "author": "judasmaiden15", "body": "In prison don't trust anyone"}, {"id": "f8qlrn0", "author": "CappinReid", "body": "I’d watch that.... and probably piss myself"}, {"id": "f8r6a0j", "author": "AlexGotWifi", "body": "So... correct me if I'm wrong, but aren't skinwalkers only interested in killing people? I didn't quite get why all the inmates 'snapped'. Is it like... something skinwalkers do?"}, {"id": "f8rwpm6", "author": "demiitra", "body": "Currently on the Navajo Rez here in New Mexico and this is making me paranoid. Ahéhee'"}, {"id": "f8rlwc3", "author": "hybridlulusi", "body": "I thought Carl's goals was to eat people not turn them into other skin walkers"}, {"id": "f8rxyma", "author": "Meggsy69", "body": "Being a prison and haunted,it could be demonic spirits from killed or killer inmates that are deceased so I'd say more demonic spirits taking over broken spirited men but the skinwalker/ skinned human thing is strange."}, {"id": "f8rz2nf", "author": "SuzeV2", "body": "Well now that just freaked the hell outta me!"}, {"id": "f8rze1f", "author": "BlitzJager", "body": "I never want to go to prison."}, {"id": "f8s84tc", "author": "wildhog323", "body": "Skin fucker skin fucjed"}, {"id": "f8twzbd", "author": "grasp570", "body": "That was dark"}, {"id": "f8ursud", "author": "creamie99", "body": "This is good."}, {"id": "f9fakl7", "author": "ParadisoDeity", "body": "Oh, god, this is good. I was thinking throughout the entire thing that the narrator was going to be the Skinwalker in some sort of maniacal plot twist."}, {"id": "faerok1", "author": "tired__and__sad", "body": "It’s been so long since I’ve read a genuinely terrifying post on this sub. This was fantastic. Please tell us more!!"}, {"id": "fbee8tt", "author": "andyfma", "body": "So one thing I dont understand is why were the inmates acting so weirdly out of no where? How was his cellmate getting thourgh the cell bars if Carl is the skinwalker or am I completely overlooking something?"}, {"id": "fbola1w", "author": "Mikkel_S", "body": "Tf is a skinwalker? Why have i never heard of this, and if the guards found a dude wearing the skin of another dude, wouldn’t that be on the news or something? Seems pretty unbelievable, do u have a link to the news article ?"}, {"id": "fecl20p", "author": "IgnorantBastrd", "body": "Wait so the cell mates that “snapped” were the Skinwalker?  I’m confused."}, {"id": "fjfcg6q", "author": "Oddrowguy12", "body": "Why the hell did I read 'Skinwalker' as 'Skywalker' !?"}, {"id": "fketdqi", "author": "xtremechaos93", "body": "This story just debuted in an episode of the scared to death podcast by Dan Cummins check it out here https://youtu.be/olvTGVEVKIQ"}]}