{"id": "eswqyf", "title": "Maria on the Moon", "url": "https://www.reddit.com/r/nosleep/comments/eswqyf/maria_on_the_moon/", "subreddit": "nosleep", "author": "Grand_Theft_Motto", "text": "“Did you know that early astronomers thought there were oceans on the moon?” I asked, looking up from my book.\n\nMy mom shifted in her bed, a tangle of IV tubes shifting with her. “Of course. The moon seems like the perfect place to find an ocean.”\n\n“What a shame we never found water then,” I said. “Because those false seas, astronomers called them ‘maria.’”\n\nMom smiled. “How sweet of them to name the moon oceans after me.”\n\n“Well, they didn’t find any oceans,” I reminded her.\n\n“Maybe they just didn’t look hard enough,” she replied, a little laugh slipping from her lips.\n\nFor all of the pain she was in, all of the fear she must feel, my mother always had the kind of laugh that could light a candle. We were in her hospital room, the same one we’d been in and out of for the last year and a half. Sometimes we had a roommate, sometimes we were alone. Always she held steady enough for both of us, the rock I tied my hope to, the wall against the grief I knew was coming.\n\nCancer is such a mundane word for something so hungry and cruel. I’ve noticed medicine does that a lot, covers horror with tedious language like a bed sheet over a body.\n\n*Malignant. Inoperable. Metastasized. Terminal.*\n\nBut when she laughed...when she laughed we weren’t in the hospital anymore, we were home. When she laughed, she wasn’t sick, she was young again, and I was a kid, and the world was a bright place begging to be explored. What a miracle my mother was. Cancer had taken so much from her, aged and hurt her, but it could never steal her laugh. That was hers to keep.\n\n“How are we feeling today?” the doctor asked. He came in less and less often. We could all sense this was the final stay in this room.\n\n“Just brilliant, doc,” my mom said, struggling to sit a little higher. “We can still go dancing later if you’d like. Though we’ll have to ask for my son’s blessing. Ever since his dad died, Brian’s been very protective of me.”\n\nI put on a stern face. “I’ll need to know your intentions are pure, Dr. Bradshaw.”\n\n“As the driven snow,” he played along. “But I might need a raincheck on the dance, Ms. Willen. I’m not as young as I used to be.”\n\nHe emphasized his age, running his fingers through grey-white hair. My mom tapped her bare scalp.\n\n“Right there with you, tiger,” she said.\n\nDr. Bradshaw smiled but I could tell he was burdened. I saw him glance at the small idol I’d placed on my mother’s nightstand. The talisman was a miniature oak tree carved from gray soapstone. There were four faces etched into the tree, a sentry against ill health and bitter spirits. I could tell the stone tree made the doctor uncomfortable. In all honesty, I had a tough time looking at the idol for more than a few seconds. The faces were each whittled in vivid expression. The face closest to my mother’s bed was smiling kindly and the face pointed towards the door was snarling, meant to ward away harm.\n\nThe final two faces were both weeping. All four shapes were too human, too raw. There was a *weirdness* to the stone tree that put people on edge but I’d grown used to every shade of weird you can imagine. My mother’s side of the family was full of stories of unexplained luck and mysterious tragedy, whispered secrets and unexplained deaths. By all accounts, my maternal grandmother was either an honest-to-goodness witch or full-bore, high-caliber crazy, or both. *Probably* both.\n\nThe stone tree was from a box of my grandmother’s things I’d found in the attic earlier that month. Maybe it was just a coincidence, but my mom did seem to get a bit better when I’d brought in the talisman, at least for a little while.\n\nI was daydreaming about family history and the odd box while Dr. Bradshaw checked his charts and mom’s vitals.\n\n“Can I talk to you for a moment?” he asked, ripping me back to reality. Dr. Bradshaw tried to keep a light tone but I could tell he didn’t have good news.\n\nThe hospital hallway smelled like ammonia and birthday cake. Someone must have had a party, maybe a patient, maybe a nurse. Strange how you remember the insignificant details while your world is crashing down around you.\n\n“I’m so sorry,” Dr. Bradshaw told me. “The results came in this morning. It’s spreading aggressively. We...we held it back as long as we could, Brian. Your mom is a fighter. But right now we just need to, well, to try to keep her as comfortable as we can. Brian?”\n\nThe wall was cracking, grief waiting on the other side, heavy and cold as an empty house. I’d known for months that this was the most likely outcome but it still hurt to hear. Hurt worse than I could stomach.\n\n“There’s nothing left to try?” I asked, fighting down the urge to throw up. “Anything, experimental, untested, anything?”\n\nDr. Bradshaw shook his head. “I’m sorry. Sometimes we just run out of options. She fought a good fight.”\n\n“How long does she have left?” I asked, looking back into her room. She’d fallen asleep.\n\n“Not long. Maybe days. Have you considered hospice?”\n\nThe smell of ammonia and birthday cake. The steady beep of mom’s heart monitor. I tried to focus on the world around me. My hope wasn’t dead yet. If medicine couldn’t help my mom, maybe something older could. I thought of the box of my grandmother’s things waiting in the attic. There was a lot in there I hadn’t gone through yet, books and candles and secrets and lost things. Maybe there was a cure or at least a way to keep the fight going.\n\n“No,” I said. “If all that’s left is to make her comfortable, I want to take her home.”\n\nThe doctor smiled. “I understand. We can give you some medication, ways to help her with the pain.” He put his hand on my shoulder. “Your mom’s been in a lot of pain but she’ll have peace, soon. You’ve done all you can.”\n\n“I know,” I lied. “Thank you.”\n\nMom lived in a small ranch house ten miles outside of town. There wasn’t much in the way of neighbors besides some woods and a creek slithering through her yard. It was a windy, warm March afternoon when I took my dying mother home. That night I began my work. I was going to turn the house into a bunker, a maze Death could never solve. I would keep my mother safe, I would find a way to keep her alive.\n\nThe little red book was full of ideas. Running water was an obvious place to start. The creek behind the house was barely a trickle but it should provide some coverage to the south side of the property. Salt was next, lining the doorways and window frames, then in an unbroken circle around the entire house. This step was to be repeated daily, the red book stressed, or even multiple times per day. Even a moderate breeze played holy havoc with any salt poured outside so it was always best to trace and retrace every few hours. Water and salt were common defenses against man’s oldest enemy and well known. The book offered other, less conventional, advice.\n\nIt took me nearly a week to finish carving the symbols and signs into the walls, the floors, even the trees on the property. Sometime around noon on the third day, on my back in the crawlspace etching strange marks onto the underside of the floor, it struck me how ridiculous I was acting. There was no proof that any of the information in the little red book was anything other than the delusional ramblings of a bizarre woman I’d only met once or twice as a child. For all I knew, the runes meant to ward off Death were actually a grocery list written in Cantonese. But I was desperate, and every time I saw my mother she looked frailer, more fragile. So I continued carving and praying and building layers upon layers of protections to keep Death far away.\n\nMaking my marks took me all over the property. It was a big yard, nearly three acres that blended gradually into the surrounding forest. I wasn’t able to pinpoint the exact boundary where cultivated met nature, the edges simply bled together, but I did my best to create a clean border with lines between the symbols. I’d always loved the wildness here, the way you could wander a few hundred yards away from home and feel like you’d traveled hundreds of years into the past to somewhere primal. This was the perfect playground for a kid, whether I was out exploring trails or trapping minnows or spending the summer building yet another treehouse, convinced this would be the final one. It never was, I was never satisfied.\n\nThe house itself, though small, was more than enough room for my mother and me. Dad died when I was seven. I don’t remember much about him, just how big he seemed, with a bonfire grin and arms that I thought could hold the whole world. My mom often said I took after my father. I could see it in the old pictures of him, we had the same eyes, green as moss in the summer, and the same fiery shock of red hair, enemy to every comb on the planet. The sicker mom got the more often she called me by my father’s name. I worried when she drifted away like that but a part of me was proud she’d mistake me for him.\n\nAfter all of the symbols were carved there were a few steps left in the book to deter Death from visiting. There were dozens of charms and talismans in the bottom of the old box in the attic. I sat up there combing through everything my grandmother left behind, referencing the red book, pushing the tiny charms into tidy piles. None of the idols were larger than my thumb. Some were iron and others were wood, some were heavy, others light. All of them were uncomfortable to look at or touch.\n\nThe attic was drafty but not nearly enough to explain the cold that burrowed into me as I sorted the charms. I’m not particularly tall but the attic felt like it was designed for dolls, beams so low I couldn’t even walk bent over. I moved around on my knees, rough floorboards threatening splinters even through my jeans. I could have taken the box downstairs where I’d have more room but the idea filled me with a deep unease. It seemed better to leave the box up in the attic, only taking down objects as I needed them. Up here, at least, my grandmother’s items, her legacy was...quarantined.\n\nThe red book was very specific about the distribution of the totems around the house and property. I walked carefully through my mom’s backyard, boots plopping in and out of mud, compass in hand. It had rained nearly every day since I’d taken my mom home from the hospital. I knew it was almost certainly a coincidence but couldn’t help wonder if the soft curtains of rain falling to the ground were for her. I placed charms in a compass rose with the house in the middle. The most disturbing objects were given places of honor at each cardinal direction.\n\nWater, salt, wards, charms, all placed carefully, intentionally. My grandmother’s book promised that these would offer some degree of protection against the inevitability of Death. The symbols would confuse it, the talismans distract it, and the water and salt make barriers to slow it down. But Death might still find a crack to slip through, so the red book recommended one final trick.\n\nThere was a small candle in the bottom of the box, dirty white as stained paper. When I took the candle from its case the smell made me gag. Have you ever walked past a portable toilet in the dog days of summer? When it’s so hot, the blue plastic has started to warp and bubble? Imagine that smell distilled into a finger’s worth of wax. I brought the candle downstairs, placed it on the dining room table and set it alight.\n\nThe wick caught immediately, the flame burning an unusual red-brown. No heat came off of the candle and it actually seemed cooler the closer I moved my hand to the fire. Once the wax began to melt the smell was ten times worse than it was back in the attic. I choked down a greasy sickness crawling up my throat and quickly left the room, shutting the French doors as I went. That helped trap the odor but I couldn’t shake the sense of nausea. I went to check on my mother.\n\n“Do you remember the day you ran away?” my mom asked, sitting in her bed, lunch untouched on the nightstand beside her.\n\nI didn’t think she had any weight left to lose before she was nothing but bone and memory. Her skin was rice paper over a frame that seemed smaller every day. Her eyes, though, no matter how fragile the rest of her became, remained two little lanterns against the dark, blue and bright and alive.\n\n“I didn’t make it very far,” I answered. “And I wasn’t really running away, only...stretching my legs.”\n\nMom smiled. “You told me you were leaving for the circus. You wanted to be either a lion tamer or a strongman or maybe a fire-eater.”\n\n“I think I wanted to be all of that combined. Young me was big on multitasking.”\n\nMy mother turned so she was looking out the window into the yard. “I was so scared when I found your note, the one saying you were leaving. My hands were shaking like you wouldn’t believe when I called the sheriff and then Mr. Jonas down the way. It felt like we were searching for you for half the night, even though it couldn’t have been more than an hour before we found you there, lost in the woods, wandering around and shivering. You hadn’t even brought a jacket.”\n\nI sat next to my mom on the bed. “Yeah, I didn’t exactly plan ahead for my circus escape. I remember...I remember getting over the idea real quick but I couldn’t find my way back. I’m glad you found me.”\n\n“I’m glad, too,” my mother said and I noticed her wipe away a tear. “I’m so glad. That hour you were gone, Brian, that was the most afraid I’ve ever been. Afraid we wouldn’t find you, afraid you might be hurt or worse. I couldn’t hardly breathe through the fear. Then, suddenly, you were there and the relief nearly knocked me over. I think we stayed up together the rest of the night watching the stars. I wanted to make sure you could find the North Star in case you ever got lost again.”\n\nShe turned back to me, reached out her thin hand and placed it over mine. There were still tears in her eyes but she smiled her lighthouse smile and, for a moment, I saw her just as she used to be, just as she was the night I ran away and my mom found me.\n\nI squeezed her hand. “I was scared, too. I was afraid I’d be stuck out there. What made you think of it?”\n\n“Well, I’ve been thinking a lot about dying lately and-”\n\n“Don’t,” I interrupted. “Don’t talk like that. You’re not going anywhere, not for a long time.”\n\n“It’s okay,” she said, squeezing my hand back. “It’s okay. I’ve known real fear and what I’m feeling now...it’s not like that. I’m scared, I guess, but I’m at peace with it. I had such a beautiful life. I’m so glad I got to meet you, to be your mom.”\n\n“I’m glad, too,” I whispered, voice breaking on the last word.\n\n*But I won’t let you go without a fight,* I added silently in my mind.\n\nSomething was trying to get to my mom. The strangeness began the day after I lit the candle. At first it was small blips, tiny *wrongs* that I chalked up to my imagination. Doors I knew I’d closed at night were open in the morning. Food began to rot and spoil within days of me bringing it into the house. Eventually, food would go bad within just a few hours. Every few hours the television in the living room would either turn off if it was running, or on if it was off.\n\nClocks would stop overnight, always at 3:03 am. Shadows began *sticking* to the corners of rooms independent of any light sources. The shadows were stubborn and they would linger for as long as I would stare, then disappear when I blinked. I began hearing bumps and knocks at all hours and sometimes, when I’d enter an empty room, I had a sharp, fleeting certainty that it was only just occupied.\n\nI avoided the dining room except to check in twice a day to see if the candle was still burning. The smell was vicious and would claw its way into your throat and nostrils the moment it was given a chance. I kept the door to the room shut and kept air fresheners running in the surrounding rooms 24/7. The funny thing was, the candle never went out, never even seemed to shrink. I could see the wax melting but day-in and day-out the candle refused to change.\n\nDays marched into weeks and the wrongness only grew deeper. My mom and I both lost sleep to vivid nightmares that we couldn’t remember when we woke up. Only the echoes remained but those were enough to leave my pulse sprinting until morning. I started sleeping in a chair in my mother’s room. I did this to comfort her if she woke up confused during the night but also because, if I’m being honest, I was too scared to sleep alone. I felt like a child running into his parents’ room, convinced there was a monster under the bed. Thing is...maybe there was.\n\nBy the third week I couldn’t keep doors closed. They would slam open the moment I left the room. A terrible scratching began inside of the walls. I told my mom it might be squirrels or mice but the sound was so insistent, not like rodents milling about, more like a dog wanting in. I stopped leaving the house for supplies; instead I had what little food we ate delivered. I kept the curtains drawn. There was tapping on the glass every night.\n\nAbout a month after leaving the hospital we were living like zombies. The dining room couldn’t contain the smell of the candle anymore. The entire house was clogged with the scent. Tiny noises had graduated into full on laughs and screams and whispers in the rooms around us. Something kicked the bathroom door so hard while I was taking a shower that the hinges warped. I covered every mirror in the house. I’d started to see things in the corners looking back at me, half-hidden faces, shapes that skittered away as soon as I turned around. Mom was drifting further and further away. She had long moments of confusion where she’d forget my name, forget where we were. Sometimes, she’d think I was my dad. Other times, she’d just stare at the wall for hours, growing fainter and fainter each day like a Polaroid left in the sun.\n\nBut she was alive.\n\nIt was clear that we were under siege by something. My world shrank to only one room and every trip to the bathroom or to answer the door for food felt like going over the trenches. The noises kept getting worse and worse, the shadows closer, the sense of movement around the house sharper. Every now and then I would feel hot breath on the back of my neck or walk through a cold patch hanging in the air. I stopped bothering redrawing the lines of salt around the house. I knew, deep in my bones, that as long as the sickly candle burned, Death could not take my mom away.\n\nOn the thirty third day after leaving the hospital, I woke with a start from a nightmare, only to find my mom’s bed empty. She hadn’t been able to walk the past week at all, so my first feeling was hope that she might be improving, at least a little. Then I noticed the oder we’d been living with for weeks was gone.\n\n“Mom!” I shouted, running in bare feet out of the room.\n\nI found her in the dining room, the door wide open. She was standing at the table, frail as a neglected scarecrow, bobbing back and forth. Her hands were hovering over the candle. The flame was out.\n\n“Why did you do that?” I whispered. “Mom? Mom...are you okay?”\n\nI padded into the room, the wooden floor freezing cold. My mother didn’t react to my presence, she just continued rocking side-to-side. I realized she was still asleep.\n\n“Mom?” I gently shook her shoulder. “Wake up.”\n\nHer head snapped back and she nearly fell. I caught her on the way down. It felt like she weighed nothing at all.\n\n“What’s going on?” she asked, looking around the dark room. “Where…”\n\n“You’re okay,” I told her. “You were sleepwalking.”\n\n“I was having the most unusual dream,” mom mumbled. “There were so many stars and...”\n\nShe began to shiver uncontrollably. The cold hit me a moment later. I let out a gasp. The house was chilly before but the dining room was near-arctic. My breath bloomed into a thin cloud in front of my face. I became acutely aware of the complete silence filling the house.\n\nThen I heard scratching. It was coming all throughout the house, deep tearing sounds at the walls around the dining room. Footsteps came immediately after, heavy and fast. Somewhere in the house a window shattered.\n\n“Brian,” my mother said, holding onto me.\n\n“Don’t worry,” I said, “everything will be-”\n\nMy voice deserted me as a massive shadow unfolded in the corner of the room. It was shaped like a man but tall, so very tall. And it was fast. Before I could yell the shadow was on us, pouring over my mother. In the space of a heartbeat, she was simply gone.\n\n“No,” I whispered, clawing at the dissolving shadow where my mom used to be. “No, no, no, no, NO.”\n\nThe shadow was disappearing like a puddle sinking into the floor. There was a texture to it, oily and too slick to hold.\n\nI thought of my mother the night she found me lost in the woods, the night I’d run away. Her face filled my memory, her lighthouse smile. I remembered the relief I felt when she found me, the overwhelming love. I held onto that feeling, clutching it close.\n\n“You can’t have her,” I whispered.\n\nI closed my fist around the last threads of the shadow. There was a terrible sensation of *pulling*. It was like I’d caught a horse by the tail and it was trying to shake me. But I held on.\n\nA sense of ripping and being dragged. It was a riptide with a mind of its own. But I held on. It could not shake me.\n\nThe temperature was dropping every second and I felt my vision growing dark. The last thought that ran through my head before I blacked out was a promise to myself that even if I died, my grip would hold. I wouldn’t let my mother’s life slip away. All sounds and light faded, narrowing to a pinprick and then going black.\n\nI woke up under a field of stars. I was lying in soft grass, still wearing my pajama bottoms and an old t-shirt. It was cool, wherever I was, but comfortably so. I stood up. There were trees all around me, tall and close, stitched together with shadows. Immediately to my right, there was a road that ran straight as far as I could see, blurring into the horizon. But the stars, they were like nothing I’d ever seen before.\n\nBright ribbons of northern lights rippled above me in green and blue and purple. Stars lit the sky like millions of lanterns floating on a still ocean. The moon shone sharpest of all, a spotlight hanging above the treeline, so close I thought I could stretch up and brush its face.\n\n“***You are*** ***persistent***,” said a voice from the forest behind me.\n\nI whipped around but couldn’t see anyone. Then a dark spot began to clarify against the gloom. The silhouette separated itself and moved towards me. I recognized it instantly as the shadow from the dining room. As it moved closer, the thing grew and grew until it touched the sky and filled my vision. A deep dread sank into me but I stood my ground.\n\n“Give me back my mom,” I shouted.\n\nThe silhouette pulled away from the sky and then it was standing in front of me, the shape and size of a tall man. But instead of a shadow, the thing had wrapped itself in stars. Miniature constellations drifted across its body, floating slowly like a timelapse of a clear night sky. Burning brightest was the North Star, blue and warm. The space between the stars was absolute black, not a shadow but a complete absence of light. It was the most beautiful, terrifying thing I’d ever seen.\n\n“What are you?” I whispered.\n\n***“You know,”*** it replied.\n\n“Give her back,” I begged. “Please, give her back.”\n\n***“I can’t. It’s her time. Past her time. You delayed me. Delayed her.”***\n\nI clenched my fists. “She didn’t get enough time. *I* didn’t get enough time. It’s not right, it’s not fair.”\n\n***“Of course it’s not fair,”*** the starry thing said, ***“but it is right. You each have your time, and at the end of it, there’s me, and there is a road, and we walk it together.”***\n\n“Where to?” I asked. “Where are you taking her?”\n\n***“I don’t know. It’s not for me to know, only to know how to get there.”***\n\n“Then I won’t let you take her.” I planted myself in the road. The world was still and solemn around us. The constellations drifted like clouds and a soft breeze stirred the branches.\n\nThe starry thing didn’t respond for a moment.\n\n***“Your mother was kind and caring. Wherever she goes, she’ll have peace,”*** it promised.\n\n“But-”\n\nThe creature raised its hand. ***“Did you ever stop to think that death isn’t an enemy? Death simply*** **is.** ***It is the natural partner to life. It knows no prejudice or malice, has no designs or ambitions. Your mother spent so long suffering, felt so much pain. Instead of letting her rest, you took it upon yourself to draw her life beyond its given course. You kept her alive but at the cost of stretching her thin, prolonging her sickness, diluting her. Did you keep her alive for her benefit or for yours?”***\n\nI couldn’t answer.\n\n***“Stretching a life is unnatural, dangerous,”*** it told me. ***“In the weeks you kept me away you drew the attention of old things, hungry things, forces that would like nothing better than to swallow even the memory of your mother, to tear and bite until there was nothing left but pain and fear and a perfect emptiness.”***\n\nI shuddered remembering the clawing sounds, the shattered window, and the laughter from empty rooms.\n\n“I’m sorry,” I whispered. “Are they...can they hurt her here? Is she safe?”\n\nThe stars in the shadow burned brighter for a moment. ***“Your mother won’t walk her road alone. None of you do. I walk with you, always, to the end.”***\n\n“Can I see her?” I asked. “Please? Just, I...let me say goodbye.”\n\nIt considered for several seconds. ***“You are persistent.”***\n\nAnd then the starry thing was gone. I was standing alone on an empty road.\n\n“Brian?”\n\nI turned to find my mother behind me on the road. She looked younger, healthier than I’d seen her in years. The frailty was gone and my mother seemed exactly as I remembered her when she found me in the woods all those years ago.\n\n“Isn’t this the most beautiful dream?” she asked, staring up at the night sky.\n\n“Yeah,” I said, trying to keep my voice steady. “A beautiful dream. I love you, mom. I love you so much, so very much.”\n\nShe smiled and touched my cheek. “I love you, too. Don’t cry, it’s okay. I’ll wake up any time now. I’ll see you then.”\n\nI nodded, wiping at tears. “Sure, yeah, I’ll see you then.”\n\n“What do you think is at the end of the road?” she asked. “Do you think I’ll have time to find out before I wake up?”\n\nI looked out at the road, scanning the trees for any hungry shadows. “I don’t know, I don’t know where it goes but...promise me you’ll be careful.”\n\nMy mom smiled wider. “Of course I’ll be careful.”\n\n“And she won’t walk alone,” said a familiar voice behind us both.\n\nI turned, expecting the starry thing. But the man standing on the road was entirely normal. The light from the moon was enough that I could see he had moss green eyes and a bright shock of red hair.\n\n“Such a beautiful dream,” my mother said.\n\nThe man came towards us and took my mother’s hand. He and I looked so alike, I could see why my mother confused us when she was sick.\n\n“Take care of her,” I told the man. “I…just please take care of her, make sure she gets where she’s going. There are, well, there are things out there that want her, to hurt her, it’s, it’s my fault, I’m sorry, I’m so sorry-”\n\nThe man squeezed my shoulder. “She’ll be safe, watched over. If the Devil himself is waiting on the road ahead *he’ll move.* Or he’ll be moved.”\n\nI believed him.\n\nThoughts raced through my head. There were so many things I wanted to say, questions, a million ways to say goodbye. I wanted to stretch out the moment for as long as I could but I realized I’d already delayed my mother enough.\n\n“I love you,” I told them both. “Goodbye.”\n\nI woke up back in my dining room sitting at the table, the unlit candle in front of me. The house was quiet and still. There was no more scratching, no sound or sense of life at all. I walked through every room. The house was empty. I was alone.\n\nI’ve spent the past couple months working on the house, erasing the marks I’d made, fixing up the property. Some nights I take long walks out into the forest. I’m far enough out in the country that on clear nights it’s like looking up at a sea of stars. I think about my parents the most during those walks, I grieve and remember in my own way. And I wonder where their road went, if they’re still traveling or if they reached their destination.\n\nI hope that their road takes them strange and beautiful places. When I walk at night, I look up for the North Star to keep from getting lost. Maybe they do the same.\n\nWhen it’s full, I also look up towards the moon. I wonder if my parents had a chance to visit, to search for hidden oceans. I like to think they did, that the moon has at least one [Maria, the one I love most](https://www.reddit.com/r/Grand_Theft_Motto/).\n\n[Audio](https://www.youtube.com/watch?v=5wVfBQWuz64&feature=youtu.be)\n\nEDIT: Thank you to everyone who read the story and my heart goes out to every single person that shared their experiences, spoke about their grief, love and family. Life is too short, and it's never fair, but I know that as long as you remember the people you've lost, they never walk their road alone.", "comments": [{"id": "ffcvhso", "author": "coveredinhope", "body": "This morning my father’s doctor told us his cancer has spread to his lungs and he doesn’t have a lot of time left.  This story is so beautifully comforting and finally allowed me to let go of the tears I’ve been holding back all day. Thank you."}, {"id": "ffd3m84", "author": "iridescent_dragon", "body": "\"he'll move. Or he'll be moved.\" Be still my heart! To have that kind of love... I lost my grandson two years ago, and so often I have pictured him among the stars. This story is so beautiful and comforting. Thank you."}, {"id": "ffcs6pa", "author": "d993103164", "body": "so beautiful it made me tear up. thank you!"}, {"id": "ffd6hr6", "author": "liquidtoxicbitch", "body": "Ugh fuck I’m crying at work :( my husband lost his mom to cancer in 2017 and this just hit me in heart. So incredibly beautiful. Thank you."}, {"id": "ffcsl5e", "author": "anon_mouse-01", "body": "Such an amazing story. \n\n>Did you ever stop to think that death isn’t an enemy? Death simply is. It is the natural partner to life. It knows no prejudice or malice, has no designs or ambitions.\n\nThat part hit different. Such a great story."}, {"id": "ffczyqi", "author": "CommunistPropagate", "body": " “You are persistent.”  \n  \nSuch a beautifully dangerous thing to be. I only hope I can be persistent as you."}, {"id": "ffd7t11", "author": "AlpacadeLlama53", "body": "Not a lot of stories can bring me to tears, but this one did. Cheers, and have an award :)"}, {"id": "ffd914z", "author": "TripleB333", "body": "This is a beautiful piece of writing. I am grateful to have read it. I often write or think about death and dying, and the section with death being a partner to life rather than an enemy is just gorgeous. Have an amazing day, OP."}, {"id": "ffdgov2", "author": "Annoying_Details", "body": "My mother is fighting cancer currently. I find myself walking around with a well of fear, grief, anger, etc. roiling just under the surface. Your story gave me a tiny release of some of that. \n\nI do not know if I will resort to wards in her last days but the talismans I do have. For her and I, to help us on our way while she’s still here. \n\nThank you for a tiny moment of peace. Even if I did cry at work. :)"}, {"id": "ffcvni9", "author": "strawberry-avalanche", "body": "This was absolutely beautiful. I cried."}, {"id": "ffdg6g8", "author": "OhMissFortune", "body": "Here I am at the train from Saint Petersburg to Moscow at the top shelf, smiling and crying very silently not to wake up anybody (1:50 am). I've been struggling with accepting death a lot, and even though I don't believe there would be anything after it, this concept brings me comfort. I'm going to hold onto it for a while if not for a whole life. It's right. It's natural. It's beautiful. This nearly won't be enough, but thank you. I'm going to remember this"}, {"id": "ffd0nvo", "author": "Fluffydress", "body": "Sitting here actively crying. A beautiful story."}, {"id": "ffd4lbh", "author": "chathamsapphire", "body": "I’m sitting here on my lunch break with tears rolling down my cheeks. I’m sorry about your mom, but this is the most beautiful tribute you could have given her. Thank you for sharing this."}, {"id": "ffcruiu", "author": "HisCricket", "body": "That was so beautiful."}, {"id": "ffd4j16", "author": "OryxIsBae", "body": "This was incredible. I have no idea why but this made me cry. I hate to think of my mum or dad passing and as time goes on I think about it more and more. This left me feeling comforted in some way so thanks."}, {"id": "ffdcz1l", "author": "saddestclaps", "body": "You're breathtaking."}, {"id": "ffdko4v", "author": "nosleeppastime", "body": "Jesus christ, the ability to being so many people to tears with just your words must feel empowering. I'm not big on imagery while I read but I could picture every second of this, theres just enough detail and the dialogue is so, so perfect. I cant begin to describe how much I love this story. I wish I could give gold!"}, {"id": "ffd4dah", "author": "MoyamoyaWarrior", "body": "Im literally sobbing at my desk. This is the most raw and beautiful thing I have read here ."}, {"id": "ffd5e27", "author": "astroannie_", "body": "This was beautiful. I'm glad Maria found her peace."}, {"id": "ffd9sfa", "author": "_SallySparrow_", "body": "Oh, my word. This is heartbreakingly beautiful. I'm going to print it and keep it for a time when I grow old and my only child has to deal with the idea of my death herself. Thank you so much for writing this."}, {"id": "ffdjjgy", "author": "Raiponced", "body": "This is absolutely beautiful. I almost died when I had my son last year and death has been on my mind ever since. This has helped alleviate the anxiety in a way, even if only a story. Thank you. Wonderfully written."}, {"id": "ffdjoku", "author": "gre_en", "body": "I lost my mom very recently and this helped me a lot. Thank you for this, truly."}, {"id": "ffda9l9", "author": "uniqueUsername_1024", "body": "This is one of the most beautiful things I’ve ever read... it nearly brought me to tears. This struggle against the inevitable, resorting to magic and hopeless attempts to try and keep someone... it hits home for me right now, for a variety of ways.\n\nThank you."}, {"id": "ffdhuke", "author": "Disapproving_Tremere", "body": "I'm sitting here trying not to cry at my desk at work. I lost my own mother to cancer, and had to make the final decisions for palliative care at the end for her, so this hit a lot of notes in me and how much I'd give to have had just one more day with her. \n\nBeautiful work."}, {"id": "ffdkvci", "author": "prince_peacock", "body": "We had a bad scare with my father recently, and he’s still in the hospital. It really drove home that he’s gotten to the age where something as simple as getting the flu could take him. This story made me cry very therapeutic tears. Thank you for writing this, it was beautiful"}, {"id": "ffdu06u", "author": "trick_tickler", "body": "I lost my mom at 16, and I cried all the way through this story. It took me right back to that time. The smell of ammonia. Hospital waiting rooms. \n\nThank you for writing it."}, {"id": "ffdxx79", "author": "Elijahs-Wood", "body": "This story made me cry uncontrollably. I lost my mother to cancer back in 2013 and I honestly haven’t recovered. \n\nShe was my world. \n\nThank you for this story, it was so beautiful."}, {"id": "ffdrhlc", "author": "min_imalist", "body": "Maria is my mom's name, and she also has a lighthouse smile. I love her so much and I absolutely dread the time in the future that I will have to go without her. This story, however, is so beautifully written, so incredibly heartbreaking and comforting, I'm saving it for the future.\n\nThank you for what you've written. This is a true gem."}, {"id": "ffdlwm9", "author": "Untied_We_Stand", "body": "When Brian woke from the chair and found his mother at the dinner table, I expected she’d be possessed, or undead, or some other no-sleep cliche. This was so much better than what I expected. This was such a unique, beautiful story. Thank you for sharing!"}, {"id": "ffd976m", "author": "Machka_Ilijeva", "body": "Man, that made me cry first thing in the morning :("}, {"id": "ffdrvus", "author": "BellicosePacifist", "body": "As soon as I read through the first paragraph, I knew the tears would come before I finished reading.\n\nSuch a strange feeling to be ugly crying because of something so beautiful. This was so hauntingly sweet."}, {"id": "ffe435q", "author": "BrogerBramjet", "body": "My grandfather survived cancer twice.  But it was the benign cysts in his kidneys and the subsequent dialysis that killed him.  He passed in his sleep at 83 a mere 50 yards from where he was born.  I've got plenty of good memories of him, but the one that sticks with me to this day, some 15 years later, was the look on his face when I said, \"My parents raised me, but you and Grandma made me who I am today.\"\n\nAfter the funeral, we were sitting around the house.  My aunt started laughing.  \"I'm just picturing Aunt Doris and Uncle Karl (his siblings) sitting there with a dish of ice cream saying, 'It's not going to run out, but it's your turn to deal the next game.' \"  Grandma gets a light in her eyes.  \"Someone needs to take me to the grocer.  I have spent these last 3 years without ice cream.  I need to make it up.\"  She did.  In fact, her last meal WAS ice cream.  \n\nI'm now going to stop and pick up some ice cream tomorrow.   I encourage you all to do so too with Grandpa's favorite saying:\n\nI do not smoke, nor drink or swear;\n\nSelf discipline is the ticket.\n\nBut when it comes to my ice cream habit, \n\nI just can't seem to lick it."}, {"id": "ffd9sq3", "author": "okitsdrew", "body": "Now this... this is something else.  Thank you for bringing this to life"}, {"id": "ffd3u8u", "author": "aDankSpazxtic", "body": "This was amazing, made me tear up"}, {"id": "ffdohr2", "author": "oopscoffee", "body": "i lost one of my closest friends to suicide just a little over a year ago. it's been hard to accept but this story is so comforting. thank you."}, {"id": "ffd6x1s", "author": "saltyRB", "body": "Beautiful. You are so talented."}, {"id": "ffdlg26", "author": "eden9776", "body": "I’ve dealt with death a lot recently. This made me cry, I needed this a lot and didn’t even know it."}, {"id": "ffdw2zc", "author": "Cassiopia23", "body": "I just lost my Grandmother recently and needed a good cry, that really was very beautiful and comforting. Thank you for sharing!"}, {"id": "ffdyz1y", "author": "Solallitser", "body": "hey stop making me cry."}, {"id": "ffd6ofe", "author": "-teaqueen-", "body": "This is absolutely gorgeous and moving."}, {"id": "ffdb3ok", "author": "Gia124", "body": "i'm crying so much"}, {"id": "ffd74rq", "author": "fangsies", "body": "this is beautiful. thank you."}, {"id": "ffdaebh", "author": "Skips35", "body": "I’m doing my best not to cry at work right now. Thank you for this."}, {"id": "ffdb3vv", "author": "cofikong7", "body": "I felt a lot reading this. Thank you."}, {"id": "ffdavqw", "author": "howlybird", "body": "That was so beautiful"}, {"id": "ffdbmdg", "author": "SunBoxDog", "body": "Fucking beautiful."}, {"id": "ffdsxjg", "author": "Saledato", "body": "Thank you for sharing Maria with us."}, {"id": "ffe2k1h", "author": "slumpgod_8D", "body": "Wow. I am usually unaffected by stories like that, but there are tears in my eyes right now and a feeling that I can’t explain. i lost my grandfather to a prolonged battle with pneumonia, and he too never let his sickness take away his bright spirit. i want nothing more than to spend more time with him, especially now as I’m older and realize how amazing he truly was. sorry for the paragraph, but the story of your mother brought back a sadness that I hadn’t felt in a while. thank you for sharing"}, {"id": "ffd8klw", "author": "ANON3o3", "body": "I'm in tears."}, {"id": "ffd8mfq", "author": "sizzlamm", "body": "Just Wow....thank you."}, {"id": "ffd9shb", "author": "ThrowAwayEggShells", "body": "I cried. Like actual tears."}, {"id": "ffdbzi1", "author": "itisntaphasemom", "body": "i can’t believe i’m crying rn"}, {"id": "ffdrqqr", "author": "_Strings-n-things_", "body": "I want to hug death now"}, {"id": "ffdt8x7", "author": "interrogativ", "body": "Thank you."}, {"id": "ffdujv8", "author": "demons_adventure", "body": " I teared up reading this. The detail about your mother’s laugh hit me right in the heart. She reminds me of my grandpa who also died of cancer. They probably would’ve gotten along."}, {"id": "ffdz1wa", "author": "eryn9", "body": "I lost my mom a number of years ago. This story hit so many familiar emotions that I still carry today. Thank you so much for sharing this beautiful tale. I will remember this story for as long as I possibly can."}, {"id": "ffe0vo0", "author": "resting-btch-face", "body": "I could feel your mom's fear and helplessness when she said she found your note and they were searching for you all night, and all these things kept running through her mind. Ever since I've had kids, I haven't looked at death, or fear, in the same way as I used to. I have since then lost my mother and grandmother, and having 2 small babies and having lost them just made life and death and everything else so scary. So thank you for this. Stranger on the internet."}, {"id": "ffe25g9", "author": "orngckn42", "body": "Beautiful, OP. A stunning tribute to your mother."}, {"id": "ffe2vt7", "author": "auron_paz", "body": "Today is 5 years since my mom passed away suddenly after falling into a deep coma. It’s super comforting to know that maybe she walked the same beautiful journey your mom did. Thank you."}, {"id": "ffdbhqi", "author": "Readalie", "body": "I'm crying at work. Thanks."}, {"id": "ffdyd63", "author": "jstaprsn0130", "body": "I've lost an aunt to cancer, and in August 2019 my husband lost his mom to it as well. This was beautifully written, and absolutely amazing. Thank you for sharing it ❤"}, {"id": "ffdyq0a", "author": "machsh", "body": "This was beautiful. Ugly crying as in type this. You got me fucked up and now I gotta go look at cute animals."}, {"id": "ffeg2wi", "author": "DeV4der", "body": "I dont cry often, but when I do, its your fault\n\nThank you for this story"}, {"id": "ffewpko", "author": "laurensmim", "body": "I'm fighting a very aggressive and recurrent cancer that causes cancerous fatty tumors in my abdomen. I'm about to start chemo and then have my fourth surgery to remove it this spring. I have been told some people have to have 7 and 8 surgeries and that generally I will fight it only to have it come back, and that will be the routine until I can't fight it anymore. The story was right, death is not the enemy, it just is. I really felt that.\n\nI haven't told my daughter who is 18 that it will keep coming back until I can't fight it anymore. I've only told her some people have to have 7 and 8 surgeries so I could be fighting it for awhile. I will tell her at some point, but not this early on. I don't want our time together to be tainted by a possible option of death from cancer. I may get hit by a truck tomorrow, or my 8th surgery may completely get rid of it, who knows. All I know is it's too soon to have her that upset, I want her to have real and carefree memories of me after I go"}, {"id": "fh3e5ck", "author": "themardbard", "body": "I miss my dad. He died of lymphoma when I was 18. He loved astronomy. I often hope he's traveling the cosmos, getting to see everything. Astronomy is my hobby now, because of my dad. I miss him so much."}, {"id": "ffd5v7z", "author": "Some_Guy132352", "body": "Yeah death is a bitch but it would be worse if it didn’t exist."}, {"id": "ffda0xx", "author": "ChearnDown4Wut", "body": "This is beautifully written, wow amazing job."}, {"id": "ffdetat", "author": "Purple_IsA_Flavor", "body": "This is the most beautiful, heartbreaking, comforting work I've read in a long time."}, {"id": "ffdfc2a", "author": "JaneEyreosmith", "body": "Well maybe I just wanted to weep at work.  \n\nThis was so beautiful."}, {"id": "ffdi7kj", "author": "onionrings4eva", "body": "Incredible. I got goosebumps."}, {"id": "ffdjibc", "author": "Beckystrong007", "body": "Great, I'm sitting here crying like a baby."}, {"id": "ffdr497", "author": "BewBueBeeyoo", "body": "What a stunning story and amazingly comforting. Thank you for allowing death to be beautiful. I will carry this with me always."}, {"id": "ffds9yu", "author": "WailingOctopus", "body": "Absolutely heartbreaking"}, {"id": "ffdu85t", "author": "fluffymalachite", "body": "this is so beautiful. it made me tear up"}, {"id": "ffdxana", "author": "salomown", "body": "this is so well written i wanna hug you\n\ni hope you are ok and have found someone to share the house with"}, {"id": "ffe1w08", "author": "someotherguy14", "body": "I honestly don’t know what to say other than I’m crying. Thank you for writing and sharing this"}, {"id": "ffejxny", "author": "ScenthoundsRevenge", "body": "This reminds me of a dream I had the night my grandmother passed away 14 years ago.\nShe was in hospital with terminal lung cancer.\nThe night she died, I was in my bed listening to music, falling asleep, dreaming of her. In the dream, I brought her to a train, made sure she was compfortable. At the next station I told her I had to leave but the guy working in the train will make sure she gets everything she needs.\nI woke up to several missed calls and my grandmother having died in that night."}, {"id": "fff2v86", "author": "RiboZurai", "body": "As one struggling with the fears of death, this was a read I didn't know I was needing so much. Amazing job, thank you for this."}, {"id": "fffju4d", "author": "Erinelizabethx0", "body": "This is something im going to save forever....and read it everytime i miss my Gran. This was beyond beautiful and i loved every word. If i had any coins or rewards, i'd give them all to you. Thank you OP 💜🤗"}, {"id": "fffwbfz", "author": "Carpet_Enforcer", "body": "God Damn, I started reading and the second I fucking saw 3:03, I knew it was you. It's amazing how you relate all your events in one universe. Keep it up, mate"}, {"id": "fffxw24", "author": "imalittlecreepot", "body": "This is SO GOOD but oh my word i was SOBBING by the end. \n\nSo beautifully written."}, {"id": "ffggjif", "author": "NotToSpec", "body": "What a beautiful and compelling story, thank you."}, {"id": "fh361fk", "author": "fourtccnwrites", "body": "i read this a week or so ago, and i genuinely haven’t been able to get it off my mind ever since. i’m certain that other people have gotten more from it than me since i’ve never lost a family member like this, but i’m so happy that others have been able to resonate with this story and related and were able to truly feel seen and heard by it. \n\ni’ve only been on reddit for a month or so, but i’ve been hearing and sharing nosleeps for years to the point that i can tell them without even needing to read them. i used to listen to or read “autopilot” so much that i’m sure i have it memorized. this story, however, is so much more than that. it’s more than the horror aspect of it, it’s about the feelings behind it. \n\nsince i read it, i’ve read it out loud to my mom. both of us started crying several times throughout the process. i’ve shared it with friends, i’ve thought about it in immense details. sometimes, before i go to bed, i can start piecing together shots and scenes of a short film for it. \n\ni really wish the best for you and your maria. i’m certain she’s been able to visit those moons and all those oceans, and she’ll tell you all about them some day."}, {"id": "ffdgi36", "author": "single_asf", "body": "This story is so beautiful..."}, {"id": "ffdh38z", "author": "Maelphius", "body": "Thank you for this.\n\nIt is beautiful."}, {"id": "ffdmojm", "author": "uhny_uftz", "body": "I wasn't expecting such a sweet story, or to tear up. This was a beautiful story and lesson about letting go."}, {"id": "ffdot7h", "author": "MissusBeeAlmeida", "body": "Absolutely beautiful"}, {"id": "ffdq4oh", "author": "purrsnikitty", "body": "Wow... This is incredible. So beautiful. I'm crying."}, {"id": "ffdr4ce", "author": "KillarneyBound", "body": "Beautiful. \n\nThank you for writing this"}, {"id": "ffdsbww", "author": "Bassman500", "body": "It's heartbreaking and beautiful at the same time."}, {"id": "ffdt72i", "author": "Foxdog27", "body": "I'm not crying, you're crying!\n\nIn all seriousness though, this brought tears to my eyes. What a beautiful story"}, {"id": "ffdxl7f", "author": "PoonedintheMouth", "body": "This is amazing, thank you for taking the time and effort to write this for our enjoyment"}, {"id": "ffea286", "author": "Greyskiesgreeneyes", "body": "My mother and I signed my grandmothers DNR orders earlier this week. Not all of the family agreed with our decision. \n\nI feel slightly comforted by this story. When the time is right, she won’t walk alone. And it won’t be fair but it’ll be her time. Thank you"}, {"id": "ffehaxt", "author": "boredgirl7798", "body": "Okay wasn’t expecting to spend the next hour crying over this but I guess that’s the new plan for tonight. This was so beautifully written, oh my god."}, {"id": "ffei1gd", "author": "forgotshoesagain", "body": "This was absolutely stunning."}, {"id": "ffeqhdj", "author": "pantsaretheworst12", "body": "I just wanted to say this is incredible. My boyfriend lost his mom to cancer 3 days before Christmas and I felt that same struggle to keep her alive as you went through. This is both beautiful and heartbreaking. Thank you."}, {"id": "ffez0ix", "author": "2ndChanceAtLife", "body": "I was actually horrified at the thought of your mother continuing to suffer the ravages of cancer without death as a blessed end to it.  Great story."}, {"id": "fffx14x", "author": "Silvermoon424", "body": "Absolutely beautiful, this made me tear up. I truly believe that death isn't the end, it's the beginning of something new. And as painful as it is, it seems like a small price to pay for the life we've been given. Thank you for sharing."}, {"id": "fgi5dga", "author": "themjsilva", "body": "My mother's name is Maria, I live away from her, your story made me appreciate her more OP. thank you so much!"}, {"id": "fgqv927", "author": "Dr_Squatch", "body": "My grandma is getting close.. she says she's ready and reading this helped me be a little bit more ready too I guess. Thanks."}, {"id": "ffe7fb2", "author": "HelloMissMurphy", "body": "March 27th, 2015 they told my mother she had Stage 4 Colon Cancer, that it had spread to lesions on her liver, that she had maybe 6 months to live because they caught it so late. But they wanted to try, anyway.  \nSo they did. Aggressive chemotherapy, and radiation, and 14 inches gone from a Colon Re-sectioning, and a hysterectomy just to be safe, and she's still here.   \nI had to stop at the word hysterectomy, because my mother asked why I asked what day she specifically got diagnosed, and when she asked I burst into tears and had to let her hug me for a while as I cried. I spent the whole time as her caretaker."}, {"id": "ffe7ooy", "author": "WanderingSibyl", "body": "Lost my mom to a long battle with ALS. Watching her become a skeleton was disturbing, to say the least. Your words were so poignant yet valuable. Truly phenomenal."}, {"id": "ffeauhm", "author": "gotbotaz", "body": "Breathtaking. Thank you."}, {"id": "ffebz0h", "author": "corkykatt", "body": "Simply beautiful."}, {"id": "ffegruz", "author": "littleprimitive", "body": "So beautiful, I think it's hard not to cry even at work."}, {"id": "ffek6bw", "author": "Bismothe-the-Shade", "body": "Great I'm sobbing on the toilet. Not how I thought I'd be spending my time."}, {"id": "ffellrj", "author": "sweetmotherofodin", "body": "I didn’t expect to cry but here I am."}, {"id": "ffepubg", "author": "Balawis05", "body": "I can't sleep due to all the feels I'm having right now."}, {"id": "ffezg8g", "author": "kristy795", "body": "Well done."}, {"id": "fff7ev9", "author": "Trentinho", "body": "Thank you for the beautiful story. Fuck cancer."}, {"id": "fffd7hq", "author": "Everloner", "body": "You have such an incredible talent.  I was absolutely spellbound.  Thanks for sharing this beautiful piece of writing with the world."}, {"id": "fffvwbq", "author": "_Strings-n-things_", "body": "That was the best thing I have ever read."}, {"id": "fffw7kw", "author": "StryfeOne", "body": "Probably the most beautiful thing I've ever read. Thank you."}, {"id": "ffg7jez", "author": "Ian-Chenault", "body": "Now I’m gonna go give my mom the biggest hug, thanks for a great story!"}, {"id": "ffhkqya", "author": "rutherfart", "body": "I lost my dad to cancer three years ago. I remember the feeling of the floor being ripped out from under me the day we received the news it had spread, and he had a few months left. \n\nThis piece beautifully captured the desperation you feel when someone you love is taken from you too soon. How I wished I could have seen him walk down a starry road, and had a proper goodbye. \n\nThank you for sharing this story and helping me on this ever-changing journey of grief."}, {"id": "ffopdcg", "author": "NebulaSlayer", "body": "I read this story days ago and can’t stop thinking about it. OP, you write beautifully."}, {"id": "ffrmk9i", "author": "MissSawczuk", "body": "The most beautiful thing I have read on here. Thank you so much for this beautiful ride. I am in absolute pieces, bawling my eyes out, but my heart is full."}, {"id": "ffroouy", "author": "liminalspace-case", "body": "It just passed the year mark of one of my closest friends committing suicide. In a way I feel this brought me peace. I hope he’s been met with a place like this. Thank you for writing something so beautiful and compelling."}, {"id": "fft420h", "author": "Psychobrad84", "body": "Damn it, you got me all teary eyed in the end!"}, {"id": "fft6z2e", "author": "corazontex", "body": "Thank you."}, {"id": "ffutrfe", "author": "HollywoodNovaBaby", "body": "Beautiful."}, {"id": "ffy6ntd", "author": "oldfaith", "body": "Wow, simply wow! It's the best story I've read so far on this sub. Thank you so much!"}, {"id": "fgf7s4a", "author": "FreedomFox138", "body": "In my mind, that was beautiful.  Thank you for sharing your story."}, {"id": "fgu8mpi", "author": "StratonOakmonte", "body": "I’ve been reading this sub for multiple years now. This is the most beautiful thing I’ve ever read on here. So damn good thank you for this"}, {"id": "fh715s0", "author": "saxonny78", "body": "This...this one is something special. \n\nI will pray to the Divine and the Universe that we know only peace, and not fear.   We are more than the proteins and bones and skin that we live in. \n\nAlso, I pray for those that stay behind for a little bit longer, that they might have peace and love until it is time to return. \n\nI walked that road a ways in 2018 with stage 3 inoperable cancer. There is no way to describe how your body feels, or the storm that settles inside your head. \n\nBravo, OP. Bravo."}, {"id": "fhutgy5", "author": "TortleTurtle", "body": "Read your story on the bus home.. Started my laptop and windows gave me the question “What are Maria on the moon?”.\n\nFelt a chill running down my spine."}, {"id": "fhwk8ox", "author": "irrateed", "body": "I came here to be creeped out not to get the feels"}, {"id": "fhzecyd", "author": "tkachuknorris96", "body": "I just wanted to say this is the most beautiful thing I've ever read. I've been sitting here crying over a bowl of soup for 40 minutes. My roommate came out and thought something was wrong but I just sent him a link to this story and told him to read it. I've never lost someone close to me but I have the craziest anxiety that makes me think every little hurt is going to make me die and I'm terrified of dying. I think about it way too often and I'm the most cynical atheist. It's weird, I hold so strongly to my convictions but this made me feel a bit of hope for something other than a very long REM sleep. I felt every thing Brian felt and I'm a disaster now hahaha. Thank you so much for this story. I will remember it forever and keep it close to my heart."}, {"id": "fi570pd", "author": "mzguevara07", "body": "This story just hit me hard. Never read anything like it and I’m so glad I did. I have a hard time coming to terms with death. I dread the day I lose my parents and I hate thinking about birthdays because it makes them that much older. I just feel like there’s not enough time to do all the things I want to do for them but I just hope I can make it happen before they leave me. This story made me see death differently and I thank you for that OP. Beautifully written."}, {"id": "fi7wh4s", "author": "Spiderlander", "body": "I cried"}, {"id": "fl6exln", "author": "toxic_and_timeless", "body": "I came here to be scared and I ended up crying instead. What a beautiful story. Thank you."}, {"id": "ffe71bu", "author": "BlueSourBoy", "body": "I shared this with my mother and told her this is how I will be feeling when the time comes.  It was nice to be able to share what I would feel with her while she's alive so she understands the importance she has in my life. \n\nI'm so sorry for the losses to those who shared their trauma. \nDeath may be the end of one story however it's also the beginning of another. \n\nVery well done OP."}, {"id": "ffe8mcx", "author": "aelbarron", "body": "I lost my father to cancer on January 11th. This was devastatingly beautiful and comforting. Thank you."}, {"id": "ffe8x3h", "author": "wuvlybunny", "body": "I love how well this was written. My mother in law passed a couple days ago from cancer and it's been difficult to say the least. Thank you for bringing light unto death. :')"}, {"id": "ffe9s9k", "author": "lizathebookworm", "body": "I'm in tears. This was so beautiful. I'm very, very close with my mom and I feel like I would have done the same thing you did just to be able to spend more and more time with her. I'm thankful every day for her and thankful my family has had the blessing of never going through cancer."}, {"id": "ffe9uu7", "author": "Nosleeper1974", "body": "Wow, this is amazing and powerful. It’s definitely got me thinking about death in a new light. Thank you"}, {"id": "ffeaa9u", "author": "screamindivr145", "body": "This was incredibly unnerving, yet equally beautiful and moving. Thank you for writing this."}, {"id": "ffebn87", "author": "fullcollapse333", "body": "This reminded me of my moms passing, she died of emphysema/COPD and that's how I imagine her in the afterlife. She can breath, dance, and laugh without a coughing fit"}, {"id": "ffebwl1", "author": "aftermaz", "body": "Absolutely beautiful"}, {"id": "ffec71i", "author": "webnetcat", "body": "Taking time to share last weeks or days, to have a chance to say goodbye forever, to feel the wanishing warmth of the most loved person through the last hug is a luxury I never had. I wish I had, even for a briefest second in the world. Sometimes the void is just too much and too cold to handle. You have wonderful memories, hold on to them. Your story and your writing touched a deeply hidden corner of my soul"}, {"id": "ffecyu4", "author": "LucienPT", "body": "“I’m so glad I got to meet you, to be your mom”.\nDude, I lost it right here. I’ve never read a story like this and doubt that I ever will again. The world needs to to read this. Thank you for sharing  with us. Seriously. Thank you."}, {"id": "ffed077", "author": "chowpills", "body": "Your a beautiful writer. I read this, and got up and cried, and went to hug my mom. Your incredibly talented. I’m not sure if your pro or not, but you sure as hell should be. I’ve never expected to read something that draws actual emotion from me in this sub. You usually expect your average shit stain on the couch, talking about how spooky the little girl in the dress is, but this is the kind of scary that’s right. This is love and terror. This is actually something truly wonderful. Please continue to write."}, {"id": "ffedefa", "author": "TheHungriestOfBees", "body": "such a beautiful story, thank you"}, {"id": "ffedizk", "author": "kakiyau", "body": "I cried.\nThe other day I was feeling anxious and emotional over the thought of “ my mom will die one day” but reading your story and your mom calms me so much. I bet my grandma will be there to walk with her as well. Thank you OP for sharing your scary yet beautiful story."}, {"id": "ffeeirq", "author": "hibah977", "body": "This was a very heartwarming story - my grandma died five years ago and if there's one thing I clearly remember, it was the torrential rain on that day. Sometimes the skies do cry to show the pain we can't fully express."}, {"id": "ffeepa1", "author": "RestlessDreamer79", "body": "My Mama is currently fighting breast cancer. I lost my little brother 2 months ago... Somehow this story made me feel better about everything we're going through.. Thank you for sharing your gift with us OP, this was beautifully written... and fuck cancer..."}, {"id": "ffeexic", "author": "Fiftywords4murder", "body": "I lost my mother to lung cancer 6 years ago and this was one of the best stories I’ve ever read relating to this.  She was a gorgeous and absolutely fantastic person so I hope someone was waiting to walk with her.\n\nThank you for this."}, {"id": "ffegoyo", "author": "basicbidita", "body": "Sometimes you come across such an amazing written piece that you forget your surroundings and just..dive into that world and this is one of those. I cried halfway through this...and then some more because of the sheer beauty of your words Brian. Thank you for sharing this with us all. I hope you find love and peace too..just like your mom did."}, {"id": "ffegu3r", "author": "jessica1987lynne", "body": "This is beautiful. I’m crying. Thank you"}, {"id": "ffegzlu", "author": "JhinWinchester", "body": "Im at work as i read this story and had to take several walks out of my office because its hard not to tear up. My mom died 8 years ago when i was in middleschool, she had an very aggressiv lung cancer with no chance to cure. This is why such a story like this hit home very hard. Have my upvote for this one."}, {"id": "ffeh8uo", "author": "outintheyard", "body": "This is so beautiful. I am speechless."}, {"id": "ffejev9", "author": "MagicalBananas2", "body": "Such a wonderful story, loved the way it's written and the words you used to describe everything, painted a clear image with your words. Simply beautiful."}, {"id": "ffejq2j", "author": "HarleyQuinn955", "body": "Thank you. Just thank you. I lost my dad last June, he was only 56 and it was his 2nd cancer. He fought like a lion during all the process, even when he has just been given quimo he still tried to mantain his activity and sometimes he was the one cheering up our familiy. He always had a wonderfull sense of humour (to give en example, he called himself a 'nuclear reactor' after receiving radio, or when having little baby hairs after the quimo he told us that 'he felt like a kiwi' :,) ) and he mantained It until the very end. I'm sheding nos very necessary tears, thanks to your beautiful story. I'm really greatful."}, {"id": "ffejyup", "author": "echolenka", "body": "\"She'll be safe. Watched over. If the Devil himself is waiting on the road, he'll move or he'll be moved\" \n\nThis line gave me full body chills. \n\nThank you for this beautiful story."}, {"id": "ffek2tk", "author": "teavu", "body": "This is so beautiful, thank you for sharing this with us."}, {"id": "ffele1p", "author": "thatshowiRohal", "body": "Oh I am just copiously weeping. We’ve all lost someone we love and this is just such a gorgeous, comforting depiction of what we would all want to have the end be. Beautifully, touchingly written, I’m so glad I had the chance to read this"}, {"id": "ffelpe7", "author": "wolfe7722", "body": "You hit me in the feels dude jeez"}, {"id": "ffem7az", "author": "BashiD923", "body": "Bloody amazing! I lost my dad 1 1/2 years ago. This very much resonated with me. Thank you"}, {"id": "ffen6oj", "author": "Bossplayer_23", "body": "Wow. I literally can not say anything other than wow. This story was so beautiful and described the most feared thing for many people including myself, death. Somehow it makes you accept death, everything comes to an end and who says that the end can‘t be beautiful as well?\n\nA tear ran down my face while reading this at work. (I hope none of my work colleagues noticed that!)"}, {"id": "fferr1a", "author": "LUCIFERHEREFORHORROR", "body": "I was so scared that i would be alone after death"}, {"id": "ffescwu", "author": "sadlittlekat", "body": "It's such a beautiful story that instantly brought tears to my eyes. My mum died last April and I can only wish she's finally at peace now, and there's someone to watch over her, like she did watch over me whilst she was alive. Goddamnit I shouldn't have read this."}, {"id": "ffesur2", "author": "C2LemonTea", "body": "This made me teared up because my dad recently passed away and that it helps me to think that maybe he's in a better place. Thank you."}, {"id": "ffet4r6", "author": "ManType", "body": "My mother has been fighting for a year and we even thought it was gone at some points. Today came with a realization from her doctor and test results that she has very little chance of making it. You described her and my relationship with her perfectly in this story. It is seriously uncanny. I haven't cried this hard in a long time but at the same time it is so nice to have read this and have it all so eloquently expressed. Thank you so much."}, {"id": "ffeta8n", "author": "Shopaholic_82", "body": "Absolutely beautiful, so sorry for ur loss 💞"}, {"id": "ffev0e7", "author": "ISmellLikeCats", "body": "I just lost the second of my two best friends, they were cats, glorious and majestic cats and this hit me hard as animals are said to cross the rainbow bridge, I hope someone was there to lead her across."}, {"id": "ffew4v1", "author": "incongruousmonster", "body": "Having lost both of my parents in the last year and a half, this hit close to home. Such an amazing and beautiful story.\n\n“I hope their road takes them strange and beautiful places.”\n\nMe too."}, {"id": "ffewdq1", "author": "jean_pierrepolnareff", "body": "The one thing that went wrong was, take this from a witch, YOU DIDN'T FRICKIN CLEANSE OR DO MORE RESEARCH! And also; Death is the first half of Life. Without Death there is no Life. But I assume you've learned that already, my dear. Have you ever considered working with Death gods? They'd love to have you."}, {"id": "ffexswu", "author": "calypso263066", "body": "Well I'm not crying. We're all persistent. This is beautiful."}, {"id": "ffeyj8d", "author": "JessyPkLover", "body": "It was a beautiful story... Really touching and the way you told it was very very emotionnally strong... (Sorry for the bad english)"}, {"id": "fff0rqj", "author": "bagbagbuy", "body": "Comfort. Somehow we picture death as a road leading us towards heaven or hell. Your story gave us a different perspective of death, thank you."}, {"id": "fff1ssm", "author": "chacharealsad", "body": "It’s like no human wrote this, this story is unbelievable beautiful and just made me feel so much I value my life much more than before,thank you so much OP"}, {"id": "fff251f", "author": "i_dont_eat_animals", "body": "I lost my father in May to cancer. Your story knocked the wind right out of me, and I am typing this behind a closed office door while trying to see through tears. This is the most beautiful thing I have ever read. Thank you for giving me a different perspective on something so difficult to process."}, {"id": "fff6n28", "author": "-letsgolesbians-", "body": "Such a beautiful story, it made me tear up! It also made me realize how lucky I am to have my mother at my side and how much I love her. The love between a parent and a child is one of the most pure things on Earth, and you really highlighted that with this. Great story!"}, {"id": "fff6sd9", "author": "NiteTimeReader1330", "body": "Such an amazing read! So many emotions. Thank you for sharing this with us, I am grateful to have read it. This definitely puts losing someone in a different perspective. Thank you!!! This is beautiful!!!"}, {"id": "fff7mhv", "author": "RowanShdwHrt", "body": "This was beautiful. My family was lucky, my mom survived her battle with cancer, though we have lost many others. Stupid fucking genes.\n\nAnyway, thank you for sharing your story and your talent with us. Very, very, very well done."}, {"id": "fff7qcd", "author": "Zionne_Makoma", "body": "This is such a sad, yet meaningful story."}, {"id": "fff8ecr", "author": "hylzz", "body": "And now I'm bawling my eyes out. What a masterfully written, beautiful, HOPEFUL story. I'm saving this. Thank you, OP."}, {"id": "fff8eqs", "author": "platinumvonkarma", "body": "What a raw and beautiful story. Very well observed. This line in particular brings back some harrowing memories, I understood perfectly.\n\n> I didn’t think she had any weight left to lose before she was nothing but bone and memory. Her skin was rice paper over a frame that seemed smaller every day."}, {"id": "fff91jb", "author": "xeroxbulletgirl", "body": "I lost my mom in July to cancer and this was so incredibly comforting to read. Thank you for writing it."}, {"id": "fffbo4u", "author": "Sjeetopotato1", "body": "This was a great story. Hauntingly beautiful."}, {"id": "fffdz53", "author": "primorialdwarf", "body": "I came back to write this because I couldn't when I read it. \nI cried when I read it. The story was beautiful. The writing was beyond amazing. You have a way with words. \n\nMy grandma passed away in October this year. She was the person I was closest to in all of my family, and it felt like I was losing a chunk with her. For a long time I felt like there was more and I kept hanging onto this concept. \nThis story felt like closure. That we have to let go.\n\nThank you."}, {"id": "ffffnmz", "author": "ChemicalThreat", "body": "This is beautiful. Hit close to home as i lost my mom just shy of a year ago. Letting go is the hardest thing I've ever done, no doubt you feel the same way."}, {"id": "ffffues", "author": "kalenugz", "body": "Have yet to read, but saw 78 awards and definitely going to read this tonight!"}, {"id": "ffffw0y", "author": "PocketFullOfArrows", "body": "Loved everything about this story. The pace, the right about of suspense and tension. I felt like the weight of it all slowly built up on me as it did for the character, bringing me to tears at the end. Beautiful."}, {"id": "fffh6lr", "author": "Hardcore_EHS", "body": "Jesus fucking christ, the feels from this. That is an absolutely incredible experience."}, {"id": "fffq8on", "author": "Apophyisra", "body": "This hit me hard my mother died of cancer when i was very young I never got to say goodbye. Thank you for such a beautiful story"}, {"id": "fffqssx", "author": "bittybones", "body": "This was so beautiful, I hope there is a starry being waiting to walk with me some day."}, {"id": "fffr996", "author": "xXSPAZXx64", "body": "This story was amazing and I loved it \nIt's nice to think that there is a place for people to go and they will have peace after they die"}, {"id": "fffsku1", "author": "4qx_", "body": "this story actually got me choked up.\n\nand, surprisingly, it made me fear death less.\n\ngreat story."}, {"id": "fffulk1", "author": "meowmeowpaws", "body": "My best friend is passing soon. This evening might be the last time I visit her in the hospital before she goes. I keep saying “they’ll have to bury her alive” because she’s held on through so much. Thank you for this imagery."}, {"id": "fffw0d7", "author": "The_Girl_Who_Lived7", "body": "This was absolutely beautiful, it moved me to tears. You have an amazing way with words."}, {"id": "ffg1wrx", "author": "APIZZASBUTTHOLE", "body": "It's not often that a story makes me cry like this. You are an insanely talented writer, thank you for sharing this."}, {"id": "ffh49ou", "author": "Just_A_Boy_In_Love", "body": "Last year in April, I lost my dad to cancer. It was a fucking long procedure, and it was really damn painful, and he was definitely too young to die. \n\nHe was a really damn provocative and stubborn man. I love that one line about the devil, and, if he is on the road, that he will be moved, cause I'm pretty sure that's what my dad would do, too. Stubborn until the end of the road.\n\nI'm an extremely mentally healthy, optimistic person and I guess I handled his death fairly well. There are few things that rip me out of the normal procedures of the day and heavily remind me of that time.\nI also read nosleep stories daily, and sometimes I tear up, but your story had me full on sobbing at 4 am at night. (Even writing this comment one day later just reminding the text makes me tear up again!)\n\nThank you for this story, man. It's a really, really beautiful story. Thank you."}, {"id": "ffhaink", "author": "rocketsniper456", "body": "This was honestly beautiful. The haunting parts were genuinely unnerving and the ending was truly heartwarming. Kudos to you."}, {"id": "ffhatdg", "author": "HDDeer", "body": "Ive never cried at a story before. \n\nThis was amazing. Thank you."}, {"id": "ffhh3ef", "author": "itspatriciam", "body": "This is so beautiful, OP. Teared me up and strung so many strings in my body. I’ve never been expressive of my emotions & feelings towards my mom but after reading this, I promised myself I’d make every moment I get to spend with her count."}, {"id": "ffhhbvt", "author": "NebulaSlayer", "body": "This was written so beautifully. Thank you."}, {"id": "ffhwz6w", "author": "KarenComplains", "body": "This brought on tears\n\nMy dad's been fighting his cancer for about a two years now and it hurts everytime I see him in pain\n\nHis doctor keeps telling us to just be ready\n\nBut I don't think I will be"}, {"id": "ffi4bt7", "author": "akoto222", "body": "Thank you for sharing the story. I hope I'am rich to give you an award or coin. \n\nOne key take away for me after reading your story is \"To show your Love to your parents or loved ones or anyone close to you as long as they live. It's never too late to tell them how grateful you are and how you love them.\""}, {"id": "ffi5m23", "author": "MattackChopper", "body": "I am weeping after reading this amazing piece of writing. I lost my mother to cancer when I was 13 and I have not seen a better representation of that sorrow in my life. I am 27 now and have had plenty of time to heal but I want you to know that this has helped me a great deal. Thank you so much."}, {"id": "ffifvda", "author": "Warm-Bandicoot", "body": "Beautiful!! Gave me sum comfort. Lost many loved ones in such a short time....I always worry about what happened afterwards. I\nWas also mad but I guess when it’s time it’s time...death doesn’t wait for anyone"}, {"id": "ffj0akq", "author": "kingfirien", "body": "It’s so refreshing to read a story that isn’t about death being this horrible, scary thing that condemns us to an eternity of misery. This was very beautifully written, and so descriptive that I felt like I was a part of the story. Thank you so much for sharing."}, {"id": "ffjawis", "author": "jegatomata", "body": "This made me cry. \n\nEdit: My wife is dying of cancer, and this made me cry and also feel better. Thank you."}, {"id": "ffk1h4m", "author": "Spiermarci", "body": "Thank you for such a beautiful telling if your story. I have to admit I teared up a little. I was scared that your delaying the inevitable might backfire, so I’m glad everything worked out so well. You truly had a magical experience because of what you did. Good writing also. Be well."}, {"id": "ffk4xez", "author": "iggetthe", "body": "I would move things, too just to spend more time with my departed mother. colon cancer, really tough battle, that the only comfort i got was knowing that when she passed, her suffering will finally be over. reading this, brings back all the memories."}, {"id": "ffkgx0c", "author": "Scarysugar", "body": "This was so beautiful and heart wrenching to read. I have never cried while reading but this one got to me."}, {"id": "ffmnkvo", "author": "Bruwin16", "body": "Such a beautiful story ❤️"}, {"id": "ffmw381", "author": "arcticafterglow", "body": "I was just lurking in here, reading, to help me sleep. ...and now I'm crying. Heartbreaking, yet comforting at the same time. It's like the epitome of bittersweet.\n\nI'm so sorry to the people who have lost their loved ones to cancer, or to any situation for that matter. My thoughts are with you. I hope, somehow, this brought you peace. \n\nDeath isn't an easy subject to deal with. I can't imagine myself going through this, but I know that one day I will be. I'm always so afraid of thinking about it...how it would break my heart, how it would affect my whole being in every way. Yet I find comfort in knowing that death takes all their pain away, and will be transporting them to paradise (I hope), and they wouldn't be alone. In that case, even though it hurts, even though my knees will be shaking and I will be hurting to the core, I will let go."}, {"id": "ffngx2r", "author": "cyncittitty", "body": "I dont think I’ve ever cried as much while reading a short story. Thank you for your lovely perspective and showing us that death doesn’t have to be so scary."}, {"id": "ffnyjh8", "author": "rustyworks", "body": "When I was a kid, I thought that I am unlucky kid, because I live in poverty.\n\nDay after day, I realize that my single parent mother is raising me well until now. This story make me remembering many moments that we already fight for. Thanks."}, {"id": "ffpkxa3", "author": "papergirlme", "body": "I have a chemistry class going on and I'm crying"}, {"id": "ffpoebv", "author": "JackTheStryker", "body": "You deserve every award that you have gotten. That was beautiful, and I’m sorry that you had to draw inspiration from something so tragic to write this."}, {"id": "ffpsx72", "author": "Meouwi", "body": "I'm crying like a baby. Demn OP. Thank you for this beautiful masterpiece."}, {"id": "ffpt1gf", "author": "TheEDGE75", "body": "That was the most touching story I’ve ever read in my entire life. I am lucky enough to still have both of my parents, and even I teared up at the end of that. Wow"}, {"id": "ffq0gw5", "author": "cocoline", "body": "Wholesome no sleep"}, {"id": "ffq4f0h", "author": "kibaxyru", "body": "I cried. Wonderful story. I hope every day eases the pain of her loss, even just a little."}, {"id": "ffqy67o", "author": "FraGZombie", "body": "Absolutely incredible. Thank you for writing this. Just....thank you."}, {"id": "ffr3x7t", "author": "kmc-kitteh", "body": "This brought tears to my eyes at work. I haven’t read something so moving in so long. \n\nMy grandmother, whom I was very close with, passed away from an aggressive cancer almost 10 years ago. This story brought me a sense of comfort and peace."}, {"id": "ffr4yg8", "author": "sedgvvick", "body": "I’ve never physically shed tears from a Nosleep but now here we are and I’m full on sobbing alone in my bed"}, {"id": "ffsma07", "author": "Da_Very_Best", "body": "This was beautiful, well done op... well done"}, {"id": "ffti7fp", "author": "SvenGranTheFourth", "body": "This reminds me of the book seven minutes past midnight or “a monster calls”"}, {"id": "ffu3x5z", "author": "Ygomaster07", "body": "This is so beautifully written. So wholesome. I wish i could give you an award, i love this story so much. Despite it being a no sleep story, it is surprisingly peaceful, and it makes me feel a sense of calmness and happiness. I really hope everyone gets a chance to read this story. This is quality work op. I can't put into words how beautiful this is. I almost wish this was like a short movie or something, just to see it as a movie or something."}, {"id": "ffubioq", "author": "HeyLookItsMe11", "body": "Simply amazing...."}, {"id": "ffv00t6", "author": "stealth941", "body": "I'm surprised I didn't get to finish this i thought I did. Beautiful story, hope you all find the peace you're looking for"}, {"id": "ffv7835", "author": "Hanshotfirst123", "body": "I just watched my dear friend finish her fight with cancer a few days ago. It was an ugly process and as sad as I was, I was happy she was no longer suffering. This hit hard, but it also made me feel a little better."}, {"id": "ffvga2p", "author": "richfroggie", "body": "this was so good"}, {"id": "ffvp6f5", "author": "dog75", "body": "I hope you all the best in life and hope the pain eases as time floats by. I know from personal experience it never goes away it just gets better!"}, {"id": "ffvwa57", "author": "laurync_92", "body": "Wow.  Just...... wow.  I lost my grandma about 10 days ago - it was a long time coming.  She had pretty severe dementia.  But this story reminded me of a dream I had about her where I saw her as she had been many years ago, in a field of beautiful yellow daisies.  She knew who I was, and I felt peace - she hadn’t known who I was in a very long time.  Thank you for this story.  You are a very talented writer."}, {"id": "ffw41z4", "author": "dorepan", "body": "This story is so beautifully written. I’m blessed to still have my mother with me, and being a mother myself, it brought me to tear reading the last part. Thank you."}, {"id": "ffxkeod", "author": "sparkle_in_the_dark", "body": "Thank you for this...It's beautiful, and heart wrenching, and I appreciate the time and effort you put in to sharing it with us. You made me cry my mascara off."}, {"id": "ffy8g93", "author": "OnyxEyez", "body": "This somehow presented beautifully how I feel about death,  and got to me so hard. Thank you."}, {"id": "ffyi6wr", "author": "L00nuhtick", "body": "I just lost my mom to cancer this month. She was never even diagnosed. Deciding to let her go was the hardest thing I've ever had to do. This was beautiful, terrifying, and comforting. It was wonderfully written."}, {"id": "ffzheye", "author": "RehnWriter", "body": "This was one of the most beautiful stories I read on here. Thank you!"}, {"id": "fg24blx", "author": "yungrapunzel", "body": "My dad died 4 years ago (he had cancer too) and I'm still grieving. I hope he's reached the end of his road and got to a better place and I also hope that wherever he is he remembers me just as much as I remember him. Thank you for your beautiful story."}, {"id": "fg2wsqn", "author": "glaux2218", "body": "I absolutely love this, I sincerely hope you write more!"}, {"id": "fg41v4g", "author": "DelusionPhantom", "body": "I learned my mom had cancer last month and fought it alone. This hit me really hard, it's beautiful and I'm crying like a baby. She's okay now, but I'm terrified it's going to come back. I didn't really have a point to this comment I just wanted to tell you I appreciate seeing this right now. I really needed it"}, {"id": "fg5x9o4", "author": "kcir-dellor", "body": "Gosh.. I’m not crying you are. But seriously, this is so good, I’ve had experiences where someone I love has to fight this sickness, but luckily she’s alright now."}, {"id": "fg5xojh", "author": "Loxer150", "body": "I don’t usually cry when reading stories, but this one got me tearing up. Thank you for this."}, {"id": "fg929dn", "author": "limegreennalgene", "body": "I’d do the same for my mum tbh"}, {"id": "fgcqa72", "author": "ablalb", "body": "i hate crying but this brought on the flood"}, {"id": "fge39bd", "author": "ruaryx", "body": "This was beautiful. Thank you."}, {"id": "fgfml67", "author": "Gpjess", "body": "I lost my best friend about a year ago.. I have had such an incredible fear of death since then.. this story is making me bawl."}, {"id": "fgfurxf", "author": "gumrose", "body": "Jesus this broke me, thank you for sharing your craft with us. I lost my dad a long time ago and this hit home, now excuse me I think I need to go call my mom."}, {"id": "fghefmx", "author": "Aninternerloser", "body": "Great job! Your story and imagery kicked me right in the testicles of my emotions. Good thing there's no one here to see me cry."}, {"id": "fgkk6fs", "author": "PM-ME-TINY-KITTENS", "body": "goddamn i cried..."}, {"id": "fgrs94d", "author": "NebulaSlayer", "body": "Coming back because I’m still thinking about this story..."}, {"id": "fgx6hrd", "author": "Frozenbloom", "body": "Absolutely beautiful and poignant and wonderfully written. It reminded me of the final chapter of The Left/Right Game (my favorite NoSleep of all time). This definitely belongs on r/wholesomenosleep"}, {"id": "fh8spmv", "author": "TheLoneNazgul", "body": "Cool, I’m crying at work."}, {"id": "fhgf0f3", "author": "ckbarbies", "body": "I didn't expect to cry at 10am of the workday damnit"}, {"id": "fhgz0d4", "author": "taylorallenpoe", "body": "Ok, this is the most beautiful thing I've ever had the pleasure of reading."}, {"id": "fho7dez", "author": "Boom400", "body": "Man this hits the feels so hard."}, {"id": "fhpfjn9", "author": "Beetroot-Salad", "body": "Holy shit, the first nosleep story to make me cry. Congrats."}, {"id": "fi5uiw7", "author": "tamaralynnchambers", "body": "This filled me with so much comfort. I cried throughout the second half. Thank you."}, {"id": "fif8u7v", "author": "jophiss_", "body": "This is so incredible and wholesome. ❤️"}, {"id": "fim32xu", "author": "Jaxdtk1", "body": "When I read this story first I cried—losing my parents is my absolute worst fear. I just found out about an hour ago that my mom has breast cancer, after sobbing and praying with her I felt the need to read your story again. It’s so beautiful, I don’t think I’ve ever been so moved, I can’t thank you enough for writing this, it’s really given me a slight peace of mind."}, {"id": "fj9vuq7", "author": "desert_coffin", "body": "I had to go hide in the office bathroom until I could stop the tears. I haven't lost my mom but she lives in a different country and I'm so terrified of all the time I spend away from her. Thank you for this beautiful, beautiful text. Your love for your mom truly resonated throughout."}, {"id": "fjg92tm", "author": "Ersheler", "body": "I lost my mother to lung cancer that metastasized and spread to pretty much every part of her body almost two years ago. Unlike your mom, my mom lost so much of herself in a months time and wasn’t the same person she had been at all. I would get occasional glimpses of her if I stayed up late enough, but it was rare. Three months after her diagnosis she was gone. A little over a year ago, I started having a recurring nightmare where I was able to have her back for one day in perfect health, but when night fell she would pass out in my arms, and I would watch her body shrivel like it did when she was sick and then decompose and turn to mush in my hands. The part where you described your mother falling into your arms and turning into a greasy shadow sent chills and what I can only describe as nausea down every part of my body and I almost had to stop reading because of the similarities to my nightmare, but I made myself continue and I ended up finding peace in this story. Thank you so much for sharing this."}, {"id": "fjrrx3d", "author": "dudebg", "body": "I'm older than my elder brother now. He suffered 2 weeks of extreme headaches then died from aneurysm at 18. I always dream of him, I'm always confused in my dreams if he is healed or not, if he somehow rose from his grave. I look around the room to search for him when i wake up after dreaming because we always shared a room. After reading this, i wonder how strong he is now that he left his body."}, {"id": "fjx05ff", "author": "Squididlio", "body": "Holy shit, this actually has me crying. So beautiful and well written. It feels so real"}, {"id": "fkhedf5", "author": "OrtusOrigin", "body": "Amazing story, give me shivers like I never had"}, {"id": "fl5q5ko", "author": "ChaiHai", "body": "I just had to comment, I was fine until your edit. ;_;\n\nMy mom suffers from undiagnosed paranoid schizophrenia. It got worse until when I was in high school, she became homeless, and her delusions  became exponential.\n\nI then moved out of my home state. I haven't had contact from her in over 5 years, a relative saw her along the road and called me.\n\nI have no idea if she's alive..... ;___;.....\n\nShe'd be about 65 if she's still out there, homeless in WA which is currently a corona virus hotspot. ;_;\n\nShe's been walking alone for awhile and your edit brought me to tears."}, {"id": "fmaspie", "author": "elvendork323", "body": "This hits home. Hard. My mom passed away in December, to cancer, after the doctors told us there was simply nothing else to do. I felt like her last dregs of life were like your mother's: frightening, unnatural, and torturous. We had no misunderstandings about her survival, we were just trying to keep her comfortable. We couldn't. 300 mcg of fentanyl patches couldn't. She, I assume like your mother, was in pain until the moment she was able to slip away. I so wish there had been something to do as easy as extinguishing a candle to stop her suffering.\n\n At some point, my dad and I are likely going to use her battle to advocate for allowing terminally ill people to die with dignity and peace. May I use some elements of your story? It brought me to tears because the imagery and metaphors are so apt and they remind me so much of the early days in hospice when we were still fighting. You so succinctly expressed what a futile fight it is to stave off the inevitable, and you hit the nail on the head with the terrors that come with the final stages of dying. I think a story like this - where the problems, fears, and pains are real, tangible, and obvious - would help so many people see why assisted suicide is needed.\n\nThank you for writing the last scene, where her husband protects her on her journey down the road. My dad is still with me, and so I think it was my mom's grandma who protected my mom on her road, just like she protected my mom in life.\n\nToday is my mom's birthday, and the thought of her walking hand in hand with her grandma down a road to paradise is a very nice thought to start the day with. If this was inspired by your experience with your mom battling cancer, I hope you're doing as well as you can. It sucks. Cut yourself some slack today; I know I'm going to do so for myself."}, {"id": "fmjhied", "author": "bopaz728", "body": "Gosh I can’t stop crying."}]}