{"id": "f4fhyv", "title": "I knew a woman who never took off her wedding dress", "url": "https://www.reddit.com/r/nosleep/comments/f4fhyv/i_knew_a_woman_who_never_took_off_her_wedding/", "subreddit": "nosleep", "author": "poloniumpoisoning", "text": "Pauline was a sweet woman who lived across the street. We weren’t close as kids or teenagers because she was around five years older than me, but our parents were friends. I think she babysat me when I was younger too.\n\nWhen my mother learned that Pauline was engaged, she sent me to help on the bridal shower. Poor mom, she thought I was like that because I was too often around boys and needed to learn to be more feminine, but she’s got that backwards.\n\nThat’s when I first learned that Pauline and her soon-to-be husband had made a blood oath.\n\n“The first to die comes and takes the other as soon as they can”, she explained to me, swirling the ruby ring gently around her fingers.\n\n“Isn’t that too dramatic? What if you end up divorcing and marrying other people?”\n\n“We won’t. We are soulmates!” she assured me. Her naïveté made her incredibly beautiful, but it felt really wrong being 21 and thinking that I was so much more mature than a 26 years-old.\n\nI didn’t pursue the matter, but she kept talking about him in a dreamy tone. *Aiden would like this*, *I wish Aiden was here*, and so on. Her dreamy tone almost made me believe that soulmates existed and that you could make the person you love the most follow you in death by just willing it.\n\nI met Pauline’s friends, and we all ended up having some quality girl time. Pauline explained to us all how she believed that you can wake up in the afterlife and start controlling things with your mind.\n\n“Of course your memories will be hazy”, she clarified. “But that’s why we made the blood oath. So we can remember.”\n\n“And how will one get the other back?” I asked, entertaining her.\n\n“I like to believe that we’ll both grow wings!”\n\nIt was all terribly silly when I think back, but Pauline had something about her that made everyone pay attention and marvel at her words.\n\nDespite the age gap, we ended up becoming good friends; I think we were finally at an age where it didn’t matter anymore. Since I was in college but lived with my parents and didn’t need to work, I had a lot of spare time to accompany her to wedding dress fittings, cake tasting and all the little things that were the world for brides.\n\nBut Pauline was a pleasant bride-to-be and never freaked out; she was just thrilled about marrying the man of her dreams, and wanted to make it pretty if possible.\n\nLittle by little, I grew to understand her devotion to Aiden. And he was just as crazy about her, if not more. When they were together the world felt like a brighter and warmer place. Like marshmallows slowly melting over my heart.\n\nThe day of the wedding came, around half a year after her bridal shower.\n\nIt was neither a big nor a small wedding – it felt like both Pauline and Aiden were able to invite exactly everyone they wanted around on their happiest day. Not one more, not one less. I felt somewhat honored to be there.\n\nStill, the happiest day never came.\n\nWhen Pauline arrived, belated as any bride should, there was whispering and disquiet; Aiden wasn’t there yet. \n\nHer smile didn’t falter, because she was completely sure that he would never bail on her. But I could tell she was worried. The bridesmaids – her two closest friends since high school – started making calls to try to find out if the groom had a sudden illness.\n\nSoon they realized that Aiden’s parents were there, but not his brother. They informed that their other son was supposed to drive the groom as part of his best man’s duties.\n\nWhen the devastating news came, everyone wanted to comfort her, everyone wanted desperately to protect her precious heart, but it was too torn apart to notice anyone else.\n\n*It was all too fast and scary. (…) A sports car ran a red light straight into the Mirage. (…) The man in the passenger seat was dead on arrival. (…) The driver was taken to the hospital but his state was critical.*\n\nIt was all so hard on everyone. Aiden’s brother ended up surviving, but he’ll be tetraplegic for life due to severe injury on his spinal cord. As far as I know, he’s also miserable because he wished he could be the one who died.\n\nRight after the wedding that never happened, Pauline and Aiden’s parents dealt with selling the house they had just bought, and Pauline continued living with her parents. They both still worked office jobs, so her other friends and I started taking turns keeping her company while they weren’t home.\n\nI did my best to be there for my neighbor and friend, but *she* wasn’t there. She was living in delusion, and the only thing you could see leaking into reality was her desolation. \n\nI never saw such a deep and heart-wrenching sadness. Pauline refused to take off her dress. She would spend the whole day by the window waiting for Aiden and the whole night crying because she missed him desperately. Every single day.\n\nShe was hopeful it was a matter of time until he woke up on the other side and remembered to bring her along. That’s why she wouldn’t take off the dress – he had died on his wedding suit, so it was only natural that she was up to par.\n\nHer parents and every single one of her friends tried to coax her into changing her clothes. We promised she could always keep the dress close for when Aiden came, but she knew that we didn’t really believe he would. It was like promising your kid that you’d buy them a Happy Meal some other day. \n\nNo one dared to penetrate her grief and force her out of the dress. She spent the day in it, slept in it, even bathed in it; since we live in a warm and arid weather, having it dry wasn’t an issue, only everything else.\n\nThe once beautiful organza and silk were now ragged, grimy and smelling. But she still refused to take it off. She started to believe that Aiden wouldn’t be able to spot her in the crowd if she wasn’t wearing it.\n\nIt was impossible to change her mind, and even though she was seeing a therapist three times a week, she wasn’t improving. Her mourning and PTSD were turning into a darker, more permanent mental illness.\n\nShe started talking to Aiden, then explained to us that he was nearby, so she could feel him coming. He was just taking a while because flying is really hard when your wings are newly-acquired.\n\nThen one morning, she disappeared for good. No one saw her leaving, and no one saw her at all after that.\n\nThe only thing that we were able to find, in the small grove behind the house, was her filthy wedding dress. It had two large holes poked on her back, like it had grown wings.\n\n\\*\\*\\*\n\nAfter finding the dress, everyone who loved Pauline was relieved; her mother readily admitted that she actually believed that Aiden somehow had come back to take her. Others weren’t so fond of the supernatural explanation, but thinking that there was a chance that it happened brought us a sense of closure.\n\nIt’s not that we were happy about her death, but we conformed to the possibility of her finally finding her peace.\n\nShe was an angel, after all. Why wouldn’t she grow wings and escape her flesh prison?\n\nThe family held a beautiful memorial service in her honor, and slowly we all started moving on with our lives.\n\nNow, you might ask what I believe in. I would laugh bitterly because I don’t have this choice to begin with.\n\nBeing the person who spent the most time watching Pauline those days, it was only natural that I was the one to found her dead in the bathtub. Hiding and subsequently getting rid of her body was the hardest thing I have ever done; tampering with the dress, though, was eerily healing.\n\nStill, I think that she would be pleased to know that I faked her rapture. \n\nA romantic and mystifying death fitted her way more than suicide[.](https://www.reddit.com/r/PPoisoningTales/)", "comments": [{"id": "fhq9x5y", "author": "MuskanRajan", "body": "WHAT AM I SUPPOSED TO FEEL"}, {"id": "fhqr32q", "author": "Dragon_Druid", "body": "In taking that burden on yourself, you healed everyone else involved.\n\nI think you're the angel here."}, {"id": "fhqiqf4", "author": "Rickticia", "body": "This was hauntingly beautiful"}, {"id": "fhq7kau", "author": "ellenthedegenerate", "body": "holy fuck"}, {"id": "fhqpq4i", "author": "illiteratepsycho", "body": "You were a true friend to her."}, {"id": "fhru4jv", "author": "Koshunae", "body": "Aiden never found her because he never saw her in the wedding dress. He didnt know who to look for."}, {"id": "fhrb8yf", "author": "coh_phd_who", "body": "Did anyone try to get her a second copy of the dress so she could switch between the two?  I would of at least offered that idea."}, {"id": "fhqqhh7", "author": "reclusecaboose", "body": "This broke my heart"}, {"id": "fhqw2cl", "author": "SunflowerShine03", "body": "Went through shock happiness and sadness all in the span of like .5 seconds"}, {"id": "fhw28uv", "author": "_____catherine", "body": ">Poor mom, she thought I was like that because I was too often around boys and needed to learn to be more feminine, but she’s got that backwards.\n\nWhat does this mean?"}, {"id": "fhqnay8", "author": "SephtisBlue", "body": "I cried for a good 10 minutes."}, {"id": "fhqzvlp", "author": "affable-mum", "body": "You did well, OP. You did well."}, {"id": "fhr8if9", "author": "Rusalochke", "body": "I wish that in another timeline, Aiden did arrive at the wedding.."}, {"id": "fhr88ag", "author": "Rangermatthias", "body": "And then Aiden showed up and couldn't find his beloved. He was drawn to you. He knows what you did. He can't find her. She's not in her proper plot. He needs to find her! HE NEEDS TO FIND HER!!!"}, {"id": "fhqtq9r", "author": "kieranluke626", "body": "Fuck me sideways this is heartbreaking"}, {"id": "fhywnst", "author": "Magena", "body": "Was no one surprised that her body was missing? Did no one think that the disappereance of Pauline could have been due to a crime (it wasn't, but only OP knows that)?"}, {"id": "fi9ns3w", "author": "themjsilva", "body": "My heart is crumbling right now. I know how it feels to love deeply, to love with devotion and passion. I know how hard it is to lose someone you love. for Pauline, I know her pain was too much to take, I feel for her, I know what she went through, just like her I've lost the person that I loved the most. Although I have survived the ordeal but it left a huge scar in my heart...and on my wrist."}, {"id": "fi6pz8m", "author": "liminalspace-case", "body": "This is so eerily beautiful. I think Pauline would have been happy with what you did."}, {"id": "fhr5hkt", "author": "_sh1ft", "body": "i dont know anymore"}, {"id": "fhrvo5b", "author": "porksiomae", "body": "FIRST OF ALL, HOW DARE YOU BREAK MY HEART LIKE THIS."}, {"id": "fhqhqsv", "author": "Technical-Loquat", "body": "Wtf where is the body"}, {"id": "fhr41xv", "author": "jkosarin", "body": "This is so good!It makes one believe in true love. I hate how sad Pauline was over losing Aiden but I can’t say I would be any different if I lost my husband who is my best friend and soulmate.Soulmates really exist, I can attest to that,I’m living it."}, {"id": "fhs1tq9", "author": "LaDamaBibliotecaria", "body": "I’m supposed to get married in a few weeks. Should not have read this."}, {"id": "fhs8wv9", "author": "Little_Queen_Beanie", "body": "I still hope than she found him in death and finaly had the time with him she deserved..."}, {"id": "fht82bx", "author": "shawster", "body": "Honorable. You took the darkness upon yourself and shed all others of the burden. If anyone gives you wings it will be an actual angel.\n\nBut probably just someone else."}, {"id": "fiboqcg", "author": "egg2419", "body": "Damn OP. It's a shame y'all couldn't have helped her more in life."}, {"id": "fhrd2uh", "author": "LarennElizabeth", "body": "Damnnnn son that's pretty sad. I had a feeling she would commit suicide but didn't know OP would stage the rest. Beautiful."}, {"id": "fhrxmj5", "author": "northernstardust", "body": "Oh my god.."}, {"id": "fht36j6", "author": "Sakura88", "body": "I don’t know if I love this or hate it I’m so torn.. wow"}, {"id": "fjchl73", "author": "deliriousnova", "body": "So wait, she killed herself? You made sure her body was stone, and that you tampered her dress to make it look like it had wings?"}, {"id": "fjmusos", "author": "xricenbeans", "body": "Heartwrenching"}, {"id": "fjzkkoe", "author": "Aejra", "body": "But.. what if he did find her while she was having a bath? Of course her moral body would be left behind!"}, {"id": "fkcyak4", "author": "Airrz10", "body": "This is such a heartfelt story. I really needed this. Thank you"}, {"id": "fhrhgex", "author": "cancerouscarbuncle", "body": "Did she kill herself or did she die of a broken heart?"}, {"id": "fhrawy4", "author": "thisbitch97-369", "body": "You do in the angel thing is so sweet"}, {"id": "fhs262z", "author": "sdharmin", "body": "Oh...brings back memories. I can relate :)"}, {"id": "fhqyvhd", "author": "MadeLAYline", "body": "You gave her family and friends the closure they wanted. But at the same time, that’s a heavy burden to carry for the rest of your life. \n\n\nGood luck!"}, {"id": "fhr52nl", "author": "Alusmitai", "body": "Wish I can find a friend like you."}, {"id": "fhrnab4", "author": "Skyhawk_Illusions", "body": "I am so sorry\n\nI cannot possibly begin to imagine how this has affected you in such a traumatic way. If you need anyone to talk to, we are here for you."}, {"id": "fhro4o7", "author": "wren-scrEAM", "body": "I'm having a mental breakdown because this is such a moral mindfuck"}, {"id": "fhs196f", "author": "DifficultGrapefruit2", "body": "They’re finally reunited again in death. Thank you for being such a good friend to her! \n\n... I hope you hid her well."}, {"id": "fhrx4hj", "author": "homegrowninidaho2", "body": "You're bestest best friend in the whole wide world op"}, {"id": "fhrxr81", "author": "thedevvylee", "body": "What a good friend ❤️ I’m sure it’s what she would have wanted!"}, {"id": "fhsp80l", "author": "FoxWarBr", "body": "This is... just wow."}, {"id": "fhswkzb", "author": "LunaticRonin", "body": "You are a great friend"}, {"id": "fhsxeox", "author": "MyoTheHamiltrash", "body": "Damn. The feels."}, {"id": "fht9z9p", "author": "setmeoneon", "body": "so bittersweet"}, {"id": "fhwy1s8", "author": "z0soo", "body": "angel huh"}, {"id": "fhx1rq6", "author": "platinumvonkarma", "body": "I felt that in my heart. True definition of bittersweet."}, {"id": "fhyvr5l", "author": "Scully__", "body": "OP = ultimate wingman"}, {"id": "fi02k9e", "author": "Sylar299", "body": "Oh man, I wasn't ready. You're crying !"}, {"id": "fi63vga", "author": "Timetofly123", "body": "Christ."}, {"id": "filepki", "author": "DandyVampy", "body": "The whole story I was like wtf and then the end punched me in the face and I basically screamed it! Holy crap what a devastating story but so good, just wow! I don't even know how to feel!"}, {"id": "fk3d9lh", "author": "HoxtonAmnesia", "body": "This gives me Havisham vibes"}, {"id": "fk3goo8", "author": "Fabantonio", "body": "I feel darkness now..."}, {"id": "fk472zz", "author": "juncotalons", "body": "I expected op to have killed her but now I'm just sad :("}, {"id": "fhqyn0x", "author": "SerenityFate", "body": "Wow, this brought a lot of feelings. Beautiful"}, {"id": "fhrf49n", "author": "RindaC10", "body": "Idk how I should feel. Anyone know how should I feel?"}, {"id": "fhrl82j", "author": "TM_Crystalline", "body": "Good work, OP! Pauline would be grateful."}, {"id": "fhrzc4d", "author": "crazeharsedragon", "body": "I don't know what to feel right now. :/"}, {"id": "fhuqmj7", "author": "ThesilentSwiNg", "body": "OP is the one with the Halo! Beautifully written!"}, {"id": "fhrchyb", "author": "LovepieCreampuff1031", "body": "All's well and good until Pauline comes back to haunt your ass."}, {"id": "fhsnisp", "author": "Ckcw23", "body": "But if her real body doesn’t have a grave, she might come after you....."}, {"id": "fjxoude", "author": "FUCK-ICEAGEBABY", "body": "just tell them she commited suicide coward"}]}