{"id": "fiz4d0", "title": "I had a disturbing conversation with my 7-year-old daughter.", "url": "https://www.reddit.com/r/nosleep/comments/fiz4d0/i_had_a_disturbing_conversation_with_my_7yearold/", "subreddit": "nosleep", "author": "samhaysom", "text": "\"Dad, *dad*! I saw a *zombie*!\"\n\nI was in the kitchen making tea when my little girl came rushing in. She ran through the back door so fast she almost tripped up the step. I poured boiling water from the kettle into a mug, hardly looking up.\n\n\"Oh yeah?\"\n\n\"Yeah, I did! Its face was all pale and messed up! It was *gross*, dad!\"\n\nI put the kettle back and picked up the milk. Sighed inwardly. I *really* had to be more careful about what I watched on TV in the evening. Rosie has a habit of sneaking downstairs in the night, and last week she caught me watching *The Walking Dead*, of all things. She's had zombies on the brain ever since. I keep telling her they're not real, but it doesn't seem to make a difference.\n\n\"Sweetheart, what did we say about zombies?\" I scooped the teabag out of the mug and dumped it in the bin. \"You know if you keep talking about them, daddy's going to get in trouble with mummy again.\"\n\n\"Yeah, but I *saw* one.\"\n\n\"I know, darling, but I already checked the back garden twice yesterday, and I can promise you it's a zombie-free zone.\"\n\n\"No, not in the back garden.\"\n\n\"Hm?\"\n\n\"I didn't see it in the back garden.\"\n\nI had the mug half raised to my lips, but now I put it down again. I turned to look at Rosie. Her hair was wind-swept and her little cheeks were red, as if she'd been running.\n\n\"Sweetheart.\" I put on my best stern, dad's-not-happy voice. \"I'm going to ask you a question, and I want you to be honest with me: Have you been playing along the path out back again?\"\n\nI didn't really need to ask the question, because I already knew the answer. Rosie is allowed to play in the garden on her own, and sometimes – if she asks us permission first – we let her ride her bike along the path at the back of our house. The one that runs past all the neighbour's back gardens. But that's *all* we allow her to do. This area is pretty safe, but these days you can never be too careful. There was a burglary a couple of roads over a few months back, and last year someone was mugged on the high street. Several years ago, a few towns over, a little boy even went missing. That was quite a long way away from here, of course, but it made national news for a few days until the search fizzled out. And it made a lot of parents more cautious. Rosie's getting older now, and she's an adventurous girl, but still – you have to have boundaries. And on a few occasions lately, Rosie's been crossing those boundaries. Riding her bike further than she should. Not coming in straight away when we call her. Sneaking out the back gate when she's only meant to be playing in the garden.\n\nAs I watched Rosie now, I noticed her face growing redder. She looked away from me, down at the kitchen floor, and scuffed her feet.\n\n\"Dad, I only went a *little* way down,\" she said. \"I *promise*. I was chatting to Mr Henderson, because I saw him in his back garden. I said hello and made him jump!\"\n\nI sighed. So there it was: Mr Henderson was Rosie's zombie. Yesterday it was the postman, and the day before that it was a different neighbour. I took a sip of tea and shook my head. Mr Henderson was, in fairness, a better candidate than the others. The guy lives on his own, and he looks about 100 years old. Moles all over his face. Skin like a deflated balloon. Whenever we'd chatted over the garden fence before, though, he'd always seemed nice enough. Just a bit lonely. I couldn't have Rosie going round calling him a zombie.\n\n\"Listen to me, sweetheart. I know you didn't go far or anything, but I don't want you–\"\n\n\"I came right back after too, dad!\" Rosie interrupted. She was staring up at me now, blue eyes large and pleading. \"I promise! And I even said no when Mr Henderson offered me an ice cream, because I know you don't like me taking stuff from strangers!\"\n\nI opened my mouth to respond, then paused. \"He offered you ice cream?\"\n\n\"Yeah, but I said no! Mr Henderson really wanted me to come in and have one, but I told him I had to get home! And then I came straight back here to tell you I'd seen a zombie, and I...\"\n\nRosie was babbling now, her voice whirring like a motor. But I'd stopped listening. My mind was still stuck on something she'd said a moment before.\n\n*Mr Henderson really wanted me to come in and have one*.\n\nI took another sip of tea and frowned. That wasn't good. I didn't mind the neighbours chatting to my little girl, but I didn't like the thought of them inviting her in. Not without us there. Not even if they were just kind, lonely old men. I made up my mind to go round and visit Mr Henderson later, and to tell him that myself – kindly, of course, but firmly. \n\nIn the end, though, I didn't get a chance. Because a few moments after I'd had the thought, Rosie said something else. Something that pushed everything else from my mind, and ended any idea I might have had about going over to Mr Henderson's house. She said something that made me feel cold.\n\n\"Daddy, please don't stop me playing in the garden. I *promise* I won't sneak out again. I don't want the zombie to get me.\"\n\n\"Rosie, I'm not going to stop you playing in the garden. But you have to make *me* a couple of promises, too. First, promise me you'll stop going round calling people zombies. Mr Henderson my be old, but he's not one of the living dead.\"\n\nRosie frowned. \"I didn't.\"\n\n\"What do you mean, you didn't? You just ran in here a moment ago calling him one.\"\n\n\"No, I *didn't*. Mr Henderson's not a zombie. I saw the zombie in his house, but it wasn't him.\"\n\nI frowned. I had the mug raised to my lips to take another sip of tea, but now I put it down again. \"What do you mean, sweetheart? You saw someone else in his house?\"\n\n\"Yeah, the *zombie*, dad! I could see it pressed against his little basement window while I was talking to him.\"\n\nCold fingers ran up my spine. \"What?\"\n\n\"Yeah, it was *really* scary. Its face was all bashed up and bloody, and its mouth was open. Like it was screaming at me. But do you know what confused me most, dad?\"\n\nI tried to keep my voice steady. \"What?\"\n\n\"Well, I didn't realise *kids* could be zombies, too. I thought it was only grownups. But I guess I must have have been wrong, cuz' the one in Mr Henderson's basement looked [just like a little boy](https://www.reddit.com/r/samhaysom/).\"", "comments": [{"id": "fkk8tj6", "author": "KingProMemo123", "body": "Thats why I will always listen carefully what kids are saying \n\nThey can lie most of the time but You need to make sure that its a lie"}, {"id": "fkk2mx7", "author": "Wishiwashome", "body": "Old lady here. When will people learn? OLD does NOT make you nice? YOUNG doesn’t make you a shithead. There are nutty bastards ( male and female) of every race, creed, religion, age, sexual orientation etc. out there. Every serial killer starts out a “cute” baby, and if we are unlucky enough, they live to be OLD. Poor kid:("}, {"id": "fkk526b", "author": "ByfelsDisciple", "body": "Just to be safe, I think you should remove Mr. Henderson's head."}, {"id": "fkk1016", "author": "MurseWoods", "body": "Hey! Who’d have thought her watching a The Walking Dead, and getting a little Negan time, might’ve just saved her life."}, {"id": "fkkb0ed", "author": "DrunkenTree", "body": "Thank you, sir, for making the effort to teach your daughter basic rules about strangers.  You surely know this, but you probably saved her life.  And, hopefully, thanks to her you can save the little boy."}, {"id": "fkk2f85", "author": "Hollowdude75", "body": "Very disturbing, Especially with a 7yo, If you know what I mean don’t say it, It only makes it more disturbing"}, {"id": "fkk5zem", "author": "_DifficultToSay_", "body": "Mr Henderson deserves to rot. OP, please tell us you’ve rescued that poor child."}, {"id": "fklbtun", "author": "samirhyms", "body": "\"Several years ago, a few towns over, a little boy even went missing.\"\n\nHmmm"}, {"id": "fkl72vv", "author": "JessyPkLover", "body": "We need you to investigate and give us an update ! It just can not end like that."}, {"id": "fkk3dys", "author": "Wishiwashome", "body": "And Dad, sorry to sound like an asshole. The old bastard was disrespectful for inviting your kid in without your knowledge! You said prior to the whole realization that he was a pedo kidnapper,you would gently talk to him. Dad, I was a little social butterfly in the late 60s early 70s. You didn’t go into houses alone then! Just off! There are plenty of ways to be kind to little kids and not give them food( unless I ask a parent ahead of time if I see their kids can I offer a snack?? I keep glow sticks and stuff like interesting rocks for kids that “visit” me. I have a small working ranch that is fenced.\nKids like to see my garden and know I have some pretty cool animals. I bring the baby chicks, poults, piggies, you get the picture, to THEM. Never would I invite a kid on my property!!  Yes, there might be some seniors who really don’t know any better BUT, screw them!! Your kid’s safety if paramount! PC bullshit aside. I am old, if I am asshole, I deserve to be called out."}, {"id": "fkl9znh", "author": "22feetistoomany", "body": "As a parent I will say this absolutely is horrifying."}, {"id": "fkmg9yc", "author": "jericjan", "body": "You really did the right thing letting your daughter finish her story, OP. Most adults just shut them up."}, {"id": "fkm54tf", "author": "bulmakai", "body": "This went from cute to freaking bone chilling real quick. I got a literally chill up my spine after finishing that."}, {"id": "fkmbev1", "author": "EitherWeird2", "body": "OP update us once you beat the fuck out of that guy."}, {"id": "fkl24kb", "author": "dargonjz", "body": "Wtf"}, {"id": "fknp471", "author": "NoLoveLostOrFound", "body": "I read this last night and then had a dream that I was being chased by a slow ass zombie child but I was moving super slow too and I couldnt get away...thanks man lol"}, {"id": "fkkdlgu", "author": "universalhippie", "body": "As a parent that made me go cold to the bone."}, {"id": "fkkui2b", "author": "slashdotbin", "body": "This is chilling."}, {"id": "fklicqo", "author": "i_r_e_n_a", "body": "oh my goodness"}, {"id": "fkmpahl", "author": "jodi5315", "body": "My whole body has goosebumps. Holy shit I feel sick. Whoah."}, {"id": "fkmr4vh", "author": "tiedye_dreamer", "body": "kids have eyes to see, \nand ears to hear.\nsometime they speak truth, \nother times spread fear."}, {"id": "fkkr8zy", "author": "17vicky37", "body": "Call the cops, seriously."}, {"id": "fkk9s3l", "author": "chickenrapist", "body": "So. Well. Done. \n\nIn every sense of the word."}, {"id": "fkk8sfa", "author": "upcoming_guitarist69", "body": "I.WAS.NOT.EXPECTING.THAT"}, {"id": "fkl3hhz", "author": "KyotoSkateShop", "body": "The perspective of the parent made me very tired. Like let the kid finish talking"}, {"id": "fkma903", "author": "MarcosJam", "body": "ok little girl thats kinda creepy i guess but can you let the man drink his goddamn tea"}, {"id": "fklmtbc", "author": "NACI00", "body": "Airstike inbound"}, {"id": "fklohsx", "author": "cheemslomver", "body": "Oh my god"}, {"id": "fkm7m7m", "author": "big_chunko", "body": "That's awsome and terryfing"}, {"id": "fkz1i84", "author": "Wank_Man420", "body": "Someone on tik tok is just reading this without crediting you at all."}, {"id": "fkkwac9", "author": "sweepsweep2", "body": "“Dad I saw a zombie”\nDad: Elon musk is outside"}, {"id": "fkk8lzn", "author": "_UnknownBeing", "body": "Now that's scary. Rosie, you're grounded."}, {"id": "fkk6kxf", "author": "iwantcupcakes18", "body": "this is so creepy!"}, {"id": "fkka0lq", "author": "deletedx2", "body": "O h,  o k a y  t h e n"}, {"id": "fklzr1k", "author": "MyPlasticMemories", "body": "I love that you play along and let her flesh out the story instead of just dismissing it like some parents. I got chills reading this. I’m so glad Rosie knew better than to go to a stranger’s house. Please call the police and have the place searched."}, {"id": "fkkrc49", "author": "Collapsing_Cardboard", "body": "Uh oh"}, {"id": "fkmkrsa", "author": "TheBlackWolfsSoulYT", "body": "Holy fucking Jesus Christ..."}, {"id": "fkuz536", "author": "m4more", "body": "This is real horror. Call 911 asap."}, {"id": "fkv6sov", "author": "Ozzy-Lucky", "body": "Mr. Henderson loves little children. Btw does he have a white van?"}, {"id": "fly5dxd", "author": "amrs1234", "body": "Are you going to call authorities or have anything done?????"}, {"id": "flywg58", "author": "DatOneRussian68", "body": "Jesus Christ. Call 911!!"}, {"id": "fkk56r5", "author": "JeffersonComingHome", "body": "Wow, the investigators there are really stupid. A boy went missing on your street and they didn’t bother to check any of the houses on your street? Call the cops immediately!!!"}, {"id": "fknzgwh", "author": "The_Bitch_Is_Here", "body": " Oh gosh.. I suggest calling the police. Tell your daughter to stay away from him, and make sure she knows not to go to anyone’s house without your permission. (Also, your daughter and I have the same name! Though my name is spelled “Rosy” instead of “Rosie”)."}, {"id": "flr15j1", "author": "Simpnation420", "body": "\"Kids can be zombies too? That's scar- hold up...\""}, {"id": "flv3wib", "author": "UranusMc", "body": "Jesus mother christ"}, {"id": "flxh00i", "author": "AreUKiddingMehOMG", "body": "Mr. Henderson bad"}, {"id": "fm6flau", "author": "Coachskau", "body": "Well it's Mr. Henderson's fault he stacked enough boxes for a zombie to climb that high"}, {"id": "fmdv4w2", "author": "GypsyWarlord", "body": "so... do you call the police?  \nor kick in his door drag him downstairs and investigate?   \nlaws and morality are so confusing"}, {"id": "fmfvne2", "author": "July220", "body": "The last sentence is just heartbreaking"}, {"id": "fmt333y", "author": "Sourpatchqueers8", "body": "I knew this was going there and holy shit this was good"}, {"id": "fklgcao", "author": "Plungermaster9", "body": "I don't think it was a zombie, more like your neighbour is a creepy pedo-necrophiliac shit.\n\nStill this is scary and disturbing as heck."}, {"id": "fljpkbp", "author": "zeda96", "body": "Sorry, I am not sure if I follow. Can someone please help me understand the story ? The last part was a bit confusing. I am sorry , my English comprehension is poor."}, {"id": "fkm0sh1", "author": "Sent1nelTheLord", "body": "My daughter: DAD DAD\n\n\n\n\nMe: if u don’t shut up..."}, {"id": "fkm101w", "author": "Hardkoar", "body": "You really gotta stop frowning and let the kid do that instead."}]}