{"id": "fw76ux", "title": "Working at an amusement park: Connections", "url": "https://www.reddit.com/r/nosleep/comments/fw76ux/working_at_an_amusement_park_connections/", "subreddit": "nosleep", "author": "girl_from_the_crypt", "text": "I work at an amusement park where only half of the actors are actual actors. After I acquired a certain revolver from Dale [yesterday](https://www.reddit.com/r/nosleep/comments/fvliz2/working_at_an_amusement_park_twenty_questions/?utm_medium=android_app&utm_source=share), I spent the remainder of the night staring at it. I played around with it a little, harmlessly imitating some rather cool Western scenes. I admit that didn't help me making any sense of it though. \n\nEither way, when I finally went to bed, I took it with me and placed it on my nightstand. For some reason, I felt like I wanted to keep it close to me. \n\nThe revolver has a standard six slot cylinder. When I checked it, I found that there were five rounds in it. This was unsurprising seeing as back in the day, cowboys wouldn't load them fully. From what I know due to my extensive \"research\", and by that I mean hours and hours of watching Westerns, that is because these early revolvers did not have any safety mechanisms and their hammers would always be resting with the striking pin right on the cartridge. \n\nThis meant that a small bump on the hammer would be sufficient to trigger an accidental shot. If one chamber is left empty though, it can be turned to be right in front of the hammer, avoiding the revolver firing on accident. Other than that, I found the adornments in its handle to be quite intriguing as well. While most of them seemed to only serve aesthetic purposes, I also discovered the letters *C* and *M* carved into the shiny, polished wood. \n\nI figured they must be its former owner's initials. The only person I know with their last name to start with an *M* is Dale, but of course I won't say his full name on here. This led me to believe that the revolver must have once belonged to one of his ancestors. I imagine it was handed down over the generations, but for it to be such a valuable heirloom, he sure was suspiciously eager to get rid of it. \n\nWhether he gave it to me as a means of protecting myself against \"upper management\" or with some other hidden intention is beyond me, but I guess I have enough time to find out. After all, Dale and I are now officially on the same side, even though I admit that that gets me thinking: If him and I are in the same boat, then who's in the other one?\n\nThe more I keep thinking about it, the more it confuses me. I believe I should really focus on the facts. \n\nThe first thing I did after getting up this morning was to gather the items Dale had advised me to keep on my person. Iron, laurel, silver, sage, salt and red verbena. Now, I'm not stupid. I am well aware that all of these items hold supernatural meaning. I myself barely have any clue about the occult, but the great thing about having a lot of friends and acquaintances is that there's always this one person who's got just the thing you need. \n\nIn my case, this person's name is Clara. Clara and I met in high school. We used to be pretty close back then and I helped her study from time to time, an act of cordiality she apparently never forgot. When I called her this morning to ask if she could hook me up with some things I needed, she was more than happy to help. Clara has practiced paganism for a long time now, and if there's *one* person who I know will take me serious when showing up on their doorstep asking for sage and red fucking verbena, it's her.\n\nLong story short, I drove over to her place, we had breakfast together and enjoyed some small talk before cutting to the chase. She disappeared into her bedroom for a few minutes before returning with a satchel, a weird looking bundle and a small jewelry box. She placed the three items on the table in front of us and sat down next to me.\n\n\"Okay, first things first,\" she began, picking up the small bundle and holding it out to me. \"This is sage. It's mostly used for cleansing rituals, basically the go-to thing if you want to rid a place of negative energy.\"\n\n\"And how do I do that? Do I just... leave it there or...?\"\n\nClara chuckled and shook her head. \"You burn it, silly. Next up,\" she held up the satchel, \"red verbena. Freshly picked from the pots on my balcony. It offers protection from the evil eye.\"\n\n*Whatever that is*, I added in my mind. \"What's in the jewelry box?\" I inquired.\n\nClara smiled mysteriously. \"I'm glad you asked. See, when you mentioned the silver and iron thing, it reminded me of a certain accessoire I've had lying around here for ages.\" She picked up the box and opened it to produce a shiny, ornate necklace with a heart-shaped locket attached to it. \"Now, the chain itself is iron, but the locket is silver. Great for protection, but sadly not my style, which is why I've decided that you may have it. You seem to need it more than I do after all.\"\n\n\"For real?\" I asked, taking the necklace and carefully opening and closing its locket. \n\n\"Yup! But the best is yet to come.\" My friend opened the satchel and took out a couple of bright red blossoms which she stuffed into the silver locket. She motioned for me to turn around and went about fixing the piece of jewelry around my neck. \"This way, you'll have some silver, iron *and* red verbena with you wherever you go!\"\n\nI smiled at her. \"Thank you so much... I don't know what to say.\"\n\n\"Then shut up!\" she replied and we started giggling and high-fived. We had made this joke all the time back in our school days.\n\n\"About the salt, you can simply use your own. You know, plain salt you use for cooking, it'll do. I don't have any bay laurel around, but I know that when burned, it's good for cleansing and purification rituals. Also, it's known to be useful for breaking curses and hexes,\" she explained. \n\nI thanked her once again and got ready to leave, but she held me back. \"One more thing. So, if I got it right, you don't know what you're dealing with here, but you *do* know the means of protecting yourself from it. Of course, I'm not in your place and you should always proceed with an open mind, but you should probably know that... iron and red verbena are specifically linked to the fae. They repel faeriefolk.\"\n\nClara gave me a moment to process her words before continuing. \"Most say that they dislike iron because it's a material forged by humans while faeries themselves are creatures of nature, but I've also heard of another belief claiming that the faeries once made a deal with the iron and didn't hold up their end of the bargain, so the iron is still angry with them. Who knows. My point is that what you're describing sounds an awful lot like them.\"\n\n\"Alright... do faeries not understand games and half-truths by any chance?\"\n\nClara frowned. \"No. Actually, they're known to be tricksters. You've got to be crazy careful when talking to them since they tend to play around with exact wording and stuff to screw you over. It's very important not to offend them. They're spiteful little...\" she lowered her voice, \"*bastards*. You never know when they might be listening.\"\n\n\"Now you're just trying to scare me.\" \n\nClara winked and opened the door for me, seeing me out. \"You should come back sometime to chat some more,\" she called after me cheerfully and I gave an affirmative thumbs-up as I ventured down the stairs in her apartment building's hallway. \n\nMy next stop was once again my neighbor's place. The elderly lady opened the door for me with a knowing smile. \"Well, if it isn't Leah. Need some more laurel?\" she offered with a grin.\n\n\"Yes, actually I've been thinking... could I buy one of your potted bays maybe?\" I inquired, fumbling for my wallet.\n\nThe lady was a bit taken aback, but willingly went for her living room and came back with a small laurel tree in a pot. She had some trouble dragging it to the doorstep, so I quickly took it from her, lifting it up with ease. I gave her thirty bucks for it. She had only asked for ten, but I told her I had to make up for all the inconveniences my pestering for twigs had caused her these last few days.\n\nLater, I covered up every mirror in my house either by removing them and turning them around or by cloaking them with bedsheets and the like. My reasoning behind this is that whatever came over me in that restroom happened after I was staring at my reflection for too long, so I should probably avoid seeing it for a little while. Normally, I'd think that what happens in the park stays there, but after the incident with Dale yesterday, who says that upper management isn't able to influence me at any given time and place?\n\nI went to work today wearing the verbena locket, my backpack filled with iron nails, bay laurel and cooking salt I had refilled into a small jar. There was one more thing I did though before getting on my way: I called Anne.\n\nShe greeted me as cheerfully as ever, as if the creepy bathroom incident had never taken place. \"Hi! How are you doing? Still violent?\"\n\nI grinned. \"No, no, I'm fine. Hey, is there any chance I could see the Mime today?\"\n\n\"Ah, sorry, but I'm not in today. I'm at my mom's, it's her birthday... but I'd gladly get you to him tomorrow!\"\n\nI told her that would probably do and thanked her, figuring I'd focus on the Aged Diva and the Pianist for the time being. I was less than willing to face the Mime by myself, but the pretenders from the Hollywood section aren't nearly as threatening in my opinion.\n\nI got to the park at around eleven. After minding the sock puppet, I went back for Hollywood. I had never really noticed how creepy it looked with nobody on the streets. The only sound that broke the silence was the quiet melody of the piano, which grew louder and louder the closer I got to the restaurant the Pianist resides in. Looking in through the building's glass front however, I stopped in my tracks. I could not only see the man in the white tuxedo sitting on his stool as usual, there was also another pretender present. The Aged Diva. \n\nI had never seen the two of them so close to one another before. The woman was elegantly leaning against the piano, cigarette in hand, watching her companion play. To my surprise, he wasn't completely ignoring her either, in fact, he would glance up at her with a smile from time to time. I squinted. This was very unusual. They looked so natural together, almost like they were two normal people interacting. But even more interestingly, they looked like they *knew* each other.\n\nIf I'm correct in my assumption that all the not-actors used to be human at some point, then these two must have had a shared past. This got me thinking. If the Pianist knew the Diva and the Diva knew the Laughing Cowboy, would that mean that all of the pretenders' lives used to be connected in some way?\n\nI decided to think about it later. For now, it would be best to take this opportunity and talk to them. If you can call that talking, that is. \n\nI pushed open the door and stepped inside, causing the elderly lady to whirl around. The Pianist however didn't even look up at me.\n\n\"Um... hello,\" I greeted them awkwardly. \"Sir... and ma'am.\"\n\nThe Diva caught herself pretty quickly and straightened up. \"Why hello, darling! So nice of you to come by and visit us,\" she said in her usual, exaggerated manner. \n\n\"Us?\" I inquired. Her usage of this word had immediately struck me as off. *Us*.\n\nShe tilted her head, ignoring my question. \"Won't you sit with me?\" she offered, pointing at a table nearby. \n\n\"Gladly,\" I replied, sliding onto the bench and waiting for her to sit down across from me. Opening my backpack, I took out the iron nail and held it out for her. I'm not sure what I was expecting, but she simply took it out of my hand and inspected it for a while before giving it back to me. She didn't say a word, just kept smiling. I cleared my throat. \"Anything weird about that nail?\" I offered. \n\nThe Diva looked at me like I was stupid. \"Why, is there?\" she asked. \n\nI shook my head. \"Uh... no.\" Seeing as I already knew how she reacted to the bay leaves, I handed her the silver earrings. She seemed to like them a lot better, holding them up against the early noon sunlight streaming in through the window. \n\n\"Why, aren't they lovely! You sure have a good taste in fashion, dearie,\" she praised me before dropping them into my hollow hand again.\n\n*Well, that was underwhelming,* I thought, but decided to simply move on to the Pianist. He didn't react to any of the items except for the laurel twig. When I held it out to him, he promptly turned in his seat. He kept playing the piano eagerly, but leaned away as far from the bay leaves as he could. It was sort of entertaining and I couldn't help but play around with this effect a little, sticking the twig out to him from either side just to see how far he could lean over without ceasing to play.\n\nI finally decided that enough was enough and put the laurel twig away. I wasn't ready to leave though. It was weird how *aware* the two had seemed of one another when they had been by themselves. So I asked, \"Not to be intrusive, but are you two together or something?\"\n\nThe Pianist didn't react, but the Aged Diva instantly looked up. She opened her mouth as if to say something, but the only thing that escaped her lips was a dry, throaty choking noise. \n\n\"We...\" she cawed, before suddenly throwing her head back and gagging. \"We...\" she pressed out, \"dear... ie...\"\n\nI took a step back. I hadn't seen her like this before. \"What's... happening to you?\" I stammered, unsure of what to do. Normally, her face would melt off, *that* I was used to. But this?\n\nI was almost relieved when I saw her wrinkled skin slowly flow downwards, her scalp following soon after. Then a loud *pop*, and she was gone. I stared in shock at the glittering spot where she had just been standing. It was like she had been trying to tell me something this time. I shuddered and backed out of the restaurant, for some reason not daring to take my eyes off the Pianist. For a split second, I thought I could see something glinting in the corner of his eye.\n\nI made my way over to Dale's office. I wasn't sure if he was in already, but to my surprise, I found him leaning against its door from outside, sipping from a bottle of what looked to be ice tea. \n\n\"There you are,\" he greeted me, cracking me a half-hearted smile. \"Took you long enough.\"\n\n\"It's good to see you too, Dale.\"\n\n\"Right. Hey, now that we're best friends and all that shit, there's one more thing I wanna show you,\" he explained. \"Um... before you give me back my gun,\" he quickly added.\n\nI nodded and he came a bit closer to me. He sat down his water bottle and pulled up his left sleeve. There was another carving in his lower arm. This one wasn't as deep as the *My name is Dale* ones though. It looked to be pretty fresh, there was even a bit of blood dripping from one of the cuts. \n\n*3/8.*\n\n\"Three out of -\" I was just about to say it out loud, but before I knew it, Dale was pressing his hand onto my mouth.\n\n\"Ssh!\" he hissed. \"Will you shut your ass up? Fucking hell.\"\n\n\"Sorry,\" I mumbled into his palm. He rolled his eyes and slowly removed it from my lips. \"But what does it mean?\" I asked under my breath. \n\nDale motioned for me to stay quiet. \"Can't tell. All I want you to know is that you need to keep your mind, like, *wide* open. Don't generalize, stick to what you know. And be careful. I can't believe I'm saying this but...\" he paused to let go of a soft sigh. He looked genuinely worried. \"I'd hate for you to get hurt.\"\n\nSuddenly, he began to fumble in his pocket only to produce his keys. His eyes had become glazed and empty and I watched in shock as he proceeded to lift the sharp object and slam it down onto his left palm with such force that it pierced the flesh. He regained conciousness soon after, told me to leave him alone and that he would take care of it.\n\nAfter this rather bizarre conversation, I gave him back his gun and went for the last thing on my to-do list for the day.\n\nI found Nathan slumped over in his coachseat, fast asleep. The horses were calmly standing in the shade of the entrance to the wooden rollercoaster in Twin Vale Point. I swung myself onto the seat next to him and quietly said his name in an attempt to wake him up, but was unable to receive any reaction apart from the occasional snore. \n\nHe looked peaceful and I didn't really want to startle him, so I merely took the stork plushie out of my backpack and placed it in his lap, right next to where his hands were resting. To my surprise, his fingers almost immediately curled around it. I couldn't help but smile at the sight.\n\nr/CrypticPark\n\n[Part 17: iron](https://www.reddit.com/r/nosleep/comments/fwsv71/working_at_an_amusement_park_the_thing_about_iron/?utm_medium=android_app&utm_source=share)", "comments": [{"id": "fmmm2pp", "author": "NoSleepAutoBot", "body": "It looks like there may be more to this story. Click [here](https://www.reddit.com/message/compose/?to=UpdateMeBot&subject=Subscribe&message=SubscribeMe%21%20%2Fr%2Fnosleep%20%2Fu%2Fgirl_from_the_crypt) to get a reminder to check back later. Got issues? Click [here](https://www.reddit.com/r/nosleep/wiki/nosleepautobot)."}, {"id": "fmmnf9e", "author": "Vessera", "body": "Ah, things are getting VERY interesting. I'm out of theories for now, more or less.\n\nIf the gun was the Cowboy's, then maybe try calling him by names that start with C. Charles? Caleb? Christopher? Cameron? Cody? Connor? Cole? He seems like a Caleb or Cody, to me. Or a Clayton. They're very \"western\" sounding names.\n\nAnd 3/8... Hmm...\n\nMaybe the older pretenders are all related to each other. Or maybe only some of them are, but those turned are considered family in some fashion? At least by being in a relationship with a family member, perhaps.\nEdit: If you consider the stagecoach & Nathan one entity, then there are 8 pretenders. Maybe only 3 are blood relatives? Or 3 aren't...\n\nI do wonder what the Diva wanted to say... It looks like some of the pretenders are more silenced than others. Poor nurse.\n\nAnyway, intriguing update!"}, {"id": "fmmmqhd", "author": "wholovesoreos", "body": "3/8... does that stand for Nathan, Leah and Dale? They all seem to be showing symptoms of being pretenders."}, {"id": "fmmnrgl", "author": "AllHarlowsEve", "body": "I'm really wondering a lot about the not-actors’ connections now. The mime and Mr Scratch aside, because I don't have a super firm grip on them, and of course the stage coach aside, I have some thoughts.\n\nThe SPF reacted to the cowboy both as I'd expect a fae creature to, but also like a sassy younger sister.\n\nThe Diva thinks of our sweet babbu Cowboy as an ugly, misshapen brat.\n\nNow this with the Pianist and the Diva, it seems like they fit together as a long-established couple.\n\nThe Cowboy and the Nurse are the only ones that are visibly injured in any significant way.\n\nA lot of us have thought that the man in the faceless picture is ~~slenderman~~ Cowboy, but the female could be either the nurse or the SPF.\n\nThe mime could have been someone that performed with the SPF? I really don't have a firm enough grip on it.\n\n\nIts also possible I'm drawing too many lines and they were all just former employees.\n\nIt's also possible the cowboy was a stagecoach driver in a past life and when he started turning, nobody could physically restrain him and he got shot to stop him, but it only let the ... something, magic, maybe? take over.\n\nI still wanna know if the cowboy has a tongue or if it's more magic stuff that stops him from talking.\n\nAnd, as always, stay safe, Leah.\n\nEDIT: Forgot one of my points. I feel like the Diva is sort of narcissism concentrate, so it might be projecting, but the cowboy being her son and scapegoat due to his birth defect but the SPF being her perfect baby could be a possibility.\n\nAlso possible that the cowboy's her stepson and that's why she has so much hatred towards him."}, {"id": "fmmnjd6", "author": "wholovesoreos", "body": "Dale's hurting himself whenever he gives you hints, unless it's not Dale. It's the Park. His eyes always seem to glaze over when he's not in control of himself, and judging by his nonchalant reaction, this is a common occurrence for him."}, {"id": "fmmpory", "author": "QuickBeamKoshki", "body": "I really hope Nathan isnt going to the next level of pretender....i adore him but he might have just stepped over into non-verbal territory. That necklace is definitely handy! I think dale might be right...keep your mind open....\n\nmake sure not to shake hands or make deals with ANY of the pretenders Leah. If this is the fey ANYTHING you say can and will be used against you. And if Nathan ever starts talking funny...find another source. \n\nFey cannot tell lies but...they dont always tell the truth so *be careful* they will say whatever it takes to manipulate you. A truth can count if it was once true or will be true. Remain in the present....stay safe"}, {"id": "fmmn1zr", "author": "wholovesoreos", "body": "CM... We just found out the Cowboy's initials! That means he *could* actually be related to Dale! If the Diva hates the Cowboy, maybe the Cowboy was the previous owner of the park!"}, {"id": "fmmqnxc", "author": "helen790", "body": "I thought this might be the Fae. Deals involving land ownership and bloodlines, making people forget who they are, nonsensical Halloween rituals, these all suggest Fae involvement.  \n\nIn which case I also suggest wearing clothing inside out while in the park, doesn’t have to be your whole outfit just your socks or something.\n\nThe Fae are notoriously manipulative. They’ll trick you without ever telling a lie, just avoiding certain truths and painting things in a flattering light. They’re like lawyers but with magic, watch what you say VERY carefully.\n\nThis makes me wonder if the locked door in the bathroom is possibly a portal to their realm. Some believe the Fae live under hills in tunnels and such, others say they have their own entire dimension. Either way that door might be the entrance.\n\nI’m also starting to suspect that maybe the cowboy might be somehow related to Dale’s family. The founding of this place seems to be tied with the wild west era and the way the Diva reacts to him, almost like she blames him for something. He also seems more aware of what’s going on than the other pretenders."}, {"id": "fmmmvhh", "author": "wholovesoreos", "body": "The Pianist and The Diva are together! I think she exploded because the Pianist may have been behind her coming here. Maybe he was the one that converted her."}, {"id": "fmmnn44", "author": "ScentedSweetsPizzer", "body": "Awwww Nathan’s reaction to getting his plushie back was so sweet-\n\nPoor Dale though, these “Upper management” folk are gonna kill him at this rate \n\nGlad to hear you have a fellow pagan for a friend too, she sounds like a great help!"}, {"id": "fmmpclv", "author": "megadanman5", "body": "I think the diva is cursed so that when she tries to speak up about being a pretender, the curse prevents her from doing so by exploding the diva."}, {"id": "fmmp35w", "author": "TheHoneySacrifice", "body": "I can think of three possibilities for 3/8:\n\n3/8 could be the number of people currently undergoing the process to become pretenders: Nathan, Leah and someone else. This would be interesting since Dale only triggered Nathan.\n\nOr it could be the number of pretenders who have completely turned and won't be able to help at all: Mr Scratch, Mime and Fairy.\n\nOr it could be the number of actors who have already reached the point of no return in the process: Nathan, maybe Mitchell and one more person (not Leah since Dale said she hasn't reached that point yet)."}, {"id": "fmmotky", "author": "ovenroastedtofu", "body": "I’m now betting that 3/8 pretenders are pretending to be pretenders (lol)."}, {"id": "fmmoxjo", "author": "TheWalkingBread3228", "body": "I think you should try and get Nathan some sort of smartphone , he’d have something to be entertained and could even text with Dale or you"}, {"id": "fmmxww0", "author": "tabsmcgab", "body": "Leah, one of the main tricks fae like to play on people is by giving gifts or receiving gifts. If you accept a gift from a fae, you’re now indebted to them. Never give your name to a fae as well, they’ll take it and by taking your name, they take you. I’ve seen theories that middle names were for when fae asked your name, you could give them that one. \n\nYour friend is right by calling them tricky bastards."}, {"id": "fmmofu0", "author": "cantgetenoughofthis1", "body": "Awe I love Nathan! I'm so glad he got his stuffie back."}, {"id": "fmmpcz0", "author": "jannysunshine", "body": "Im starting to feel bad for Dale! It seems like his self harming isn't all \"self\" harm! Also maybe the gun is part of your permanent costume. I wouldn't keep it on you until you know more! Keep us posted and please stay safe."}, {"id": "fmmpenw", "author": "Cute_Harpy", "body": "Hmm... So fairies might be involved, but they're probably not the pretenders, unless the cowboy removed your iron because he didn't like it and not because it caused you to pass out.\n\nYou gotta chat more with your friend. She probably know a looot of info that you'll need to know at some point or another. Also do show her the number on a calculator or on a piece of paper and ask her if it has extra meaning. You already wrote it out on this post so you could be in danger, but maybe it's dangerous only if you say it out loud.\n\nDo test the other items on the pretenders and see I burning Laurel does something. I also don't recommend testing on the sock puppet because if he gets mad, losing a leg or two would really make your investigation harder.\n\nRemember to stay safe and use coded language when talking to someone about important info - upper management sounds really dangerous. Probably will get really mad if he hears what you're talking about.\n\nAlso, as you're becoming a pretender, I'd recommend you always test yourself with laurel and whatnot to see how far your transformation is going. See if you start disliking any of the other items. Maybe not all pretenders are made pretenders by the same means, so you could have a dislike for some of the \"protection items\" that other pretenders don't, as you didn't drink anything weird, at least you don't remember doing it.\n\nIf you are really becoming a pretender, try to see if there was something that you did or that happened that could have been the \"weird soda\" but in a different shape. It probably wasn't you entering the bathroom since Nathan's symptoms started showing a bit later.\n\nAnyways, do lots of research and stay safe. I couldn't come up with a pun for this comment."}, {"id": "fmms4vx", "author": "grodemonster", "body": "Maybe this has already been done, but have you brought mr. Scratch to interact with any other pretenders? \nHe loves you so much, acts like he’s your dog. He may act similarly if he knew one or more of the pretenders. If he’s more vicious... maybe that would be more information on who turned who...?"}, {"id": "fmn18ej", "author": "LikeaPandaButUgly", "body": "Oh snap. I thought Nathan didn’t need to sleep anymore. I hope this is a good sign."}, {"id": "fmmlxmp", "author": "DannkyG", "body": "I'm always watching Leah... but in a good way of course, we have your back!\n\n&#x200B;\n\nAlso, being a minute late made my heart sink..."}, {"id": "fmmqtf1", "author": "gobibextraordinaire", "body": "On a lighter note, that thing with Nathan and the stuffed toy seemed so darn cute. Maybe there's still a chance of saving him since he still instinctively reacts to items from before Dale did him dirty (he was made to but still)"}, {"id": "fmmtmt7", "author": "SincerelySinning", "body": "I'm guessing for the process to happen you have to be somewhat close?\nDale and Nathan dating.\nThe Pianist and The Diva possibly dating?\nThen with Leah she's become closer/friendlier with Dale and The Laughing Cowboy. Maybe because Mr. Scratch isn't quite human enough to influence properly???"}, {"id": "fmmr3cs", "author": "count-the-days", "body": "3/8? Maybe it means 3/8 of the pretenders are coming back or like relatively human? I mean, the cowboy is obviously conscious of his actions, the nurse did the thing with the key and the diva seems to be becoming more human the more you talk to her. Also, how is the fairy doing? As your friend said, the iron and red flower is for faery folk, maybe she has something to do with that as she is one. Just my thoughts!"}, {"id": "fmn3t6s", "author": "UnstoppableChicken", "body": "Dale is fucked. Keep that necklace on, and good job covering the mirrors. Maybe start cleansing the park srctins with the sage one by one and see if there's any reaction or changes. Maybe make a giant salt circle around one and see if that does anything. Just be careful, Fae are little bastards. I'd also suggest getting some obsidian, it's a defensive stone and it couldn't hurt."}, {"id": "fmmxl76", "author": "EmiApricot", "body": "My first thought was that the 3 out of 8 refers to the pretenders that you have formed relationships with/become close to: Mr Scratch, the Cowboy, & now Nathan... \n\nOther comments along the way have mentioned the fact that your coworkers don’t really seem to have attachments to their pretenders the way that you do, & you have been forming closer bonds throughout this investigation. Maybe “letting them in” in this way alters the balance/ energy that keeps the park safe & “paid for”. \n\nWhether that’s what it refers to or not, I wonder what would happen if 8 out of 8 were to be reached??"}, {"id": "fmmneqm", "author": "kalyj", "body": "I think the 3/8 has something to do with the pretenders. There are 8 of them in the park, maybe 3 of them are important in some way?"}, {"id": "fmmvg4b", "author": "azur_owl", "body": "Hmm...I tried googling “Three of Eight” to see if there were any mythological or folktale connections, but no such luck it seems. Rats.\n\nBe careful and keep those safety items close. ~~Too bad *Changeling: The Lost* is just a game, sounds like you could use some of their contracts right about now~~"}, {"id": "fmmqlcd", "author": "madisontwilson", "body": "I think 3/8 could be people who are possibly against Leah? Mitchell, Caroline, & ? 🤔"}, {"id": "fmmzf8h", "author": "-_-blahblah_-_", "body": "3/8- people that are past some no point of return kind of thing? \nWhy didnt you try to burn the sage or laurel? \nMind how you burn the sage, its sacred for some people. \n\nFae, i never heard the about a bargain with iron, interesting. Tho I wonder how the park land is tied to them.."}, {"id": "fmn7092", "author": "puffpuffpazuzu", "body": "Leah did you ever get that new trailer set up for the Sugar Plum Fairy? Might be worth going through the old one if so, since Dale said consider *everything* and to not generalize, maybe there’s something different about her?\n\nAlso- 3/8... I have a feeling this isn’t about the not-actors, but instead about their handlers.... Nathan, maybe you, and...one other...Mitchell?"}, {"id": "fmmm9zq", "author": "WolfshyYT_", "body": "When you gave Nathan his storkie it was really cute and I love what your doing just be safe!!!"}, {"id": "fmmtoyi", "author": "Titan_Mask", "body": "Dale and \"upper management\" feels like G-man and his employers from half life. He is usually present but revelled in mystery along with \"Upper management.\" Though clearly Dale is not the bad guy."}, {"id": "fmmz4sq", "author": "agentperry007", "body": "Nathan protection squad 2k20! Ppl are saying 3/8 means 3 actors are turning, but what if it's also a headcount for management as to who's helping? Nathan, Cowboy, and Nurse have been helping Leah (though Nurse isn't helping as much) so management's keeping tabs on them. Or, on the grimmer side of things, it could be a countdown as to when Dale starts to lose himself completely."}, {"id": "fmn19p6", "author": "TheStellarQueen", "body": "Aw man I waited the entire story for the cowboy's reaction to the gun. I kinda want a locket like that now that seems neat."}, {"id": "fmmuv3v", "author": "shawk1735", "body": "Three out of the eight pretenders were turned maybe?"}, {"id": "fmmwhzj", "author": "stormthor", "body": "I know a pretty bunch about rituals, protection and cleansing.\n\nCheck out umbanda later if you can, Miss Bard from College of Lore!"}, {"id": "fmmxnzy", "author": "Mydogisadoglol", "body": "What if the cowboy was the previous owner of the park and turned the aged diva into a pretender like Dale and Nathan. That would explain why she hates the cowboy so much."}, {"id": "fmn343r", "author": "ThothTooth", "body": "This might be a bit of a stretch on my part, but Leah, does the park happen to have a large population of ravens, crows, bats, or anything of the sort? Or have you been noticing more of them around your home recently? I've got a bit of a theory about upper management."}, {"id": "fmnd06f", "author": "SeekAnswers", "body": "Out of curiosity, would you by chance be adopted?\nIf so then I wonder if you might be related to Dale and family. Could explain the mirror and your body's reaction in the restroom."}, {"id": "fmndw7p", "author": "kcupsmama", "body": "My theory is that Dale is more involved with upper management than you think, and when his eyes glaze over, that’s the real Dale like waking up. \n\n\nWhy would he be writing things to help him remember who he is (writing his name) along with a number that could potentially help you (3/8), if upper management doesn’t want you to learn the truth? It doesn’t seem like upper management can function the park without him, so why would they possess him to harm himself? I would be very cautious with Dale. If getting close with the people in the park is what leads to a successful transformation from actor to pretender, then it could make sense that upper management would want to influence “Dale” to get close to you. \n\n\nI’m so torn on whether or not we can trust our friend, the cowboy. A part of me says he’s more involved with upper management than we think. If it’s true that you need to be emotionally involved (and yes Leah, you are emotionally involved!) with someone involved at the park to transform, then why would he try so hard to charm you if he truly cared about you? If anything, you’d think he’d try to make you hate him. \n\n\nAlso, I’m torn on why the cowboy would remove the protective items from your backpack when he retrieved you from the bathroom. I was thinking that maybe he couldn’t physically carry the bag out with them inside? But if he was able to remove them, he must have been able to touch them. \n\n\nI also had a theory that maybe the laurel has an opposite effect than what we’ve originally thought. Maybe the laurel is what actually makes them transform. You’re the only one who’s rly been running around with it, right? Maybe the coke that Dale gave Nathan was spiked with laurel? If “Dale” is trying to trick you into becoming a pretender, it seems like telling you to stock up on it would be beneficial to the needs of the park. Plus it lulls you into a false sense of security. \n\n\nI do also think that “Dale” was trying to imply that the cowboy is the one that’s watching you in the park and keeping him informed on everything. If Dale was being controlled by upper management at that time, it doesn’t seem beneficial to them to try to drive a wedge between you and the cowboy if you need to feel connected to him to transform. Unless maybe they’ve realized that the cowboy has found a way to help you, so now they’re trying to get you to turn on him? \n\n\nGah. So many theories! \n\n\nI’m going to re-read from the beginning and see if anything sticks out. \n\n\nStay safe, Leah!"}, {"id": "fmnfx2v", "author": "kipobaker", "body": "Okay before Leah started reading the numbers as a fraction, I was seeing it as a date.. 3/8, March 8th. Did anyone else read it like that?"}, {"id": "fmn10r8", "author": "thehatefulmuse", "body": "OK, hear me out. Nathan, the Diva, and (my heart) The Cowboy. They've all been affected by Leah, changed somehow. Nathan seems more human. The Diva is trying to tell her something, kind of trying to break free of her bonds. The Cowboy (AKA the sweetest man alive) is just... Well, he's changed. He's helpful and sweet. Is it possible that the 3/8 is 3/8 pretenders that Leah has already started helping? \n\nOr maybe 3/8 people being turned into pretenders. Nathan, Dale, and Leah. Although Dale isn't an actor so the out of 8 bit doesn't really work.\n\nI'm just saying, it would make sense though for Dale to hint that she was helping the pretenders. Cause he can't directly tell her that she's on the right path, so he has to carve it in his arm so Upper Management doesn't see.\n\nAlso, allow me to say, the cowboy is the sweetest man alive. If he were human I would marry him, however he isn't, which is really sad. But, here are the reasons I love the cowboy.\n\n- has a sense of humor\n- helpful\n- caring\n- daring\n\n\nAnd much, much more. He is officially my son and I love him."}, {"id": "fmmrd9v", "author": "Starchu93", "body": "What if all the pretenders are actually Dales family, explaining why he had to change Nathan. I have no doubt that your change is due to getting close to what the park REALLY is or they could all be previous workers with Cowboy being the old owner. I love this series so much for all the theories!"}, {"id": "fmnfyma", "author": "JideryJuice", "body": "I couldn’t imagine you messing around with the Pianist without laughing my ass off :D"}, {"id": "fmnq1jx", "author": "Eddmakesart", "body": "Speaking of fair folk, I do feel like the transformation to pretenders is similar to the stories of children being kidnapped by them and replaced by changelings (to explain away autism, and disabilities, however were gonna ignore that). However I’m feeling less of “stealing them away” and more forcing them to change? Like a weird subversion of it. Instead of them being kidnapped, it’s more becoming the changling themselves, changing into a monster. Does that make sense? In a way they’re becoming fair folk of a kind, by an outside force, likely relating to nature like fair folk are. \nAs a side note: as someone who works with demons as a religion, I can assure you it’s not a demon. While they are treated evil, they only attack when provoked and when trapped. So don’t worry about any demonic entities being at play! They might even be helpful for protection, if you’re willing to offer something. Not your soul or anything, but they do like rings and food. No blood. They don’t actually enjoy blood! \nI do hope you can figure out how to help yourself and the others. I’m rooting for you!"}, {"id": "fmnx6h8", "author": "Petentro", "body": "So just a few small thoughts about dealing with the diva. \n1. I know the stuff can be a little expensive but she showed interest in the earrings so maybe you could ask her if she wants them. See if she can wear them \n2. This is a question and potential idea but idk if it's a good idea to try or not so use your best judgement. When she melts or explodes does everything she has on her person go with her? Specifically her cigarette holder? Does she ever have to put a cigarette in it or light it? I can't see her being allowed to smoke in the bar so she'd have to have a lighter or something. Have you ever seen her with a pack? Now here's my potentially bad idea..... Roll up a cigarette but put some of the sage and or bay leaves in it and see what happens. If you are apprehensive about that idea maybe have someone else who smokes smoke it in her presence instead?  Like I said might not be the best idea but it's what I've got"}, {"id": "fmn8bpt", "author": "TheOGBronzeJohnson", "body": "Whats messes up is C M is my initials and a revolver like that is something i would own"}, {"id": "fmn8dq8", "author": "FieldMarshalFry", "body": "love, I've said it before, you're gonna need a gun, even if ain't Dales fancy pants revolver, you need something large calibre (.44 mag is always a safe bet in handguns), shit like this has a habit of getting very fucked up very quickly and, well, you might need a way out if worst comes to worst...."}, {"id": "fmn9z8t", "author": "Allorrarbor", "body": "I’m glad Nathan got the stuffed animal. :))"}, {"id": "fmnf4w3", "author": "ggg730", "body": "I'm glad that you and Dale are getting along better now because you have a shared goal. But even he says so himself. BE CAREFUL. He wants to help but he is also obviously being controlled by a malevolent force. Also since you're kinda arming yourself for the inevitable high noon showdown (snicker) I suggest weaponizing some of these things. Silver bullets, shotgun shells full of rock salt, an iron knife. I don't know if you can afford it but supposedly meteoric iron is better for this kinda thing according to Tibetan beliefs. Maybe get a Vajra with meteoric iron incorporated in it. Might sound like overkill but nobody dies from being too prepared. Also make sure you use like sea salt or kosher salt instead of that normal table salt. I don't know if it affects it in any way spiritually I just think it tastes better."}, {"id": "fmnmqih", "author": "emonkid", "body": "Aight. I’m sorta back but I have no time to explain about it. Now time for some of the observations/speculations:\n\n1. Initials of the revolver make me really think that it’s the cowboy’s BUT DO NOT GIVE IT TO HIM YET. It could blow this op all over. Remember that they have very good surveillance around the park. \n\n2. Again, I suggest looking into the history of the place. There could be some gold mine of info out there. Especially with some reported missing people. \n\n3. It’s weird how I didn’t mention that I think that the diva and the pianist are somewhat “married/together” before in the past. Maybe it’s because I could have shrugged it off as some coincidence or something. Anyway, seems that they’re long gone into their transformation unless you try to find a significant part of their past or something. \n\n4. I appreciate the fact that you will interact with the mime in spite of your fear. Good luck on that one. In theory, the mime could communicate in their true form but I digress not to interact with its true form. \n\n5. About my findings about what could be behind this madness: I might have some leads on the “spells” that are present at the park but I am not sure if they have the same basis/origin. Well all of the info I got are based on the red verbena, silver, iron and the sage. Anyways, my info is still considered as unproven hypothetical speculation so I wouldn’t count on them for now. \n\n\nCiao again for now\n\n-TFHM"}, {"id": "fmmoafa", "author": "Jintess", "body": " *I gave him back his gun*\n\nWhat? Why???"}, {"id": "fmmuszk", "author": "NaivafAreul", "body": "3/8 converted into decimals is 0.375. \nIt could also be a recipe. Like 3 parts of ingredient(s) 1, and 8 parts ingredient(s) 2. I don't know its just speculation."}, {"id": "fmnc6iu", "author": "n1r0ak", "body": "All of the pretenders are former actors. All of them. It's a cycle and you need to run or burn the place to the ground."}, {"id": "fmnn1q5", "author": "freakinmausers", "body": "Please don't play with old guns. Especially if you don't know much about them. That's a good way to get seriously injured or dead."}, {"id": "fmnn5pp", "author": "MissCandid", "body": "I wonder if something like [this](https://youtu.be/3tfeYJxy3Wc) could work with the sock puppet? I'm curious what he'd have to say"}, {"id": "fmnqea1", "author": "Deusraix", "body": "I had a feeling you were dealing with the Fae. Be very careful. They're very dangerous creatures."}, {"id": "fmnro9d", "author": "wordsforfelix", "body": "implying something is wrong or imperfect concerning the park seems to lead to violence — for the diva, for dale, for leah.\n\nthere are a few theories that i’ve seen that i like:\n- the cowboy was the previous owner, dale’s brother or relative in some way, that gained the diva’s trust (like he’s gaining yours, perhaps?) and is the reason she became trapped.\n- the diva and the pianist are together\n- mitchell isn’t an actor\n- the cowboy is part of upper management.\nalso:\n3 out of 8 are fae.\nobservations:\n- dale couldn’t tell you about the origins of the stagecoach. sus.\n- the fae ‘made a deal with iron and didn’t hold up their end of the deal, so now iron is angry with them” seems a bit interesting, doesn’t it? it sounds a bit like dale’s relationship to the park, doesn’t it??\n- the fae can only tell the truth, right?? how does that play into the pretenders that can’t speak at all? are there some fae that are in the park against their will??\n- in fae lore, faes transform humans into fae in a few different ways — one of which being clothing.\n- there’s something suspicious going on with those magical items. those who’ve been in the park longer have more of an adverse reaction to it. there’s something fishy here, op."}, {"id": "fmntj7s", "author": "Misslieness", "body": "What if cowboy is part of upper management and wants you to join him and that's why you've been given the wild west revolver?\n\nJust a jumping off point."}, {"id": "fmnttr7", "author": "morrisonh0tel", "body": "I’ve been quiet up until this point, but I am SO invested in this recollection. I look forward to a new update each day!!! Absolutely love this"}, {"id": "fmo10eq", "author": "NotAnyOrdinaryPsycho", "body": "Does the sock puppet have a zipper or anything? I’m curious what would happen if you tried to take the “costume” off. As far as you’ve described him, it doesn’t seem like there is any opening on this sentient costume. But that would be a really interesting way to get yourself mauled."}, {"id": "fmo3vlh", "author": "DifficultGrapefruit2", "body": "For a moment I’d thought the Diva would say that her and the pianist are your parents or grandparents. \n\nFae like I said, I’m proud of my detective skills.\n\nStay safe, Leah. And avoid Caroline and maybe Anne for that matter..."}, {"id": "fmosust", "author": "Libertarian4lifebro", "body": "I don’t trust that OP isn’t behind all this and just acting the fool to show off her incredible amusement park"}, {"id": "fmmold9", "author": "Turdishmanner", "body": "Hmm maybe three out of the 8 means three could still be saved?"}, {"id": "fmo1o0c", "author": "HighNoon1200", "body": "Everyone seems sold on the fae yet I can’t find much info on how they connect. Still looking into but as of now the leading candidate for other worldly beings would be jinn. They fear iron, are used to make occult deals, used in possessions and often have to do with written formulae, like the incantations you heard dale muttering throughout the park in that notebook. Will update if I find other creatures have stronger connections."}, {"id": "fmo5fg7", "author": "aster-bunny", "body": "Do some more fae research. They go by some rather particular rules that could land you in hot water if you break them on accident. Never thank them, for example. They basically take it as a “Hey I owe you one” except you don’t get to choose what you owe or when you owe it to them. Also you should have your friend teach you how to energetically ward yourself and your apartment."}, {"id": "fmo9ybb", "author": "danetrain05", "body": "Fae steal names. When you meet, they say, \"Hello! I'm DaneTrain05. May I have your name?\"\n\nDO NOT GIVE YOUR NAME.\n\nSay, \"You may not have my name; but you may call me Leah\"\n\nWording is tricky. If you give your name, they will take it and you will become something that's not you.\n\nUsually Fae aren't evil or bad, so it's weird that they would be involved with turning people into these things but it could be a 'trick' they're playing on the family. Or they're doing the bidding for something else. Fae can sadly be enslaved."}, {"id": "fmoiwn5", "author": "Vivaliciouschic", "body": "The picture you found with the blurred faces-a man and a woman. Could these be the pianist and the Diva?"}, {"id": "fmomk9r", "author": "xraxstucks", "body": "I think it has something to do with cowboy he has 3 bullet wounds and you have 5 bullets in the gun so 3/8 and I think if you shoot the rest of the 5 bullets at the cowboy something will happen...just a brainfart don't fry me"}, {"id": "fmpec7w", "author": "_Eileen_the_crow_", "body": "3/8 may mean that Dale has had 3 instances where he felt compelled to hurt himself, and that there are only 8 tries left before.. something even worse happens?"}, {"id": "fmpi0q4", "author": "ChocolateWhirlwind", "body": "Hmmm...\nMaybe it's pointing out that three out of eight of the non-actors can't talk (the Nurse, the Mime, and the Cowboy)..? Maybe more are on their way to being silenced."}, {"id": "fmpnlok", "author": "whatthefrelll", "body": "My lukewarm take so far: most if not all of the pretenders have been people close to the family and I'm thinking that part of the initiation when accepting the new manager position is to turn someone you care deeply about.\n\nHey OP, I may need to re-read a few entries but how much does Dale interact with the pretenders? Does he ever seem particularly emotional towards any of them like he may have known them when they were people?"}, {"id": "fmpvaxc", "author": "SatanicFoxx", "body": "My takeaway from all of Dale’s hints (3/8, things not being scary when they should be, being watched, people fucking her over, etc) is that it’s likely 3/8 of the actors are either pretenders, or directly involved with Upper Management. We already know Nathan is being converted into a pretender. And I’m getting really strong vibes that Mitchell should not be trusted. So I’m wondering who good ole number 3 would be."}, {"id": "fmpy8r4", "author": "killurz", "body": "I think Dale can make 8 mistakes. He made 3. If it's 8/8 its over. The 3/8 is fresh so it happened after the conversation with him."}, {"id": "fmpzsno", "author": "linuen", "body": "So many theories all at once! I’ve just finished binging your stories, Leah, and now I’m obsessed! I love Scratch! He’s like a doggo. Very good boi.\n\nI don’t know why, but the Nurse always gets to me. There’s something about her braindead demeanor that breaks my heart. Is she struggling? Did her last episode took a lot for her? Was she trapped in perpetual mental torment?\n\nAbout the whole 3/8’s discussions. I do subscribe to the hypothesis that it could be 3 out of the 8 actors succumbing to the Park. I do believe one of the actors besides Leah is secretly becoming influenced by the Park. And the last one being Nathan. But I’m just rambling. I’m not very good with mysteries."}, {"id": "fmmwhjy", "author": "CosplaasFrisk", "body": "I knew it I knew it I knew it I knew it I knew it Ok  OP usually you don't respond that's okay but listen to this device I'm going to give you research different pantheons especially Egyptian or Greek or the Asgard specific symbols still holds power in the Mystic world even if nobody worships anymore they still hold power try to get an ankh I know it's cliche but those Dua for protection more importantly though research Loki not the Marvel Loki the original Loki I know there's a lot of different interpretations of him but everything's got a grain of Truth in it and he is known as the god of mischief and magic for a reason if not that try Heka would also be able to help with protection or RA the sun god again cliche but they were powerful for a reason or if all else fails Hecate if you can gain their favor and are willing to go the distance for it they can offer you great protection it ain't going to be easy though it's better than my niggaa dead"}, {"id": "fmn0g4d", "author": "Allencia", "body": "Could 3/8 possibly refer to music time? What if it's something to do with the pianist? I wish I knew more about music to say something more concrete tbh"}, {"id": "fmn28v5", "author": "hailstorm2121", "body": "Definitely keep the mirrors in your apartment turned around, maybe also burn some sage in each room to cleanse it? And do not take off that locket whatever you do. Dale’s hint must be very significant since he was obviously willing to suffer the gruesome consequences of helping you when he gave you that single piece of information."}, {"id": "fmndl5j", "author": "fizhingdude", "body": "guess that answers my question about whether the revolver was loaded or not"}, {"id": "fmnice0", "author": "KTfromKC", "body": "Clara said something about how faes screw you over and didn’t Dale say something about Leah not realizing someone was screwing her over in the last part of the story?? There has to be some kind of connection there if I’m right, right???"}, {"id": "fmnkm0v", "author": "hi_imstillhere", "body": "I had a theory that the pretenders were relatives of Dales that had released too much info about the park or something. I don’t think this theory is true because of Nathan turning into a pretender but maybe the Cowboy is a relative of Dale. Dale kinda seemed to react negatively when he asked Leah if she was close or cared about the Cowboy, so as much as I love him, I don’t completely trust the Cowboy just yet."}, {"id": "fmnnzta", "author": "Mylovekills", "body": ">you don't know what you're dealing with here, but you do know the means of protecting yourself from it.\n\nShe's right and wrong.  You really don't know what you're dealing with, which needs to be #1 priority.\n\nBut, while you have the ingredients, you have no idea how to use any of them.  Like, do you know *how* to burn sage, to cleanse a room?  You don't just light it, and \"poof, you're good\".     \nWhat are you supposed to do with the laurel?  Hell, maybe you're supposed to make a (nasty) tea, and serve it to the pretenders...      \nThe point is, unless you know *what* you're dealing with, you can't really know *how* to deal with it.  Until you figure out the *what*, the pieces you have are just a bunch of pieces, you need the picture to solve the puzzle.  Work on Dale more, but be careful!"}, {"id": "fmno765", "author": "LittleMissChriss", "body": "I don’t have any theories or anything, but yay, the return of The Mime soon :D"}, {"id": "fmnolf0", "author": "UnluckyWin8", "body": "I disagree with what seems to be the prevailing thought through the comments.  I don't think Leah is becoming a pretender, I think \"Upper management\" has selected her as the new manager. I also think Dale was forced to turn Nathan as a punishment to  for not continuing the family and the bloodline to continue the contract. 3/8 may also imply that 3 of the pretenders were never human to begin with.  The stagecoach as it's an object,  the mime and SPF. I have some more theories but I'll save those for later"}, {"id": "fmnv373", "author": "faloofay", "body": "As far as cleansing rituals go involving sage, those pretty much always have to be done by an actual practitioner of a faith that involves that specific ritual"}, {"id": "fmnxwnu", "author": "flmhdpsycho", "body": "As one person said, the gun could be the cowboy's or something. Or if it's a family heirloom, maybe you're distantly related to the family? You had the same reaction to your reflection that Dale said effects everyone in his family."}, {"id": "fmnznd8", "author": "MurderousLamb", "body": "There are both 8 pretenders in the park and 8 actors, so it's possible that it means 3 of the 8 actors will take 3 of the pretenders places, or just just them altogether?"}, {"id": "fmo0476", "author": "DoNotCare_CP", "body": "Important stuff to remember about fairies,fey,fae or other magical beings of the sort:\n\n1.Fey are dicks\n\n2. Faes are just devils but cuter\n\n3. Mushroom Circles are goddamn evil ok? Don't ever step on them or a grim fate awaits you.\n\n4. Using D&D as an example of number 2, Hags which make deals that always appear too good to be true but in the end only benefit the hag and makes you suffer,are fey.\n\n5. \"Tricksters\" can mean cold blooded murderers.\n\n6. Fey are dicks...wait I already said that didn't I?But it's always good to remember.\n\n7.Fey talk funny.\n\n8.Fairies have a good grasp on how to troll you with words,the devil is the details,pay attention to every sentence.\n\n9. Fey are prideful,as your friend said,don't insult them,pick your words carefully,everything you say will be used against you.\n\n10.Fey don't lie,remember that,again following your friend's advice might save you.\n\n11.Stay safe please,take this humble words of this fantasy geek and don't die to the fucking SPF ok?\n\n12.Trust NO ONE,changelings are a thing,besides disguises qualify as tricks."}, {"id": "fmo0dlj", "author": "patroclus54", "body": "Does Dale have any siblings? If he's the nicest out of a bunch Leah might be fucked."}, {"id": "fmo0kph", "author": "SmolBoi01", "body": "I literally have so much of my heart invested in Nathan because he just seems so gentle and kind and now he has A STORK PLUSHIE which is the cutest thing!\n\nI hope you manage to save him, Leah. And Dale too.\n\nAlso, I'm not really very good with theories, but what if the pretenders are able to act 'normally' when they're not being watched by actors or visitors? Like how Diva and Pianist were hitting it off while no one was around, but revert back to their creepy/useless selves when in the company of someone who isn't like them?\n\nMaybe Nathan is able to understand and talk to them a little better than a 'normal' person/actor? As long as he does it by himself?\n\nFinally, about the 3/8 deal. If I remember correctly (which I'm probably not TBH), the Cowboy, The Diva and the Nurse are the only pretenders who have been 'useful' investigation-wise (I'm not counting Nathan as a pretender), so 3 out of a possible 8 allies have been discovered by Upper Management, maybe?"}, {"id": "fmo0x3y", "author": "RedChlo11111", "body": "All I keep thinking is that the cowboy is bad and he is luring you in to change you..  I feel like maybe some of these things aren't there against their will. I don't know I can't wait to see this through gonna be sad when it ends."}, {"id": "fmo44yi", "author": "NeverWannaTalk", "body": "It really feels to me that 3/8 is the number of steps or processes that have been done to turn Leah into a pretender. I'd be very wary of anything strange you have a strong urge to do. I'm worried that in order for the ritual or whatever to succeed you have to be doing it yourself. Nathan was forced to sit in the carriage by poison, but he stayed there willingly, in a way, because of the alternative."}, {"id": "fmo7ss5", "author": "Tytticus", "body": "Ok, so it's been almost a week since you last spoke to the Cowboy and you haven't mentioned seeing him even though you've been to Twin Vale Point almost every day. He's definitely avoiding you for some reason."}, {"id": "fmoah5d", "author": "FedX", "body": "What if you can¿t trust the actor? At least not all of them. What if the actors are watching you?"}, {"id": "fmoetpv", "author": "Corporeal_form", "body": "Are there 8 pretenders ? Has Leah “converted” / dealt deeply with 3? It seems to me that would be the dog, the cowboy, and Nathan. She’s the dogs keeper, and the other two help her blatantly. Everyone else seems to still be more on the mysterious side."}, {"id": "fmofux6", "author": "harrohamtaro", "body": "I still think Dale is not to be trusted, considering that he had betrayed Nathan before and asked Leah if she had ever been screwed over. Now he’s creating a (false?) sense of camaraderie with her and calling them BFFs and everything."}, {"id": "fmovfav", "author": "harley-belle", "body": "I think it’s an exchange. When you return humanity back to Cowboy and Nathan, you absorb the darkness in them that it’s replacing."}, {"id": "fmq2hym", "author": "awesomecatlady", "body": "SHE'S WAKING THEM UP! \nThe 3/8 is how many Dale knew about. \nThe zombie nurse\nThe cowboy\nAnd Nathan\n\nAnd now The diva and the pianist?\nThe mime is next and he has ties to the sugar plum fairy\nSock puppet will be last."}, {"id": "fmn7agf", "author": "FreshBlueSweater", "body": "That's weird. Have you not been self-quarantining, Leah? You should really take care of yourself. I know you love seeing Mr. Scratch and the Cowboy but it would be really bad if you got infected. \n\nAlso, I find it weird that you find the Diva saying \"us\" so weird. I mean, if she can acknowledge people and other things, like the earrings and certain verbal comments directed at her, why would it be so strange that she can aknowledge being with another entity like the pianist? I think this should be expected..\n\nThen again, Dale mentioned keeping an open mind is essential sooooo.. Idk."}, {"id": "fmn01k6", "author": "twiliteshadow2", "body": "It was the donuts and you're done or about to become one... keep what you want at work in case you never get to leave again"}, {"id": "fmnqd98", "author": "IWantToEatAShirt", "body": "If the cowboy is Dale's ancestor than it's likely he's a lot older than Leah. I think it's time to stop."}, {"id": "fmmu5wr", "author": "yeklum", "body": "Very odd that your friend mentioned that Fae like to screw you over and Dale asked you if it was the first time you’ve been screwed over... She also said that they like to twist words and Dale told you you had to choose your words carefully during Twenty Questions..."}, {"id": "fmq1bdb", "author": "Phone_Guy2", "body": "I have been following your posts for awhile now but I tend to be quiet observer seldom sharing my thoughts. Let me take a moment and offer you a word of caution. The Supernatural is not how fiction portrays it.  Supernatural entities have to abide by laws. Not laws like keep off the grass or only pass in the left lane but rather the Laws of Physics. One such law is of belief or faith. Once someone believes in the Supernatural they open themselves up making them vulnerable to manipulation of Physical, Emotional, or Mental nature. Once you believe there is no turning back.  \n\n\nYou know that Dale's family formed a deal with something. That narrows the field on what you are looking for. Fae, Devils, and Demons. There are older entities that have made deals with mortals but they don't have a unified category. Knowing what you are dealing with doesn't mean it can be stopped either. People who have devoted their life to the study of such things rarely survive and attempt to disrupt them.    \n\n\nYou keep mentioning the Iron nails, but are you sure you have iron nails? Most modern nails are made of steel. When turning Iron into steel something happens. In some folklore the Iron has to be wrought. My understanding from these superstitions adding carbon or melting down the iron causes it to lose something. Wrought Iron is heated and worked but never melted down so its as close to the natural ore as you will get.  \n\n\nA word about your new necklace. Keep it touching your skin and out of sight. Don't tell anyone about it and keep note of anyone who notices the chain around you neck. It may offer some protection but I feel it will be more useful identifying those working against you. Not all of the actors are your friends. Some of them may be more involved than you can understand.   \n   \nI leave you with this small warning. I know you want to help Nathan and solve this mystery. I believe your hiring or discovering the position was not by accident. What ever it is, its scope and reach are much further than the park. You may have been chosen for some reason and Upper management it using this mystery and now Nathan to keep you coming back. So with that said I would tell you to run away and forget the park and everything you know but, its grip on your will prevent you from doing just that. Anyway stay safe."}, {"id": "fmq4j65", "author": "Lil_misspoundcake", "body": "Seems suspicious that Dale asked you what your name was. Makes me think everything he does is to ultimately deceive you to think that he’s not part of the fae or to even question it. The gunshot, the cuts and everything on his body could all be part of the deception. Maybe he really is the one pulling all the strings here."}, {"id": "fmq8lvf", "author": "Namastdoge", "body": "I dunno if someone else said this and I might be reading way to far into it but Oliver flys way to far under the radar for my liking."}]}