{"id": "fwhmda", "title": "When my daughter loses her temper, my next-door neighbor “accidentally” loses a limb", "url": "https://www.reddit.com/r/nosleep/comments/fwhmda/when_my_daughter_loses_her_temper_my_nextdoor/", "subreddit": "nosleep", "author": "hyperobscura", "text": "My next-door neighbor Klaus was what you would call a character. He was born without eyebrows, had a pet rock farm, and had a snake with his mother’s face tattooed on his neck. He was (h)armless enough though, a bit on the odd side, sure, but we’re all a bit eccentric when you think about it. I for one can’t go a day without rearranging my dresser. Doesn’t matter how tidy it is, or what system I’m using, or how neatly it is all folded; I simply have to tear into that sucker and do it all over again.\n\nKlaus’ family were german immigrants. Or was it dutch? Belgian? Moroccan? European at least, they’re all basically the same country over there anyway. They’d lived here since long before we ever moved in, but now there was only Klaus left. No wonder he’d lost it a little, I always thought. Being alone for so long, knowing your family is more or less extinct. He seemed rather flustered when he first met us, but I always figured he was just very self conscious, you know, because of the missing arm. Lost it in a tractor accident apparently. A very peculiar man indeed.\n\nThen there was my daughter.\n\nAmbrosia was five years old when I started noticing her *eccentricity*. She’d stubbed her toe on a chair - we’ve all been there - and I was taken aback by the ferocity of her anger. She’d cry, sure, but she’d also throw furniture around herself in a wild frenzy. Larry, my husband, her father, tried to calm her down, but his noodly spaghetti arms were never built for manual labor I’m afraid. In the end we resorted to locking her in her room, waiting out the proverbial storm.\n\nThe next day Larry was out trimming our rose bushes, his spindly stick-figure arms struggling under the weight of the gardening shears, when Klaus approached him, blood dripping from the bandages around his remaining hand. \n\n“What happened to your hand?” I imagine Larry asking.\n\n“Pet rock bit me,” I imagine Klaus answering.\n\nLarry wasn’t one for investigative questioning, so I suppose the conversation ended with him commenting on the weather. Klaus seemed pretty out of it though, Larry noticed. Even more so than usual. He kept asking about Ambrosia, how she was doing, how she was feeling, and it rubbed my Larry in all the wrong ways.  \n\nA few weeks later Ambrosia cut herself on a pair of scissors. Nothing serious or anything, just a little nick on her thumb, but it was enough to send her screaming into one of her explosive tantrums. Larry didn’t know what to do, big surprise, so I ended up having to physically constrain her by more or less sitting on her. I could see bluish serpentine veins protruding from her forehead as she clawed at the floor hysterically, and at that point I was mere seconds away from just calling a priest. \n\nThe ambulance arrived half an hour later. Ambrosia had calmed down at that point, and we all peered out from behind the curtains curiously as they carried Klaus away. I don’t know what was said, or what had happened exactly, but I noticed the paramedics exchanging worried glances. It was Larry who saw it. You can say a lot of things about my Larry, but he’s nothing if not very selectively perceptive.\n\n“Where’s his foot?” he asked rhetorically. It was rhetorical because there wasn’t a foot.\n\nKlaus came back a week later, limping around on crutches. His foot was still nowhere to be seen, Larry astutely observed, but Klaus seemed to be in good spirits considering the circumstances. In fact, he didn’t mention the missing limb at all. Just kept asking about Ambrosia, and how she was doing, and if she’d had a good week. I found the line of questioning quite absurd, bordering on outright creepy, but decided it’d be better to just let it go. He was probably still in shock or something.\n\nAmbrosia liked Klaus, but I don’t think Klaus liked her back. I chalked it up to him being who he was, an eccentric oddball, and the fact that he was unimaginably awkward. Maybe he hadn’t been around children that much? He never allowed her on his property, but at the same time he wasn’t being a dick about it. He’d just gently remind us to *keep our lithe offspring on our side of the fence*, as he’d put it.\n\nThe third time Ambrosia blew up was a bad one, for all the people involved. It was about a month after the foot-incident, and we’d all slowly started getting back to normal again, when she decided to investigate her father’s razor. Kids do that, you know. Monkey see, monkey do. Anyway, she cut her face up pretty bad, and there was a lot of blood everywhere. The bathroom looked like something out of a horror movie or something, and poor Larry ran around in panic like a headless chicken when we heard the screams. I managed to get her out of there by dragging her by her feet.\n\nBut that wasn’t the end of it.\n\nHer anger was relentless, and she swung the razor around in a crazed frenzy, cutting both me and Larry, in the arm and neck respectively, before I was able to subdue her, and take the razorblade away. Mere seconds after I’d calmed her down though, we heard the horrid, bloodcurdling shrieks coming from next door.\n\nYou know, up until that point I hadn’t been able to connect the dots. I mean, how could I? It’s not something you do. Not a conclusion you’d just automatically jump to. But seeing poor Klaus crawl out the front door like a disfigured caterpillar, his remaining arm no longer remaining, I don’t know, my mind just instantly went there.\n\n*Is this because of Ambrosia?*\n\nLarry called the paramedics in between slipping around in a mixture of ours and Ambrosia’s blood, his hysterical high-pitched voice causing some amount of confusion on the other end. Eventually I just had to grab the phone, give them our address, and run out to the hemorrhaging Klaus, wrapping whatever I could find around the stump of his arm to stop the blood flow. Miraculously enough he survived, but I still can’t remember how we pulled it off. All I remember is what he whispered to me in between those tormented sobs.\n\n“Please, keep her happy while I’m away.”\n\nIt’s such a strange thing to say, isn’t it? There he was, bleeding to death, and all he could focus on was Ambrosia? I spent quite a few sleepless nights pondering what he meant by it. Why did he care? Did he know? That it was Ambrosia who caused it? I wasn’t sure myself, of course, because it was such a ridiculous, outlandish thought. But you didn’t see her. Didn’t see her face when she went all berzerk. It wasn’t pretty. It was...demonic.\n\nI heeded his advice though, and kept a watchful eye on Ambrosia for the next couple of weeks, until Klaus was let out from the hospital. It was a strange sight to behold, a none-armed, one legged man hopping around, no one around to help him get into his locked house. I had to convince Larry to go help him out, and after a brief argument involving me pointing out several missing key characteristics of his personality, he humbly agreed.\n\nWhen he came back he had this look on his face. Disbelief, I suppose. He sauntered into the living room, gaze kept steadily at the floor, sighing deeply.\n\n“What’s going on, Larry?” I asked.\n\n“He wants us to move,” Larry said, shuffling around nervously. “Says it’s for our own safety.”\n\n“What?” I exclaimed, staring at him firmly. “Why? What the heck does he mean by that?”\n\n“Says our daughter is causing him distress,” he shrugged helplessly. “What do you think? Should we do it?”\n\nI wanted to scream *NO OF COURSE NOT LARRY, YOU STUPID HECKING CLOWN*, but deep down I knew there was something very sinister going on, and that *something* definitely involved our dear Ambrosia. Larry didn’t see it like I did, but then again he wasn’t the brightest closet in the shed, so I didn’t expect him to.\n\n“Yes,” I murmured. “I think maybe it’s for the best.”\n\nWe never planned on staying in that house forever anyway. It was a fixer-upper, and we’d fixed her up quite nicely, and maybe now was the time to move on. We’d get a good deal on it, perhaps even enough for us to move back into the city. Yes, all in all it was a blessing in disguise. A silver lining behind limbless clouds. \n\nThe next week or so we spent looking into realtors, and packing non-essentials. We didn’t know how long it would take, but we figured we should be prepared nonetheless. Worst case scenario we could move in with my sister for a few weeks, until we found ourselves a new home. \n\nKlaus kept to himself, periodically peeking out at us behind closed curtains. I felt so sorry for him, hopping around helplessly, all alone in that old house. *How does he brush his teeth*, I kept thinking. *How does he pour milk into his cereal*? I suppose I was too wrapped up in everything. Didn’t see it coming. Didn’t notice Ambrosia sneaking outside to play with the gardening shears (of which I specifically told Larry to put back in the toolshed).\n\nWhen I heard her shrieking I knew it was bad. I don’t know how she did it, but the doctors later told us she was lucky she didn’t sever a major artery. A long, deep gash from her thigh all the way down to her toes. Her pants were soaked in blood when I found her violently stabbing the rose bushes with the shears, screaming bloody murder. I grabbed her and disarmed her in one fell swoop, then ran back to the house yelling for Larry to call an ambulance.\n\nBut then I stopped.\n\nA harrowing thought entered my mind. Klaus. I had to check in on Klaus. If it was in any way possible that Ambrosia’s tantrums, inadvertently or otherwise, somehow led to his horrible “accidents”, I simply *had* to make sure he was OK.\n\nSo with Ambrosia under one arm, and the shears in the other, I turned on the dime and bolted to Klaus’ front door instead, leaving poor Larry behind stringing together incoherent sentences to the 911 operators. I guess the adrenaline got most of the job done, because when I more or less kicked open his door I didn’t even feel winded. I staggered into his messy, dark hallway, shouting his name in a high-pitched, desperate voice.\n\n“Klaus?! Klaus?!” I yelled, stomping further in with Ambrosia screaming under my arm.\n\n“Karen?” Klaus answered, his wide-eyed visage suddenly popping out from behind a corner. “Did you fucking bring the girl with you?!”\n\nI stared at the still shrieking Ambrosia writhing under my arm. “Uh, yes?” I muttered, slightly taken aback by his intensity.\n\n“Fucking shit, Karen!” he yelled furiously, spit flying everywhere. “You really shouldn’t have done that. Oh shit, oh fuck. This is bad, Karen. Really fucking bad. Get the fuck out of here! Now!”\n\nHe disappeared behind the corner again, but I could hear him descending steadily down some stairs, the ominous sounds of continuous one-legged hopping slowly fading the further down he went. I didn’t know what to do, so I did the only neighborly thing I could think of; I followed him down there. He was getting my help whether he wanted it or not. \n\nAmbrosia was practically foaming at the mouth at this point, and I was having a hard time holding on to her as I found myself stumbling down some crude wooden steps at the end of another hallway. A faint, flickering light from below, and the barely audible echo of Klaus hopping, were the only things guiding my rapid descent, and I still consider it something of a miracle that I even got down those stairs in one piece.\n\nA dark corridor met me once I reached the bottom, and I hustled onwards without thinking twice. Ambrosia had calmed down some, but as we rounded the corner leading up to Klaus, I made the grave mistake of bumping her head into the cold brick wall, causing her to erupt into one of her unpredictable frenzies once more. I caught a glimpse of Klaus sitting at the end of the corridor, his bloodshot, tear-filled eyes expressing nothing but utter fear and shock.\n\n“No!” he screamed at the top of his lungs. “Get her out of here! I can’t hold her back!”\n\n“What are you talking about?” I yelled back, desperately trying to muffle Ambrosia’s hysterical wails.\n\nI didn’t see her at first, but as Klaus scrambled to his foot clumsily, I noticed something behind him. A shape, I suppose. Or an amorphous mass of several shapes to be more precise. \n\n“She can’t fucking stand kids!” he screamed. “Get her out so I can put her back to sleep!”\n\nA face emerged from the formless mass behind him; a distorted and monstrous parody of female features, mouth agape in a horrible, sickening pose. I froze, paralyzed by the utter shock of what I was seeing, and I even think Ambrosia shut up for a brief second or two.\n\n“Whah,” I muttered. “What the heck is that?”\n\n“Get out!” Klaus yelled, still facing Ambrosia and me. “Get out before it’s too late!”\n\nI suppose it was too late, because moments later the corridor was filled with his tormented screams as the horrible face lunged forward, violently biting down on his remaining foot with ferocious force, immediately sending him face down on the floor.\n\n“No, mother! Please!” Klaus shrieked hysterically, blood squirting from the wound, painting the dull brick walls in a crimson red.\n\nBut she didn’t stop, not even for a second. Just kept chomping down on the poor, helpless Klaus. I wish I could tell you that I did something. Anything. But as the full shape of that repulsive horror slowly revealed herself, I stumbled back, Ambrosia in arm, edging into the wall on the opposite side. \n\nThe gruesome head was on one end of an impossibly long intestinal tract, the abhorrent, greyish serpentine figure ending in an enormous bulbous sack, more than likely functioning as a stomach. Grotesque blackish veins pulsated rhythmically on the beings hideous, leathery skin, and it was almost completely covered in deep fissures, like open, gangrenous wounds. Klaus kept screaming for minutes, until his head finally disappeared into the impossible depths of the gaping mouth, and I could hear a sickening crunch as she cracked him open, chunks of brain and bones and flesh dripping down on the floor. \n\n“What on earth is going on here?” Larry suddenly queried, his awkward appearance the last thing I’d expect to see down there. He adjusted his ridiculously overpriced spectacles and squinted down the corridor confusedly.\n\n“Hold Ambrosia!” I yelled, throwing him our darling little girl. Larry fumbled to catch her, and somehow managed to grab hold of her before she tumbled to the floor. I gripped onto the gardening shears with both hands, and ran down the corridor howling like a banshee. I must have taken the creature by surprise, because she didn’t even flinch as I brutally stabbed her through a revolting, bulging eye.\n\nThe whole of her utterly disgusting body fell to the floor like a limp sack of flour, spasming violently for minutes. And then...nothing. Nothing but silence, and the sound of poor Larry whimpering, and Ambrosia trying to comfort him.\n\n“I think,” Larry murmured in between pathetic sobs, “I think we have to move now.”\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nLarry was right of course. We couldn’t stay there after what had happened. But we also knew that the value of our house would drop drastically because of the rather unusual demise of our beloved neighbor, and the subsequent investigation into the bizarre existence of his serpentine maternal figure. \n\nSo that’s why we decided to cover the whole thing up.\n\nWe cleaned up the house as best we could, and buried the bodies in the backyard. It was the best course of action all things considered, and in the end everything worked out great for our little family. We sold the house above asking price, found ourselves a new home a few weeks later, and truth be told, we’ve never been happier.  \n\nOur new neighbor is an oddball though. I guess we attract those. Or maybe it’s the other way around? Regardless, Bertrand, our next-door neighbor, plays the violin. I guess that’s a job. Or rather, I should say he *played* the violin. There was a mishap you see. An accident. Just a few weeks after we moved in.\n\nCan’t play the violin with only one arm, I’m [afraid.](https://www.reddit.com/r/Obscuratio/)", "comments": [{"id": "fmobb28", "author": "peculi_dar", "body": "Wow, Karen, are you for real? Your kid keeps getting their hands on things like razors, garden sheers, etc., because you're obviously too busy checking out the foreign neighbor to notice. If you hate your husband so much, just divorce him ffs.\n\nGod. Karens are just the worst. Poor Ambrosia."}, {"id": "fmpnl5f", "author": "segasfuneral", "body": "\"he wasn’t the brightest closet in the shed\" i assume that you aren't either"}, {"id": "fmpksd3", "author": "Mesmerotic31", "body": "You've sure got a lot of esteem for your husband, Karen."}, {"id": "fmplxpt", "author": "VC_Stormer", "body": "did you ask the managers for help?\n\nis it becasue of the vaccines?\n\nsry Karen \n\ngood story"}, {"id": "fmpu0au", "author": "ColdHeartedDemon24", "body": "Karen you had one job to keep your daughter away,,,,, one job Karen,,,,, one job,,,,,"}, {"id": "fmq9bf4", "author": "berkyblaster", "body": "good story!"}, {"id": "fmqgmwg", "author": "maxsebasti", "body": "Typical Karen"}]}