{"id": "fwjlzg", "title": "There's a sex demon in my closet.", "url": "https://www.reddit.com/r/nosleep/comments/fwjlzg/theres_a_sex_demon_in_my_closet/", "subreddit": "nosleep", "author": "MackMoyerAuthor", "text": "  \n\nMy unholy seductress whispered my name at night, her dark soft voice billowing out over her soft pink tongue, her tongue that emerged from her sharpened teeth and rolled over her full red lips. \n\nI won’t get into when she first started appearing to me, except to say that she always came at night. It didn’t matter if I locked the closet door with a deadbolt or hung Crucifixes across the entryway. She came regardless. \n\nA sickly, dim red light glowed murderously through the cracks in the closet doorway and my bedroom grew pungent with brimstone. The deadbolt simply melted and the Christ figures on the Crucifixes began to laugh or weep before bursting into flames. \n\nThen the door opened and I tried not to look but I always did, peering over the top of my blanket to behold her sensual red-and-black form, gently writhing in the closet doorway. \n\nPreviously, I’d shout and plead and beg for her to leave me alone, but that never worked. These days, I could only try to force my head back under that blanket, trying to ignore the horrid and beautiful and profane poses she struck at the foot of my bed, giggling her dark giggle all the while. \n\nShe could have taken me, I suppose, but I don’t think she ever wanted that. Instead, she wanted me to *want her* to *want me,* and in my weakest moments, sometimes I feared that’s exactly what I wanted. \n\nI shut my eyes and pulled the blanket tight around my face but my desire for her was unmistakable. Show me a man—no, show me any *person* on this earth—who could resist fantasizing about her lithe, red naked form and I’ll show you a liar. \n\nHer long red prehensile tail rolled across the soles of my feet, as if daring me to look upon her. \n\nI shut my eyes tighter and gnawed on my bottom lip and the moment I began to doze, I felt her tongue flick across my earlobe. \n\nOr I felt it flick across my throat, and she giggled when she felt the meager beat of my heart through my delicious carotid artery. \n\nGod help me, more than once, I nearly begged for her to take a bite. \n\nWhen I did peek out from under my protective blanket, she grinned widely and ran her sharp talons down her supple naked frame, tempting me with the gash of her sex, an alluring sight that dripped human blood and stank of burning sulfur yet never failed to make my mouth water. Her murder-red skin was covered in shifting black tattoos, like shadows dancing across her naked body. \n\nAnd while she *always* came at night, she was by no means *limited* to coming at night. \n\nI’ve seen her on the highway, as I was driving home from my daily commute to the liquor store, and she waved at me from the shoulder of the road, stretching her black wings wide and curling her talon, beckoning me to her. \n\nWhen I drank at bars, she never failed to materialize across the room, in darkened corners, or peeking at me through the bathroom mirror as I took a piss. When I walked down the street, I’d catch her reflection in storefront windows, trailing mere inches behind me, licking her lips and playing with herself as I tried to ignore her and go about my business. \n\nThis had been going on for years. But then, something about her became different. \n\nShe grew hungrier. And, God help me, I couldn’t help but grow aroused every time I watched her feed. \n\nI never consented to this. She forced me to watch, worming her way into my mind as I slept. Though I resisted, my resolve never lasted very long and, eventually, I couldn’t help but groan in delight as I slumbered, as I watched her slaughter and defile her victims. \n\nI wasn’t sure where she took them, except that it appeared to be a small clearing in a forest thick with conifer trees. \n\nAt first, I thought these visions were dreams, regardless of how vivid they were. Indeed, in each vision, I could smell the metallic copper-stink of warm blood. The awful screams rang out in my eardrums, reverberating down to my soul. I swore, sometimes, as she peeled the flesh from their willing throats, I could even *taste* the fresh meat, the dangling sinew. \n\nSo yes, for a time, I was able to convince myself these visions were only fantasies, either dreamed up in my own fractured mind or deviant desires beamed into my thoughts by my unholy seductress*.* \n\nHowever, eventually I was no longer able to harbor such delusions. \n\nThe first victim I knew was a coworker, another clerk from my minimum wage liquor store job. (As you can imagine, I was unable to keep a steady career once she began tormenting me.) This coworker’s name was Dan. I never did like him very much. He was a drunk, with a habit of sneaking drinks in the stock rooms, something he always seemed to do at our peak hours, when we were busiest. \n\nOne night, as I slept, I suffered yet another vision, blurry but gradually growing clearer. It was that clearing again, dead leaves littering the ground and naked conifers shivering in the wind. \n\nShe walked into the clearing. Behind her, Dan followed. Though his eyes were glazed and his jaw was slackened, his face burned with an unmistakable *willingness* as he walked sheepishly behind her, licking his lips and brandishing an erection in his pants. \n\nThe things she did to him…\n\nIt wasn’t merely a murder, nor was it sexual. Instead, the vile act lay somewhere in between, a perverse and violent gray area. A grisly act of copulation and defilement, during which Dan lay on the barren earth, his blood flowing over those scattered dead leaves, screaming in both agony and ecstasy as she writhed and heaved, as she pulled him apart inch by bloody inch, crowning herself with his esophagus as she gnawed slowly through his exposed viscera. \n\nThe following morning, I wanted more than anything to know that it had only been a nightmare. I went into work, praying that Dan would come in for his shift, but I wasn’t altogether surprised when he hadn’t. \n\nFor a week, instead of visiting me in my bedroom, she would only come to me in my dreams, grinning up at me as she led yet another person I knew into that clearing. \n\nMy high school history teacher, who died grinning madly as she ripped his throat out. \n\nMy very first real girlfriend, from college, who was devoured from the bottom up, screaming in anguish for over an hour before she finally expired. \n\nMy mailman, my neighbor from around the corner, my landlord, all of them torn apart, wet clumps of flesh being ripped and flung and devoured. \n\nThen, just last night, I decided I’d had enough. No, it wasn’t that I could no longer bear witness to her vile feedings. That wasn’t it at all. \n\nInstead, I found my jealousy was nearly uncontrollable. She hadn’t been to my bedroom for a week, preferring instead to haunt my dreams, making me admire her lithe nubile demonic body from my mind’s eye. \n\nFunny. For years, I’d wanted nothing more than to be rid of her nightly torment. Now that she was gone, I wanted nothing more than to have her return to me. \n\nI swallowed an unreasonable amount of over-the-counter trucker speed, caffeine and niacin and ephedrine. My face flushed red. I paced my bedroom, my heart twitching uneasily in my chest. I stared at my closet door, praying that I’d see that murderous red glow, praying that I’d smell that stinking brimstone one more time. \n\nThis time, she came in through my bedroom door. I heard the squealing hinges behind me, smelled the sulfur wafting up from her sex, heard her bare feet slipping quietly upon the hardwood floor. \n\nThen, I heard something else. \n\n*Tap.* \n\n*Tap.* \n\n*Tap.* \n\nThe sound of something wet striking the floorboards. \n\nMy shuddering heart seemed to drop, as I somehow already knew what I was going to see. \n\nI turned around to face her. She grinned at me, gore smeared across her mouth, red-on-red, her eyes shimmering golden, flaring golden, like I was staring into twin morningstars. \n\nShe held my mother’s decapitated head in her right hand, her sharp talons tangled in my mother’s matted gray hair. \n\nI lowered my head, wiped the tears from my eyes, and muttered the words, “I’ve missed you so much.”\n\nShe took my cheek into her hand, talons resting sharply against my soft flesh. The skin of her palm sizzled against my own and I shut my eyes tight, teeth clenched, trying not to cry out at the pain, at the melting flesh and boiling fat. I looked up at her, at her grinning gore-smeared face, and I swore, I’d never seen anything half as stunning. \n\nShe kissed me, long and soft and sensual, her tongue dancing upon my own as she slipped my mother’s clotted gore into my mouth. As her lips closed around mine, she giggled an evil, vicious giggle and shot into my mind the final moments of my mother’s life. \n\nMy mother, strung up like Christ on a flimsy wooden cross, her palms pierced with Cerberus fangs, her crisscrossed feet impaled with the chitinous sex organ of some insectoid hell-beast. My mother, eyes lolling about in her sockets as my unholy seductress unspooled my mother’s intestinal tract, hand-over-fist, that hell-born giggle rising to a glass-shattering pitch as she tugged upon my mother’s innards, making her body jerk and dance. \n\nFinally, she broke our kiss. I stumbled and fell to the floor, my throat full of my mother’s blood, and on my hands and knees, I found myself level with my mother’s lifeless visage, her mouth hanging open in a strange rictus of bliss and anguish, with fresh blood still *tapping* upon the floor from her severed airway, her severed throat, her dangling spinal cord. \n\nMy unholy seductress grinned down at me as she licked her lips clean, then her cheeks, then her chin with an elongated forked tongue the color of charred bones. She blew me a kiss and began to evaporate in a cloud of slate-colored smoke and, even as I choked down my mother’s clotted blood, I reached out for my seductress, screaming for her to remain at my side. \n\nYet, my hands passed through the dissipating wisps of smoke and I fell flat on my face, feeling my mother’s lifeblood leak warmly into my stomach, and I wept for my seductress, for I knew she’d left me for good. \n\nWell, not entirely. \n\nAs I write this, I’m fully aware that if I clicked the screen off, I’d see her in that black reflection, grinning that gory grin, hovering just over my shoulder, holding the decapitated head of a friend, or a family member (not that I have many of those left now). I know that no matter how quickly I might turn around to look, she’d vanish before I could ever turn my naked, desperate eyes back to her supple form. \n\nI’ve come to realize that she has never wanted anything more than to toy with me. To pluck my strings, to make the marionette dance. Even so, I can’t help but yearn for her, I can’t help but weep angry tears into my pillow each night, knowing that she could visit me again if she wanted, but knowing full well that she never will.", "comments": [{"id": "fmorcnd", "author": "ShelobahMaoben", "body": "Doesn't matter had sex"}, {"id": "fmp2azz", "author": "HeyAdoraEnergy", "body": "I appreciate her commitment to the usual acts of demonic entities, not to make light of your tragedy. Out of innocent curiosity, do you know what may have drawn her to you? Purely innocent curiosity..."}, {"id": "fmpfj2l", "author": "Tyler31_", "body": "Dammit shoulda just fucked her the first day she came before waiting for everyone you knew die"}, {"id": "fmqa4td", "author": "Ryoji_Watermelon", "body": "at least you didn't fuck a cow like my uncle"}, {"id": "fmovau1", "author": "The1V0RYK1NG", "body": "Now, I won't lie. I would've just asked her to hug me. And then, with what would be an extremely confused expression across her face, the face that had fucked and murdered at the same time. I would pull her into bed and use her like a teddy bear. Why waste an opportunity when you can at least enjoy her company?"}, {"id": "fmp74on", "author": "PWS_Doc", "body": "This brings a whole new meaning to “going out with a bang”."}, {"id": "fmq4zxp", "author": "xdNomad", "body": "\"I see this as an absolute win.\""}, {"id": "fmq5wx0", "author": "Avid4Planes", "body": "This was really good. I'm sending an analogy to something, maybe a real world reference? My guess is that this story is a parallel of a humanly experience."}, {"id": "fmqdr14", "author": "edgeladz", "body": "Succubus"}]}