{"id": "fwjtls", "title": "My Grandma worked for NASA. There are monsters on the moon. (Part Two)", "url": "https://www.reddit.com/r/nosleep/comments/fwjtls/my_grandma_worked_for_nasa_there_are_monsters_on/", "subreddit": "nosleep", "author": "googlyeyes93", "text": "[1](https://www.reddit.com/r/nosleep/comments/fvvh2q/my_grandmother_worked_for_nasa_for_forty_years/?utm_source=share&amp;amp;utm_medium=ios_app&amp;amp;utm_name=iossmf)\n\nGram is in one hell of a mood today. Not sure if she's just feeling better than usual or something has got her riled up. Either way, she's letting her feelings be known. That's just a forewarning before we get into this transcription. There are things about her in here that I personally NEVER wanted to hear.\n\nNo, really. She can tell me how she saw eldritch beings in the vastness of space and none of that is as terrifying as her talking about hooking up with astronauts in the training areas. Ugh. Here's the transcription. I'm going to go chug bleach.\n\n------------------------\n\n[Conversation from April 5, 2020. Again, this is being told by Gram and translated by me. My own interjections are in these brackets.]\n\nAh, you want to hear more? Alright, guess it's time to turn this bullshit off. Live through the damn missile crisis and I'm going to get taken out because nobody is competent enough to stay in their damn houses.\n\n[Gram has been cursing like a sailor all day. She only does this when she's either very happy or very anxious.]\n\nSo... let's see. I told you we had some crews up there already, yeah? Just couldn't get any successful returns down. Damn Reds beat us to that. Joke was on them though, they just tossed Gagarin up there in a metal tube and waited for him to come back down on his own. We actually had our own man pilot themself back down to earth. How's that for you? Russians don't have shit on American determination.\n\nSo we did a few other missions once we finally got the hang of putting people up there and bringing them back down. It was all smooth sailing for the most part. So now what did we decide to do? Put a man on the goddamn moon.\n\n[She gets up and goes to the kitchen, returning with a bottle of red wine and a comically large glass. I mention to her that it's only around two in the afternoon.]\n\nI worked with astronauts, darling. Days don't matter when you're orbiting the planet. Anyway, it was '62 that we crashed a vessel on the far side of the moon. That was something of a test run I suppose, seeing just how bad we could crash and burn something before we tried it again with people inside.\n\nWe had the Ranger 4 vessel that we sent up there. Had do a fly by of the moon for a bit and take some photos before dive bombing it to the surface and taking some pictures for us there. We never released those to the public. Scared the hell out of all of us in the command center when they transmitted back. Keep in mind all the pictures we had at the time were black and white still, no color photography on that scale yet.\n\nSo Ranger 4 lands there and immediately begins snapping pictures. All of us are standing around, expecting to see just a barren expanse of grey rock, nothing all too special. Lo and behold the first picture comes back and there's someone just... *standing* there. Right in front of the crashed capsule. We couldn't tell gender or race or anything, they were in a spacesuit that looked remarkably like the ones we were developing.\n\nSo naturally we think \"Oh no. They beat us to the moon.\" because who else could it be at this point? The Russians were the only other country keeping any kind of pace with us. Then we realized it couldn't be them. They would have already been rubbing it in our faces if they had landed a man on the moon. There's no fucking way this is from anyone on our planet. That's when the rest of the pictures started coming in.\n\nThe suit kept getting closer and closer to the capsule. maintaining the same stance the whole time. It just kind of floated over to it. Then you could see into the visor on the helmet. Where there should have been someone's face visible there was just... fire. Pure, bright flame. Then the pictures stopped. Nothing else came from Ranger 4. \n\n[She finishes off her first glass of wine. Or half-gallon, it's hard to tell from the size of the glass. She immediately empties the rest of the bottle into it.]\n\nI'll give the higher-ups at NASA credit though. Crazy bastards didn't let seeing a flaming cosmonaut stop them from going ahead with their plans. We plugged away at it, sending up more and more missions to orbit the Earth, do fly-by's of the moon, Mars, Jupiter... anything we could get near. We saw a few oddities here and there as we went, but things stayed mostly silent for those few years. Maybe we just didn't notice it because we were so focused on the mission at hand.\n\nThen it finally happened in '69, as you well know. We got to the moon, beat the Russians there after all. There was that big televised bit with Neil and Buzz taking the steps onto the surface and everything. I really hated those suits they had them in. Didn't get to accentuate Buzz's best features for sure. That man had the best ass in this entire galaxy...\n\n[This was one of five tangents about Buzz Aldrin's physical features throughout the day. I've edited these out for the sake of mine and your sanity.]\n\nYou ever consider that we landed someone on the moon and sent up missions to land again and again for the next three years, then just quit cold turkey and never went back? Why do you think that is? Huh? Hey, I thought you wanted to hear all this!\n\n[At this point in time she threw the remote for the television at me.I had retreated to my mental safe space during the Buzz Aldrin diatribe.]\n\nWell we DID go back! A few times. This wasn't for the scientific research we did the last three years. No, this was for anthropological purposes. We found things on the moon. We weren't the first beings there.\n\nNo, we started finding small signs with the Apollo 14 mission. There were some little remnants of previous visitors. The first thing they found were some symbols carved into crater walls. Nothing that we could translate of course, nobody knew what the hell they meant. But we knew they weren't naturally occurring, that much was obvious.\n\nSo they took pictures of all the ones they found. Pretty sure they're still working on it to this day. They'll probably crack the Zodiac cipher before that damned thing.\n\nApollo 17 was when they knew they needed to carry this one on privately. That's the \"last\" manned moon mission that happened back in '72. For all the world knows, we ain't been back since. That's the way they want to keep it.\n\nApollo 17 found way more than anyone previously had. They found full on structures. Altars of worship is what it looked like. I can't even describe the images transmitted back. The way these things were built... it wasn't natural. There's no way that structures built that way should be allowed to stand. It was like the ghost of Lovecraft possessed Escher and made him design some fucked up church.\n\nWe advised them not to go inside. We would send another mission up there with some better training and equipment to document all of this. That's where Apollo 18-22 came in. Before they left though they photographed the structure from every angle. We didn't notice until the end that it appeared absolutely identical no matter what angle it was viewed from. One hundred percent symmetry. Everything aligned perfectly, no matter how insane it was built up. \n\n[Gram finishes the second glass of wine. Leaning back in her chair.]\n\nWell, I believe that's enough wine for one hour. Time for a good nap. All that talk of Buzz got me thinking about the old days...\n\n[I turned off the recorder and ran from the room. I can still hear Gram cackling [from downstairs](https://www.reddit.com/r/Googlyeyes93/)", "comments": [{"id": "fmomcvv", "author": "NoSleepAutoBot", "body": "It looks like there may be more to this story. Click [here](https://www.reddit.com/message/compose/?to=UpdateMeBot&subject=Subscribe&message=SubscribeMe%21%20%2Fr%2Fnosleep%20%2Fu%2Fgooglyeyes93) to get a reminder to check back later. Got issues? Click [here](https://www.reddit.com/r/nosleep/wiki/nosleepautobot)."}, {"id": "fmoq418", "author": "blackbutterfree", "body": "> She can tell me how she saw eldritch beings in the vastness of space and none of that is as terrifying as her talking about hooking up with astronauts in the training areas.\n\nHonestly, your grandma is an OG. I'd love for an astronaut to make me feel weightless. LOL"}, {"id": "fmoqv1j", "author": "Jasminemads", "body": "can we get some of the pictures.. sure she must have smuggled some of it!! for research, of course!!"}, {"id": "fmp950b", "author": "korruption77", "body": "*loads gun* moons haunted"}, {"id": "fmooi3i", "author": "I-wish-l-was-you", "body": "Can you ask her on her opinions on space x/ other private space agency’s?"}, {"id": "fmowyoq", "author": "Warm-Bandicoot", "body": "Lol looks like granny got it on back in her day. Had to laugh when she threw the remote at you...I’m sorry lol. It’s just so funny. My granny used to carry a cane....if I didn’t listen she would whack my legs not hard mind u. One time she hooked my sweater and yanked me back saying where do u think ur going lmao grannies are wise and crazy at the same time"}, {"id": "fmoq76e", "author": "YourHomieJeff", "body": "Your grandma is awesome"}, {"id": "fmoy299", "author": "TurbulentDivide", "body": "\" It was like the ghost of Lovecraft possessed Escher and made him design some fucked up church. \"\n\nWow, first grandma ever to know what Lovecraft is!!"}, {"id": "fmp19jo", "author": "the_illidari", "body": "get her some of that moon ice cream"}, {"id": "fmoux7h", "author": "ThrillerPodcast", "body": "Apollo 20 is the really interesting mission, video of it on YouTube. Crazy stuff they found."}, {"id": "fmpk1h9", "author": "SirBeam", "body": " Grams might be a nazi."}, {"id": "fmpdain", "author": "numbers909", "body": "*moon's haunted.*"}, {"id": "fmozpe3", "author": "Longbeacher707", "body": "Not the moony men, Jimmy!"}, {"id": "fmoojjf", "author": "Cathayan82", "body": "OP your Grandma is fricking awesome and hilarious as well 🤗😂\nCan’t wait for the next part and send gram my regards 🙏"}, {"id": "fmq6va8", "author": "Warm-Bandicoot", "body": "Well they weren’t old forever lol. I don’t think most turn prim and proper till they are at least 40-50."}, {"id": "fmqesgf", "author": "TheSnipeyBoi", "body": "*Eyes up guardian intensifies*"}, {"id": "fmp8a8z", "author": "Mommyhita1", "body": "Your Grandmother is awesome!!! Reminds me of my own, as far as being feisty and fun!! Please tell her she has fans and ask her to keep the stories coming!!"}, {"id": "fmp8aug", "author": "Mommyhita1", "body": "Your Grandmother is awesome!!! Reminds me of my own, as far as being feisty and fun!! Please tell her she has fans and ask her to keep the stories coming!!"}, {"id": "fmpg5w1", "author": "pitty_chan", "body": "Oooooh I love this! Ancient weird altars of horrors on the moon... fascinating! Please, tell your grandma her stories are amazing!"}, {"id": "fmpkg9j", "author": "shanwar3", "body": "Grandma is pretty chill I would live to hang out with her."}, {"id": "fmpsn4q", "author": "jane_says99", "body": "I wanna be friends with your g-ma"}, {"id": "fmqa444", "author": "stormthor", "body": "Your grandma knows a lot about Lovecraft lol\n\nTo be honest I hope she didn't give her real name on 1st story, because, you know, gov makes casualties."}]}