{"id": "fwjvmt", "title": "I joined a support group that promised to \"cure\" me of my phobia. Edie is horrified of stairs. [5]", "url": "https://www.reddit.com/r/nosleep/comments/fwjvmt/i_joined_a_support_group_that_promised_to_cure_me/", "subreddit": "nosleep", "author": "hercreation", "text": "[I](https://www.reddit.com/r/nosleep/comments/fo51xt/i_joined_a_support_group_that_promised_to_cure_me/) | [II](https://www.reddit.com/r/nosleep/comments/fpaj6j/i_joined_a_support_group_that_promised_to_cure_me/) | [III](https://www.reddit.com/r/nosleep/comments/fsl6tt/i_joined_a_support_group_that_promised_to_cure_me/) | [IV](https://www.reddit.com/r/nosleep/comments/fuv5as/i_joined_a_support_group_that_promised_to_cure_me/) | V\n\nI’d like to take a moment to thank you all for the thoughtful responses you’ve given me so far. I’ve shared some of your comments with the other members of my support group, and many of them have been so touched by your kind remarks. For those of us who live controlled by a constant fear, being able to relate to people we’ve never even met or even just being shown kindness in general can be a rare occurrence.\n\nWe’ve spent the majority of our lives being dismissed by people, being told to “get over it”. We are constantly reminded of the irrationality of our fears – *we know* – by the people we love most, the people we long to be accepted by. Family, friends, lovers, partners, spouses snubbing the steps we take to avoid encountering what we fear most. In some cases, they take extreme measures in an effort to fix us; in many cases, making them much worse. I think of Don, a young boy with bright green eyes, screaming and crying in the darkness of a locked closet, and I shed a tear thinking of it now.\n\nFrom the bottom of my heart, thank you. I’d love to skip ahead and share with you the situation I am in now, the “cure” that was revealed to me, but it remains important to the process that I follow the order that was assigned to us the moment we first took our seats in the empty classroom of that old, abandoned church. It is important that I honor the stories that came before me, because they have fundamentally changed my life. For now, that means I must go back to participant number five.\n\n\\---\n\n“Well, that’s enough of that,” Don commented mere moments after finishing his tale, his demeanor shifting instantly from despondence to his normal, casual attitude. He leaned back in his chair, kicking his feet out in front of him, tattered white tennis shoes squeaking on the linoleum floor. I was suddenly reminded of my own father, who would wear a pair of sneakers until the soles were practically worn through. An, if it ain’t broke, don’t fix it, kind of guy. “Who’s next?”\n\nI was startled by a sound to my immediate right, Edie clearing her throat several times.\n\n“I think I’m supposed to go next,” she muttered, unfolding her paper to confirm that she was indeed participant number five.\n\nThe elderly woman appeared to be at least ninety years old, though I only based this assumption on her striking similarity to my own grandmother in the years before she passed. The same white, permed hair, the string of large pearls around her neck with earrings to match, the sweet, gentle smile and almost melodic cadence to her voice that had put me at ease throughout the group thus far. She had the same delicate hands, with pale, paper thin skin barely masking the underlying, bones, veins, joints enlarged from arthritis. The only major difference between them was the black sweat suit she was dressed in. My Granny Ruth wore pastels and bright hues; she always said that black is for mourning, not for living.\n\nEdie slipped her paper back into her pants pocket before introducing herself, “I’m Obedience, but all my friends call me Edie. I have bathmophobia.” A sly smile crossed her wrinkled features as she wagged a finger at Don, clearly in jest. “And before you go off about it, Don, I’m not afraid of taking a bath!”\n\nThe group erupted into laughter, with Don joining in.\n\n“What are you afraid of then, Edie?” Valo inquired, the sound of his booming baritone voice signaling for the group to settle, much like a professor’s.\n\nThe elderly woman waited for the laughter to die down completely before answering, “I’m afraid of stairs.”\n\nNodding, I could understand why someone of her age might have such a fear – a fall down a flight of stairs would almost certainly leave her with a broken hip, or worse.\n\n“Now, I know what you’re thinking – an old thing like me, of course I’m afraid of stairs! One tumble down and I’d be in the hospital, if I was even lucky enough to be wearing my Life Alert,” she remarked with a wink. “I’ve been afraid of stairs since I was a child. I was actually the only child with the phobia the family doctor had ever seen at the time it first arose.\n\n“Although, when I was a child, I believe I actually had climacophobia, the fear of *climbing* stairs, not just the stairs themselves… but we didn’t have all these different names for everything back then,” she continued, raising a thin eyebrow. “But, explicitly named or not, I was darn horrified of climbing stairs. When I was around ten years old, I suffered a terrible fall down the stairs in my family home.\n\n“I grew up wealthy, in one of those old money families, so we had this massive marble staircase with several turns coming down from the upper floor. I was playing at the top of the stairs when I lost my balance and tumbled all the way down. Gosh, I nearly broke every bone in my body, but it could’ve been a lot worse. It took what felt like decades to recover… as a child, not being able to do much more than lie in bed was absolute misery. But still, I was a strong little girl and I got better… mostly, that is.”\n\nStubbing out what must have been the hundredth cigarette she’d burned through since she first arrived, Tegen lifted her sunken eyes to meet Edie’s. “Your body recovered, but your mind never did, eh?”\n\nEdie pointed an index finger at Tegen. “You got it. I refused to go up or down that staircase. Father tried to force me, but I just felt dizzy and anxious as soon as I set foot on that first step up. My mind blew the incline way out of proportion… to climb that set of stairs felt comparable to scaling the face of a mountain, almost entirely vertical.\n\n“From there, well, it was all downhill,” she declared as she glanced down into her lap, tut-tutting gently. “I couldn’t go back to school, so mother homeschooled me. I lost all of my friends. All I had for the rest of my childhood was my books, my garden, an overwhelmed mother, and a father who thought I was broken, worthless.”\n\nThe white-haired woman sighed deeply as she reflected on the sudden turn her life had taken at such a young age.\n\nThomasine broke the silence, chiming in with, “Edie, you were not - *are* not worthless.”\n\n“Thank you, dear,” Edie replied warmly, folding her hands neatly over her knees as she straightened her posture. “As I became an adult, there was much argument around the house about what I could possibly amount to with my… *condition*. My parents wanted me to marry a man of wealth and status, but none would have me. So, when the mailman saw me out in my garden and we took a liking to each other, father said to him, his voice muddled with whiskey, if you want her, you can take her.”\n\nCecily scoffed from across the circle – my sentiment exactly.\n\nEdie chuckled lightly in return. “We married, and we had a fairly decent life. He didn’t make much money, but he worked hard. We cared about each other, though we grew distant over time. He was initially very supportive of my phobia, but as we grew older and as my parents passed, one right after the other, he insisted that we move into their house, the one with the marble staircase. He was tired of working his fingers to the bone and wanted some measure of comfort.\n\n“I agreed… reluctantly,” she recalled cautiously, her anxiety surrounding the arrangement clear. “All of the things I’d need were set up on the ground floor at first, but eventually he wanted to move into the master bedroom upstairs together. I worked tirelessly to overcome my fear, not wanting it to control me anymore. For months, he’d hold onto me as I walked first up one step, then several, then finally the entire staircase… though I must admit, I vomited right on the floor the first time I made it to the top!”\n\nLaughing in spite of herself, she shook her head slightly. “I was still a little anxious and dizzy each time, but as long as I had my husband with me, I could finally climb those darn stairs!”\n\nA puzzled look came over Alec’s face. “It seems like you’ve overcome your phobia – mostly, at least. Why are you here?”\n\nEdie’s brow furrowed, the wrinkles on her forehead deepening in a somber expression. “Because it came back, five or so years ago, but much, much worse,” she answered grimly, wringing her hands together so tightly I feared the fragile skin would tear. “I woke up late one night, alone. My husband wasn’t one to get out of bed in the middle of the night, so I was immediately worried. I sat up in bed and noticed a dim light spilling in from the hallway. I went to investigate, and found that the chandelier was on, the one that lit the stairway, that the staircase curled around beneath.\n\n“And then my husband emerged from the darkness of the hallway and pushed me.”\n\nI gasped involuntarily. “No!”\n\n“I fell down the first set of steps to the landing,” she responded, her voice soft and unnerving. “I heard my husband’s bare feet slapping on the marble steps as he came down after me. I decided to act like I’d gone unconscious, and when he reached me on the landing, I grabbed him by the ankles and shoved him down. I watched as he crashed down the remaining stairs, though I couldn’t see him at the bottom because of the turns in the staircase.\n\n“Now, I knew he’d just tried to kill me, but I wasn’t about to just leave him there to die. My body aching, I got back up to my feet. I looked down at the steps I’d been able to descend for years at that point as they suddenly grew monstrously steep, with each step at least several feet deep. Both hands clinging to the rail, I slowly took the first step, paused a moment to collect myself, and kept going. My hands slick with sweat, my grip on the rail was very precarious, but I kept going until I reached the second landing.\n\n“That staircase had three flights of stairs with eight steps each, and two landings in between. I know this for a fact because I’d learned to count each step to keep myself calm. Now that I was on the second landing, I knew that as soon as I turned the corner, there would only be one flight left, and then I’d get to my husband.\n\n“Imagine my horror, however, when I turned to take the last set of steps, I couldn’t see my husband at the bottom, nor the bottom of the staircase at all, as another landing had appeared. And then, *thunk*… a new step unfolded at the bottom… *thunk, thunk, thunk, thunk, thunk, thunk, thunk*, seven more, in rapid succession, a new flight of eight steps down to yet another new landing…”\n\nEdie closed her eyes tightly, breathing in through her nose, and out through pursed lips – likely a learned coping mechanism for anxiety. “Still, I soldiered on, afraid for both mine and my husband’s lives, down what should have been the last flight of stairs and onto the new one when the loud sounds of new steps falling into place rang out through my house once more.\n\n“My husband started to groan, began to cry, begging for help, asking what had happened. I called down to him that there’d been an accident… he grumbled for a few moments, then began to yell…\n\n“*Obedience, you worthless piece of shit, you get down here right now!*” she exclaimed in a voice so vile, so hateful, I could barely believe it came out of her. “I tried to explain what was going on, but the words wouldn’t come to me, and as I kept climbing down the stairs, more and more appeared, increasing exponentially, the *thunking* sounds incessant, deafening, until I felt impossibly high up, yet as I looked back, the stairs continued to stretch so far behind and above me that I couldn’t even see the top anymore, the chandelier nothing but a speck of light, distant like a star in the night.\n\n“I continued down, frantic and hysterical, trapped in this never-ending maze of stairs, all the while my husband alternating between pleading gently with me and shouting at me, insulting me, ordering me to hurry up and help him. By the time the end was in sight and I finally made it down, I was soaked in sweat, my legs trembling from overexertion and… my husband had fallen silent.”\n\nThe elderly woman began to cry quietly as she continued, “I rushed to the phone to call for help. An ambulance came soon after, as they opened the door… I noticed it was morning. Looking back up at the stairs, I realized I’d spent at least twelve hours climbing down twenty-four steps. My husband had died.\n\n“Desperate for some sort of connection to family now that I had none, I looked back into my family’s history soon after my husband’s passing. I discovered that my grandmother Obedience, who I was named for, passed away after a fall down that very staircase. I found some old pictures of her and, my goodness… she looked *just* like me.\n\n“There were rumors that her husband had pushed her to her death… after my own husband pushed me that awful night, I’m convinced that’s the truth. I know now that, my husband wasn’t himself when he tried to kill me… as I pushed him down, he looked… *confused*,” she explained, pulling a tissue out of her pocket to collect her tears. “I’ve been terrified of the sight of stairs ever since. I can’t climb a staircase, let alone look at one, without dissolving into an immediate panic attack.\n\n“I don’t know if any of you believe in destiny or anything of the sort, but I believe it is my fate to die like my grandmother Obedience did, broken and bloodied at the bottom of a staircase. I’ve survived it twice now, and I don’t think I’ll be so [lucky next time](https://www.reddit.com/r/hercreation).”\n\n[I](https://www.reddit.com/r/nosleep/comments/fo51xt/i_joined_a_support_group_that_promised_to_cure_me/) | [II](https://www.reddit.com/r/nosleep/comments/fpaj6j/i_joined_a_support_group_that_promised_to_cure_me/) | [III](https://www.reddit.com/r/nosleep/comments/fsl6tt/i_joined_a_support_group_that_promised_to_cure_me/) | [IV](https://www.reddit.com/r/nosleep/comments/fuv5as/i_joined_a_support_group_that_promised_to_cure_me/) | V\n\n[WATCH](https://www.youtube.com/channel/UCk1WJMX5xj1FHruveKH8gmg/videos?view_as=subscriber)", "comments": [{"id": "fmomo5h", "author": "NoSleepAutoBot", "body": "It looks like there may be more to this story. Click [here](https://www.reddit.com/message/compose/?to=UpdateMeBot&subject=Subscribe&message=SubscribeMe%21%20%2Fr%2Fnosleep%20%2Fu%2Fhercreation) to get a reminder to check back later. Got issues? Click [here](https://www.reddit.com/r/nosleep/wiki/nosleepautobot)."}, {"id": "fmoxguh", "author": "zomgkitteh4ever", "body": "I really feel for her. As a person with bad depth perception and REALLY bad knees all stairs feel endless.\n\nOn the bad days climbing the four floors of the staircase in my apartment building leaves me in panic and it feels like I could literally die every time I have to go down them"}, {"id": "fmosqj1", "author": "meneedpringles", "body": "Seems to be a bit of a pattern forming for some of these stories. Cecily, Valo and Edie all had to experience their individual fears for a quite a long time."}, {"id": "fmoyx9j", "author": "chacaad", "body": "Im always looking forward to the stories of your group. I've never had a phobia of anything in my life. But the way the participants in this session described their fears can make me imagine all of their anguish as they're faced with that thing they fear the most. It's like I'm  reliving it for myself. And I can believe how frozen in fear they must have felt in that exact moment"}, {"id": "fmp0k6j", "author": "Wulfy451", "body": "Holy shit. Legit, the part where she got pushed made me say \"no!\" at the same time as you, OP. It felt great to hear someone be more joking about their fear (even just at first) but god DAMN that is awful. I knew I wanted to know what Edie's was and that's just freaky!"}, {"id": "fmp33jk", "author": "-_-blahblah_-_", "body": "Working so hard to try and control her fear only for it to come back in such a heart breaking way, Edie is definitely so strong.\n\nThank you for these, I get scared of things like swimming in a lake or clowns but I dont have a phobia and I could not imagine having one. And reading about these experiences are eye opening"}, {"id": "fmp06es", "author": "kayla_kitty82", "body": "I can understand each person's fear, anxiety.. I'm terrified of deep water.. utterly petrified!!  Hearing their stories helps me to remember that I'm not alone, I'm not crazy.. Cant wait to hear more!!"}, {"id": "fmozdy5", "author": "I-wish-l-was-you", "body": "I feel so bad for all the people in the group to think that ordinary ppl go through stuff like this"}, {"id": "fmpjkjd", "author": "AkabaneOlivia", "body": "I'm absolutely, utterly, objectively *too* terrified of heights. This hits way close to home for me. I could immediately put myself in Edie's place with the vertigo and anxiety I get at the bottom of a high staircase, or, a lot of the time, at the top of any old regular one.\n\nEscalators are even worse, since I can't go at my own pace (again, a lot of the time, I have to do what she'd done - gripping the railing, lowering myself one slow, careful step at a time - that night her husband pushed her...God, how **awful.**) \n\nThis is real nightmare fuel. That poor woman is so brave, much braver than I - as far as I know my fears are entirely unfounded, to have it stem from that type of trauma? Unthinkable. Almost had me in tears, ha, not gonna lie."}, {"id": "fmplgqu", "author": "alanapants", "body": "Oh jeez. This one hit home. I have bathmophobia as well.\n\nHad? Have? It's well-managed and doesn't interfere with my life anymore, but boy was it crippling when I was younger. \n\nGive Edie my best, and tell her she isn't alone."}, {"id": "fmpto32", "author": "Kalooeh", "body": "Honestly I hate going up stairs too, especially the kind of stairs that don't have backs to the steps so it seems like it'd be too easy to slip and fall through or to at least get hurt. \n\nAnd if they're outside where they can get wet or icy? Ugh"}, {"id": "fmox6mh", "author": "Creation-of-T", "body": "AHHH READING THIS AFTER MIDNIGHT GIVES ME CHILLS!!! \nBEST. BIRTHDAY. GIFT. EVER!!\nP.S this is soo awful and scary, and like- I can relate with my own phobias (not as... impending), cant wait to hear the others but I ultimately fear what is to come 😬"}, {"id": "fmqkkld", "author": "sophless", "body": "Completely in love with the story of your support group OP! Can't wait to hear the rest of the phobias, especially yours and the 'cure' too! \nReally enjoying how you tell the story too, keep em coming!"}]}