{"id": "fwmv3a", "title": "My brother is the favorite child.", "url": "https://www.reddit.com/r/nosleep/comments/fwmv3a/my_brother_is_the_favorite_child/", "subreddit": "nosleep", "author": "VaxYoKidsVaxYoWife", "text": "My brother Andy and I are identical twins. Well, we were supposed to be. Something went wrong when he was born, and for as long as I’ve known him, he’s never been able to move. At all. He sits in a wheelchair all day, staring into space like he’s just zoning out for a second. But he’s not. The doctors say he hears and understands everything. \n\n&#x200B;\n\nHe’s my mom’s entire life. As soon as I was old enough to use the microwave by myself, I was completely ignored. I learned how to cook, how to ride a bike, how to take a bus, all by myself. She’s just too busy with him. “You understand, don’t you, Jonathan?” she always says. “I need to clean him.” “I need to take him to one of his appointments.” “I need to run his feeding tube.” “I need to go to work so we can afford better equipment for him.” There’s always an excuse. So I go and play with my friends from school, and their moms are nice to me. They have dads, too, who didn’t disappear after they were born. Sometimes their dads will throw a ball around with us. \n\n&#x200B;\n\nI never really understood why my mom worked so hard for my brother. He never responded to anything, except maybe blinking “yes” and “no”. I can’t tell you how many times I’ve tried to talk to him, tell him about my day, give him a chance to answer. He doesn’t. It’s really boring. So I stopped talking to him as much. I didn’t really hate him, then, I was just bitter and lonely and liked to pretend my friends were my brothers instead.\n\n&#x200B;\n\nThings changed five years ago, when I was eight. Mom and Andy came home from one of the doctor’s appointments. Mom had a weird look on her face, and she sat me down and talked to me, just one on one, for the first time in a while. \n\n&#x200B;\n\nAt first she was just asking normal things, like how I was, what my friends’ names were, how I liked school. In minutes, I was jabbering away, telling her my entire life story because I never got this time alone with her. I was so excited. \n\n&#x200B;\n\nThen she dropped the bomb.\n\n&#x200B;\n\n“Jonathan, one of Andy’s doctors has a very interesting machine he’d like to try on Andy. But we need your help. Would you help me and your brother?” \n\n&#x200B;\n\nI was in such a good mood. Of course I said yes. \n\n&#x200B;\n\nWe went to a clinic, and the lady at the front desk directed us straight to the basement. I’d never been in a doctor’s basement before. It looked straight out of a sci-fi movie. Big whirring devices, cables, flashing lights, screens with x-rays and other brain pictures I couldn’t identify. It was almost a little bit scary. \n\n&#x200B;\n\nBut the doctor was nice. He sat me in a chair and put a bunch of stickers all over my head. He told me that it wouldn’t hurt one bit.\n\n&#x200B;\n\nHe was right. In fact, not only did it not hurt, I didn’t think anything had happened at all. The only clue was the fact that everyone was wearing different clothes, and that my mom was crying. \n\n&#x200B;\n\n“Did it help Andy?” I asked her. \n\n&#x200B;\n\nShe kissed me on the head. “Yes, it did. So much.” \n\n&#x200B;\n\nSatisfied, I smiled at my brother. Obviously he didn’t smile back, but I got the strangest feeling of dread when he stared at me. \n\n&#x200B;\n\nWe went back multiple times. Each time, it seemed, full days had passed without me realizing it. My friends would tell me that I’d been acting differently. My mom suddenly knew all these things about Andy she couldn’t possibly know, like what his favorite color was (she started only buying him green shirts) and what he wanted to be when he grew up (she would show him videos about painting. I don’t know why. How was he going to paint?) \n\n&#x200B;\n\nEven as a little kid, I started to figure out what was going on. Andy was sharing my body. And while he was in control, it was like I was asleep. I’d just wake up without knowing anything about what he’d done as me. I became the only person who had never met my brother, even though he shared a house with me, and spent most of his time gazing at me with greed in his eyes. \n\n&#x200B;\n\nThe memory gaps grew longer and longer. My mom doted on Andy more and more. I started marking days in a secret calendar I didn’t tell anyone about, not even when mom did her sneaky interrogations to try and find out things Andy should know about my life. The first time she let him keep my body for a week, I stopped talking to her entirely. Then she let him keep my body for a month, and I blew up. \n\n&#x200B;\n\n“You can’t do this! My friends barely talk to me anymore! I don’t even know what’s going on in school half the time! You guys keep going places without me, and I just keep getting worse at soccer because he doesn’t practice! I don’t like it and I don’t want to share anymore!”\n\n&#x200B;\n\nMy mother gave me a long, thoughtful look. “Okay, Jonathan. Let’s do this one more time. Andy really wanted to try swimming. Just once. You can let him try it once, can’t you, Jonathan?” \n\n&#x200B;\n\n“For the last time, I go by Johnny,” I grumbled. “Will you promise to call me that?”\n\n&#x200B;\n\n“Of course, sweetheart. Whatever you want.” \n\n&#x200B;\n\n“Then fine. Just one more time. And only for a day!”\n\n&#x200B;\n\nThe next time I woke up, I was back in my room. My brother was in his wheelchair, as usual, but he looked very, very different. And when I looked in the mirror, so did I. I was taller. There were small, fine hairs on my upper lip. I had pimples. \n\n&#x200B;\n\nI ran to my calendar, made a note of the last date I had marked, and then checked the family calendar. \n\n&#x200B;\n\nThree years. Three years had passed. \n\n&#x200B;\n\nI refused to believe this. Even though it was now fall outside, and when I had “gone to sleep” it had been the beginning of summer. Even though my bedsheets and blankets had changed to something less childish. Even though my room was covered in stupid paintings that barely looked like anything. \n\n&#x200B;\n\nWhen it did finally hit me, I cried. I cried for a long, long time. I had lost so much of my life. I was a ten year old in a thirteen year old’s body. My mom had allowed this - wanted it, even. Had anyone noticed that I was gone? \n\n&#x200B;\n\nMy sobbing calmed into sniffles when I realized Andy had not blinked in over an hour. Actually, his eyes were kind of glassy and even more unfocused than usual. When I poked at him, he was kind of cold and he didn’t react by looking at me. \n\n&#x200B;\n\n“Andy! I’m home!” I heard my mother yell from downstairs as the front door shut behind her. “Come downstairs, I’ll make you a snack!” \n\n&#x200B;\n\nA feeling I’d never really experienced bubbled up inside my chest. It was white-hot and ice cold at the same time, and it made my mother’s voice sound like the devil talking. My face turned as expressionless as Andy’s, but I did as she asked. I went downstairs. \n\n&#x200B;\n\n“Hello, sweetheart,” my mother greeted, kissing my forehead. “How was your day?”\n\n&#x200B;\n\nMy day? I don’t know. I don’t even know what my year was like, thanks to her. “Fine,” I managed to grunt. \n\n&#x200B;\n\n“Good. I have to tell you some worrying news, dear. The cardiologist called, and he said the tests showed that your other body might have something wrong with its heart. We’re going to take your old body in to see him again, maybe tomorrow. I know it’s tedious, darling, but we wouldn’t want anything happening to it.” \n\n&#x200B;\n\nI stayed silent, which she took as me being mad. “Don’t sulk, dear. It’s necessary to keep you alive. You know that.”\n\n&#x200B;\n\n“Yeah,” I answered. I knew that when she went upstairs, she would find the old body as I had found it. “I want a snack.”\n\n&#x200B;\n\n“Alright. Go get a plate from the cupboard.” \n\n&#x200B;\n\nI did get the plate, but what also caught my eye was a large, shiny knife with a jagged edge. \n\n&#x200B;\n\n“Hey, mom?” I called casually while she busied herself at the stove. Whatever she was cooking didn’t smell appetizing. Or maybe it did to Andy. “Do you think we should ever give Johnny the chance to wake up again? See what he’s missed?”\n\n&#x200B;\n\nShe tsk’ed. “Oh no, darling. It’s been far too long. He would just be confused. It’s much better this way. Still, that’s such a kind thought for your - “ She paused in the middle of stirring. “Did you call him Johnny?”\n\n&#x200B;\n\nThe next sound out of her mouth was a scream as I plunged the knife into her back. Then I pulled it out and did it again. “Andy’s dead,” I told her, enjoying everything minute of it. “And Johnny is never going away, ever again.” \n\n&#x200B;\n\nFor now I live with two corpses in my house. They’re starting to smell, so I might bury them in the back garden. But other than that, I’m okay. I know how to take care of myself.", "comments": [{"id": "fmp9ozf", "author": "woodchipper2point0", "body": "Hey man, I'd kill her too"}, {"id": "fmp6w7i", "author": "666wife", "body": "Why would she do that? That’s horribly cruel."}, {"id": "fmpcvax", "author": "TheHamPrincess", "body": "You deserve a much better mother dear, that woman was NOT a mother. She was a monster. You should make sure to deal with the bodies properly, and get information on that doctor, expose him, lawsuit, make some money off that disgusting man instead of him making money off experimenting on your body and brain."}, {"id": "fmpm2vg", "author": "kingof-potatos", "body": "Parenting goals 101"}, {"id": "fmqbmbk", "author": "The_Twiddle_Meister", "body": " Seems like the only problem left is the “doctor”. He’s probably curious of why “you” and your mother haven’t come in for that appointment. Would love to hear more from you soon to see how you’re doing."}, {"id": "fmq67wp", "author": "spookyegirl", "body": "Its what she deserves😌💅"}, {"id": "fmq89wy", "author": "berkyblaster", "body": "wow. I mean, a day was pushing it. But, a YEAR. Not just one, but THREE?! Good job, op"}, {"id": "fmq2hi3", "author": "TroyMckee", "body": "Boi wash your face andy is a slob"}, {"id": "fmpc5gf", "author": "ejs-97", "body": "I'm glad you're alive, Johnny!"}, {"id": "fmq2c3e", "author": "UranusMc", "body": "Jesus christ. 3 years?!"}, {"id": "fmqa2fa", "author": "midnight_dream1648", "body": "Eh your mom's death was kinda necessary for your survival"}, {"id": "fmq0tu7", "author": "eim_gai", "body": "if you did kill them\n\nyou should get a crusher try to make their corpses as thin as possible shred them and hen shred them in a paper shredder but don't put the bones in,then burry the bodies\n\ni am not a murderer but i think this should work\n\n&#x200B;\n\nEdit: Or just drop the bodies off at the Zone of death at yellowstone"}, {"id": "fmq7hg0", "author": "Warm-Bandicoot", "body": "Me too I would be so mad"}, {"id": "fmqk0xr", "author": "icecubed13", "body": "Oh man. This was good. Like this needs to be a full on book or a movie."}, {"id": "fmpb0i6", "author": "Complete-Tension", "body": "I’m with you on this one"}, {"id": "fmqjo7i", "author": "GadgetGrape", "body": "I hate your mother, that was terrible of her."}, {"id": "fmqsbf7", "author": "spookysketchkitty", "body": "What was her thought process here? Did she just not love you? She was really just willing to let you feel unwanted? Honestly, I think it might’ve been better to let her live. At least for a little while. Her favorite kid dead and the one she’s got left making it very clear he will never love her and she’s worthless, with no one who needs or wants her. Make her feel how you did."}]}