{"id": "fwr1zr", "title": "My husband has had a recurring dream since he was 11 years old. It finally drove him to suicide.", "url": "https://www.reddit.com/r/nosleep/comments/fwr1zr/my_husband_has_had_a_recurring_dream_since_he_was/", "subreddit": "nosleep", "author": "pb1707", "text": "*do you ever have recurring dreams?*\n\nThat was the last text I ever got from my husband.\n\nIt was a Wednesday afternoon. We were both at work.\n\nThis was a normal occurrence for us—a random text conversation in the middle of the day if, for nothing else, just to keep us in touch. It’s one of the things I miss most about him.\n\nWhen he texted, I was in the middle of a meeting. When I got out, I was pulled a hundred different directions and didn’t check my phone until around 5 pm. By the time I read the text, he was dead.\n\nOf course, I didn’t know that until about an hour later, when I found two cops waiting for me on the front porch of our suburban rambler.\n\n“Jenna Steele?” one of the officers said.\n\nI nodded quizzically and welcomed the officers into the living room. As they explained what happened, I felt like I was floating near the ceiling, like I had stepped into an alternate reality.\n\nAccording to the officers, my husband, Tanner Steele, fell from the fire escape outside the fifth-floor breakroom at his Old Town office building, dying on impact.\n\n“Do you have any reason to believe that Tanner was suicidal?” an officer asked.\n\n“No,” I started, then cleared my throat. The room was spinning around me. “I—I don’t think so. He acted normal this morning. He’s acted normal all week. I mean he’s always been in his head a little bit, but he—ya know—he’s always been like that.”\n\nThe officers told me his coworkers said the same thing, that he acted normally that morning. That something like this was out of the blue. He didn’t leave a note or give any hints to what he was planning.\n\nI didn’t cry. I didn’t even feel sad. Even while they showed me pictures of the body to confirm his identity. It wasn’t until about twenty minutes after they left, while sitting alone in my dark, empty house, calling Tanner’s phone for the hundredth time, that I understood. He was dead. Gone. Forever.\n\nWhen the situation caught up to me, I collapsed on the floor, sobbing uncontrollably.\n\nMy world was crumbling before my eyes. Unbeknownst to me at the time, my world was only *beginning* to crumble.\n\n\\--\n\nThe next three weeks passed by in a blur—the viewing, the funeral, the burial, the flowers, and three weeks of coming home to a painfully cold and empty house.\n\nOn one of those lonely nights, I found myself in the attic with a bottle of whiskey going through a crate of Tanner’s journals. The attic was dusty and stuffy, with an old, circular window that creaked anytime the wind blew. It was dimly lit by a single incandescent bulb.\n\nI laughed and cried going through his journals from when we first starting dating ten years earlier. There were so many stories I forgot about: getting caught in the middle of a brawl at a minor league hockey game, the time I forgot my ID at the airport, the time we ran out of gas on some country road in Nevada. He appeared to be happy with our relationship and everyone else in his life, so where did things go wrong?\n\nThat’s when I put my detective hat on. I started reading the entries not with the intention to reminisce, but to understand what drove my husband to suicide. I read each entry carefully, looking for clues. It didn’t take long to start noticing his frequent documentation of his dreams. But not just random dreams. The same dream. I scanned the journals all the way back to his childhood years and found that he had been having a variation of the same dream since he was eleven years old.\n\nHis text on the day he died—the one asking me if I’d ever had a recurring dream—wasn’t small talk, it was a final plea. He was absorbed by this dream, yet, he never mentioned it to me. Not a single time.\n\nIn the dreams, Tanner found himself standing in what he called The Big Room. The room was infinitely long with impossibly tall ceilings. Sometimes there were large oblong shapes extended from its walls. Sometimes the walls were glowing. Other times, they were blank black or white.\n\nIn one of his entries, he said he felt like an ant in a human-scale modern art museum.\n\nFrom age eleven to thirteen, he spent a lot of time describing what the room looked like.\n\nFrom age thirteen to sixteen, he focused more on how the room felt—the paralyzing fear of incredible smallness and insignificance.\n\nAround age seventeen, he figured out he can walk through the room. From then on, his entries were brief, like status updates:\n\n*I made it through about 100 feet of the room before I nearly suffocated. Left wall was glowing red.*\n\nOr\n\n*Moved freely through the room. Maybe traveled a mile. Very, very dim light.*\n\nOr\n\n*Couldn’t move at all. Just stared up toward the ceiling/sky. Horrifying feeling. Glowing dull blue.*\n\nFrom what I could gather, Tanner was positive that he could eventually travel to the end of the big room. He believed that each time he dreamt of the big room, he was able to continue his progress from where he left off.\n\nIt’s an idea that I thought was farfetched until I found his journal from 2019.\n\nThat’s because, starting in 2019, Tanner started to see an end to the big room. In some instances, he could see a pinhole of light. In other journal entries, he could see the dreadfully massive walls come to a stop in the distance. As his reporting went, that conclusion to the big room was getting closer and closer each time he dreamt.\n\nHis 2019 journal ended with this entry:\n\n*I CAN SEE A DOOR*\n\n*THERES A DOOR AT THE END OF THE BIG ROOM!!!*\n\nReading those lines chilled me to my bone. What was this mysterious world he was navigating while he was asleep? And why did he never talk about it?\n\nI climbed down the attic ladder and ran downstairs, clutching his early 2019 journal in one hand and the whiskey in the other. I raided his nightstand in search of his current journal but didn’t find anything. With tear-stained cheeks, I took another swig of whiskey and passed out on the bed.\n\n\\--\n\nThe next morning, while drinking coffee in the front room, one of Tanner’s coworkers dropped off a box of his belongings. He offered condolences and went on his way. As soon as I closed the door behind him, I rummaged through the box looking for clues.\n\nNear the bottom of the box was the golden ticket—a blue composition notebook entitled “Late 2019 – Early 2020.”\n\n“Big room, big room,” I whispered repeatedly under my breath as I flipped through its pages. Almost every entry mentioned the big room. As I worked through the latter half of the journal, the end of the big room came into focus. Starting in February of this year, Tanner was close enough that he could see a door—a purple antique door with intricate carvings and gold finishes.\n\nThe door became the focus of his journal entries from there on out. He was obsessed with the door and his ultimate arrival. He kept making guesses as to how long it’d take him to reach the door.\n\n*I’m guessing another couple weeks until I get to the elusive PURPLE DOOR*\n\n*I swear the room is slowing me down as I get closer to the purple door, like it doesn’t want me to leave*\n\n*What the hell is going to be on the other side of that purple door? Days away. Sooner if I can get a couple good nights in.*\n\nHe was so determined in his journal entries, I almost found myself rooting for him. This purple door represented something that he had been progressing toward his entire life, and it was finally within reach. Like an athlete who finally has a chance to compete in the Olympics after years of dedication.\n\nI read through the entries in a blur, with tears forming in my eyes. At one point, I set the journal down and looked through the rest of the box. I pulled a framed picture of us he had on his desk. It was of our eighth anniversary trip to Mexico a couple years earlier.\n\n*Oh, Tanner. Why? Why do this? Why now? Why leave me behind like this?*\n\nI thought about his aging mother. His father. His two sisters. His nephew, his two nieces. His friends. Why?\n\nI went into the kitchen and poured a shot of rum into my coffee. When I returned, my rage followed. I picked up his journal—with its horrid blue marble cover—and hurled it across the room.\n\n“Damn fucking big room and your damn fucking purple door!” I yelled into the empty house.\n\nA squirrel climbing the tree outside the front window stopped and looked at me, sensing commotion.\n\nI collapsed on the floor, tears streaming down my face, sobbing like a child. What could I have done? Nothing. There’s nothing I could’ve done. I could’ve sneaked into his journals to see what was going through his head, but I wouldn’t have done that. I couldn’t have done that. I’m not that kind of person. Maybe I should’ve been that kind of person. I could’ve saved him.\n\nNo, it was out of my hands. That’s the only thing I can tell myself to give me any sort of reprieve. Out of my hands.\n\nAfter a moment, I collected myself enough to pick up the journal again. It was opened to his last entry, dated three weeks earlier, on the last day of his life. It wasn’t a suicide note, but it was as close as I was gonna get.\n\n*I made it to the purple door last night. It was beautiful. Striking. Incredibly ornate and vibrant. It was the first time I had reached any sort of boundary during my twenty plus years in the big room. It was exhilarating—even in my dream state—like an era coming to a close. I tried to turn around to see how far I’ve come, but I couldn’t. The room wouldn’t let me. Eventually, I reached for the decorative gold doorknob and tried to turn it. It didn’t budge. I went like this for another while—felt like hours. The door never opened. Next thing I knew, my alarm clock went off.*\n\nI took another long drink of my spiked coffee, and tried to slow my breathing, then picked up the journal again. The next thing I read sent my heart racing. The pen color switched from black to blue telling me he wrote this next part from his office.\n\n*I FOUND THE PURPLE DOOR.*\n\n“No, Tanner. No, you didn’t. What the hell were you thinking?” I muttered to myself as I continued reading.\n\n*I went to the fifth floor breakroom looking for coffee filters when I saw it. The door for the fire escape, which I swear is usually a generic commercial-grade brown was the same ornate purple door from the big room. Same golden doorknob and everything. I’m not going in yet, cause I had to write this down first. I should tell someone. I should tell Jenna.*\n\nThat was it.\n\nI assume that’s when he texted me. Then, when I didn’t answer, he proceeded through the door and fell to his death.\n\nI was sick. Literally sick. I threw up in the toilet, then stumbled to the attic to collect the crate of journals. When I tried to lift it, a feeling of weakness passed over me and I knelt to avoid fainting. The attic was dim and silent aside from the wind rattling the damn circular window.\n\nOnce my strength returned a few minutes later, I took the crate downstairs, loaded them in my car, and drove to Old Town. I had to see the fifth-floor break room for myself.\n\nI parked two blocks away and walked down the narrow alleyway that ran behind the Old Town commercial district, to avoid running into any of Tanner’s coworkers. I snuck in the back entrance and took the stairs to the fifth floor. My heart was beating uncontrollably as I stepped into the fifth-floor lobby and carefully surveyed my surroundings. A brown placard sign on the wall pointed me in the direction of the break room.\n\nI walked carefully; each footstep dampened by the gray commercial carpet. The hallway was quiet. I stepped onto the tile floor of the breakroom and flipped on the lights. I navigated through the kitchen and past the cluster of tables. I turned the corner, and there in front of me, was the fire escape.\n\nIt wasn’t a purple door. Of course it wasn’t.\n\nIt was the generic brown metal door Tanner suspected it should have been.\n\nI walked up to it and felt a weakness in my knees. *This is where it happened.* I thought for a moment about pushing the door open to see Tanner’s last view of the world, but then I realized it would be pointless. Tanner wasn’t seeing this world; he was seeing something else. If his journal is to be believed, the alternative reality that existed only in his dreams somehow merged with the real one. When he opened that door, he left this world and stepped into a new one.\n\nI took a deep breath.\n\nAbsurd. This whole thing is batshit absurd.\n\nI marched back through the lobby, down the stairs, and to my car. I laughed at myself almost hysterically on my drive home thinking about his waking and sleeping worlds merging. No, he was mentally ill, but hid it well. That’s all.\n\nThat is all, Jenna.\n\nI walked through the front door of our house, dropped the crate of journals in the living room and crashed on the couch.\n\nI wish I could say the story ended there—that the combination of his journals and my visit to his office gave me the closure I needed. Well, it didn’t.\n\nThat night, I had the most lucid, most vivid dream I’ve ever had. I dreamt that I was in the big room. The real big room. I stood in the middle of the room, the walls hundreds of feet away, spanning miles in either direction. One of the walls glowed red and stretched as high as the eye could see. Straight ahead, at least a mile away, was a figure. I tried to move through the big room, but only could at a glacial pace. I tried calling out but couldn’t. My smallness was crushing. I went through moments of breathlessness, like my lungs were being crushed.\n\nFinally, the figure spoke. It was a person. A man. It was Tanner.\n\n“Jenna, keep moving. Move as fast as the room will allow. You can do this,” he shouted.\n\nWriting this down now, I have tears in my eyes, but in the big room, I didn’t feel any emotion. I couldn’t.\n\nAfter a while, I got into the swing of things and started picking up the pace. Tanner stood still in the distance, occasionally calling out words of encouragement. Over the course of what felt like ten hours, I finally made it to Tanner. It *was* him.\n\nAgain, the big room was completely devoid of emotion, so I couldn’t really react to seeing him up close, but it felt so good. So right. It felt like home. Even in that weird-ass sci-fi big room, I felt at ease.\n\nTanner moved out of the way and pointed to a door just behind him. It was a purple door. *The* purple door. Exactly the way he had described it. In the dream, I looked between him and the door several times. It didn’t seem fair. He had spent twenty years trying to reach the purple door, yet I’m reaching it on my first time in the big room. I have Tanner to thank for that, I’m sure.\n\nI was overcome with a burning desire to open the door, to peer into its contents. But when I turned the doorknob, nothing happened. Just like in Tanner’s journals.\n\nI looked to Tanner, but he didn’t say anything, only smiled, like he expected me to know what to do. But I didn’t know what to do.\n\nNot until I woke up this morning with an incredibly deep void in my chest. Not just for Tanner, but for the big room and the purple door. That room held something I can’t explain—a kind of cosmic knowledge that can’t be fully understood in the earthly realm. For whatever reason, I craved it. I needed it.\n\nNow I started to understand how Tanner felt the last twenty years. His dreams weren’t a sideshow like they are for the rest of us. His dreams were the main event. Everything else was a sideshow. *I* was a sideshow to Tanner.\n\nI carried the crate of journals and my laptop to the attic, hypnotized.\n\nAs I’m writing this record with a single incandescent bulb swinging above me in our dingy attic with Tanner’s journals sprawled out around me, I finally have clarity.\n\nThe old circular attic window—the one that rattles with the wind—is no longer a window.\n\nIt is now a door.\n\nA decorative, ornate door colored a vibrant purple with gold finishes and a shiny gold doorknob.\n\nIt calls me.\n\nIt needs me.\n\nI need it.\n\nBehind its doors lies knowledge.\n\nWisdom.\n\nAnswers to the unexplainable.\n\nComfort.\n\nFulfillment.\n\nPeace.\n\nIt calls me.\n\nIt calls me.\n\nIt calls me.\n\nIt calls me.\n\nIt calls me.\n\nThe [purple](https://www.derekwalker.me) door holds all, and I will partake.", "comments": [{"id": "fmq44z6", "author": "kayla_kitty82", "body": "OMG!!!  Death is calling you, from beyond that purple door.. another dimension, parallel universe.."}, {"id": "fmq7mg3", "author": "berkyblaster", "body": "WOW. great job, op"}, {"id": "fmqhiwm", "author": "KC_Dude1983", "body": "Wow. Great story op!"}, {"id": "fmqioco", "author": "menna_2006", "body": "Wow this story was amazing ,I felt like I was in it! Great job!"}, {"id": "fmqlw3g", "author": "UndercoverUniverse", "body": "don’t go to it! It’s how he died.. but I would guess it’s too late"}]}